{"id": "2512.15362", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.15362", "abs": "https://arxiv.org/abs/2512.15362", "authors": ["Chunhao Cai"], "title": "Drift estimation for a partially observed mixed fractional Ornstein--Uhlenbeck process", "comment": null, "summary": "We consider estimation of the drift parameter $\\vartheta>0$ in a \\emph{partially observed} Ornstein--Uhlenbeck type model driven by a mixed fractional Brownian noise. Our framework extends the partially observed model of \\cite{BrousteKleptsyna2010} to the \\emph{mixed} case. We construct the canonical innovation representation, derive the associated Kalman filter and Riccati equations, and analyse the asymptotic behaviour of the filtering error covariance.\n  Within the Ibragimov--Khasminskii LAN framework we prove that the MLE of $\\vartheta$, based on continuous observation of the partially observed system on $[0,T]$, is consistent and asymptotically normal with rate $\\sqrt{T}$ and the Fisher Information is the same as in \\cite{BrousteKleptsyna2010} or the standard Brownian motion case."}
{"id": "2512.14863", "categories": ["math.NA", "math-ph", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2512.14863", "abs": "https://arxiv.org/abs/2512.14863", "authors": ["Pavel A. Makarov", "Vladimir I. Shcheglov"], "title": "Accuracy of the Yee FDTD Scheme for Normal Incidence of Plane Waves on Dielectric and Magnetic Interfaces", "comment": "Submitted to IMA Journal of Numerical Analysis", "summary": "This paper analyzes the accuracy of the standard Yee finite-difference time-domain (FDTD) scheme for simulating normal incidence of harmonic plane waves on planar interfaces between lossless, linear, homogeneous, isotropic media. We consider two common FDTD interface models based on different staggered-grid placements of material parameters. For each, we derive discrete analogs of the Fresnel reflection and transmission coefficients by formulating effective boundary conditions that emerge from the Yee update equations. A key insight is that the staggered grid implicitly spreads the material discontinuity over a transition layer of one spatial step, leading to systematic deviations from exact theory. We quantify these errors via a transition-layer model and provide (i) qualitative criteria predicting the direction and nature of deviations, and (ii) rigorous error estimates for both weak and strong impedance contrasts. Finally, we examine the role of the Courant number in modulating these errors, revealing conditions under which numerical dispersion and interface discretization jointly influence accuracy."}
{"id": "2512.14857", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.14857", "abs": "https://arxiv.org/abs/2512.14857", "authors": ["Munki Jeong", "Alexander Strang"], "title": "On the Local Structure and Approximation Stability of Block Isotropic Gaussian Fields", "comment": "23 pages main text, 1 figure, 9 pages appendix", "summary": "Skew-symmetric functions are a class of functions defined on a product space $M \\times M$ that are antisymmetric with respect to the order of their inputs. In [13], the authors proved that non-deterministic skew-symmetric Gaussian fields cannot be stationary or isotropic and proposed an alternative notion: stationarity (isotropy) in each component space. Our work focuses on local quadratic approximations of the associated Gaussian fields. Local quadratic approximations to random fields are random polynomials parametrized by a jointly sampled gradient vector and Hessian matrix. We characterize the distribution of the corresponding random vectors and random matrices. Then, we study the error in the quadratic approximation, which is also a Gaussian field. We investigate the error induced by the quadratic approximation in three senses: the pointwise error, the maximal error over an ellipsoidal region, and the worst-case error for multivariate Gaussian inputs at a given confidence level. Next, we explore the limiting behavior of the worst-case error as the distance between an expansion point and evaluation points approaches zero and infinity. Finally, we study how, as the input dimension increases, the variance of multivariate Gaussian distributions must be restricted to keep the worst-case error bound constant."}
{"id": "2512.14912", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.14912", "abs": "https://arxiv.org/abs/2512.14912", "authors": ["Roberto Rossi", "Steven D. Prestwich", "S. Armagan Tarim"], "title": "Mixed-Integer Linear Programming Approximations for the Stochastic Knapsack", "comment": "34 pages, working draft", "summary": "We develop a novel mathematical programming approximation framework to tackle the stochastic knapsack problem. In this problem, the decision maker considers items for which either weights or values, or both, are random. The aim is to select a subset of these items to be included into their knapsack. We study both \"static\" and \"dynamic\" variants of this problem: in the static setting, the decision about which items should be included in the knapsack is taken at the outset, before any random item value or weight is revealed; in the dynamic setting, items are received sequentially, and the decision about a particular item is made by taking into account previously observed values and weights. The knapsack has a given capacity, and if the total realised weight exceeds this capacity then a penalty cost is incurred for each unit of excess capacity utilised. The goal is to maximise the expected net profit. We tackle the case of normally distributed item weights and we show that our approach extends seamlessly to the case in which item weights are correlated and follow a multivariate normal distribution. In addition, we show our approach represents an effective heuristic for the case in which item weights follow generic probability distributions. In an extensive computational study we demonstrate that our models are near-optimal and more scalable than other state-of-the-art approaches."}
{"id": "2512.14877", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.14877", "abs": "https://arxiv.org/abs/2512.14877", "authors": ["Conor Rowan"], "title": "Extending the explicit constraint force method to inverse problems", "comment": null, "summary": "Recently, the explicit constraint force method (ECFM) was introduced as a principled approach to solution reconstruction in the presence of missing physics. In solution reconstruction, parameters of a physical model are estimated from sparse measurement data as a means to obtain the full solution field. In contrast, inverse problems target the missing parameters and estimate the solution along the way. Noting the similarity of the mathematical formulations of these two tasks, we investigate the use of ECFM to solve inverse problems. First, we compare the ECFM formulation of the inverse problem to a standard approach using two numerical examples. The first example provides an extension of ECFM to dynamic problems, and the second offers a novel approach to treat noisy measurement data. Next, we introduce a method to solve inverse problems for which the parameterized model has stochastic components. This approach is based on constraint forces and the polynomial chaos expansion, and is illustrated with another numerical example. Finally, we discuss extensions of ECFM to recover missing boundary conditions and domain geometries from measurement data, which are shown to be special cases of problems treated previously in the literature. The purpose of this work is to extend the mathematical framework of ECFM to novel applications and to gauge the method's viability as an alternative strategy for inverse analysis."}
{"id": "2512.14986", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.14986", "abs": "https://arxiv.org/abs/2512.14986", "authors": ["Carlo Bellingeri", "Emilio Ferrucci"], "title": "Wick integrals", "comment": null, "summary": "We introduce the Wick integral $\\int_s^t p(X_u) \\Diamond \\mathrm{d} X_u$ for a class of stochastic processes $X$ which are not necessarily Gaussian, in the regime of bounded $2> q$-variation. The integral is defined for polynomial integrands, and has the property of being centred if $X$ is such. In the case of $1/2 < H$-fractional Brownian motion, the Wick integral agrees with the divergence operator in Malliavin calculus. It satisfies a correction formula with the Young integral $\\int p(X)\\mathrm{d} X$ and an Itô formula which have arbitrarily many correction terms (only limited by the degree of $p$), given by integration against the cumulant functions of $X$, and reduce to familiar identities in the Gaussian case. These results are obtained by first developing diagram formulae for Appell polynomials. Our theory applies to a range of processes taking values in bounded Wiener chaos, such as the Rosenblatt process."}
{"id": "2512.14979", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.14979", "abs": "https://arxiv.org/abs/2512.14979", "authors": ["Qi Wang", "Uday V. Shanbhag", "Yue Xie"], "title": "A Parameter-Free Stochastic LineseArch Method (SLAM) for Minimizing Expectation Residuals", "comment": null, "summary": "Most existing rate and complexity guarantees for stochastic gradient methods in $L$-smooth settings mandates that such sequences be non-adaptive, non-increasing, and upper bounded by $\\tfrac{a}{L}$ for $a > 0$. This requires knowledge of $L$ and may preclude larger steps. Motivated by these shortcomings, we present an Armijo-enabled stochastic linesearch framework with standard stochastic zeroth- and first-order oracles. The resulting steplength sequence is non-monotone and requires neither knowledge of $L$ nor any other problem parameters. We then prove that the expected stationarity residual diminishes at a rate of $\\mathcal{O}(1/\\sqrt{K})$, where $K$ denotes the iteration budget. Furthermore, the resulting iteration and sample complexities for computing an $ε$-stationary point are $\\mathcal{O}(ε^{-2})$ and $\\mathcal{O}\\left(ε^{-4}\\right)$. The proposed method allows for a simple nonsmooth convex component in the objective, addressed through proximal gradient updates. Analogous guarantees are provided in the Polyak-Lojasiewicz (PL) setting and convex regimes. Preliminary numerical experiments are seen to be promising."}
{"id": "2512.14914", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.14914", "abs": "https://arxiv.org/abs/2512.14914", "authors": ["Federico Achini", "Paola Causin", "Sara Vanini", "Ke Chen", "Simone Scacchi"], "title": "Optimization of gridding algorithms for FFT by vector optimization", "comment": "27 pages", "summary": "The Fast Fourier Transform (FFT) is widely used in applications such as MRI, CT, and interferometry; however, because of its dependence on uniformly sampled data, it requires the use of gridding techniques for practical implementation. The performance of these algorithms strongly depends on the choice of the gridding kernel, with the first prolate spheroidal wave function (PSWF) regarded as optimal. This work redefines kernel optimality through the lens of vector optimization (VO), introducing a rigorous framework that characterizes optimal kernels as Pareto-efficient solutions of an error shape operator. We establish the continuity of such operator, study the existence of solutions, and propose a novel methodology to construct kernels tailored to a desired target error function. The approach is implemented numerically via interior-point optimization. Comparative experiments demonstrate that the proposed kernels outperform both the PSWF and the state-of-the-art methods (MIRT-NUFFT) in specific regions of interest, achieving orders-of-magnitude improvements in mean absolute errors. These results confirm the potential of VO-based kernel design to provide customized accuracy profiles aligned with application-specific requirements. Future research will extend this framework to multidimensional cases and relative error minimization, with potential integration of machine learning for adaptive target error selection."}
{"id": "2512.15013", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15013", "abs": "https://arxiv.org/abs/2512.15013", "authors": ["Han L. Gan"], "title": "Poisson-Dirichlet approximation for the stationary distribution of the inclusion process", "comment": "8 pages", "summary": "We consider the approximation of the stationary distribution of the finite inclusion process with the Poisson-Dirichlet distribution. Using Stein's method, we derive an explicit bound for the approximation error, which is of order 1/N in the thermodynamic limit. The results are achieved from a minor modification to Stein's method for Poisson-Dirichlet distribution approximation developed in Gan & Ross (2021). The derivatives used on test functions in Gan & Ross (2021) were directional type derivatives specifically chosen for their measure preserving properties. Depending upon the application, these derivatives can prove cumbersome. In this note, we show that for certain test functions we can instead use more traditional derivatives, which simplifies the bounds for the Stein factors and is more amenable to the approximation of the inclusion process."}
{"id": "2512.15070", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15070", "abs": "https://arxiv.org/abs/2512.15070", "authors": ["Alexander While", "Chen Chen"], "title": "QUBO Formulations for MIP Symmetry Detection", "comment": null, "summary": "Formulation symmetry in mixed-integer programming (MIP) can hinder solver performance by inducing redundant search, but detecting such symmetries is also a significant computational challenge. This paper explores the potential for quantum computing to handle symmetry detection. Quantum is a promising alternative to classical compute, but this emerging technology has limited hardware capacity in terms of input problem size. This paper explores the use of Quadratic Unconstrained Binary Optimization (QUBO) models for symmetry detection, as QUBO is the canonical format for quantum optimization platforms. To help address the input size bottleneck, we develop full, reduced, and decomposed QUBO as well as QUBO-Plus formulations for MIP symmetry detection. Computational experiments on the MIPLIB 2017 benchmark are used to estimate the quantum computing resources needed for practical problems."}
{"id": "2512.14941", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.14941", "abs": "https://arxiv.org/abs/2512.14941", "authors": ["Conor Rowan", "Kai Hampleman", "Kurt Maute", "Alireza Doostan"], "title": "Boundary condition enforcement with PINNs: a comparative study and verification on 3D geometries", "comment": null, "summary": "Since their advent nearly a decade ago, physics-informed neural networks (PINNs) have been studied extensively as a novel technique for solving forward and inverse problems in physics and engineering. The neural network discretization of the solution field is naturally adaptive and avoids meshing the computational domain, which can both improve the accuracy of the numerical solution and streamline implementation. However, there have been limited studies of PINNs on complex three-dimensional geometries, as the lack of mesh and the reliance on the strong form of the partial differential equation (PDE) make boundary condition (BC) enforcement challenging. Techniques to enforce BCs with PINNs have proliferated in the literature, but a comprehensive side-by-side comparison of these techniques and a study of their efficacy on geometrically complex three-dimensional test problems are lacking. In this work, we i) systematically compare BC enforcement techniques for PINNs, ii) propose a general solution framework for arbitrary three-dimensional geometries, and iii) verify the methodology on three-dimensional, linear and nonlinear test problems with combinations of Dirichlet, Neumann, and Robin boundaries. Our approach is agnostic to the underlying PDE, the geometry of the computational domain, and the nature of the BCs, while requiring minimal hyperparameter tuning. This work represents a step in the direction of establishing PINNs as a mature numerical method, capable of competing head-to-head with incumbents such as the finite element method."}
{"id": "2512.15104", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15104", "abs": "https://arxiv.org/abs/2512.15104", "authors": ["Attila Lovas", "Miklós Rásonyi", "Lionel Truquet"], "title": "Sharp Mixing Rates for Markov Chains on General Spaces with Unbounded Random Environments", "comment": null, "summary": "We consider Markov chains on general state spaces in stationary random environment which are defined by a random mapping that is contractive up to a bounded perturbation. We prove their convergence to a limiting law, providing convergence rates. We also show that these processes are strongly mixing and estimate their mixing coefficients. Our results significantly extend those available in the literature. In particular, for some additive autoregressive processes with exogenous covariates we achieve mixing rates that are optimal up to logarithmic factors."}
{"id": "2512.15165", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15165", "abs": "https://arxiv.org/abs/2512.15165", "authors": ["Giacomo Albi", "Elisa Calzola", "Matteo Piu"], "title": "Control of kinetic opinion dynamics in popularity-adaptive social networks", "comment": null, "summary": "This paper presents a mathematical model for opinion dynamics in popularity-adaptive social networks, where both opinion spreading and the evolution of social media contacts depend on agents' popularity and the prominence of their views. While previous approaches accounted for the influence of popularity on opinion dynamics, we introduce a novel feedback mechanism in which opinion affects the formation of contacts. Within a kinetic modeling framework, we describe the evolution of the coupled dynamics of opinions and network structure, incorporating a class of control laws in order to promote interactions with popular individuals and amplify dominant opinions. Such control strategies are introduced to influence both opinion formation and connectivity, representing interventions such as awareness campaigns or moderation policies. Numerical results show how control strategies can mitigate polarization, foster consensus, or guide opinion distributions in dynamically evolving networks."}
{"id": "2512.14950", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.14950", "abs": "https://arxiv.org/abs/2512.14950", "authors": ["Geshuo Wang", "Jingwei Hu"], "title": "Dynamical Tensor Train Approximation for Kinetic Equations", "comment": null, "summary": "The numerical solution of kinetic equations is challenging due to the high dimensionality of the underlying phase space. In this paper, we develop a dynamical low-rank method based on the projector-splitting integrator in tensor-train (TT) format. The key idea is to discretize the three-dimensional velocity variable using tensor trains while treating the spatial variable as a parameter, thereby exploiting the low-rank structure of the distribution function in velocity space. In contrast to the standard step-and-truncate approach, this method updates the tensor cores through a sweeping procedure, allowing the use of relatively small TT-ranks and leading to substantial reductions in memory usage and computational cost. We demonstrate the effectiveness of the proposed approach on several representative kinetic equations."}
{"id": "2512.15135", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15135", "abs": "https://arxiv.org/abs/2512.15135", "authors": ["Yinshan Chang", "Qinwei Chen"], "title": "The maximal correlation coefficient associated with the minimum", "comment": null, "summary": "For independent random variables $(X_i)_{1\\leq i\\leq n}$, we consider the maximal correlation coefficient $R=R(\\min_{i:1\\leq i\\leq m}X_i,\\min_{j:\\ell+1\\leq j\\leq n}X_j)$. If $X_1,X_2,\\ldots,X_n$ are identically distributed with the same continuous distribution, we find that $R=(m-\\ell)/\\sqrt{m(n-\\ell)}$. For discrete distributions, we calculate the maximal correlation coefficient $R$ for Bernoulli distributions, geometric distributions, binomial distributions and Poisson distributions. Our paper answers a question in \\cite[Section~6]{ChangChen}."}
{"id": "2512.15167", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15167", "abs": "https://arxiv.org/abs/2512.15167", "authors": ["Lingjia Zeng", "Manman Li"], "title": "Long-Run Average Reward Maximization of A Regulated Regime-Switching Diffusion Model", "comment": "35 pages,1 table, 4 figures", "summary": "This study considers an optimal reinsurance, investment, and dividend strategy control problem for insurance companies in a regulated Markov regime-switching environment, intending to maximize long-run average reward. Unlike existing single or dual strategy studies, an integrated control framework is established under solvency constraints, allowing investment and dividends only when the surplus process exceeds a minimum cash requirement level. To address the analytical difficulties associated with solving HJB equations and stationary distributions in high-dimensional state spaces under regime switching, we construct a numerical approximation scheme for the optimal strategy function based on Markov chains and neural networks. Furthermore, we establish the convergence of the corresponding sequence of surplus processes and rigorously prove that the associated optimal values converge to the true value function. Finally, we provide a numerical example based on the approximate dynamic programming method to demonstrate the feasibility of the proposed method."}
{"id": "2512.15102", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15102", "abs": "https://arxiv.org/abs/2512.15102", "authors": ["Frank de Hoog", "Markus Hegland"], "title": "Determinant-Based Error Bounds for CUR Matrix Approximation: Oversampling and Volume Sampling", "comment": "18 pages", "summary": "We derive error bounds for CUR matrix approximation using determinant-based methods that relate local projection errors to global approximation quality. For general matrices, we establish determinant identities for bordered Gramian matrices that decompose CUR approximation errors into interpretable local components. These identities connect projection errors onto submatrix column spaces directly to determinants, providing geometric insight into approximation degradation. We develop a probabilistic framework based on volume sampling that yields interpolation-type error bounds quantifying the benefits of oversampling: when $r > k$ rows are selected for $k$ columns, the expected error factor transitions linearly from $(k+1)^2$ (no oversampling) to $(k+1)$ (full oversampling). Our analysis establishes that the expected squared error is bounded by this interpolation factor times the squared error of the best rank-$k$ approximation, directly connecting CUR approximation quality to the optimal low-rank approximation. The framework applies to both CUR decomposition for general matrices and the Nyström method for symmetric positive semi-definite matrices, providing a unified theoretical foundation for determinant-based low-rank approximation analysis."}
{"id": "2512.15177", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15177", "abs": "https://arxiv.org/abs/2512.15177", "authors": ["Davar Khoshnevisan", "Cheuk Yin Lee"], "title": "Points of slow growth for parabolic SPDEs", "comment": null, "summary": "Consider the stochastic PDE, $\\partial_tu = \\partial^2_x u + σ(u) \\dot{W}$ on $\\mathbb{R}_+\\times\\mathbb{R}$, subject to $u(0)\\equiv1$, where $\\dot{W}$ denotes space-time white noise on $\\mathbb{R}_+\\times\\mathbb{R}$ and $σ:\\mathbb{R}\\to\\mathbb{R}$ is Lipschitz continuous. It is known that $u(t\\,,x)-1$ has approximately a Gaussian distribution for every $x$ when $t\\approx0$. Here we prove that there exist random points $x\\in\\mathbb{R}$ where the fluctuations of the solution near times zero are almost surely of sharp order $t^{1/4}$. Our work bears some loose resemblance to the study of the slow points of Brownian motion increments, though significant challenges arise due to the infinite-dimensional nature of the present problem."}
{"id": "2512.15189", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.15189", "abs": "https://arxiv.org/abs/2512.15189", "authors": ["Zhao Zhu", "Yu-Ping Tian", "Xuyang Wu"], "title": "Historical Information Accelerates Decentralized Optimization: A Proximal Bundle Method", "comment": null, "summary": "Historical information, such as past function values or gradients, has significant potential to enhance decentralized optimization methods for two key reasons: first, it provides richer information about the objective function, which also explains its established success in centralized optimization; second, unlike the second-order derivative or its alternatives, historical information has already been computed or communicated and requires no additional cost to acquire. Despite this potential, it remains underexploited. In this work, we employ a proximal bundle framework to incorporate the function values and gradients at historical iterates and adapt the framework to the proximal decentralized gradient descent method, resulting in a Decentralized Proximal Bundle Method (DPBM). To broaden its applicability, we further extend DPBM to the asynchronous and stochastic setting. We theoretically analysed the convergence of the proposed methods. Notably, both the asynchronous DPBM and its stochastic variant can converge with fixed step-sizes that are independent of delays, which is superior to the delay-dependent step-sizes required by most existing asynchronous optimization methods, as it is easier to determine and often leads to faster convergence. Numerical experiments on classification problems demonstrate that by using historical information, our methods yield faster convergence and stronger robustness in the step-sizes."}
{"id": "2512.15121", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15121", "abs": "https://arxiv.org/abs/2512.15121", "authors": ["Songzhe Xu", "Majid Rasouli", "Robert M. Kirby", "David Moxey", "Hari Sundar"], "title": "A geometrically informed algebraic multigrid preconditioned iterative approach for solving high-order finite element systems", "comment": null, "summary": "Algebraic multigrid (AMG) is conventionally applied in a black-box fashion, agnostic to the underlying geometry. In this work, we propose that using geometric information -- when available -- to assist with setting up the AMG hierarchy is beneficial, especially for solving linear systems resulting from high-order finite element discretizations. High-order problems draw considerable interest to both the scientific and engineering communities, but lack efficient solvers, at least open-source codes, tailored for unstructured high-order discretizations targeting large-scale, real-world applications. For geometric multigrid, it is known that using p-coarsening before h-coarsening can provide better scalability, but setting up p-coarsening is non-trivial in AMG. We develop a geometrically informed algebraic multigrid (GIAMG) method, as well as an associated high-performance computing program, which is able to set up a grid hierarchy that includes p-coarsening at the top grids with minimal information of the geometry from the user. A major advantage of using p-coarsening with AMG -- beyond the benefits known in the context of geometric multigrid (GMG) -- is the increased sparsification of coarse grid operators. We extensively evaluate GIAMG by testing on the 3D Helmholtz and incompressible flow problems, and demonstrate mesh-independent convergence, and excellent parallel scalability. We also compare the performance of GIAMG with existing AMG packages, including Hypre and ML."}
{"id": "2512.15184", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.15184", "abs": "https://arxiv.org/abs/2512.15184", "authors": ["Hakima Bessaih", "Benedetta Ferrario", "Oussama Landoulsi", "Margherita Zanella"], "title": "Continuous data assimilation for 2D stochastic Navier-Stokes equations", "comment": "29 pages", "summary": "Continuous data assimilation methods, such as the nudging algorithm introduced by Azouani, Olson, and Titi (AOT) [2], are known to be highly effective in deterministic settings for asymptotically synchronizing approximate solutions with observed dynamics. In this work, we extend this framework to a stochastic regime by considering the two-dimensional incompressible Navier-Stokes equations subject to either additive or multiplicative noise. We establish sufficient conditions on the nudging parameter and the spatial observation scale that guarantee convergence of the nudged solution to the true stochastic flow.\n  In the case of multiplicative noise, convergence holds in expectation, with exponential or polynomial rates depending on the growth of the noise covariance. For additive noise, we obtain the exponential convergence both in expectation and pathwise. These results yield a stochastic generalization of the AOT theory, demonstrating how the interplay between random forcing, viscous dissipation and feedback control governs synchronization in stochastic fluid systems."}
{"id": "2512.15205", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15205", "abs": "https://arxiv.org/abs/2512.15205", "authors": ["Tomoya Kamijima", "Naoki Marumo", "Akiko Takeda"], "title": "A Regression-Based Prediction-Correction Method for Stochastic Time-Varying Optimization Problems", "comment": "22 pages, 2 figures", "summary": "In many real-world applications, optimization problems evolve continuously over time and are often subject to stochastic noise. We consider a stochastic time-varying optimization problem in which the objective function $f(x;t)$ changes continuously and only noisy gradient observations are available. In deterministic settings, the prediction-correction method that exploits the time derivative of the solution is effective for accurately tracking the solution trajectory. However, a straightforward extension to stochastic problems requires an estimate of $\\nabla_{xt} f(x;t)$ and the computation of a Hessian inverse at each step--requirements that are difficult or costly in practice. To address these issues, we propose a prediction-correction algorithm that uses a regression-based prediction step: the prediction is formed as a linear combination of recent iterates, which can be computed efficiently without estimating $\\nabla_{xt}f(x;t)$ or computing Hessian inversions. We prove a tracking-error bound for the proposed method under standard smoothness and stochastic assumptions. Numerical experiments show that the regression-based prediction improves tracking accuracy while reducing computational cost compared with existing methods."}
{"id": "2512.15141", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.15141", "abs": "https://arxiv.org/abs/2512.15141", "authors": ["Liangcai Huang", "Shujuan Lü"], "title": "A New Fast Finite Difference Scheme for Tempered Time Fractional Advection-Dispersion Equation with a Weak Singularity at Initial Time", "comment": null, "summary": "In this paper, we propose a new second-order fast finite difference scheme in time for solving the Tempered Time Fractional Advection-Dispersion Equation. Under the assumption that the solution is nonsmooth at the initial time, we investigate the uniqueness, stability, and convergence of the scheme. Furthermore, we prove that the scheme achieves second-order convergence in both time and space. Finally, corresponding numerical examples are provided."}
{"id": "2512.15500", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15500", "abs": "https://arxiv.org/abs/2512.15500", "authors": ["Bénédicte Haas", "Grégory Miermont"], "title": "Ancestral diversity in fragmentation trees", "comment": null, "summary": "In a deterministic or random tree, a notion of ancestral diversity can be defined as follows. Sample independently $n$ groups of $k$ leaves and count the number $N_n(k)$ of distinct most recent common ancestors of each of the groups. As $n$ becomes large, the asymptotic behavior of $N_n(k)$ depends of course on the structure of the tree. Motivated by the study of the edge density in the Brownian co-graphon, Chapuy recently considered this problem in the case where $k=2$ and where the tree is the Brownian continuum random tree. We vastly extend this framework by considering general values of $k$ and general fragmentation trees, which include some prominent examples such as stable Lévy trees and idealized models of phylogenetic trees. Other natural ancestral statistics are also considered. For a given tree model, we identify a phase transition-like phenomenon, with different asymptotic regimes for $N_k(n)$, depending on the position of $k$ relative to a model-dependent critical value."}
{"id": "2512.15318", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15318", "abs": "https://arxiv.org/abs/2512.15318", "authors": ["Jan Schwientek", "Katrin Teichert", "Jan Schröder", "Johannes Höller", "Patrick Schwartz", "Norbert Asprion", "Pascal Schäfer", "Martin Wlotzka", "Michael Bortz"], "title": "On Computing and Pricing of Adjustable Robust Chemical Process Designs", "comment": "30 pages, 12 figures, 4 tables", "summary": "Model-based process simulation can be used to derive designs and operating conditions of chemical processes that optimally balance multiple objectives, such as quality, costs, or environmental impacts. This work focuses on identifying designs that hedge against uncertainties in model parameters to ensure feasibility, taking the possibility to adjust operating conditions into account. An adaptive scheme is proposed to pinpoint the relevant scenarios in a discretized uncertainty space; these scenarios are then fed into a multi-objective adjustable robust optimization framework reducing the computational burden compared to the consideration of all potential scenarios. Furthermore, we propose a method to quantify the cost or price of robustness, i.e., the compromise which has to be made in comparison to the nominal design case in order to hedge against uncertainty. The conceptual findings are illustrated with an industrially relevant case study."}
{"id": "2512.15227", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15227", "abs": "https://arxiv.org/abs/2512.15227", "authors": ["Julius Ehigie", "Vu Thai Luan"], "title": "Efficient high-order two-derivative DIRK methods with optimized phase errors", "comment": "20 pages, 7 figures", "summary": "This work constructs and analyzes new efficient high-order two-derivative diagonally implicit Runge--Kutta (TDDIRK) schemes with optimized phase errors. Specifically, we present a convergence result for TDDIRK methods and investigate their optimized phase errors and linear stability analysis. Based on these, we derive new families of 2-stage fourth-order, 2-stage fifth-order, and 3-stage fifth-order TDDIRK schemes. Finally, we provide numerical experiments at both the ODE and PDE levels to demonstrate the accuracy and efficiency of these new schemes compared to known DIRK schemes in the literature."}
{"id": "2512.15506", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.15506", "abs": "https://arxiv.org/abs/2512.15506", "authors": ["Alessandra Faggionato", "Michele Salvi"], "title": "Scaling limit of the complex mobility matrix for the random conductance model on $\\mathbb{T}^d_N$", "comment": "35 pages, 3 figures", "summary": "We consider a continuous-time random walk on the $d$-dimensional torus $\\mathbb{T}^d_{N}=\\mathbb{Z}^d/N \\mathbb{Z}^d$, possibly with long-range, but finite, jumps. The law of the jumps is regulated by a random environment $ξ$ yielding a stationary and ergodic field of random conductances. The complex mobility matrix $σ_N^ξ(ω)$ measures the linear response of the random walk to a $\\cos(ωt)$-type oscillating external field. By investigating the homogenization properties of the medium, and assuming in addition that the conductances have finite second moment, we show that, for almost every realization of the environment $ξ$, the complex mobility matrix $σ_N^ξ(ω)$ converges as $N\\to+\\infty$ to a deterministic limiting matrix $σ(ω)$ and provide different characterizations of $σ(ω)$."}
{"id": "2512.15381", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.15381", "abs": "https://arxiv.org/abs/2512.15381", "authors": ["Mohammad Mahmoudi Filabadi", "Guillaume Crevecoeur", "Tom Lefebvre"], "title": "Gaussian Process Dual MPC using Active Inference: An Autonomous Vehicle Usecase", "comment": null, "summary": "Designing controllers under uncertainty requires balancing the need to explore system dynamics with the requirement to maintain reliable control performance. Dual control addresses this challenge by selecting actions that both regulate the system and actively gather informative data. This paper investigates the use of the Active Inference framework, grounded in the Free Energy Principle, for developing a dual model-predictive controller (MPC). To identify and quantify uncertainty, we introduce an online sparse semi-parametric Gaussian Process model that combines the flexibility of nonparametric with the efficiency of parametric learning for real-time updates. By applying the expected free energy functional to this adaptive probabilistic model, we derive an MPC objective that incorporates an information-theoretic term, which captures uncertainty arising from both the learned model and measurement noise. This formulation leads to a stochastic optimal control problem for dual controller design, which is solved using a novel dynamic-programming-based method. Simulation results on a vehicle use case demonstrate that the proposed algorithm enhances autonomous driving control performance across different settings and scenarios."}
{"id": "2512.15305", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15305", "abs": "https://arxiv.org/abs/2512.15305", "authors": ["Laurent Navoret", "Roxana Sublet", "Marcela Szopos"], "title": "From flocking to jamming in collective cell dynamics: a Vicsek-like model including contact forces", "comment": null, "summary": "The goal of the present work is to propose an agent-based model that originally combines classical Vicsek-like polarity alignments and contact forces, as implemented in the framework developed by Maury and Venel in [Maury, Venel, 2011]. The description additionally incorporates velocity feedback on polarity and soft attraction-repulsion interactions. After carefully studying the well posedness of the model, we introduce a suitable discretization and perform an extensive range of numerical experiments to assess the impact of different modeling ingredients. The dynamical system is capable of recovering the order-disorder phase transition of the flock, as well as the jamming effect in high density regimes. As such, the developed framework can be seen as a promising theoretical tool that could contribute to improving the understanding of complex collective cell dynamics and emerging tissue flows."}
{"id": "2512.15527", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15527", "abs": "https://arxiv.org/abs/2512.15527", "authors": ["Claudio Macci", "Barbara Pacchiarotti"], "title": "Some vector-valued examples of noncentral moderate deviation results", "comment": "14 pages", "summary": "The term noncentral moderate deviations is used in the literature to mean a class of large\n  deviation principles that, in some sense, fills the gap between the convergence in probability to a\n  constant (governed by a reference large deviation principle) and a weak convergence to a non-Gaussian\n  (and non-degenerating) distribution. Several examples can be found in the literature, mainly for\n  real-valued random variables (see, e.g.,~\\cite{GiulianoMacci} and the references cited therein). In this\n  paper we present some examples with vector-valued random variables."}
{"id": "2512.15392", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15392", "abs": "https://arxiv.org/abs/2512.15392", "authors": ["Chiara Schindler"], "title": "Asymptotic behaviour of stochastic inertial dynamics incorporating a Tikhonov regularization term", "comment": null, "summary": "In a separable Hilbert space, we study the minimization problem of a convex smooth function with Lipschitz continuous gradient whose evaluations are corrupted by random noise. To this end, we associate a stochastic inertial system that incorporates Tikhonov regularization with the optimization problem. We establish existence and uniqueness of a solution trajectory for this system. Then, we derive an upper bound on the expected value of an appropriate associated energy function given square-integrability of the diffusion $σ_X$ before focusing on the particular case where the parameter function multiplied by the Tikhonov term is given by $\\frac{1}{t^r}$ for $0<r<2$. For this setting, we show a.s. convergence rates as well as convergence rates in expectation for the function values along the trajectory to an infimal value, the trajectory process to an optimal solution and its time derivative to zero under a stronger integrability condition on $σ_X$."}
{"id": "2512.15314", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15314", "abs": "https://arxiv.org/abs/2512.15314", "authors": ["Feiyi Liao", "Haochen Liu", "Hehu Xie"], "title": "Continuous Finite Element Method For Maxwell Eigenvalue Problems With Regular Decomposition Technique", "comment": "35 pages, 10 figures", "summary": "With the regular decomposition technique, we decompose the space $\\mathbf{H}_0^s(\\mathbf{curl}; Ω)$ into the sum of a vector potential space and the gradient of a scalar space, both possessing higher regularity. Based on this new high order regular decomposition, a novel numerical method using standard high order Lagrange finite elements is designed for solving Maxwell eigenvalue problems. Specifically, the full convergence orders of the eigenpair approximations are proved for the proposed numerical method. Finally, numerical examples are provided to validate the proposed scheme and confirm the theoretical convergence results."}
{"id": "2512.15529", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15529", "abs": "https://arxiv.org/abs/2512.15529", "authors": ["Erik I. Broman", "Johan H. Tykesson"], "title": "The Poisson stick model in hyperbolic space", "comment": "34 pages, 7 figures", "summary": "In this paper we study the Poisson stick model in two dimensional hyperbolic space $\\mathbb{H}^2,$ where the sticks all have length $L.$ Typically, percolation models in hyperbolic space undergo two phase transitions as the intensity $λ$ varies, namely the percolation phase transition and the uniqueness phase transition. For the Poisson stick model, the critical intensities at which these transitions occur will depend on $L$, and in this paper we study the asymptotic behavior of these critical points as $L\\to \\infty.$ Our main results show that the critical point for the percolation phase transition scales like $L^{-2},$ while the critical point for the uniqueness phase transition scales like $L^{-1}.$ Comparing these results to the analogous results in Euclidean space show that the behavior of the percolation phase transition is the same in these two settings, while the uniqueness phase transition scales differently."}
{"id": "2512.15471", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15471", "abs": "https://arxiv.org/abs/2512.15471", "authors": ["Casper Loman", "Loriana Pascual", "Marjan van den Akker", "Roel van den Broek", "Han Hoogeveen"], "title": "Robustness Measures for Stochastic Parallel Machine Scheduling and Train Unit Shunting", "comment": null, "summary": "In many real world scheduling problems, the processing times of tasks are subject to uncertainty. This makes it essential to design schedules that are robust and able to handle potential disruptions. Therefore, we investigate measures that give us information about the robustness of a schedule. Although many measures can be found in literature, there is no consensus on which measures are the best. We identify 14 robustness measures from the literature, as well as introduce 4 new ones. To find out which of these measures are best used for generating robust schedules, we perform an elaborate simulation study to investigate how well these robustness measures correlate with the stability of the objective function under disturbances (quality robustness) and with the stability of the schedule itself (solution robustness). We first consider the Stochastic Parallel Machine Scheduling Problem (SPMSP) with precedence constraints, which is a very general setting that is relevant for many practical situations. We then perform a second simulation study by taking the best performing measures from the first experiment, and using them for the Train Unit Shunting Problem with Service Scheduling (TUSPwSS). After establishing the correlation with quality and solution robustness, we included the measures as objective in a local search algorithm. We make a comparison between the theoretical setting of the SPMSP and the TUSPwSS, and identify a set of robustness measures that can be applied in many different settings. We show that we can achieve up to 90% decreases in delays compared to using no robustness measures. Lastly, we also identify properties that can be used to predict the effectiveness of such a robustness measure."}
{"id": "2512.15317", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.15317", "abs": "https://arxiv.org/abs/2512.15317", "authors": ["M. Buhmann", "J. Jódar", "M. Rodríguez"], "title": "Hyperbolic trigonometric functions as approximation kernels and their properties II: Wavelets", "comment": null, "summary": "In a previous paper we have introduced a new class of radial basis functions that are powerful means to approximate functions by quasi-interpolation. In this article we extend the results to create new ways of approximating functions by prewavelets that are constructed from spaced spanned of the new hyperbolic radial basis functions. They consist of highly localised time-frequency decompositions that are suitable for analysis and filtering. The construction is sufficiently general to apply for large classes of other radial basis functions too - such as multiquadrics and their generalisations and thin-plate splines -, as well as, for example, polynomial splines."}
{"id": "2512.15561", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15561", "abs": "https://arxiv.org/abs/2512.15561", "authors": ["Sayan Banerjee", "Shankar Bhamidi", "Remco van der Hofstad", "Rounak Ray"], "title": "Non-equilibrium coagulation processes and subcritical percolation on evolving networks", "comment": "56 pages, 3 figures", "summary": "We investigate percolation on growing networks where the evolution of connected components resembles a non-equilibrium version of the multiplicative coalescent. The supercritical $π> π_c$ regime for a host of such models was conjectured in statistical physics, and then rigorously proven in mathematics, to exhibit behavior similar to the BKT infinite-order phase transition as $π\\searrow π_c$. It has further been conjectured that the entire regime $π<π_c$ for such growing networks are ''critical'' with power-law cluster size distributions having a non-universal exponent for all values of $π\\in (0, π_c)$.\n  In this paper, we study percolation on the uniform attachment model, as a concrete template in order to develop general tools based on stochastic approximation, local convergence, branching random walks and tree-graph inequalities to prove the above conjectured phenomena. For each $π\\in (0,π_c)$, we show there exists an explicit $α(π) \\in (0,\\tfrac{1}{2}) $ such that the maximal component size, as well as the size of the component containing any fixed vertex, all re-scaled by $n^{α(π)}$, converge almost surely to strictly positive random variables as the network size $n \\to \\infty$. These dynamics lead to novel phenomena, compared to classical 'static' models, including long-range dependence and fixation of the identity of the maximal component, within finite time, among a finite number of 'early' components. Moreover, in contrast with most static network models, we show that the susceptibility, that is, the expected size of the component of a uniformly chosen vertex, remains bounded as the network grows and $π$ approaches $π_c$ from below. The general tools developed in this paper will be used in follow-up work to understand percolation for general growing network evolution models."}
{"id": "2512.15568", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.15568", "abs": "https://arxiv.org/abs/2512.15568", "authors": ["Jiayang Ren", "Qiangqiang Mao", "Tianwei Zhao", "Yankai Cao"], "title": "Exact Learning of Linear Model Predictive Control Laws using Oblique Decision Trees with Linear Predictions", "comment": "6 pages, 4 figures, accepted by and presented at the 64th IEEE Conference on Decision and Control (CDC) in December 2025", "summary": "Model Predictive Control (MPC) is a powerful strategy for constrained multivariable systems but faces computational challenges in real-time deployment due to its online optimization requirements. While explicit MPC and neural network approximations mitigate this burden, they suffer from scalability issues or lack interpretability, limiting their applicability in safety-critical systems. This work introduces a data-driven framework that directly learns the Linear MPC control law from sampled state-action pairs using Oblique Decision Trees with Linear Predictions (ODT-LP), achieving both computational efficiency and interpretability. By leveraging the piecewise affine structure of Linear MPC, we prove that the Linear MPC control law can be replicated by finite-depth ODT-LP models. We develop a gradient-based training algorithm using smooth approximations of tree routing functions to learn this structure from grid-sampled Linear MPC solutions, enabling end-to-end optimization. Input-to-state stability is established under bounded approximation errors, with explicit error decomposition into learning inaccuracies and sampling errors to inform model design. Numerical experiments demonstrate that ODT-LP controllers match MPC's closed-loop performance while reducing online evaluation time by orders of magnitude compared to MPC, explicit MPC, neural network, and random forest counterparts. The transparent tree structure enables formal verification of control logic, bridging the gap between computational efficiency and certifiable reliability for safety-critical systems."}
{"id": "2512.15332", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.15332", "abs": "https://arxiv.org/abs/2512.15332", "authors": ["Julio Careaga", "Qian Huang", "Julian Koellermeier"], "title": "A moment model of shallow granular flows with variable friction laws", "comment": "30 pages, 8 figures", "summary": "In this work, we develop a modelling framework for granular flows based on the shallow water moment equations on inclined planes. Under the assumption of a polynomial expansion of the velocity field, the model extends the classical shallow water equations to vertically variable velocity profiles. The friction effects, which are captured through the strain-rate tensor, are incorporated into the model in two terms, the bulk and bottom friction. We propose a modelling procedure to incorporate general friction laws into our framework and exemplify this combining the Manning, Coulomb, Savage-Hutter, and $μ(I)$-rheology friction models in our modeling framework. Moreover, we develop a path-conservative finite volume numerical scheme based on the polynomial viscosity matrix method to properly handle the stiffness of the source terms. Numerical simulations are presented for different models of friction, including the case of wet-dry fronts."}
{"id": "2512.15673", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.15673", "abs": "https://arxiv.org/abs/2512.15673", "authors": ["Remco van der Hofstad"], "title": "Percolation on random graphs", "comment": "20 pages, Proceeding of the International Congress of Mathematicians 2026", "summary": "Percolation is a model for random damage to a network. It is one of the simplest models that displays a phase transition: when the network is severely damaged, it falls apart in many small connected components, while if the damage is light, connectivity is hardly affected. We study the location and nature of the phase transition on random graphs. In particular, we focus on the connectivity structure close to, or below, criticality, where components display intricate scaling behaviour such that a typical connected component has bounded size, while the average and maximal connected component sizes grow like powers of the network size.\n  We review the recent progress that has been made in two important settings: random graphs whose expected adjacency matrix is close to being rank-1, the most prominent examples being the configuration model and rank-1 inhomogeneous random graphs, and dynamic random graphs, i.e., random graphs that grow with time, such as uniform and preferential attachment models. Remarkably, these two settings behave rather differently. In all cases, the inhomogeneity of the underlying random graph on which we perform percolation is of crucial importance."}
{"id": "2512.15678", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.15678", "abs": "https://arxiv.org/abs/2512.15678", "authors": ["Jorge I. Poveda", "Andrew R. Teel"], "title": "Hybrid Set-Seeking Systems: Model-Free Feedback Optimization via Hybrid Inclusions", "comment": "Submitted to IEEE Control Systems Magazine in September of 2024", "summary": "This article aims to provide an accessible, tutorial-style introduction to hybrid extremum-seeking systems, which are model-free, feedback-optimization controllers that incorporate hybrid dynamics, meaning both continuous-time and discrete-time behaviors. Such systems arise when advanced control and optimization tools are needed to overcome the limitations of smooth feedback methods and to satisfy demanding transient and steady-state requirements in high-performance applications. They also appear when controllers must operate on plants that inherently exhibit hybrid behaviors, as is common in cyber-physical and autonomous systems that rely on digital sensing, computation, and actuation. To study hybrid extremum-seeking dynamics through control-theoretic methods, we first review the key concepts that support the development of perturbation theory for hybrid inclusions, forming the basis for averaging and singular perturbation analyses. We then show how these ideas apply to the design and evaluation of hybrid extremum-seeking algorithms for static and dynamic plants. Several examples are presented, including set-valued and switching algorithms under different switching regimes such as arbitrarily fast switching, dwell-time and average dwell-time constraints, and average activation time conditions. We also discuss state-based switching extremum seeking for obstacle-avoidance problems and gradient-Newton switching schemes. Additional topics include momentum-based and reset-type extremum seeking, intermittent updates, slowly varying parameters, hybrid filters, and safety-aware schemes that incorporate constraints. Across all these settings, we illustrate how perturbation-based methods traditionally used for extremum-seeking control naturally extend to hybrid systems when mild regularity assumptions are satisfied, and solutions are modeled on hybrid time domains."}
{"id": "2512.15373", "categories": ["math.NA", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.15373", "abs": "https://arxiv.org/abs/2512.15373", "authors": ["Sebastian Resch-Schopper", "Romain Rumpler", "Gerhard Müller"], "title": "Consistent Parametric Model Order Reduction by Matrix Interpolation for Varying Underlying Meshes", "comment": null, "summary": "Parametric model order reduction (pMOR) is a powerful tool for accelerating finite element (FE) simulations while maintaining parametric dependencies. For geometric parameters, pMOR by matrix interpolation is a well-suited approach because it does not require an affine representation of the parametric dependency, which is often not available for geometric parameters. However, the method requires that the underlying FE mesh has the same number of degrees of freedom and the same topology for all parameter configurations. This requirement can be difficult or even impossible to achieve for large parameter ranges or when automatic meshing is used. In this work, we propose a novel framework for pMOR by matrix interpolation for varying underlying meshes. The key idea is to understand the sampled reduced bases as continuous displacement fields that can be represented in different discretizations. By using mesh morphing and basis interpolation, the sampled reduced bases described in varying meshes can all be represented in terms of one reference mesh. This not only allows for performing pMOR by matrix interpolation, but also enables comparing the subspaces that the reduced bases span, which is important to detect strong changes that could lead to inconsistencies in the reduced operators. For mesh morphing, two strategies, namely morphing by spring analogy with elastic hardening and radial basis function morphing, were implemented and tested. Numerical experiments on a beam-shaped plate and a plate with a hole for one- and two-dimensional parameter spaces show that the proposed framework achieves high accuracy for both morphing methods and performs significantly better than two existing approaches for pMOR by matrix interpolation for varying underlying meshes."}
{"id": "2512.15455", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15455", "abs": "https://arxiv.org/abs/2512.15455", "authors": ["Jean-Guillaume de Damas", "Laura Grigori", "Igor Simunec", "Edouard Timsit"], "title": "Randomized orthogonalization and Krylov subspace methods: principles and algorithms", "comment": "40 pages, 14 figures", "summary": "We present an overview of randomized orthogonalization techniques that construct a well-conditioned basis whose sketch is orthonormal. Randomized orthogonalization has recently emerged as a powerful paradigm for reducing the computational and communication cost of state-of-the-art orthogonalization procedures on parallel architectures, while preserving, and in some cases improving, their numerical stability. This approach can be employed within Krylov subspace methods to mitigate the cost of orthogonalization, yielding a randomized Arnoldi relation. We review the main variants of the randomized Gram--Schmidt and Householder QR algorithms, and discuss their application to Krylov methods for the solution of large-scale linear algebra problems, such as linear systems of equations, eigenvalue problems, the evaluation of matrix functions, and matrix equations."}
{"id": "2512.15495", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15495", "abs": "https://arxiv.org/abs/2512.15495", "authors": ["Lubomir Banas", "Jean Daniel Mukam"], "title": "Robust a posteriori error analysis of the stochastic Cahn-Hilliard equation with rough noise", "comment": null, "summary": "We derive a posteriori error estimate for a fully discrete adaptive finite element approximation of the stochastic Cahn-Hilliard equation with rough noise. The considered model is derived from the stochastic Cahn-Hilliard equation with additive space-time white noise through suitable spatial regularization of the white noise. The a posteriori estimate is robust with respect to the interfacial width parameter as well as the noise regularization parameter. We propose a practical adaptive algorithm for the considered problem and perform numerical simulations to illustrate the theoretical findings."}
{"id": "2512.15631", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15631", "abs": "https://arxiv.org/abs/2512.15631", "authors": ["Dibyendu Adak", "Rujeko Chinomona", "Duc P. Truong", "Oleg Korobkin", "Kim Ø. Rasmussen", "Boian S. Alexandrov"], "title": "Space-Time Spectral Collocation Tensor-Network Approach for Maxwell's Equations", "comment": null, "summary": "In this work, we develop a space--time Chebyshev spectral collocation method for three-dimensional Maxwell's equations and combine it with tensor-network techniques in Tensor-Train (TT) format. Under constant material parameters, the Maxwell system is reduced to a vector wave equation for the electric field, which we discretize globally in space and time using a staggered spectral collocation scheme. The staggered polynomial spaces are designed so that the discrete curl and divergence operators preserve the divergence-free constraint on the magnetic field. The magnetic field is then recovered in a space--time post-processing step via a discrete version of Faraday's law. The global space--time formulation yields a large but highly structured linear system, which we approximate in low-rank TT-format directly from the operator and data, without assuming that the forcing is separable in space and time. We derive condition-number bounds for the resulting operator and prove spectral convergence estimates for both the electric and magnetic fields. Numerical experiments for three-dimensional electromagnetic test problems confirm the theoretical convergence rates and show that the TT-based solver maintains accuracy with approximately linear complexity in the number of grid points in space and time."}
{"id": "2512.15640", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15640", "abs": "https://arxiv.org/abs/2512.15640", "authors": ["Kimberly Matsuda", "Yanlai Chen", "Yingda Cheng", "Fengyan Li"], "title": "Reduced Basis Methods for Parametric Steady-State Radiative Transfer Equation", "comment": "Accepted by Journal of Computational Physics", "summary": "The radiative transfer equation (RTE) is a fundamental mathematical model to describe physical phenomena involving the propagation of radiation and its interactions with the host medium. Deterministic methods can produce accurate solutions without any statistical noise, yet often at a price of expensive computational costs originating from the intrinsic high dimensionality of the model. With this work, we present the first systematic investigation of projection-based reduced order models (ROMs) following the reduced basis method (RBM) framework to simulate the parametric steady-state RTE with isotropic scattering and one energy group. Four ROMs are designed, with each defining a nested family of reduced surrogate solvers of different resolution/fidelity. They are based on either a Galerkin or least-squares Petrov-Galerkin projection and utilize either an $L_1$ or residual-based importance/error indicator. Two of the proposed ROMs are certified in the setting when the absorption cross section is positively bounded below uniformly. One technical focus and contribution lie in the proposed implementation strategies under the affine assumption of the parameter dependence of the model. These well-crafted broadly applicable strategies not only ensure the efficiency and accuracy of the offline training stage and the online prediction of reduced surrogate solvers, they also take into account the conditioning of the reduced systems as well as the stagnation-free residual evaluation for numerical robustness. Computational complexities are derived for both the offline training and online prediction stages of the proposed model order reduction strategies, and they are demonstrated numerically along with the accuracy and robustness of the reduced surrogate solvers. Numerically we observe four to six orders of magnitude speedup of our ROMs compared to full order models for some 2D2v examples."}
{"id": "2512.15646", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15646", "abs": "https://arxiv.org/abs/2512.15646", "authors": ["Jacinto Ulloa", "Laurent Stainier"], "title": "Material data identification in generalized continua", "comment": null, "summary": "We introduce a data-driven framework for identifying material behavior from full-field kinematics and force measurements in generalized (micromorphic) continua. Unlike traditional approaches that rely on constitutive assumptions or homogenization schemes, our method extracts generalized stress--strain data by enforcing non-classical balance laws and compatibility relations on full-field boundary value problems. Specifically, the approach infers the associated generalized stresses and constructs representative material datasets via clustering in a non-classical phase space. We show that the proposed method reliably extracts non-symmetric and higher-order local stress states, providing material data suitable for either model calibration or model-free data-driven simulations of generalized continua. These capabilities are demonstrated in validation simulations with synthetic data and in an application to mechanical metamaterials, suggesting a practical route for material characterization of microstructured solids."}
{"id": "2512.15703", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.15703", "abs": "https://arxiv.org/abs/2512.15703", "authors": ["Erika Ye", "Chao Yang"], "title": "Time integration of quantized tensor trains using the interpolative dynamical low-rank approximation", "comment": null, "summary": "Quantized tensor trains (QTTs) are a low-rank and multiscale framework that allows for efficient approximation and manipulation of multi-dimensional, high resolution data. One area of active research is their use in numerical simulation of hyperbolic systems such as the Navier-Stokes equations and the Vlasov equations. One popular time integration scheme is the dynamical low-rank approximation (DLRA), in which the time integration is constrained to a low-rank manifold. However, until recently, DLRA has typically used orthogonal projectors to project the original dynamical system into a reduced space, which is only well-suited for linear systems. DLRA has also mostly been investigated in the context of non-quantized tensor trains. This work investigates interpolative DLRA schemes in which the low-rank manifold is constructed from aptly chosen interpolation points and interpolating polynomials, in the context of QTTs. Through various examples, its performance is compared to its orthogonal counterpart. This work demonstrates how interpolative DLRA is suitable for nonlinear systems and time integrators requiring nonlinear element-wise operations, such as upwind time integration schemes."}
