{"id": "2512.17036", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.17036", "abs": "https://arxiv.org/abs/2512.17036", "authors": ["Yuan-Hung Kuan", "Jr-Shin Li"], "title": "EBIF: Exact Bilinearization Iterative Form for Control-Affine Nonlinear Systems", "comment": "12 pages, 4 figures", "summary": "In this paper, we develop a novel framework, Exact Bilinearization Iterative Form (EBIF), for transforming a nonlinear control-affine system into an exact finite-dimensional bilinear representation. In contrast to most existing approaches which generally lead to an infinite-dimensional representation, the proposed EBIF approach yields an iterative procedure for constructing a finite set of smooth coordinate functions that define an embedding, enabling an exact bilinear representation of the original nonlinear dynamics. Leveraging tools from algebra and differential geometry, we establish both necessary and sufficient conditions for a nonlinear system to be exactly bilinearizable. We further illustrate how the EBIF-induced bilinear systems facilitate reachability analysis and control design. Through theoretical analysis and numerical simulations, we demonstrate the effectiveness of the EBIF framework and highlight its potential in simplifying control synthesis for nonlinear systems."}
{"id": "2512.17039", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17039", "abs": "https://arxiv.org/abs/2512.17039", "authors": ["Aleksandr Arakcheev", "Heinz H. Bauschke"], "title": "Fejér and Fejér* Monotonicity: New Results and Limiting Examples", "comment": null, "summary": "Many algorithms in convex optimization and variational analysis can be analyzed using Fejér monotone sequences. In 2024, Behling, Bello-Cruz, Iusem, Alves Ribeiro, and Santos introduced a new, more general, notion: Fejér* monotonicity. They obtained basic results and discussed applications in optimization.\n  In this work, we complement Behling et al.'s work by presenting a thorough study of Fejér* monotonicity. We reveal striking similarities and differences between these notions, including descriptions of the maximal Fejér* set. Moreover, we also touch upon Opial sequences and quasi-Fejér monotonicity. Throughout this paper, we provide numerous limiting examples and counterexamples."}
{"id": "2512.17174", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17174", "abs": "https://arxiv.org/abs/2512.17174", "authors": ["Chao Zhai", "Yanlin Li"], "title": "Distributed Rotary Coverage Control of Multi-Agent Systems in Uncertain Environments", "comment": null, "summary": "It is always a challenging task for multi-agent systems to achieve efficient and robust coverage in uncertain environments. The absence of global positioning information on the uncertain environment introduces significant complexity to the spatially distributed design of coverage control algorithms. To address this issue, this paper proposes a coverage control formulation based on beacon-free rotary pointer partition mechanism. A partition dynamics is designed to enable the asymptotical consensus of multi-agent reference points, as well as the workload-balanced subdivision of coverage region. On this basis, a distributed coverage control algorithm is developed to drive each agent toward the optimal deployment of their respective subregions, thereby minimizing the coverage cost. Simulation results demonstrate that the proposed coverage control method can significantly improve overall coverage efficiency with workload balance among agents, and exhibit strong adaptability and robustness in uncertain environments."}
{"id": "2512.17353", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17353", "abs": "https://arxiv.org/abs/2512.17353", "authors": ["Najmeh Ghaderi", "Birgit Jacob"], "title": "Unknown input observer design for a class of coupled wave PDE systems", "comment": null, "summary": "This paper deals with the problem of designing unknown input observers for a class of coupled semilinear wave partial differential equations (PDE) systems. A state observer is designed to estimate the uncertain coupled wave PDE systems. Then, the analysis of the asymptotic stability and $H_{\\infty}$ performance for the observer design of coupled wave PDE systems is investigated. Some sufficient conditions of asymptotic stability for the observer error system with disturbance attenuation level are derived via matrix inequalities based on the Lyapunov stability theory. Finally, a numerical simulation is presented to demonstrate the effectiveness of the obtained result."}
{"id": "2512.17372", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.17372", "abs": "https://arxiv.org/abs/2512.17372", "authors": ["Ruiting Liang", "Samuel Dyson", "Rina Foygel Barber", "Daniel E. Holz"], "title": "False detection rate control in time series coincidence detection", "comment": null, "summary": "We study the problem of coincidence detection in time series data, where we aim to determine whether the appearance of simultaneous or near-simultaneous events in two time series is indicative of some shared underlying signal or synchronicity, or might simply be due to random chance. This problem arises across many applications, such as astrophysics (e.g., detecting astrophysical events such as gravitational waves, with two or more detectors) and neuroscience (e.g., detecting synchronous firing patterns between two or more neurons). In this work, we consider methods based on time-shifting, where the timeline of one data stream is randomly shifted relative to another, to mimic the types of coincidences that could occur by random chance. Our theoretical results establish rigorous finite-sample guarantees controlling the probability of false positives, under weak assumptions that allow for dependence within the time series data, providing reassurance that time-shifting methods are a reliable tool for inference in this setting. Empirical results with simulated and real data validate the strong performance of time-shifting methods in dependent-data settings."}
{"id": "2512.17076", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17076", "abs": "https://arxiv.org/abs/2512.17076", "authors": ["Louis Gass", "Domenico Marinucci", "Giovanni Peccati", "Francesca Pistolato", "Michele Stecconi"], "title": "Universal Cancellations in Uniform Random Waves", "comment": "49 pages. Comments are welcome!", "summary": "A vast literature over the past fifteen years has been devoted to the study of the geometric properties of Gaussian random waves. In this work, we investigate the geometric behavior of \\emph{uniform random waves}, a much less studied non-Gaussian model in which the $L^2$ norm is constrained to be exactly equal to one in every realization (a normalization that is natural from the standpoint of quantum mechanics). We show that this norm-constrained formulation has deep consequences for the universality of the so-called \\emph{Berry's cancellation phenomenon}, as well as for novel high-frequency asymptotic variance estimates. These effects manifest themselves in both local geometric functionals, such as the Lipschitz--Killing curvatures, and global ones, such as the number of connected components above a fixed threshold. A key byproduct of our analysis is a new explicit relation between Hermite expansions and spherical harmonic decompositions for $0$-homogeneous functionals of Gaussian vectors, which enables a systematic chaos-based analysis of non-Gaussian random waves."}
{"id": "2512.17006", "categories": ["math.NA", "math-ph", "nlin.CD"], "pdf": "https://arxiv.org/pdf/2512.17006", "abs": "https://arxiv.org/abs/2512.17006", "authors": ["Matthew Golden"], "title": "An Explicit Sixth Order Runge-Kutta Method for Simple Lawson Integration", "comment": null, "summary": "Explicit Runge-Kutta schemes become impractical when a stiff linear operator is present in the dynamics. This failure mode is quite common in numerical simulations of fluids and plasmas. Lawson proposed Generalized Runge-Kutta Processes for stiff problems in 1967, in which the stiff linear operator is treated fully implicitly via matrix exponentiation. Any Runge-Kutta scheme induces valid Lawson integration, but a scheme is exceptionally simple to implement if the abscissa $c_i$ are ordered and equally spaced. Classical RK4 satisfies this requirement, but it is difficult to derive efficient higher order schemes with this constraint. Here I present an explicit sixth order method identified with Newton-Raphson iteration that provides simple Lawson integration."}
{"id": "2512.17417", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17417", "abs": "https://arxiv.org/abs/2512.17417", "authors": ["Wenjie Xiao", "Mathieu Besançon", "Patrick Gelß", "Deborah Hendrych", "Stefan Klus", "Sebastian Pokutta"], "title": "Graph Isomorphism: Mixed-Integer Convex Optimization from First-Order Methods", "comment": "Code available at https://github.com/WenjieXiao-2022/graph-isomorphism-benchmark", "summary": "The graph isomorphism (GI) problem, which asks whether two graphs are structurally identical, occupies a unique position in computational complexity -- it is neither known to be solvable in polynomial time, nor proven to be NP-complete. We propose a convex mixed-integer formulation of the problem and leverage first-order convex optimization to tackle it, following a stream of recent work on optimization-driven graph isomorphism detection. We strengthen our formulation with variable fixing techniques that prove highly effective while preserving the polyhedral structure. We perform extensive computations evaluating the performance of different families of methods including a mixed-integer convex formulation, mixed-integer linear optimization, local search and spectral heuristics over a collection of challenging GI instances. We find that a high level of symmetry is beneficial for optimization-based methods. On the other hand, presolving techniques that detect local substructures to fix variables are crucial for asymmetric instances. The proposed method outperforms the second best approach, the integer feasibility approach, on 6 of the 12 graphs families and is on par with it on symmetric families."}
{"id": "2512.17805", "categories": ["math.ST", "math.NA", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.17805", "abs": "https://arxiv.org/abs/2512.17805", "authors": ["Ben Adcock", "Gregor Maier", "Rahul Parhi"], "title": "Towards Sharp Minimax Risk Bounds for Operator Learning", "comment": null, "summary": "We develop a minimax theory for operator learning, where the goal is to estimate an unknown operator between separable Hilbert spaces from finitely many noisy input-output samples. For uniformly bounded Lipschitz operators, we prove information-theoretic lower bounds together with matching or near-matching upper bounds, covering both fixed and random designs under Hilbert-valued Gaussian noise and Gaussian white noise errors. The rates are controlled by the spectrum of the covariance operator of the measure that defines the error metric. Our setup is very general and allows for measures with unbounded support. A key implication is a curse of sample complexity which shows that the minimax risk for generic Lipschitz operators cannot decay at any algebraic rate in the sample size. We obtain essentially sharp characterizations when the covariance spectrum decays exponentially and provide general upper and lower bounds in slower-decay regimes."}
{"id": "2512.17135", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17135", "abs": "https://arxiv.org/abs/2512.17135", "authors": ["Hanwu Li"], "title": "Conditional Expectation Backward Stochastic Differential Equations and Related Backward Stochastic Differential Equations with Conditional Reflection", "comment": null, "summary": "In this paper, we introduce a new type of backward stochastic differential equations (BSDEs), called conditional expectation BSDEs, whose drivers depend not only on the value of the solutions but also on their conditional expectations with respect to a certain sub-σ-algebra. The collection of these sub-σ-algebra forms a subfiltration, which stands for partial information that is common for decision making applications. The classical BSDEs and the mean-field BSDEs can be regarded as two special and extreme cases of conditional expectation BSDEs. We establish the well-posedness for conditional expectation BSDEs under mild conditions and discuss the comparison results. Then, we provide an alternative construction for the solutions to conditional reflected BSDEs without the continuity assumption for the subfiltration, which can be seen as the limit of a sequence of penalized conditional expectation BSDEs."}
{"id": "2512.17120", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.17120", "abs": "https://arxiv.org/abs/2512.17120", "authors": ["Kingsley Yeon", "Mihai Anitescu"], "title": "Beyond Low Rank: Fast Low-Rank + Diagonal Decomposition with a Spectral Approach", "comment": null, "summary": "Low-rank plus diagonal (LRPD) decompositions provide a powerful structural model for large covariance matrices, simultaneously capturing global shared factors and localized corrections that arise in covariance estimation, factor analysis, and large-scale kernel learning. We introduce an alternating low-rank then diagonal (Alt) algorithm that provably reduces approximation error and significantly outperforms gradient descent while remaining cheaper than majorization-minimization methods~\\cite{sun2016majorization}. To scale to large matrices, we develop a randomized LRPD variant that combines fixed-rank Nystrom sketching~\\cite{tropp2017fixed} for the low-rank component with Diag++ stochastic diagonal estimation~\\cite{baston2022stochastic}. This hybrid algorithm achieves machine precision decomposition error using a number of matrix-vector products far smaller than the ambient dimension, and comes with rigorous non-asymptotic error bounds. On synthetic data, it exactly recovers LRPD structured matrices with high efficiency, and on real-world S&P 500 stock return covariances, where the spectrum decays slowly and strong sector structure exists, it achieves substantially lower error than pure low-rank approximations."}
{"id": "2512.17511", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17511", "abs": "https://arxiv.org/abs/2512.17511", "authors": ["Francois Dufour", "Tomas Prieto-Rumeau"], "title": "Absorbing Markov Decision Processes: Geometric Properties and Sufficiency of Finite Mixtures of Deterministic Policies", "comment": "arXiv admin note: substantial text overlap with arXiv:2510.04808", "summary": "In this paper we investigate several geometric properties of the set of occupancy measures. In particular, we analyse the structure of the faces generated by a given occupancy measure, together with their relative algebraic interior. We also determine the affine hulls of these faces and describe the associated parallel linear subspaces. It is shown that these structures can be fully characterised in terms of the parameters that define the underlying Markov decision process (MDP). Moreover, we establish that the class of finite mixtures of deterministic stationary policies constitutes a sufficient class of policies for uniformly absorbing MDPs with a measurable state space and multiple criteria. We also provide a characterisation of the minimal order required for a finite mixture of deterministic stationary policies to represent the performance vector of an arbitrary policy."}
{"id": "2512.17674", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.17674", "abs": "https://arxiv.org/abs/2512.17674", "authors": ["Dietmar Ferger"], "title": "On the supremum and its location of the standardized uniform empirical process", "comment": "6 pages", "summary": "We show that the maximizing point and the supremum of the standardized uniform empirical process converge in distribution. Here, the limit variable (Z, Y ) has independent components. Moreover, Z attains the values zero and one with equal probability one half and Y follows the Gumbel-distribution."}
{"id": "2512.17190", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17190", "abs": "https://arxiv.org/abs/2512.17190", "authors": ["Huixi Wang", "Minzhi Zhao"], "title": "Estimation of First Returning Speed in Null Recurrent Continuous-Time Markov Chains", "comment": "24 pages, 6 figures", "summary": "This paper establishes a novel connection between null-recurrent CTMCs and electric networks, offering a systematic classification of null-recurrent behavior based on the first returning speed. By leveraging techniques from electric network theory, we present a general method for estimating the first returning speed of null recurrent birth-death processes and provide some important examples."}
{"id": "2512.17182", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.17182", "abs": "https://arxiv.org/abs/2512.17182", "authors": ["Kelong Cheng", "Jingwei Sun", "Hong Zhang"], "title": "Long-time stability and convergence analysis of an IMEX BDF3 scheme for 2-D incompressible Navier-Stokes equation", "comment": null, "summary": "High-order time-stepping schemes are crucial for simulating incompressible fluid flows due to their ability to capture complex turbulent behavior and unsteady motion. In this work, we propose a third-order accurate numerical scheme for the two-dimensional incompressible Navier-Stokes equation. Spatial and temporal discretization is achieved using Fourier pseudo-spectral approximation and the BDF3 stencil, combined with the Adams-Bashforth extrapolation for the nonlinear convection term, resulting in a semi-implicit, fully discrete formulation. This approach requires solving only a single Poisson-like equation per time step while maintaining the desired temporal accuracy. Classical numerical experiments demonstrate the advantage of our scheme in terms of permissible time step sizes. Moreover, we establish uniform-in-time bounds for the vorticity in both $L^2$ and higher-order $H^m$ norms ($m \\geq 1$), provided the time step is sufficiently small. These bounds, in turn, facilitate the derivation of optimal convergence rates."}
{"id": "2512.17529", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17529", "abs": "https://arxiv.org/abs/2512.17529", "authors": ["Guanwei Cheng"], "title": "Stochastic Maximum Principle for Optimal Control of Anticipated Backward Stochastic Systems with Delays", "comment": null, "summary": "This paper investigates optimal control problems for delayed systems governed by Infinitely Anticipated Backward Stochastic Differential Equations (IABSDEs). Unlike existing frameworks limited to bounded delays, we introduce a generalized formulation utilizing $σ$-finite measures that accommodates both long-term memory effects and forward-looking anticipation.\n  Employing a new type of infinitely delayed stochastic differential equations as adjoint equations, we derive the necessary conditions of the maximum principle for optimal control. Under appropriate assumptions, the sufficiency of the maximum principle is also established. As illustrative examples, a climate policy model, a consumption optimization problem and a linear quadratic control problem are discussed, and all optimal controls are derived explicitly."}
{"id": "2512.17300", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17300", "abs": "https://arxiv.org/abs/2512.17300", "authors": ["Guangjun Shen", "Jiangpeng Wang", "Xuekang Zhang"], "title": "Euler-Maruyama method for distribution dependent stochastic differential equation driven by multiplicative fractional Brownian motion", "comment": null, "summary": "In this paper, we establish the propagation of chaos and Euler-Maruyama method of DDSDE driven by multiplicative fractional Brownian motion with Hurst parameter $H\\in (\\frac{\\sqrt{5}-1}{2},1)$. We have not only obtained an upper bound for the error of the Euler-Maruyama method but also verified the correctness of this result via systematic numerical simulation experiments."}
{"id": "2512.17377", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.17377", "abs": "https://arxiv.org/abs/2512.17377", "authors": ["Sara Avesani", "Leevan Ling", "Francesco Marchetti", "Tizian Wenzel"], "title": "Sobolev Algorithm for Local Smoothness Analysis (SALSA) via Sharp Direct and Inverse Statements", "comment": null, "summary": "We extend sharp direct and inverse approximation statements for kernel-based methods for finitely smooth kernels, i.e. those whose native spaces are norm-equivalent to Sobolev spaces. In particular, our inverse results are now formulated for a broad class of approximation schemes beyond interpolation, extending existing theory. Building on these results, we propose a novel Sobolev Algorithm for Local Smoothness Analysis (SALSA) for detecting local smoothness properties of target data, including their degree of smoothness and non-smoothness. The method is rigorously grounded based on the sharp direct and inverse statements. Numerical experiments in various settings highlight the effectiveness of the proposed algorithm."}
{"id": "2512.17551", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17551", "abs": "https://arxiv.org/abs/2512.17551", "authors": ["Jacob von Holly-Ponientzietz", "Alexander Hoen", "Mark Turner", "Ambros Gleixner"], "title": "Clique Probing for Mixed-Integer Programs", "comment": null, "summary": "Probing is an important presolving technique in mixed-integer programming solvers. It selects binary variables, tentatively fixes them to 0 and 1, and performs propagation to deduce additional variable fixings, bound tightenings, substitutions, and implications. In this work, we propose clique probing instead of probing on individual variables, we select cliques, a set of binary variables of which at most one can be set to one, and systematically probe on all variables of a clique. Experiments with our implementation in the open-source presolve library PaPILO demonstrate that exploiting clique information in this form significantly increases the number of reductions. When integrated into the MIP solver SCIP, we observe a 3% performance improvement on MIPLIB instances containing cliques."}
{"id": "2512.17418", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17418", "abs": "https://arxiv.org/abs/2512.17418", "authors": ["Grégoire Véchambre"], "title": "Large deviation principle for the absorption time of the Beta-coalescent via integral functionals", "comment": "24 pages", "summary": "We study some aspects of the absorption time of the Beta$(a,b)$-Coalescent starting with $n$ blocks. More precisely, when $a>1$, the absorption time is known to converge to infinity as $n$ goes to infinity, and we prove that it satisfies a large deviation principle. When $a \\in (0,1)$, it is known that the coalescent comes down from infinity, and we derive bounds for the convergence in the Kolmogorov distance of the distribution of the absorption time as $n$ goes to infinity. To prove our results we introduce a method, inspired from statistical mechanics, that allows to infer the asymptotic behavior of the Laplace transforms of some integral functionals of the Beta-coalescent as the initial number of blocks $n$ goes to infinity. As a by-product of our proofs we also obtain estimates for the record probabilities of the Beta-coalescent."}
{"id": "2512.17521", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.17521", "abs": "https://arxiv.org/abs/2512.17521", "authors": ["Nanna Berre", "Kent-Andre Mardal", "André Massing", "Ivan Yotov"], "title": "A cut finite element method for the Biot system of poroelasticity", "comment": null, "summary": "We propose a novel cut finite element method for the numerical solution of the Biot system of poroelasticity. The Biot system couples elastic deformation of a porous solid with viscous fluid flow and commonly arises on domains with complex geometries that make high-quality volumetric meshing challenging. To address this issue, we employ the cut finite element framework, where the domain boundary is represented independently of the background mesh, which significantly simplifies the meshing process. Our approach builds upon a parameter robust total pressure formulation of the Biot system, which we combine with the cut finite element method to develop a geometrically robust solution scheme, while preserving the parameter robustness. A key ingredient in the theoretical analysis is a modified inf-sup condition which also holds for mixed boundary conditions, leading to stability and optimal error estimates for the proposed formulation. Finally, we provide numerical evidence demonstrating the theoretical properties of the method and showcasing its capabilities by solving the Biot system on a realistic brain geometry."}
{"id": "2512.17572", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17572", "abs": "https://arxiv.org/abs/2512.17572", "authors": ["Zhongbin Guo", "Guangchen Wang"], "title": "A Separation Principle for Conditional Mean-Field Type Linear Quadratic Optimal Control Problem", "comment": null, "summary": "This paper investigates a conditional mean-field type linear quadratic (LQ) optimal control problem with partial observation and regime switching, where the conditional expectations of the state and control given the history of Markov chain enter into the dynamics and cost. The exact regime of Markov chain is accessible, whereas the system state can only be partially observed. A separation principle is established, showing that the estimate and control procedures can be separated and implemented independently. It extends the classical separation principle to conditional mean-field system. Utilizing two sets of Riccati equations and a set of first-order ordinary differential equations, we derive the feedback representation of the optimal control. To illustrate the effectiveness of the theoretical results, two applications with numerical simulations are provided, including a one-dimensional LQ example and a coupled electrical machines control problem."}
{"id": "2512.17438", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2512.17438", "abs": "https://arxiv.org/abs/2512.17438", "authors": ["Piotr Chlebicki", "Kristoffer Lindensjö"], "title": "Splitting infinity: a de Finetti game with state-dependent profit rates and singular control for diffusions", "comment": null, "summary": "We study a game of resource extraction of a common good under one-dimensional diffusive dynamics with player actions corresponding to singular stochastic control up to absorption at $0$, implying a trade-off between profitable resource extraction and sustainability. Unsurprisingly, immediate extraction of all available resources is an equilibrium. A main result is that we characterize and prove the existence of non-trivial equilibria that do not result in immediate absorption, but instead are attained with both players extracting resources according to a state-dependent rate of threshold type, corresponding to the presence of control only when the state process is in an interval $(b,\\infty)$. The underlying assumption is, roughly, that the drift coefficient of the uncontrolled state process grows sufficiently fast in relation to the discount rate, implying that the value for the corresponding one-player problem is infinite. We also study a generalization of the game that allows a state-dependent profit rate integrated against the control processes. In this game we again characterize and prove the existence of non-trivial equilibria of threshold type. In particular, a main novelty is that we find equilibria where the state process is controlled with its own local time such that we have reflection points with associated initial jumps, as well as other points in the state space where the control processes increase in a singular manner (skew points)."}
{"id": "2512.17523", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.17523", "abs": "https://arxiv.org/abs/2512.17523", "authors": ["A. V. Nesterova", "N. V. Denisova"], "title": "Comparison of two statistical image reconstruction algorithms for quantitative assessment of pathological lesions using gamma emission tomography", "comment": "20 pages, in Russian language, 6 figures, keywords: single-photon emission computed tomography, image reconstruction algorithms, OSEM, MAP-Ent, regularization, quantitative assessment", "summary": "This study compares two statistical approaches to image reconstruction in single-photon emission computed tomography (SPECT). We evaluated the widely used Ordered Subset Expectation Maximization (OSEM) algorithm and the newer Maximum a Posteriori approach with Entropy prior (MAP-Ent) approach in the context of quantifying radiopharmaceutical uptake in pathological lesions. Numerical experiments were performed using a digital twin of the standardized NEMA IEC phantom, which contains six spheres of varying diameters to simulate lesions. Quantitative accuracy was assessed using the maximum recovery coefficient (RCmax), defined as the ratio of the reconstructed maximum activity to the true value. The study shows that OSEM exhibits unstable convergence during iterations, leading to noise and edge artifacts in lesion images. Post-filtering stabilizes the reconstruction and ensures convergence, producing RCmax-size curves that could be used as correction factors in clinical evaluations. However, this approach significantly underestimates uptake in small lesions and may even lead to the complete loss of small lesions on reconstructed images. In contrast, MAP-Ent demonstrates fundamentally different behavior: it achieves stable convergence and preserves quantitative accuracy without post-filtering, while maintaining the contrast of even the smallest lesions. However, the iteration number at which accurate reconstruction is achieved depends strongly on the choice of a single global regularization parameter, which limits optimal performance across lesions of different sizes. These results demonstrate the need for locally adaptive regularization in MAP-Ent to improve quantitative accuracy in lesion reconstruction."}
{"id": "2512.17634", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17634", "abs": "https://arxiv.org/abs/2512.17634", "authors": ["Barsha Shawa", "Md Abu Talhamainuddin Ansary"], "title": "A Conjugate Gradient Method for Nonlinear Programming Problems using Caputo Fractional Gradients", "comment": "10 Figures, 3 Tables", "summary": "The article proposes a Caputo fractional conjugate gradient (CFCG) method for unconstrained optimization problems which is applicable to smooth as well as non-smooth problmes. The proposed method uses a non-adaptive version of the Caputo fractional derivative that provides integer-order derivatives information. A descent direction is obtained using the Caputo fractional gradients of two consecutive iterative points with a parameter ($β$). An inexact line search technique based on Armijo-Wolfe line conditions is used to find a suitable step length. Finally, a descent sequence is generated. The convergence results are derived under mild assumptions that ensuring of convergence is at least linear. Moreover, the convergence of the proposed method for quadratic functions is established through a Tikhonov-regularized formulation that can be interpreted as an extension of the least-squares approach. Finally, some numerical experiments, including neural network applications, are performed to justify that the proposed method achieves faster and more stable performance."}
{"id": "2512.17451", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.17451", "abs": "https://arxiv.org/abs/2512.17451", "authors": ["Noam Berger", "Anders Johansson", "Anders Öberg"], "title": "Equality of the critical inverse temperatures for the one- and two-sided Dyson models", "comment": "8 npages", "summary": "We prove that the critical inverse temperatures $β_c^{\\mathbb N}(α)$ and $β_c^{\\mathbb Z}(α)$ for the one- and two-sided Dyson models are the same when the power of the interaction strength $α$ satisfies $1<α<2$. We conjecture that this is true also in the remaining case of $α=2$."}
{"id": "2512.17666", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.17666", "abs": "https://arxiv.org/abs/2512.17666", "authors": ["Christoph Hollweck", "Andrea Gorgi", "Nicolo Antonelli", "Marcus Wagner", "Roland Wüchner"], "title": "Local h-, p-, and k-Refinement Strategies for the Isogeometric Shifted Boundary Method Using THB-Splines", "comment": null, "summary": "The concept of trimming, embedding, or immersing geometries into a computational background mesh has gained considerable attention in recent years, particularly in isogeometric analysis (IGA). In this approach, the physical domain is represented independently from the computational mesh, allowing the latter to be generated more easily compared with body-fitted meshes. While this facilitates the treatment of complex geometries, it also introduces challenges, such as ill-conditioning of the stiffness matrix caused by small cut elements and difficulties in accurately enforcing boundary conditions. A recently proposed technique to address these issues is the Shifted Boundary Method (SBM), which represents the computational domain solely through uncut elements and enforces boundary conditions via a Taylor expansion from a surrogate boundary to the true boundary. Previous studies have shown that, for Neumann boundary conditions, the flux evaluation requires additional derivatives in the Taylor expansion, effectively reducing the order of convergence by one. In this work, we investigate for the first time the performance of SBM combined with Truncated Hierarchical B-splines (THB-splines) under various local refinement strategies. In particular, we propose local p- and k-refinement schemes for THB-splines and compare them with local h-refinement and the unmodified SBM. Furthermore, we propose an enhanced shift operator that incorporates mixed partial derivatives, in contrast to the standard operator. The study assesses accuracy, stability, and computational efficiency for benchmark problems on trimmed domains. The results highlight how different refinement strategies affect convergence behavior in trimmed IGA formulations using SBM and demonstrate that targeted degree elevation can mitigate the Neumann boundary limitations of the standard method."}
{"id": "2512.17806", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17806", "abs": "https://arxiv.org/abs/2512.17806", "authors": ["D. Dennstädt", "J. Schaa", "T. Berger"], "title": "Funnel control with input filter for nonlinear systems of relative degree two", "comment": "6 pages, 2 figures, submitted to IFAC World Congress 2026", "summary": "We address the problem of output reference tracking for unknown nonlinear multi-input, multi-output systems with relative degree two and bounded-input bounded-state (BIBS) stable internal dynamics. We propose a novel model-free adaptive controller that ensures the evolution of the tracking error within prescribed performance funnel boundaries. By applying an output filter, the control objective is achieved without utilizing derivative information of system's output. The controller is illustrated by a numerical example."}
{"id": "2512.17485", "categories": ["math.PR", "stat.CO"], "pdf": "https://arxiv.org/pdf/2512.17485", "abs": "https://arxiv.org/abs/2512.17485", "authors": ["Penka Mayster", "Assen Tchorbadjieff"], "title": "Koenigs functions in the subcritical and critical Markov branching processes with Poisson probability reproduction of particles", "comment": null, "summary": "Special functions have always played a central role in physics and in mathematics, arising as solutions of nonlinear differential equations, as well as in the theory of branching processes, which extensively uses probability generating functions. The theory of iteration of real functions leads to limit theorems for the discrete-time and real-time Markov branching processes. The Poisson reproduction of particles in real time is analysed through the integration of the Kolmogorov equation. These results are further extended by employing graphical representations of Koenigs functions under subcritical and critical branching mechanisms. The limit conditional law in the subcritical case and the invariant measure for the critical case are discussed, as well. The obtained explicit solutions contain the exponential Bell polynomials and the modified exponential-integral function $\\rm{Ein} (z)$."}
{"id": "2512.17712", "categories": ["math.NA", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17712", "abs": "https://arxiv.org/abs/2512.17712", "authors": ["Niklas Sapountzoglou", "Aleksandra Zimmermann"], "title": "Study of a TPFA scheme for the stochastic Allen-Cahn equation with constraint though numerical experiments", "comment": "25 pages", "summary": "This contribution provides numerical experiments for a finite volume scheme for an approximation of the stochastic Allen-Cahn equation with homogeneous Neumann boundary conditions. The approximation is done by a Yosida approximation of the subdifferential operator. The problem is set on a polygonal bounded domain in two or three dimensions. The non-linear character of the projection term induces challenges to implement the scheme. To this end, we provide a splitting method for the finite volume scheme. We show that the splitting method is accurate. The computational error estimates induce that the squared $L^2$-error w.r.t. time is of order $1$ as long as the noise term is small enough. For larger noise terms the order of convergence w.r.t. time might become worse."}
{"id": "2512.17839", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.17839", "abs": "https://arxiv.org/abs/2512.17839", "authors": ["Sidhartha Patnaik", "Kumarasamy Sakthivel"], "title": "Time Optimal Control Problem for the Landau-Lifshitz-Bloch equation", "comment": null, "summary": "This paper investigates the time-optimal control problem for the Landau-Lifshitz-Bloch (LLB) equation, a macroscopic model that characterizes magnetization dynamics in ferromagnetic materials across a wide temperature range, including near and above the Curie temperature. We analyze the LLB system on bounded domains in one, two, and three dimensions, establishing the existence of optimal controls that drive the magnetization to a desired target state within a minimal time frame. Utilizing a Lagrange multiplier approach and an adjoint-based framework, we derive first-order necessary optimality conditions. Furthermore, we establish second-order sufficient conditions for local optimality, addressing the mathematical challenges posed by the system's inherent nonlinearities and the nonlinear appearance of the control in the effective magnetic field. These results provide a rigorous theoretical basis for the rapid manipulation of magnetic states, offering insights into the fundamental limits of control for nonlinear diffusion-relaxation processes in magnetism. Such findings are essential for advancing high-speed magnetic memory technologies and optimizing thermal magnetic switching in next-generation storage technologies."}
{"id": "2512.17524", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17524", "abs": "https://arxiv.org/abs/2512.17524", "authors": ["Louis Gass", "Giovanni Peccati"], "title": "Tightness of Stationary Nodal Measures", "comment": "15 pages, 15 figures", "summary": "We study the rescaled nodal volume field $ξ_R$ associated with a smooth, stationary Gaussian field on $[0,R]^d$, whose covariance satisfies adequate integrability conditions. Our main theorem shows that, as $R \\to \\infty$, the process $ξ_R$ converges in distribution, in an appropriate space of càdlàg mappings, to a standard Brownian sheet. The proof relies on a recent finite-dimensional CLT by Ancona, Gass, Letendre, and Stecconi (2025), as well as on a multidimensional Kolmogorov--Chentsov criterion for tightness due to Bickel and Wichura (1971). The application of the latter requires new moment estimates that are of independent interest. Our results stand in sharp contrast with Berry's random wave model, where the required integrability conditions fail and the question of tightness remains open."}
{"id": "2512.17714", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17714", "abs": "https://arxiv.org/abs/2512.17714", "authors": ["Charles-Edouard Bréhier", "Adrien Busnot Laurent", "Arnaud Debussche", "Gilles Vilmart"], "title": "Preconditioning for the high-order sampling of the invariant distribution of parabolic semilinear SPDEs", "comment": "29 pages", "summary": "For a class of ergodic parabolic semilinear stochastic partial differential equations (SPDEs) with gradient structure, we introduce a preconditioning technique and design high-order integrators for the approximation of the invariant distribution. The preconditioning yields improved temporal regularity of the dynamics while preserving the invariant distribution and allows the application of postprocessed integrators. For the semilinear heat equation driven by space-time white noise in dimension $1$, we obtain new temporal integrators with orders $1$ and $2$ for sampling the invariant distribution with a minor overcost compared to the standard semilinear implicit Euler method of order $1/2$. Numerical experiments confirm the theoretical findings and illustrate the efficiency of the approach."}
{"id": "2512.17870", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.17870", "abs": "https://arxiv.org/abs/2512.17870", "authors": ["Alexander Keimer", "Lukas Pflug", "Jakob Rodestock"], "title": "Optimal Control Problems with Nonlocal Conservation Laws: Existence of Optimizers and Singular Limits in Approximations of Local Conservation Laws", "comment": "[24 pages with 24 figures]", "summary": "This contribution considers optimal control problems subject to nonlocal conservation laws -- those in which the velocity depends nonlocally (i.e., via a convolution) on the solution -- and the so-called singular limit. First, the existence of minimizers is demonstrated for a broad class of optimal control problems, involving optimization over the initial datum, velocity, and nonlocal kernel for classical tracking-type $L^2$ cost functionals. Then, it is proven that the obtained minimizers converge to minimizers of the corresponding local optimal control problem when the kernel function of the convolution is of exponential type and approaches a Dirac distribution. Finally, some numerical results are presented."}
{"id": "2512.17533", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17533", "abs": "https://arxiv.org/abs/2512.17533", "authors": ["Christina Goldschmidt", "Liam Hill"], "title": "The stable trees revisited", "comment": "65 pages", "summary": "We introduce a new, relatively simple, line-breaking construction of the $α$-stable tree which realises its random finite-dimensional distributions. This is a direct analogue of Aldous' line-breaking construction of the Brownian continuum random tree, which is based on an inhomogeneous Poisson process. Here, we replace the deterministic rate function from the Brownian setting by a random rate process, given by a certain measure-changed $(α-1)$-stable subordinator. Rather than attaching uniformly, the line-segments now connect to locations chosen with probability proportional to the sizes of the jumps of the rate process.\n  We also give a new proof of an invariance principle originally due to Duquesne, which states that the family tree of a Bienaymé branching process with critical offspring distribution in the domain of attraction of an $α$-stable law (for $α\\in (1,2))$, conditioned to have $n$ vertices, converges on rescaling distances appropriately to the $α$-stable tree. Our proof makes use of a discrete line-breaking construction of the branching process tree, which we show converges to our continuous line-breaking construction."}
{"id": "2512.17728", "categories": ["math.NA", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17728", "abs": "https://arxiv.org/abs/2512.17728", "authors": ["Kavin Rajasekaran", "Niklas Sapountzoglou"], "title": "Convergence rates for a finite volume scheme of a stochastic non-linear parabolic equation", "comment": "35 pages", "summary": "In this contribution, we provide convergence rates for a finite volume scheme of a stochastic non-linear parabolic equation with multiplicative Lipschitz noise and homogeneous Neumann boundary conditions. More precisely, we give an error estimate for the $L^2$-norm of the space-time discretization by a semi-implicit Euler scheme with respect to time and a two-point flux approximation finite volume scheme with respect to space and the variational solution. The only regularity assumptions additionally needed is spatial regularity of the initial datum and smoothness of the diffusive term."}
{"id": "2512.17438", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2512.17438", "abs": "https://arxiv.org/abs/2512.17438", "authors": ["Piotr Chlebicki", "Kristoffer Lindensjö"], "title": "Splitting infinity: a de Finetti game with state-dependent profit rates and singular control for diffusions", "comment": null, "summary": "We study a game of resource extraction of a common good under one-dimensional diffusive dynamics with player actions corresponding to singular stochastic control up to absorption at $0$, implying a trade-off between profitable resource extraction and sustainability. Unsurprisingly, immediate extraction of all available resources is an equilibrium. A main result is that we characterize and prove the existence of non-trivial equilibria that do not result in immediate absorption, but instead are attained with both players extracting resources according to a state-dependent rate of threshold type, corresponding to the presence of control only when the state process is in an interval $(b,\\infty)$. The underlying assumption is, roughly, that the drift coefficient of the uncontrolled state process grows sufficiently fast in relation to the discount rate, implying that the value for the corresponding one-player problem is infinite. We also study a generalization of the game that allows a state-dependent profit rate integrated against the control processes. In this game we again characterize and prove the existence of non-trivial equilibria of threshold type. In particular, a main novelty is that we find equilibria where the state process is controlled with its own local time such that we have reflection points with associated initial jumps, as well as other points in the state space where the control processes increase in a singular manner (skew points)."}
{"id": "2512.17674", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.17674", "abs": "https://arxiv.org/abs/2512.17674", "authors": ["Dietmar Ferger"], "title": "On the supremum and its location of the standardized uniform empirical process", "comment": "6 pages", "summary": "We show that the maximizing point and the supremum of the standardized uniform empirical process converge in distribution. Here, the limit variable (Z, Y ) has independent components. Moreover, Z attains the values zero and one with equal probability one half and Y follows the Gumbel-distribution."}
{"id": "2512.17766", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17766", "abs": "https://arxiv.org/abs/2512.17766", "authors": ["Zhiwei Gao"], "title": "A Short Report on Importance Sampling for Rare Event Simulation in Diffusions", "comment": null, "summary": "In this manuscript, we investigate importance sampling methods for rare-event simulation in diffusion processes. We show, from a large-deviation perspective, that the resulting importance sampling estimator is log-efficient. This connection is established via a stochastic optimal control formulation, and the associated Hamilton--Jacobi--Bellman (HJB) equation is derived using dynamic programming. To approximate the optimal control, we adopt a spectral parameterization and employ the cross-entropy method to estimate the parameters by solving a least-squares problem. Finally, we present a numerical example to validate the effectiveness of the cross-entropy approach and the efficiency of the resulting importance sampling estimator."}
{"id": "2512.17727", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17727", "abs": "https://arxiv.org/abs/2512.17727", "authors": ["Zdzisław Brzeźniak", "Enrico Priola", "Jianliang Zhai", "Jiahui Zhu"], "title": "Stochastic transport equation with Lévy noise", "comment": "128 pages", "summary": "We study the stochastic transport equation with globally $β$-Hölder continuous and bounded vector field driven by a non-degenerate pure-jump Lévy noise of $α$-stable type. Whereas the deterministic transport equation may lack uniqueness, we prove the existence and pathwise uniqueness of a weak solution in the presence of a multiplicative pure jump noise, assuming $\\fracα{2}+β>1$. Notably, our results cover the entire range $α\\in (0,2)$, including the supercritical regime $α\\in(0,1)$ where the driving noise exhibits notoriously weak regularization. A key step of our strategy is the development of a \\emph{sharp} $C^{1+δ}$-diffeomorphism\n  and new regularity results for the Jacobian determinant of the stochastic flow associated to its stochastic characteristic equation. These novel probabilistic results are of independent interest and constitute a substantial component of our work. Our results are the first full generalization of the celebrated paper by Flandoli, Gubinelli, and Priola [Invent. Math. 2010] from the Brownian motion to the pure jump Lévy noise. To the best of our knowledge, this appears to be the first example of a partial differential equation of fluid dynamics where well-posedness is restored by the influence of a non-degenerate pure-jump noise."}
{"id": "2512.17855", "categories": ["math.NA", "cs.PF"], "pdf": "https://arxiv.org/pdf/2512.17855", "abs": "https://arxiv.org/abs/2512.17855", "authors": ["Mariana Bergonzi", "Joaquín Fernández", "Ernesto Kofman"], "title": "On General Linearly Implicit Quantized State System Methods", "comment": null, "summary": "This work proposes a methodology to develop new numerical integration algorithms for ordinary differential equations based on state quantization, generalizing the notions of Linearly Implicit Quantized State Systems (LIQSS) methods. Using this idea, two novel sub-families of algorithms are designed that improve the performance of current LIQSS methods while preserving their properties regarding stability, global error bound and efficient event handling capabilities. The features of the new algorithms are studied in two application examples where the advantages over classic numerical integration algorithms is also analyzed."}
{"id": "2512.17736", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.17736", "abs": "https://arxiv.org/abs/2512.17736", "authors": ["Davide Addona", "Davide Bignamini", "Carlo Orrieri", "Luca Scarpa"], "title": "Pathwise uniqueness by noise for singular stochastic PDEs", "comment": "47 pages", "summary": "Pathwise uniqueness for stochastic PDEs with drift in differential form is a main open problem in the recent literature on regularisation by noise. This paper establishes a self-contained theory in the framework of stochastic evolution equations on separable Hilbert spaces and provides a first result to address such an issue. The singularity of the drift allows to achieve novel uniqueness results for several classes of examples, ranging from fluid-dynamics to phase-separation models."}
{"id": "2512.17805", "categories": ["math.ST", "math.NA", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.17805", "abs": "https://arxiv.org/abs/2512.17805", "authors": ["Ben Adcock", "Gregor Maier", "Rahul Parhi"], "title": "Towards Sharp Minimax Risk Bounds for Operator Learning", "comment": null, "summary": "We develop a minimax theory for operator learning, where the goal is to estimate an unknown operator between separable Hilbert spaces from finitely many noisy input-output samples. For uniformly bounded Lipschitz operators, we prove information-theoretic lower bounds together with matching or near-matching upper bounds, covering both fixed and random designs under Hilbert-valued Gaussian noise and Gaussian white noise errors. The rates are controlled by the spectrum of the covariance operator of the measure that defines the error metric. Our setup is very general and allows for measures with unbounded support. A key implication is a curse of sample complexity which shows that the minimax risk for generic Lipschitz operators cannot decay at any algebraic rate in the sample size. We obtain essentially sharp characterizations when the covariance spectrum decays exponentially and provide general upper and lower bounds in slower-decay regimes."}
{"id": "2512.17747", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.17747", "abs": "https://arxiv.org/abs/2512.17747", "authors": ["Louigi Addario-Berry", "Benoît Corsini", "Neeladri Maitra", "Meltem Ünel"], "title": "On exponentially height-penalized random trees", "comment": "53 pages, 3 figures", "summary": "Given $n \\in \\mathbb{N}$ and $μ\\in \\mathbb{R}$, a $\\textit{$μ$-height-biased tree of size $n$}$ is a random plane tree $\\mathbf{\\mathbf{T}}_n$ with $n$ vertices with law given by $\\mathbb{P}(\\mathbf{T}=t) \\propto e^{-μh(t)}$, where $t$ ranges over fixed plane trees with $n$ vertices, and $h(t)$ is the height of $t$. Fix a sequence $(μ_n)_{n \\ge 1}$ of real numbers, and for $n \\ge 1$ let $\\mathbf{T}_n$ be a $μ$-height-biased tree of size $n$. Durhuus and Ünel (2023) described the asymptotic behaviour of $h(\\mathbf{T}_n)$ when $μ_n \\equiv μ\\in \\mathbb{R}$ is fixed. In this work, we extend their results to arbitrary sequences of positive parameters depending on $n$. Most notably, we show that such a tree behaves like a height-biased Continuum Random Tree (CRT) when $μ_n$ is of order $1/\\sqrt{n}$; that its height is asymptotically $(2π^2n/μ_n)^{1/3}$ when $μ_n$ is of larger order than $1/\\sqrt{n}$ and of smaller order than $n$; and that its height converges to a fixed constant when $μ_n$ is of order at least $n$, with some random jumps under specific conditions on $μ_n$. We additionally prove various results on second order behaviours, and large deviation principles for the height, for different regimes of $μ_n$. Finally, we describe new statistics of these trees, covering their widths, their root degrees, and the local structure around their roots."}
{"id": "2512.17794", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.17794", "abs": "https://arxiv.org/abs/2512.17794", "authors": ["Gautam Iyer", "Raghavendra Venkatraman"], "title": "Convergence of Empirical Measures for i.i.d. samples in $W^{-α, p}$", "comment": "21 pages, 0 figures", "summary": "Given $N$ i.i.d. samples from a probability measure $μ$ on $\\mathbf{R}^d$, we study the rate of convergence of the empirical measure $μ_N \\to μ$ in the negative Sobolev space $W^{-α, p}$. When $W^{-α, p}$ contains point measures (i.e. when $αp > (p-1)d$), we show $\\mathbf{E} \\| μ_N - μ\\|_{W^{-α, p}}^p \\leq C_d / N^{p/2}$ for an explicit dimensional constant $C_d$, and obtain a Gaussian tail bound. When $0 < αp \\leq d(p-1)$, we prove a similar result for Gaussian regularizations."}
{"id": "2512.17808", "categories": ["math.PR", "math.CA", "math.CV"], "pdf": "https://arxiv.org/pdf/2512.17808", "abs": "https://arxiv.org/abs/2512.17808", "authors": ["Antonia Höfert", "Jonas Jalowy", "Zakhar Kabluchko"], "title": "Zeros of polynomial powers under the heat flow", "comment": "35p, 3 Figures, comments always welcome!", "summary": "We study the evolution of zeros of high polynomial powers under the heat flow. For any fixed polynomial $P(z)$, we prove that the empirical zero distribution of its heat-evolved $n$-th power converges to a distribution on the complex plane as $n$ tends to infinity. We describe this limit distribution $μ_t$ as a function of the time parameter $t$ of the heat evolution: For small time, zeros start to spread out in approximately semicircular distributions, then intricate curves start to form and merge, until for large time, the zero distribution approaches a widespread semicircle law through the initial center of mass. The Stieltjes transform of the limit distribution $μ_t$ satisfies a self-consistent equation and a Burgers' equation. The present paper deals with general complex-rooted polynomials for which, in contrast to the real-rooted case, no free-probabilistic representation for $μ_t$ is available."}
{"id": "2512.17823", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.17823", "abs": "https://arxiv.org/abs/2512.17823", "authors": ["Shirshendu Ganguly", "Milind Hegde", "Lingfu Zhang"], "title": "van den Berg-Kesten--type correlation inequalities for disjoint polymers in the KPZ universality class", "comment": "38 pages, 5 figures", "summary": "In classical percolation theory, the van den Berg-Kesten (BK) inequality is a fundamental tool that shows that disjoint events induce negative conditionings on each other. The inequality also holds in the context of last passage percolation (LPP), which is the zero temperature limit of polymer models and an important subclass in the Kardar-Parisi-Zhang (KPZ) universality class. Recently, an analog of the BK inequality was discovered in the context of zero temperature line ensembles and the scaling limit of LPP, where it was used to study upper tail probabilities of the weight and the scaling limit of geodesics under such upper tail conditionings. However, while it has become apparent that such an inequality in the positive temperature setting would have a number of applications, it seems likely that a direct generalization of the zero temperature inequality would not hold. In this work we prove a version of the BK inequality for the KPZ line ensemble and the continuum directed random polymer. We do so by working with the log gamma polymer, making use of its integrability and the geometric RSK correspondence. Our inequality serves as a key input in analyzing the KPZ line ensemble and proving sharp upper tail estimates of the KPZ equation in arXiv:2208.08922, and proving convergence of the continuum directed random polymer to Brownian bridge under the upper tail event in arXiv:2311.12009. The crucial role of integrability in the validity of such an inequality is highlighted via a counter-example for a non-integrable model."}
{"id": "2512.17712", "categories": ["math.NA", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17712", "abs": "https://arxiv.org/abs/2512.17712", "authors": ["Niklas Sapountzoglou", "Aleksandra Zimmermann"], "title": "Study of a TPFA scheme for the stochastic Allen-Cahn equation with constraint though numerical experiments", "comment": "25 pages", "summary": "This contribution provides numerical experiments for a finite volume scheme for an approximation of the stochastic Allen-Cahn equation with homogeneous Neumann boundary conditions. The approximation is done by a Yosida approximation of the subdifferential operator. The problem is set on a polygonal bounded domain in two or three dimensions. The non-linear character of the projection term induces challenges to implement the scheme. To this end, we provide a splitting method for the finite volume scheme. We show that the splitting method is accurate. The computational error estimates induce that the squared $L^2$-error w.r.t. time is of order $1$ as long as the noise term is small enough. For larger noise terms the order of convergence w.r.t. time might become worse."}
{"id": "2512.17714", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17714", "abs": "https://arxiv.org/abs/2512.17714", "authors": ["Charles-Edouard Bréhier", "Adrien Busnot Laurent", "Arnaud Debussche", "Gilles Vilmart"], "title": "Preconditioning for the high-order sampling of the invariant distribution of parabolic semilinear SPDEs", "comment": "29 pages", "summary": "For a class of ergodic parabolic semilinear stochastic partial differential equations (SPDEs) with gradient structure, we introduce a preconditioning technique and design high-order integrators for the approximation of the invariant distribution. The preconditioning yields improved temporal regularity of the dynamics while preserving the invariant distribution and allows the application of postprocessed integrators. For the semilinear heat equation driven by space-time white noise in dimension $1$, we obtain new temporal integrators with orders $1$ and $2$ for sampling the invariant distribution with a minor overcost compared to the standard semilinear implicit Euler method of order $1/2$. Numerical experiments confirm the theoretical findings and illustrate the efficiency of the approach."}
{"id": "2512.17728", "categories": ["math.NA", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17728", "abs": "https://arxiv.org/abs/2512.17728", "authors": ["Kavin Rajasekaran", "Niklas Sapountzoglou"], "title": "Convergence rates for a finite volume scheme of a stochastic non-linear parabolic equation", "comment": "35 pages", "summary": "In this contribution, we provide convergence rates for a finite volume scheme of a stochastic non-linear parabolic equation with multiplicative Lipschitz noise and homogeneous Neumann boundary conditions. More precisely, we give an error estimate for the $L^2$-norm of the space-time discretization by a semi-implicit Euler scheme with respect to time and a two-point flux approximation finite volume scheme with respect to space and the variational solution. The only regularity assumptions additionally needed is spatial regularity of the initial datum and smoothness of the diffusive term."}
{"id": "2512.17766", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17766", "abs": "https://arxiv.org/abs/2512.17766", "authors": ["Zhiwei Gao"], "title": "A Short Report on Importance Sampling for Rare Event Simulation in Diffusions", "comment": null, "summary": "In this manuscript, we investigate importance sampling methods for rare-event simulation in diffusion processes. We show, from a large-deviation perspective, that the resulting importance sampling estimator is log-efficient. This connection is established via a stochastic optimal control formulation, and the associated Hamilton--Jacobi--Bellman (HJB) equation is derived using dynamic programming. To approximate the optimal control, we adopt a spectral parameterization and employ the cross-entropy method to estimate the parameters by solving a least-squares problem. Finally, we present a numerical example to validate the effectiveness of the cross-entropy approach and the efficiency of the resulting importance sampling estimator."}
