{"id": "2512.17922", "categories": ["math.OC", "nlin.AO", "physics.optics", "quant-ph"], "pdf": "https://arxiv.org/pdf/2512.17922", "abs": "https://arxiv.org/abs/2512.17922", "authors": ["Toshiya Sato", "Takashi Goh"], "title": "A proof-of-principle experiment on the spontaneous symmetry breaking machine and numerical estimation of its performance on the $K_{2000}$ benchmark problem", "comment": "10 pages, 14 figures", "summary": "In a previous paper, we proposed a unique physically implemented type simulator for combinatorial optimization problems, called the spontaneous symmetry breaking machine (SSBM). In this paper, we first report the results of experimental verification of SSBM using a small-scale benchmark system, and then describe numerical simulations using the benchmark problems (K2000) conducted to confirm its usefulness for large-scale problems. From 1000 samples with different initial fluctuations, it became clear that SSBM can explore a single extremely stable state. This is based on the principle of a phenomenon used in SSBM, and could be a notable advantage over other simulators."}
{"id": "2512.18330", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18330", "abs": "https://arxiv.org/abs/2512.18330", "authors": ["Tatiana Tatarenko", "Lucas Wey Hacker"], "title": "Learning Generalized Nash Equilibria in Non-Monotone Games with Quadratic Costs", "comment": null, "summary": "We study generalized Nash equilibrium (GNE) problems in games with quadratic costs and individual linear equality constraints. Departing from approaches that require strong monotonicity and/or shared constraints, we reformulate the KKT conditions of the (generally non-monotone) games into a tractable convex program whose objective satisfies the Polyak-Lojasiewicz (PL) condition. This PL geometry enables a distributed gradient method over a fixed communication graph with global geometric (linear) convergence to a GNE. When gradient information is unavailable or costly, we further develop a zero-order fully distributed scheme in which each player uses only local cost evaluations and their own constraint residuals. With an appropriate step size policy, the proposed zero-order method converges to a GNE, provided one exists, at rate O(1/t)."}
{"id": "2512.18348", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18348", "abs": "https://arxiv.org/abs/2512.18348", "authors": ["Hua Liu"], "title": "Modified Quasi-Newton Method for Nonconvex Multiobjective Optimization Problems with Barzilai-Borwein diagonal matrix", "comment": null, "summary": "This paper addresses the challenge of developing efficient algorithms for large-scale nonconvex multiobjective optimization problems (MOPs). While quasi-Newton methods are effective, their traditional application to MOPs is computationally expensive as they require maintaining and inverting separate Hessian approximations for each objective function. To overcome this limitation, we propose a novel Barzilai-Borwein diagonal-type Quasi-Newton method (BB-DQN). Our key innovation is the use of a single, shared, and modified BB-type matrix, updated iteratively using function and gradient information, to approximate the Hessians of all objectives simultaneously. We theoretically demonstrate that this approximation matrix remains positive definite throughout the iterative process. Furthermore, we establish the global convergence of the BB-DQN method without convexity assumptions and prove its R-linear convergence under mild conditions. Numerical experiments on a diverse set of test problems confirm that BB-DQN outperforms existing methods like M-BFGSMO, achieving superior performance in terms of computational time, iteration count, and reliability, especially for large-scale instances."}
{"id": "2512.17974", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17974", "abs": "https://arxiv.org/abs/2512.17974", "authors": ["Nicolas Chenavier", "Samuel Delepoulle", "Christophe Renaud", "Franck Vandewièle"], "title": "Voronoi integration of the rendering equation", "comment": null, "summary": "In photorealistic image rendering, Monte Carlo methods form the foundation for the integration of the rendering equation in modern approaches. However, despite their effectiveness, traditional Monte Carlo methods often face challenges in controlling variance, resulting in noisy visual artifacts in regions that are difficult to render. In this work, we propose a new approach to the integration of the rendering equation by introducing a Voronoi tessellation reweighting scheme combined with a Poisson point process sampling strategy to address some of the limitations of standard Monte Carlo methods. From a theoretical point of view, we show that the variance induced by a Poisson-Voronoi tessellation is smaller than that of the Monte Carlo method when the intensity of the underlying process is arbitrarily large and when the function to be integrated satisfies a Holder continuity condition."}
{"id": "2512.18381", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.18381", "abs": "https://arxiv.org/abs/2512.18381", "authors": ["George J. Bautista", "Roberto de A. Capistrano-Filho", "Boumediene Chentouf", "Oscar Sierra Fonseca", "Juan Límaco"], "title": "Studies on the Rao-Nakra Sandwich Beam: Well-Posedness, Dynamics, and Controllability", "comment": "33 pages. Comments are welcome", "summary": "In this work, we investigate the well-posedness, stabilization, and boundary controllability of a linear Rao-Nakra type sandwich beam. The system consists of three coupled equations that represent the longitudinal displacements of the outer layers and the transverse displacement of the composite beam, all of which are coupled with dynamical boundary conditions. In the first problem, time-dependent weights and delays are considered. Then, we establish the existence and uniqueness of solutions for the Cauchy problem associated with the damped system using semigroup theory and a classical result by Kato. Furthermore, employing a Lyapunov-based approach, we prove that the system's energy decays exponentially, despite the presence of time-varying weights and delays. In the second problem, we consider a boundary linear control system and prove its well-posedness. By deriving an observability inequality for the adjoint system and applying the Hilbert Uniqueness Method (HUM), we show that the system is null controllable. A key contribution of this work lies in handling the full three-equation coupled system, which involves significant difficulty due to the dynamic boundary conditions, resolved via appropriately constructed Lyapunov functionals and intermediate observability inequalities."}
{"id": "2512.18033", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18033", "abs": "https://arxiv.org/abs/2512.18033", "authors": ["Franziska Eickmann", "Johnny Guzmán", "Michael Neilan", "L. Ridgway Scott", "Tabea Tscherpel"], "title": "A local Fortin projection for the Scott-Vogelius elements on general meshes", "comment": "15 pages, 2 figures", "summary": "We construct a local Fortin projection for the Scott-Vogelius finite element pair for polynomial degree $k \\ge 4$ on general shape-regular triangulations in two dimensions. In particular, the triangulation may contain singular vertices. In addition to preserving the divergence in the dual of the pressure space, the projection preserves discrete boundary data and satisfies local stability estimates."}
{"id": "2512.18587", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.18587", "abs": "https://arxiv.org/abs/2512.18587", "authors": ["Marios Papamichalis", "Regina Ruane"], "title": "Graphon-Level Bayesian Predictive Synthesis for Random Network", "comment": "This paper may be reorganized during submission to match journal requirements", "summary": "Bayesian predictive synthesis provides a coherent Bayesian framework for combining multiple predictive distributions, or agents, into a single updated prediction, extending Bayesian model averaging to allow general pooling of full predictive densities. This paper develops a static, graphon level version of Bayesian predictive synthesis for random networks. At the graphon level we show that Bayesian predictive synthesis corresponds to the integrated squared error projection of the true graphon onto the linear span of the agent graphons. We derive nonasymptotic oracle inequalities and prove that least-squares graphon-BPS, based on a finite number of edge observations, achieves the minimax L^2 rate over this agent span. Moreover, we show that any estimator that selects a single agent graphon is uniformly inconsistent on a nontrivial subset of the convex hull of the agents, whereas graphon-level Bayesian predictive synthesis remains minimax-rate optimal-formalizing a combination beats components phenomenon. Structural properties of the underlying random graphs are controlled through explicit Lipschitz bounds that transfer graphon error into error for edge density, degree distributions, subgraph densities, clustering coefficients, and giant component phase transitions. Finally, we develop a heavy tail theory for Bayesian predictive synthesis, showing how mixtures and entropic tilts preserve regularly varying degree distributions and how exponential random graph model agents remain within their family under log linear tilting with Kullback-Leibler optimal moment calibration."}
{"id": "2512.18218", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18218", "abs": "https://arxiv.org/abs/2512.18218", "authors": ["Robert J. Elliott", "Zhe Yang"], "title": "Stochastic control for Backward Stochastic Differential Equations with semi-Markov chain noises", "comment": "11 pages", "summary": "In this paper, we extend the results of Elliott and Yang \\cite{elliott3} and discuss the control of a stochastic process for which the driving noise is provided by a martingale associated with a semi-Markov Chain. An existence and a comparison theorem are obtained. In our discrete time setting, adjoint processes are provided by backward stochastic difference equations. Technical results from partial differential equation theory to establish a verification theorem are not required."}
{"id": "2512.18458", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.18458", "abs": "https://arxiv.org/abs/2512.18458", "authors": ["Daniel Arnström", "Gianluca Garofalo"], "title": "Prioritized Constraints in Optimization-Based Control", "comment": null, "summary": "We provide theoretical foundations and computational tools for the systematic design of optimization-based control laws with constraints that have different priorities. By introducing the concept of prioritized intersections, we extend and unify previous work on the topic. Moreover, to enable the use of prioritized intersection in real-time applications, we propose an efficient solver for forming such intersections for polyhedral constraints. The solver in question is a tailored implementation of a dual active-set quadratic programming solver that leverages the particular problem structure of the optimization problems arising for prioritized intersections. The method is validated in a real-time MPC application for autonomous driving, where it successfully resolves six different levels of conflicting constraints, confirming its efficiency and practicality for control. Furthermore, we show that the proposed solver outperforms existing solvers for hierarchical quadratic programming, making it relevant beyond control applications."}
{"id": "2512.18059", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.18059", "abs": "https://arxiv.org/abs/2512.18059", "authors": ["Martin Eigel", "Charles Miranda", "Anthony Nouy", "David Sommer"], "title": "Approximation and learning with compositional tensor trains", "comment": "37 pages, 6 figures", "summary": "We introduce compositional tensor trains (CTTs) for the approximation of multivariate functions, a class of models obtained by composing low-rank functions in the tensor-train format. This format can encode standard approximation tools, such as (sparse) polynomials, deep neural networks (DNNs) with fixed width, or tensor networks with arbitrary permutation of the inputs, or more general affine coordinate transformations, with similar complexities. This format can be viewed as a DNN with width exponential in the input dimension and structured weights matrices. Compared to DNNs, this format enables controlled compression at the layer level using efficient tensor algebra. On the optimization side, we derive a layerwise algorithm inspired by natural gradient descent, allowing to exploit efficient low-rank tensor algebra. This relies on low-rank estimations of Gram matrices, and tensor structured random sketching. Viewing the format as a discrete dynamical system, we also derive an optimization algorithm inspired by numerical methods in optimal control. Numerical experiments on regression tasks demonstrate the expressivity of the new format and the relevance of the proposed optimization algorithms. Overall, CTTs combine the expressivity of compositional models with the algorithmic efficiency of tensor algebra, offering a scalable alternative to standard deep neural networks."}
{"id": "2512.18592", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.18592", "abs": "https://arxiv.org/abs/2512.18592", "authors": ["Marios Papamichalis", "Regina Ruane"], "title": "Wavelet Latent Position Exponential Random Graphs", "comment": "While under review, the material in this paper may be reorganized to meet journal requirements", "summary": "Many network datasets exhibit connectivity with variance by resolution and large-scale organization that coexists with localized departures. When vertices have observed ordering or embedding, such as geography in spatial and village networks, or anatomical coordinates in connectomes, learning where and at what resolution connectivity departs from a baseline is crucial. Standard models typically emphasize a single representation, i.e. stochastic block models prioritize coarse partitions, latent space models prioritize global geometry, small-world generators capture local clustering with random shortcuts, and graphon formulations are fully general and do not solely supply a canonical multiresolution parameterization for interpretation and regularization. We introduce wavelet latent position exponential random graphs (WL-ERGs), an exchangeable logistic-graphon framework in which the log-odds connectivity kernel is represented in compactly supported orthonormal wavelet coordinates and mapped to edge probabilities through a logistic link. Wavelet coefficients are indexed by resolution and location, which allows multiscale structure to become sparse and directly interpretable. Although edges remain independent given latent coordinates, any finite truncation yields a conditional exponential family whose sufficient statistics are multiscale wavelet interaction counts and conditional laws admit a maximum-entropy characterization. These characteristics enable likelihood-based regularization and testing directly in coefficient space. The theory is naturally scale-resolved and includes universality for broad classes of logistic graphons, near-minimax estimation under multiscale sparsity, scale-indexed recovery and detection thresholds, and a band-limited regime in which canonical coefficient-space tilts are non-degenerate and satisfy a finite-dimensional large deviation principle."}
{"id": "2512.18255", "categories": ["math.PR", "stat.CO", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.18255", "abs": "https://arxiv.org/abs/2512.18255", "authors": ["Miha Brešar", "Aleksandar Mijatović", "Gareth Roberts"], "title": "Central Limit Theorem for ergodic averages of Markov chains \\& the comparison of sampling algorithms for heavy-tailed distributions", "comment": "71 pages, 5 figures, short YouTube presentation describes our theory and its applications to unadjusted (ULA-type) algorithms with increments of finite and infinite variance (see \\href{https://youtu.be/m2y7U4cEqy4}{Part~I}); \\href{https://youtu.be/w8I_oOweuko}{Part~II} of the presentation discusses the application of our theory to unbiased MCMC algorithms", "summary": "Establishing central limit theorems (CLTs) for ergodic averages of Markov chains is a fundamental problem in probability and its applications. Since the seminal work~\\cite{MR834478}, a vast literature has emerged on the sufficient conditions for such CLTs. To counterbalance this, the present paper provides verifiable necessary conditions for CLTs of ergodic averages of Markov chains on general state spaces. Our theory is based on drift conditions, which also yield lower bounds on the rates of convergence to stationarity in various metrics.\n  The validity of the ergodic CLT is of particular importance for sampling algorithms, where it underpins the error analysis of estimators in Bayesian statistics and machine learning. Although heavy-tailed sampling is of central importance in applications, the characterisation of the CLT and the convergence rates are theoretically poorly understood for almost all practically-used Markov chain Monte Carlo (MCMC) algorithms. In this setting our results provide sharp conditions on the validity of the ergodic CLT and establish convergence rates for large families of MCMC sampling algorithms for heavy-tailed targets. Our study includes a rather complete analyses for random walk Metropolis samplers (with finite- and infinite-variance proposals), Metropolis-adjusted and unadjusted Langevin algorithms and the stereographic projection sampler (as well as the independence sampler). By providing these sharp results via our practical drift conditions, our theory offers significant insights into the problems of algorithm selection and comparison for sampling heavy-tailed distributions (see short YouTube presentations~\\cite{YouTube_talk} describing our \\href{https://youtu.be/m2y7U4cEqy4}{\\underline{theory}} and \\href{https://youtu.be/w8I_oOweuko}{\\underline{applications}})."}
{"id": "2512.18511", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18511", "abs": "https://arxiv.org/abs/2512.18511", "authors": ["Siyi Wang", "Zifan Wang", "Karl Henrik Johanssson"], "title": "Preference-based optimization from noisy pairwise comparisons", "comment": null, "summary": "In interactive systems, feedback is often provided in the form of preference between queried options rather than precise scores, which motivates optimization methods to learn from such comparisons. In this work, we propose a preference-based optimization algorithm that relies on noisy two-point comparisons. At each iteration, the algorithm employs a uniform-sphere perturbation to generate a perturbed action and queries the resulting loss comparison to estimate a descent direction. We demonstrate that, under standard smoothness and bounded variance assumptions, the algorithm converges to a stationary point when the smoothing and step size parameters are properly chosen. Numerical experiments on an LQG system demonstrate the effectiveness of the preference-based optimization algorithm with comparison feedback."}
{"id": "2512.18178", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18178", "abs": "https://arxiv.org/abs/2512.18178", "authors": ["Qijia Zhai"], "title": "A Domain Decomposition Deep Neural Network Method with Multi-Activation Functions for Solving Elliptic and Parabolic Interface Problems", "comment": null, "summary": "We present a domain decomposition-based deep learning method for solving elliptic and parabolic interface problems with discontinuous coefficients in two to ten dimensions. Our Multi-Activation Function (MAF) approach employs two independent neural networks, one for each subdomain, coupled through interface conditions in the loss function. The key innovation is a multi-activation mechanism within each subdomain network that adaptively blends multiple activation functions (e.g., $\\tanh$ and Gaussian-type) with interface-aware weighting, enhancing learning efficiency near interfaces where coupling constraints are most demanding. We prove conditional error bounds relating solution accuracy to trained loss values and quadrature errors. Numerical experiments on elliptic and parabolic interface problems with various interface geometries (2D--10D) validate the effectiveness and accuracy of the proposed method."}
{"id": "2512.18705", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.18705", "abs": "https://arxiv.org/abs/2512.18705", "authors": ["Sara van de Geer", "Sylvain Sardy", "Maximę van Cutsem"], "title": "A pivotal transform for the high-dimensional location-scale model", "comment": "36 pages", "summary": "We study the high-dimensional linear model with noise distribution known up to a scale parameter. With an $\\ell_1$-penalty on the regression coefficients, we show that a transformation of the log-likelihood allows for a choice of the tuning parameter not depending on the scale parameter. This transformation is a generalization of the square root Lasso for quadratic loss. The tuning parameter can asymptotically be taken at the detection edge. We establish an oracle inequality, variable selection and asymptotic efficiency of the estimator of the scale parameter and the intercept. The examples include Subbotin distributions and the Gumbel distribution."}
{"id": "2512.18297", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18297", "abs": "https://arxiv.org/abs/2512.18297", "authors": ["José M. Zapata"], "title": "Sharp large deviation estimates for Gaussian extrema", "comment": null, "summary": "We establish sharp large-deviation asymptotic estimates for the maximum order statistic of i.i.d.\\ standard normal random variables on all Borel subsets of the positive real line. This result yields more accurate tail approximations than the classical Gumbel limit."}
{"id": "2512.18548", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18548", "abs": "https://arxiv.org/abs/2512.18548", "authors": ["Zikang Yuan", "Guanjie Wang", "Qifeng Liao"], "title": "An adaptive adjoint-oriented neural network for solving parametric optimal control problems with singularities", "comment": null, "summary": "In this work, we present an adaptive adjoint-oriented neural network (adaptive AONN) for solving parametric optimal control problems governed by partial differential equations. The proposed method integrates deep adaptive sampling techniques with the adjoint-oriented neural network (AONN) framework. It alleviates the limitations of AONN in handling low-regularity solutions and enhances the generalizability of deep adaptive sampling for surrogate modeling without labeled data ($\\text{DAS}^2$). The effectiveness of the adaptive AONN is demonstrated through numerical examples involving singularities."}
{"id": "2512.18208", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18208", "abs": "https://arxiv.org/abs/2512.18208", "authors": ["Baoling Xie", "Jun Lai"], "title": "A Singularity Guided Nyström Method for Elastostatics on Two Dimensional Domains with Corners", "comment": null, "summary": "We develop a comprehensive analytical and numerical framework for boundary integral equations (BIEs) of the 2D Lamé system on cornered domains. By applying local Mellin analysis on a wedge, we obtain a factorizable characteristic equation for the singular exponents of the boundary densities, and clarify their dependence on boundary conditions. The Fredholm well-posedness of the BIEs on cornered domains is proved in weighted Sobolev spaces. We further construct an explicit density-to-Taylor mapping for the BIE and show its invertibility for all but a countable set of angles. Based on these analytical results, we propose a singularity guided Nyström (SGN) scheme for the numerical solution of BIEs on cornered domains. The SGN uses the computed corner exponents and a Legendre-tail indicator to drive panel refinement. An error analysis that combines this refinement strategy with an exponentially accurate far-field quadrature rule is provided. Numerical experiments across various cornered geometries demonstrate that SGN obtains higher order accuracy than uniform Nyström method and reveal a crowding-limited regime for domains with re-entrant angles."}
{"id": "2512.18898", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.18898", "abs": "https://arxiv.org/abs/2512.18898", "authors": ["Hongxiang Qiu"], "title": "Model-Agnostic Bounds for Augmented Inverse Probability Weighted Estimators' Wald-Confidence Interval Coverage in Randomized Controlled Trials", "comment": null, "summary": "Nonparametric estimators, such as the augmented inverse probability weighted (AIPW) estimator, have become increasingly popular in causal inference. Numerous nonparametric estimators have been proposed, but they are all asymptotically normal with the same asymptotic variance under similar conditions, leaving little guidance for practitioners to choose an estimator. In this paper, I focus on another important perspective of their asymptotic behaviors beyond asymptotic normality, the convergence of the Wald-confidence interval (CI) coverage to the nominal coverage. Such results have been established for simpler estimators (e.g., the Berry-Esseen Theorem), but are lacking for nonparametric estimators. I consider a simple but practical setting where the AIPW estimator based on a black-box nuisance estimator, with or without cross-fitting, is used to estimate the average treatment effect in randomized controlled trials. I derive non-asymptotic Berry-Esseen-type bounds on the difference between Wald-CI coverage and the nominal coverage. I also analyze the bias of variance estimators, showing that the cross-fit variance estimator might overestimate while the non-cross-fit variance estimator might underestimate, which might explain why cross-fitting has been empirically observed to improve Wald-CI coverage."}
{"id": "2512.18353", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18353", "abs": "https://arxiv.org/abs/2512.18353", "authors": ["Maher Boudabra"], "title": "A note on the planar Skorokhod embedding problem", "comment": "To appear in Bulletin of the Australian Mathematical Society, God willing", "summary": "The planar Skorokhod embedding problem was first proposed and solved by R. Gross in 2019 [#gross2019]. Gross worked with probability distributions having finite second moment. In [#boudabra2019remarks, #Boudabra2020], the solutions extended to all distributions with a finite $p^{th}$ moment for $p>1$. The case $p=1$ remained uncovered since then. In this note we show that the planar Skorokhod embedding problem is solvable for $p=1$ when the Hilbert transform of its quantile function is integrable, effectively closing this line of investigation."}
{"id": "2512.18713", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18713", "abs": "https://arxiv.org/abs/2512.18713", "authors": ["Adrien Fradin", "Abdurakhmon Sadiev", "Laurent Condat", "Peter Richtárik"], "title": "Tight Lower Bounds and Optimal Algorithms for Stochastic Nonconvex Optimization with Heavy-Tailed Noise", "comment": null, "summary": "We study stochastic nonconvex optimization under heavy-tailed noise. In this setting, the stochastic gradients only have bounded $p$--th central moment ($p$--BCM) for some $p \\in (1,2]$. Building on the foundational work of Arjevani et al. (2022) in stochastic optimization, we establish tight sample complexity lower bounds for all first-order methods under \\emph{relaxed} mean-squared smoothness ($q$-WAS) and $δ$-similarity ($(q, δ)$-S) assumptions, allowing any exponent $q \\in [1,2]$ instead of the standard $q = 2$. These results substantially broaden the scope of existing lower bounds. To complement them, we show that Normalized Stochastic Gradient Descent with Momentum Variance Reduction (NSGD-MVR), a known algorithm, matches these bounds in expectation. Beyond expectation guarantees, we introduce a new algorithm, Double-Clipped NSGD-MVR, which allows the derivation of high-probability convergence rates under weaker assumptions than previous works. Finally, for second-order methods with stochastic Hessians satisfying bounded $q$-th central moment assumptions for some exponent $q \\in [1, 2]$ (allowing $q \\neq p$), we establish sharper lower bounds than previous works while improving over Sadiev et al. (2025) (where only $p = q$ is considered) and yielding stronger convergence exponents. Together, these results provide a nearly complete complexity characterization of stochastic nonconvex optimization in heavy-tailed regimes."}
{"id": "2512.18272", "categories": ["math.NA", "cond-mat.soft"], "pdf": "https://arxiv.org/pdf/2512.18272", "abs": "https://arxiv.org/abs/2512.18272", "authors": ["Ranajay Datta", "Mária Lukáčová-Medviďová", "Andreas Schömer", "Peter Virnau"], "title": "Hybrid multiscale method for polymer melts: analysis and simulations", "comment": null, "summary": "We model the flow behaviour of dense melts of flexible and semiflexible ring polymers in the presence of walls using a hybrid multiscale approach. Specifically, we perform molecular dynamics simulations and apply the Irving-Kirkwood formula to determine an averaged stress tensor for a macroscopic model. For the latter, we choose a Cahn-Hilliard-Navier-Stokes system with dynamic and no-slip boundary conditions. We present numerical simulations of the macroscopic flow that are based on a finite element method. In particular, we present detailed proofs of the solvability and the energy stability of our numerical scheme. Phase segregation under flow between flexible and semiflexible rings, as observed in the microscopic simulations, can be replicated in the macroscopic model by introducing effective attractive forces."}
{"id": "2512.19023", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19023", "abs": "https://arxiv.org/abs/2512.19023", "authors": ["Haijun Li"], "title": "Operator Tail Densities of Multivariate Copulas", "comment": null, "summary": "Operator regular variation of a multivariate distribution can be decomposed into the operator tail dependence of the underlying copula and the regular variation of the univariate marginals. In this paper, we introduce operator tail densities for copulas and show that an operator-regularly-varying density can be characterized through the operator tail density of its copula together with the marginal regular variation. As an example, we demonstrate that although a Liouville copula is not available in closed form, it nevertheless admits an explicit operator tail-dependence function."}
{"id": "2512.18398", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.18398", "abs": "https://arxiv.org/abs/2512.18398", "authors": ["Carlo Marinelli"], "title": "A note on stochastic semilinear dissipative evolution equations", "comment": "14 pages", "summary": "Existence and uniqueness of mild solutions to a class of semilinear stochastic evolution equations with additive noise is proved. The linear part of the drift term is the generator of a compact semigroup of contractions, while the nonlinear part is only assumed to be the superposition operator associated to a decreasing function."}
{"id": "2512.18819", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18819", "abs": "https://arxiv.org/abs/2512.18819", "authors": ["Luc Cote", "Andy Sun"], "title": "Locational Marginal Emissions for Carbon-Aware Data Center Operations in Large-Scale Power Grids", "comment": null, "summary": "Carbon accounting methods for electricity consumption face challenges regarding physical deliverability, double counting, additionality, and impact magnitude. Locational Marginal Emissions (LMEs) show potential to address many of these key issues. However, their use in a large-scale power grids remains understudied. We analyze the properties of LMEs from a data center's perspective in a 1493-bus Western Interconnection over one year of hourly operation. We find that LME characteristics create three distinct regions: the hydropower-dominated Pacific Northwest, with low and stable LMEs; the coal-heavy Intermountain West, containing often high LMEs; and the Sunbelt, where mixed generation leads to variable LMEs correlated with solar output. This characterization provides analytical guidance for data center emission reduction. In particular, LME-guided emission reduction interventions through data center temporal-spatial load shifting, siting, and renewable procurement display over 85% accuracy with respect to actual emission reduction. Moreover, large-scale, nodal grid simulation is shown to be critical to accurate evaluation."}
{"id": "2512.18361", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18361", "abs": "https://arxiv.org/abs/2512.18361", "authors": ["Michael V. Klibanov", "Jingzhi Li", "Vladimir G. Romanov", "Zhipeng Yang"], "title": "Convexification Numerical Method for Imaging of Moving Targets", "comment": null, "summary": "The problem of imaging of a moving target is formulated as a Coefficient Inverse Problem for a hyperbolic equation with its coefficient depending on all three spatial variables and time. As the initial condition, the point source running along a straight line is used. Lateral Cauchy data are known for each position of the point source. A truncated Fourier series with respect to a special orthonormal basis is used. First, Lipschitz stability estimate is obtained. Next, a globally convergent numerical method, the so-called convexification method, is developed and its convergence analysis is carried out. The convexification method is based on a Carleman estimate. Results of numerical experiments are presented."}
{"id": "2512.19303", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.19303", "abs": "https://arxiv.org/abs/2512.19303", "authors": ["Abdelhanid Hassairi", "Gérard Letac"], "title": "Simple Cubic Variance Functions on $\\R^n$, Part one", "comment": "46 pages", "summary": "The classification of natural exponential families started with the paper \\cite {Morri} where Carl Morris unifies six very familiar families by the fact that their variance functions are polynomials of degree less or equal to two. Extension of this classification to $\\R^n$ and to degree three is the subject of this paper.\n  Keywords: Actions of the group $GL(n+1,\\R)$, classification of natural exponential families, multivariate Lagrange formula. variance functions."}
{"id": "2512.18435", "categories": ["math.PR", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.18435", "abs": "https://arxiv.org/abs/2512.18435", "authors": ["Damis El Alami", "Gábor Pete", "Ádám Timár"], "title": "Indistinguishability for recurrent clusters", "comment": "25 pages, 9 figures", "summary": "We introduce a general framework to show the indistinguishability of infinite clusters (ergodicity of the cluster subrelation) in group-invariant percolation processes with a weaker version of the finite energy property: the possibility of moving infinite branches from one infinite cluster to another. Crucially, this removes the necessity for the infinite clusters to be transient, present in most previous works. Our method also applies to more general random graphs, whenever a stationary sequence of vertices is definable.\n  We use this to show the indistinguishability of infinite clusters (or permutation cycles) in the interchange process (a.k.a.~random stirring process), the loop $O(n)$ model on amenable Cayley graphs, biased corner percolation on $\\mathbb{Z}^2$, and the Poisson Zoo process.\n  Finally, we show that infinite clusters in any invariant process on a Cayley graph are indistinguishable for any ``not essentially tail'' property, i.e., properties that depend only on the local structure of the cluster."}
{"id": "2512.18984", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.18984", "abs": "https://arxiv.org/abs/2512.18984", "authors": ["Amlan Sinha", "Ryne Beeson"], "title": "Bi-Level Optimal Control Framework For Missed-Thrust-Design With First-Order Bounds On Maximum Missed-Thrust-Duration", "comment": "This manuscript was submitted to Journal of Guidance, Control, and Dynamics. This manuscript builds on previous work which was presented as Paper AAS 25-697 at the AAS/AIAA Astrodynamics Specialist Conference, Boston, MA, August 10-14 2025", "summary": "In this paper, we present a bi-level optimal control framework for designing low-thrust spacecraft trajectories with robustness against missed-thrust-events. The upper-level (UL) problem generates a nominal trajectory assuming full control authority, while each lower-level (LL) problem computes the optimal recovery maneuver following a missed-thrust-event along the nominal solution. Under suitable regularity conditions ensuring uniqueness and smoothness of the LL response, the hierarchy admits a single-level reformulation by embedding the LL first-order optimality conditions within the UL constraints. We further establish a robustness certificate, which provides an upper bound on the maximum admissible missed-thrust-duration for which the structural assumptions remain valid for the LL problem. The bound depends explicitly on precomputable dynamical quantities along the nominal solution, enabling rapid evaluation over large ensembles without iterative solves. Numerical experiments show that while the certificate identifies when modeling assumptions are valid, it does not fully characterize recoverability after missed-thrust-events. A finite-horizon controllability-energy analysis is therefore used to interpret recovery beyond the theoretical bounds. Collectively, these results provide a deterministic, certifiable approach for incorporating robustness directly into trajectory design, replacing post-hoc margin allocation techniques with formal guarantees."}
{"id": "2512.18377", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18377", "abs": "https://arxiv.org/abs/2512.18377", "authors": ["Saint Cyr E. R. Koyaguerebo-Imé"], "title": "Sixth-order explicit one-step methods for stiff ODEs via hybrid deferred correction involving RK2 and RK4: Application to reaction-diffusion equations", "comment": null, "summary": "In this paper, the fourth-order explicit Runge-Kutta method (RK4) is used to make a Deferred Correction (DC) on the explicit midpoint rule, resulting in an explicit one-step method of order six of accuracy, denoted DC6RK2/4. Convergence and order of accuracy of DC6RK2/4 are proven through a deferred correction condition satisfied by the RK4. The region of absolute stability of this method contains that of a RK6 and is tangent to the region [-5.626,0[x[-4.730,4.730] of the complex plane, containing a significant part of the imaginary axis. Numerical experiments with standard test problems for stiff systems of ODEs show that DC6RK2/4 performs well on problems regarding strong non-linearity and long-term integration, and this method does not require extremely small time steps for accurate numerical solutions of stiff problems. Moreover, this method is better than standard implicit methods like the Backward Differentiation Formulae and the DC methods for the implicit midpoint rule on stiff problems for which Jacobian matrices along the solution curve have complex eigenvalues where imaginary parts have larger magnitudes than real parts. An application of DC6RK2/4 to a class of test problems for reaction-diffusion equations in one dimensional is also carried out."}
{"id": "2512.19338", "categories": ["math.ST", "stat.AP", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.19338", "abs": "https://arxiv.org/abs/2512.19338", "authors": ["Claudia Neves", "Chang Xu"], "title": "A hybrid-Hill estimator enabled by heavy-tailed block maxima", "comment": "31 pages, 5 figures", "summary": "When analysing extreme values, two alternative statistical approaches have historically been held in contention: the seminal block maxima method (or annual maxima method, spurred by hydrological applications) and the peaks-over-threshold. Clamoured amongst statisticians as wasteful of potentially informative data, the block maxima method gradually fell into disfavour whilst peaks-over-threshold-based methodologies were ushered to the centre stage of extreme value statistics. This paper proposes a hybrid method which reconciles these two hitherto disconnected approaches. Appealing in its simplicity, our main result introduces a new universal limiting characterisation of extremes that eschews the customary requirement of a sufficiently large block size for the plausible block maxima-fit to an extreme value distribution. We advocate that inference should be drawn solely on larger block maxima, from which practice the mainstream peaks-over-threshold methodology coalesces. The asymptotic properties of the promised hybrid-Hill estimator herald more than its efficiency, but rather that a fully-fledged unified semi-parametric stream of statistics for extreme values is viable. A finite sample simulation study demonstrates that a reduced-bias off-shoot of the hybrid-Hill estimator fares exceptionally well against the incumbent maximum likelihood estimation that relies on a numerical fit to the entire sample of block maxima."}
{"id": "2512.18494", "categories": ["math.PR", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.18494", "abs": "https://arxiv.org/abs/2512.18494", "authors": ["Yeor Hafouta"], "title": "Limit theorems for inhomogeneous random walks on $GL(d,\\mathbb R)$", "comment": "18 pp", "summary": "We prove Berry-Esseen theorems, almost sure invariance principle rates and large deviations for products of independent but not identically distributed invertible matrices with some average (logarithmic) projective contraction and uniform boundedness assumptions. We also characterize the divergence of the variance of the logarithm of the norm of the product. Our approach is based on verifying the conditions of \\cite{NewBE} after reversing time."}
{"id": "2512.18985", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.18985", "abs": "https://arxiv.org/abs/2512.18985", "authors": ["Jaewoo Kim", "Taehyun Sung", "Woonam Hwang", "Jaemyung Ahn"], "title": "On-Orbit Servicing-Integrated Maintenance Strategy for Satellite Constellation", "comment": "32 pages, 5 figures", "summary": "This paper proposes a maintenance strategy for a satellite constellation that utilizes on-orbit servicing (OOS). Under this strategy, the constellation operator addresses satellite failures in two ways: by deploying new satellites and by recovering failed satellites through OOS. We develop an inventory management model with a parametric replenishment policy for the maintenance process, which can evaluate the performance of the satellite constellation system. Based on this model, we formulate two single-objective optimization problems representing the decision-making contexts of two main stakeholders -- the constellation operator and the OOS provider -- and a bi-objective optimization problem that can reflect the tension between the two. A case study of the OOS-supported maintenance for a real-world-scale constellation provides valuable insights that help explain the behaviors of the stakeholders."}
{"id": "2512.18422", "categories": ["math.NA", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2512.18422", "abs": "https://arxiv.org/abs/2512.18422", "authors": ["Takeharu Matsuda", "Satoshi Ii"], "title": "A least-squares meshfree method for the incompressible Navier-Stokes equations: A satisfactory solenoidal velocity field via a staggered-variable arrangement", "comment": null, "summary": "Incompressible flow solvers based on strong-form meshfree methods represent arbitrary geometries without the need for a global mesh system. However, their local evaluations make it difficult to satisfy incompressibility at the discrete level. Moreover, the collocated arrangement of velocity and pressure variables tends to induce a zero-energy mode, leading to decoupling between the two variables. In projection-based approaches, a spatial discretization scheme based on a conventional node-based moving least-squares method for the pressure causes inconsistency between the discrete operators on both sides of the Poisson equation. Thus, a solenoidal velocity field cannot be ensured numerically. In this study, a numerical method for the incompressible Navier-Stokes equations is developed by introducing a local primal-dual grid into the mesh-constrained discrete point method, enabling consistent discrete operators. The \\textit{virtual} dual cell constructed is based on the local connectivity among nodes, and therefore our method remains truly meshfree. To achieve a consistent coupling between velocity and pressure variables under the primal-dual arrangement, time evolution converting is applied to evolve the velocity on cell interfaces. For numerical validation, a linear acoustic equation is solved to confirm the effectiveness of the staggered-variable arrangement based on the local primal-dual grid. Then, incompressible Navier-Stokes equations are solved, and the proposed method is demonstrated to satisfy the condition of a solenoidal velocity field at the discrete level, achieve the expected spatial convergence order, and accurately reproduce flow features over a wide range of Reynolds numbers."}
{"id": "2512.18838", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.18838", "abs": "https://arxiv.org/abs/2512.18838", "authors": ["Ruslan Mirmominov", "Johannes Wiesel"], "title": "Convergence of the adapted empirical measure for mixing observations", "comment": null, "summary": "The adapted Wasserstein distance $\\mathcal{AW}$ is a modification of the classical Wasserstein metric, that provides robust and dynamically consistent comparisons of laws of stochastic processes, and has proved particularly useful in the analysis of stochastic control problems, model uncertainty, and mathematical finance. In applications, the law of a stochastic process $μ$ is not directly observed, and has to be inferred from a finite number of samples. As the empirical measure is not $\\mathcal{AW}$-consistent, Backhoff, Bartl, Beiglböck and Wiesel introduced the adapted empirical measure $\\widehatμ^N$, a suitable modification, and proved its $\\mathcal{AW}$-consistency when observations are i.i.d.\n  In this paper we study $\\mathcal{AW}$-convergence of the adapted empirical measure $\\widehatμ^N$ to the population distribution $μ$, for observations satisfying a generalization of the $η$-mixing condition introduced by Kontorovich and Ramanan. We establish moment bounds and sub-exponential concentration inequalities for $\\mathcal{AW}(μ,\\widehatμ^N)$, and prove consistency of $\\widehatμ^N$. In addition, we extend the Bounded Differences inequality of Kontorovich and Ramanan for $η$-mixing observations to uncountable spaces, a result that may be of independent interest. Numerical simulations illustrating our theory are also provided."}
{"id": "2512.18497", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.18497", "abs": "https://arxiv.org/abs/2512.18497", "authors": ["Cédric Bernardin", "Ana Djurdjevac", "Patricia Gonçalves", "Leander Schnee"], "title": "Derivation of stochastic Burgers on the line with a Dirichlet boundary condition at the origin", "comment": null, "summary": "We analyze the \\emph{equilibrium fluctuations} of a Hamiltonian chain of oscillators on \\(\\mathbb{Z}\\) with an exponential potential, perturbed by a conservative, symmetric noise. Under the canonical \\emph{diffusive scaling} \\(t \\mapsto t n^2\\) and an interaction strength tuned by \\(n^{-1/2}\\), the fluctuation field is known to converge to the \\emph{energy solution} of the stochastic Burgers equation (SBE) on the torus~\\cite{ABGS22}. We introduce a \\emph{coupled moving heat bath} of strength \\(n^{-δ}\\) acting on the particle system. We prove that for \\(δ\\leq 1\\) (the \\emph{strong-coupling regime}), the equilibrium fluctuation field converges to the \\emph{energy solution of the SBE with a Dirichlet boundary condition at zero}. We provide two distinct analytical characterizations of these boundary solutions, corresponding to different spaces of test functions. Conversely, for \\(δ> 1\\) (the \\emph{weak-coupling regime}), the heat bath becomes irrelevant in the scaling limit: the fluctuations converge to the standard SBE on the full line without any boundary condition, reproducing the full-line result of~\\cite{GJ14}. Our analysis thus reveals a sharp \\emph{critical scaling} in the coupling strength \\(δ\\), which dictates the emergence -- or absence -- of a macroscopic boundary condition from the microscopic perturbation."}
{"id": "2512.19104", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.19104", "abs": "https://arxiv.org/abs/2512.19104", "authors": ["Haishan Ye"], "title": "Explicit and Non-asymptotic Query Complexities of Rank-Based Zeroth-order Algorithm on Stochastic Smooth Functions", "comment": null, "summary": "Zeroth-order (ZO) optimization with ordinal feedback has emerged as a fundamental problem in modern machine learning systems, particularly in human-in-the-loop settings such as reinforcement learning from human feedback, preference learning, and evolutionary strategies. While rank-based ZO algorithms enjoy strong empirical success and robustness properties, their theoretical understanding, especially under stochastic objectives and standard smoothness assumptions, remains limited. In this paper, we study rank-based zeroth-order optimization for stochastic functions where only ordinal feedback of the stochastic function is available. We propose a simple and computationally efficient rank-based ZO algorithm. Under standard assumptions including smoothness, strong convexity, and bounded second moments of stochastic gradients, we establish explicit non-asymptotic query complexity bounds for both convex and nonconvex objectives. Notably, our results match the best-known query complexities of value-based ZO algorithms, demonstrating that ordinal information alone is sufficient for optimal query efficiency in stochastic settings. Our analysis departs from existing drift-based and information-geometric techniques, offering new tools for the study of rank-based optimization under noise. These findings narrow the gap between theory and practice and provide a principled foundation for optimization driven by human preferences."}
{"id": "2512.18586", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18586", "abs": "https://arxiv.org/abs/2512.18586", "authors": ["Xiaodong Feng", "Tao Tang", "Xiaoliang Wan", "Tao Zhou"], "title": "Overcoming Spectral Bias via Cross-Attention", "comment": "25 pages, 21 figures", "summary": "Spectral bias implies an imbalance in training dynamics, whereby high-frequency components may converge substantially more slowly than low-frequency ones. To alleviate this issue, we propose a cross-attention-based architecture that adaptively reweights a scaled multiscale random Fourier feature bank with learnable scaling factors. The learnable scaling adjusts the amplitudes of the multiscale random Fourier features, while the cross-attention residual structure provides an input-dependent mechanism to emphasize the most informative scales. As a result, the proposed design accelerates high-frequency convergence relative to comparable baselines built on the same multiscale bank. Moreover, the attention module supports incremental spectral enrichment: dominant Fourier modes extracted from intermediate approximations via discrete Fourier analysis can be appended to the feature bank and used in subsequent training, without modifying the backbone architecture.\n  We further extend this framework to PDE learning by introducing a linear combination of two sub-networks: one specialized in capturing high-frequency components of the PDE solution and the other in capturing low-frequency components, with a learnable (or optimally chosen) mixing factor to balance the two contributions and improve training efficiency in oscillatory regimes. Numerical experiments on high-frequency and discontinuous regression problems, image reconstruction tasks, as well as representative PDE examples, demonstrate the effectiveness and robustness of the proposed method."}
{"id": "2512.19063", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.19063", "abs": "https://arxiv.org/abs/2512.19063", "authors": ["Victor H. de la Pena", "Heyuan Yao", "Demissie Alemayehu"], "title": "Sharp Decoupling Inequalities for the Variances and Second Moments of Sums of Dependent Random Variables", "comment": null, "summary": "Both complete decoupling and tangent decoupling are classical tools aiming to compare two random processes where one has a weaker dependence structure. We give a new proof for the complete decoupling inequality, which provides a lower bound for the sum of dependent square-integrable nonnegative random variables $\\sum\\limits^n_{i=1} d_i$ \\[ \\frac{1}{2} \\mathbb E \\left( \\sum\\limits^n_{i=1} z_i \\right)^2 \\leq \\mathbb E \\left( \\sum\\limits^n_{i=1} d_i \\right)^2, \\] where $z_i \\stackrel{\\mathcal{L}}{=} d_i$ for all $i\\leq n$ and $z_i$'s are mutually independent. We will then provide the following sharp tangent decoupling inequalities \\[\\mathbb Var \\left( \\sum\\limits^n_{i=1} d_i\\right) \\leq 2 \\mathbb Var \\left( \\sum\\limits^n_{i=1} e_i\\right),\\] and \\[\\mathbb E \\left( \\sum\\limits^n_{i=1} d_i\\right)^2 \\leq 2 \\mathbb E \\left( \\sum\\limits^n_{i=1} e_i\\right)^2 - \\left[ \\mathbb E \\left( \\sum\\limits^n_{i=1} e_i\\right) \\right]^2,\\] where $\\{e_i\\}$ is the decoupled sequences of $\\{d_i\\}$ and $d_i$'s are not forced to be nonnegative. Applications to construct Chebyshev-type inequality and Paley-Zygmund-type inequality, and to bound the second moments of randomly stopped sums will be provided."}
{"id": "2512.18588", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18588", "abs": "https://arxiv.org/abs/2512.18588", "authors": ["Ramon van Handel"], "title": "On the subgaussian comparison theorem", "comment": "8 pages", "summary": "The aim of this expository note is to prove that any $1$-subgaussian random vector is dominated in the convex ordering by a universal constant times a standard Gaussian vector. This strengthens Talagrand's celebrated subgaussian comparison theorem. The proof combines a tensorization argument due to J. Liu with ideas that date back to the work of Fernique."}
{"id": "2512.19141", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.19141", "abs": "https://arxiv.org/abs/2512.19141", "authors": ["Didier Henrion"], "title": "Solving Stengle's Example in Rational Arithmetic: Exact Values of the Moment-SOS Relaxations", "comment": null, "summary": "We revisit Stengle's classical univariate polynomial optimization example $min 1 - x^2 s.t. (1 - x^2)^3 \\geq 0$ whose constraint description is degenerate at the minimizers. We prove that the moment-SOS hierarchy of relaxation order $r \\geq 3$ has the exact value $-1/r(r - 2)$. For this we construct in rational arithmetic a dual polynomial sum-of-squares (SOS) certificate and a primal moment sequence representing a finitely atomic measure. The key ingredients are elementary trigonometric properties of Chebyshev and Gegenbauer polynomial, and a Christoffel-Darboux kernel argument."}
{"id": "2512.18848", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18848", "abs": "https://arxiv.org/abs/2512.18848", "authors": ["Nurgül Gökgöz"], "title": "Generalized Chebyshev acceleration on the unit disc", "comment": "16 pages, 8 figures", "summary": "Generalized Chebyshev acceleration is a semi-iterative technique applicable to a basic iterative method only when the eigenvalues of the iteration matrix satisfy a highly restrictive inclusion condition. In this work, we relax this requirement by introducing an alternative iterative scheme that converges to the same solution. The effectiveness of the proposed approach is examined through its application to a large-scale sparse normal matrix."}
{"id": "2512.18598", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18598", "abs": "https://arxiv.org/abs/2512.18598", "authors": ["Jianfeng Lu", "Yuliang Wang"], "title": "Long-time reverse transportation inequalities for non-globally-dissipative Langevin dynamics", "comment": null, "summary": "We establish a dimension-free, uniform-in-time reverse transportation inequality for Langevin dynamics with non-convex potentials. This inequality controls the Rényi divergence of arbitrary order between the process distributions starting from distinct initial points and serves as the dual version of the Harnack inequality. Notably, we prove that this inequality retains exponential decay in the long-time regime, thereby extending existing results for log-concave sampling to the non-convex setting."}
{"id": "2512.19157", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.19157", "abs": "https://arxiv.org/abs/2512.19157", "authors": ["Riccardo Bonalli", "Benoît Bonnet-Weill", "Laurent Pfeiffer"], "title": "A Characterization of Law-Invariant and Coherent Risk Measures through Optimal Transport", "comment": null, "summary": "In this article, we propose a novel characterization of law-invariant and coherent risk measures, based on a generalized optimal transport problem in which the second marginal of the admissible plans is not fixed, but required to lie within a target set of probability measures. One of the main contributions of this work is a general representation formula for such risk measures, which is closely related to Kusuoka's theorem. When the aforementioned target set is convex, our representation result allows for the systematic derivation of general duality formulas. To illustrate our findings, we explicitly compute the target sets associated with several classical law-invariant coherent risk measures, including the prototypical conditional value at risk and higher moment measures."}
{"id": "2512.18905", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18905", "abs": "https://arxiv.org/abs/2512.18905", "authors": ["Chunmei Wang", "Shangyou Zhang"], "title": "Weak Galerkin finite element methods for elliptic interface problems on nonconvex polygonal partitions", "comment": "21 pages, 15 tables, 8 figures", "summary": "This paper proposes a weak Galerkin (WG) finite element method for elliptic interface problems defined on nonconvex polygonal partitions. The method features a built-in stabilizer and retains a simple, symmetric, and positive definite formulation. An optimal-order error estimate is rigorously derived in the discrete $H^1$ norm. Furthermore, a series of numerical experiments are provided to verify the theoretical results and to demonstrate the robustness and effectiveness of the proposed WG method for elliptic interface problems."}
{"id": "2512.18838", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.18838", "abs": "https://arxiv.org/abs/2512.18838", "authors": ["Ruslan Mirmominov", "Johannes Wiesel"], "title": "Convergence of the adapted empirical measure for mixing observations", "comment": null, "summary": "The adapted Wasserstein distance $\\mathcal{AW}$ is a modification of the classical Wasserstein metric, that provides robust and dynamically consistent comparisons of laws of stochastic processes, and has proved particularly useful in the analysis of stochastic control problems, model uncertainty, and mathematical finance. In applications, the law of a stochastic process $μ$ is not directly observed, and has to be inferred from a finite number of samples. As the empirical measure is not $\\mathcal{AW}$-consistent, Backhoff, Bartl, Beiglböck and Wiesel introduced the adapted empirical measure $\\widehatμ^N$, a suitable modification, and proved its $\\mathcal{AW}$-consistency when observations are i.i.d.\n  In this paper we study $\\mathcal{AW}$-convergence of the adapted empirical measure $\\widehatμ^N$ to the population distribution $μ$, for observations satisfying a generalization of the $η$-mixing condition introduced by Kontorovich and Ramanan. We establish moment bounds and sub-exponential concentration inequalities for $\\mathcal{AW}(μ,\\widehatμ^N)$, and prove consistency of $\\widehatμ^N$. In addition, we extend the Bounded Differences inequality of Kontorovich and Ramanan for $η$-mixing observations to uncountable spaces, a result that may be of independent interest. Numerical simulations illustrating our theory are also provided."}
{"id": "2512.19172", "categories": ["math.OC", "cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.19172", "abs": "https://arxiv.org/abs/2512.19172", "authors": ["Filippo Fabiani", "Barbara Franci"], "title": "Finite-sample guarantees for data-driven forward-backward operator methods", "comment": null, "summary": "We establish finite sample certificates on the quality of solutions produced by data-based forward-backward (FB) operator splitting schemes. As frequently happens in stochastic regimes, we consider the problem of finding a zero of the sum of two operators, where one is either unavailable in closed form or computationally expensive to evaluate, and shall therefore be approximated using a finite number of noisy oracle samples. Under the lens of algorithmic stability, we then derive probabilistic bounds on the distance between a true zero and the FB output without making specific assumptions about the underlying data distribution. We show that under weaker conditions ensuring the convergence of FB schemes, stability bounds grow proportionally to the number of iterations. Conversely, stronger assumptions yield stability guarantees that are independent of the iteration count. We then specialize our results to a popular FB stochastic Nash equilibrium seeking algorithm and validate our theoretical bounds on a control problem for smart grids, where the energy price uncertainty is approximated by means of historical data."}
{"id": "2512.18939", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18939", "abs": "https://arxiv.org/abs/2512.18939", "authors": ["Haixia Dong", "Ziqing Xie", "Jiwei Zhang"], "title": "An asymptotically compatible unfitted finite element methods for nonlocal elliptic Interfaces: local limits and sharp error estimates", "comment": "23 pages, 4 figures", "summary": "This paper presents the development and analysis of an asymptotically compatible (AC) unfitted finite element method for one-dimensional nonlocal elliptic interface problems. The proposed method achieves optimal error estimates through three principal contributions: (i) an extended maximum principle, coupled with an asymptotic consistency analysis of the flux operator, which establishes second-order convergence of nonlocal solutions to their local counterparts in the maximum norm; (ii) a Nitsche-type formulation that directly incorporates nonlocal jump conditions into the weak form, enabling high accuracy without body-fitted meshes; and (iii) a rigorous proof of optimal convergence rates in both the energy and L2 norms via the nonlocal maximum principle, flux consistency, and a newly derived nonlocal Poincare inequality. Numerical experiments confirm the theoretical findings and demonstrate the robustness and efficiency of the proposed approach, thereby providing a foundation for extensions to higher dimensions."}
{"id": "2512.18867", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18867", "abs": "https://arxiv.org/abs/2512.18867", "authors": ["Garrett Mulcahy", "Soumik Pal"], "title": "Diffusion Approximations to Schrödinger Bridges on Manifolds", "comment": "43 pages", "summary": "We present a collection of explicit diffusion approximations to small temperature Schrödinger bridges on manifolds. Our most precise results are when both marginals are the same and the Schrödinger bridge is on a manifold with a reference process given by a reversible diffusion. In the special case that the reference process is the manifold Brownian motion, we use the small time heat kernel asymptotics to show that the gradient of the corresponding Schrödinger potential converges in $L^2$, as the temperature vanishes, to a manifold analogue of the score function of the marginal. As an application of the previous result we show that the Euclidean Schrödinger bridge, computed for the quadratic cost, between two different marginal distributions can be approximated by a transformation of a two point distribution of a stationary Mirror Langevin diffusion."}
{"id": "2512.19201", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19201", "abs": "https://arxiv.org/abs/2512.19201", "authors": ["Sebastian Zimper", "Ana Djurdjevac", "Carsten Hartmann", "Christof Schütte", "Nataša Djurdjevac Conrad"], "title": "Mean-field optimal control with stochastic leaders", "comment": null, "summary": "We consider interacting agent systems with a large number of stochastic agents (or particles) influenced by a fixed number of external stochastic lead agents. Such examples arise, for example in models of opinion dynamics, where a small number of leaders (influencers) can steer the behaviour of a large population of followers. In this context, we study a partial mean-field limit where the number of followers tends to infinity, while the number of leaders stays constant. The partial mean-field limit dynamics is then given by a McKean-Vlasov stochastic differential equation (SDE) for the followers, coupled to a controlled Itô-SDE governing the dynamics of the lead agents. For a given cost functional that the lead agents seek to minimise, we show that the unique optimal control of the finite agent system convergences to the optimal control of the limiting system. This establishes that the low-dimensional control of the partial (mean-field) system provides an effective approximation for controlling the high-dimensional finite agent system. In addition, we propose a stochastic gradient descent algorithm that can efficiently approximate the mean-field control. Our theoretical results are illustrated on opinion dynamics model with lead agents, where the control objective is to drive the followers to reach consensus in finite time."}
{"id": "2512.18949", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18949", "abs": "https://arxiv.org/abs/2512.18949", "authors": ["Michael Neilan", "Hongzhi Wan"], "title": "A TraceFEM $C^0$ Interior Penalty Method for the Surface Biharmonic Equation", "comment": null, "summary": "We construct and analyze a TraceFEM discretization for the surface biharmonic problem. The method utilizes standard quadratic Lagrange finite element spaces defined on a three-dimensional background mesh and a symmetric $C^0$ interior penalty formulation posed on a second-order polyhedral approximation of the surface. Stability is achieved through a combination of surface edge penalties and bulk-facet penalization of gradient and Hessian jumps. We prove optimal first-order convergence in a discrete $H^2$ norm and quadratic convergence in the $L^2$ norm."}
{"id": "2512.18874", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18874", "abs": "https://arxiv.org/abs/2512.18874", "authors": ["Dirk Erhard", "Tertuliano Franco", "Wanessa Muricy"], "title": "The Most General Brownian Motion on the Line and on Two Closed Half-Lines", "comment": "37 pages, 5 figures", "summary": "In the 1950s, W. Feller characterized the most general Brownian motion on the closed half-line. He showed that any such process is a mixture of reflected, sticky, and killed Brownian motions. By most general Brownian motion, we mean a strong Markov process whose excursions away from zero coincide with those of standard Brownian motion, and which may be sent to the cemetery state upon hitting zero. In this work, we fully characterize the most general Brownian motion on the whole real line and on the union of two closed half-lines. Our results are twofold. First, we show that the most general Brownian motion on the line is the process known in the literature as the Skew Sticky Brownian Motion Killed at Zero (see Borodin and Salminen's book). Second, we prove that the most general Brownian motion on two closed half-lines is a process, which we call the Skew Sticky Killed at Zero Snapping Out Brownian Motion. This process extends the Snapping Out Brownian Motion introduced by A. Lejay in 2016."}
{"id": "2512.19217", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.19217", "abs": "https://arxiv.org/abs/2512.19217", "authors": ["Matthias De Lozzo", "Olivier Roustant", "Amine Aziz-Alaoui"], "title": "Make an optimization problem multidisciplinary", "comment": null, "summary": "Despite the abundance of benchmark problems for optimization algorithms, there is a notable scarcity of such problems in multidisciplinary design optimization (MDO). To address this gap, we introduce a novel methodology that enables the transformation of any optimization problem with a known solution into an equivalent MDO problem. This equivalence holds for a large class of coupling functions, including non-linear ones. The proposed methodology exploits a ''link function'' that effectively eliminates the coupling variables from the MDO problem, without influencing the solution. This approach allows for the creation of benchmark problems with reference solutions, facilitating the comparison and evaluation of various MDO algorithms. Moreover, it is adaptable to scalable optimization problems, where the dimensions of the search and constraint spaces can be configured. We also present a variant tailored to linear coupling functions with constant coefficients sampled independently at random, for which we derive a closed-form solution to the coupling equations. For the sake of illustration, we put our approach into action on a multidimensional Rosenbrock problem, varying the number of disciplines and design variable sizes. This example showcases the versatility and applicability of our methodology in generating benchmark problems for MDO."}
{"id": "2512.18955", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.18955", "abs": "https://arxiv.org/abs/2512.18955", "authors": ["Prosper Torsu"], "title": "A Spectral Low-Mode Reduced Method for Elliptic Problems", "comment": null, "summary": "We develop a spectral low-mode reduced solver for second-order elliptic boundary value problems with spatially varying diffusion coefficients. The approach projects standard finite difference or finite element discretization onto a global coarse space spanned by the lowest Dirichlet Laplacian eigenmodes, yielding an analytic reduced model that requires no training data and preserves coefficient heterogeneity through an exact Galerkin projection. The reduced solution is energy-optimal in the selected subspace and, for $H^2$-regular solutions, the truncation error associated with discarded modes satisfies a $\\sqrt{\\log M}/M$ decay in the $H_0^1$ norm. For uniformly stable reduced bases, the projected operator is well conditioned with respect to mesh refinement, and numerical experiments corroborate the predicted accuracy and demonstrate meaningful speedups over sparse direct solvers, with favorable performance relative to multigrid and deflation-based Krylov methods for heterogeneous coefficients in the tested setups."}
{"id": "2512.18927", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18927", "abs": "https://arxiv.org/abs/2512.18927", "authors": ["Seiichiro Kusuoka", "Hirotatsu Nagoji"], "title": "Stochastic quantization of the weighted exponential QFT", "comment": "14 pages", "summary": "We consider the stochastic quantization equation associated with the weighted exponential quantum field model (or the Høegh-Krohn model) on the two dimensional torus. Unlike in the case of the usual (unweighted) exponential model, the drift term of the stochastic quantization equation can be both positive and negative, and that makes the equation more difficult to treat. We prove the unique existence of the time-global solution under a certain initial condition by a pathwise PDE argument in the so-called $L^2$-regime. We also see that this solution is properly associated with a Dirichlet form canonically constructed from the weighted exponential quantum field measure."}
{"id": "2512.19446", "categories": ["math.OC", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19446", "abs": "https://arxiv.org/abs/2512.19446", "authors": ["Alessandro Baldi"], "title": "An alternative approach to well-posedness of McKean-Vlasov equations arising in Consensus-Based Optimization", "comment": null, "summary": "In this work we study the mean-field description of Consensus-Based Optimization (CBO), a derivative-free particle optimization method. Such a description is provided by a non-local SDE of McKean-Vlasov type, whose fields lack of global Lipschitz continuity. We propose a novel approach to prove the well-posedness of the mean-field CBO equation based on a truncation argument. The latter is performed through the introduction of a cut-off function, defined on the space of probability measures, acting on the fields. This procedure allows us to study the well-posedness problem in the classical framework of Sznitman. Through this argument, we recover the established result on the existence of strong solutions, and we extend the class of solutions for which pathwise uniqueness holds."}
{"id": "2512.19009", "categories": ["math.NA", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.19009", "abs": "https://arxiv.org/abs/2512.19009", "authors": ["Yijun Dong", "Paul Schwerdtner", "Benjamin Peherstorfer"], "title": "Randomized time stepping of nonlinearly parametrized solutions of evolution problems", "comment": "43 pages, 9 figures", "summary": "The Dirac-Frenkel variational principle is a widely used building block for using nonlinear parametrizations in the context of model reduction and numerically solving partial differential equations; however, it typically leads to time-dependent least-squares problems that are poorly conditioned. This work introduces a randomized time stepping scheme that solves at each time step a low-dimensional, random projection of the parameter vector via sketching. The sketching has a regularization effect that leads to better conditioned least-squares problems and at the same time reduces the number of unknowns that need to be solved for at each time step. Numerical experiments with benchmark examples demonstrate that randomized time stepping via sketching achieves competitive accuracy and outperforms standard regularization in terms of runtime efficiency."}
{"id": "2512.18937", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.18937", "abs": "https://arxiv.org/abs/2512.18937", "authors": ["Joost Jorritsma", "Pascal Maillard", "Peter Mörters"], "title": "The critical percolation window in growing random graphs", "comment": null, "summary": "We describe the critical window for percolation in the universality class of sparse growing random graphs. In our models, vertices arrive sequentially and connect independently to each earlier vertex $v$ with probability proportional to a nonpositive power of the arrival time of $v$, continuing until the graph has $n$ vertices. This class includes uniformly grown random graphs and inhomogeneous random graphs of preferential-attachment type. Whenever the critical percolation threshold is positive, we show that the critical window has width of order $(\\log n)^{-2}$ and a secondary phase transition at its finite upper boundary. Inside this window the largest component has size of order $\\sqrt{n}/\\log n$, and the susceptibility remains finite and independent of the position in the window. The proofs couple component explorations to branching random walks killed outside an interval of length $\\log n$, allowing sharp control of the barely subcritical and critical regimes."}
{"id": "2512.19457", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.19457", "abs": "https://arxiv.org/abs/2512.19457", "authors": ["Ho Yun"], "title": "Spectral Shinkage of Gaussian Entropic Optimal Transport", "comment": null, "summary": "We present a functional calculus treatment of Entropic Optimal Transport (EOT) between Gaussian measures on separable Hilbert spaces, providing a unified framework that handles infinite-dimensional degeneracy. By leveraging the notion of proper alignment and the Schur complement, we reveal that the Gaussian EOT solution operates as a precise \\textit{spectral shrinkage}: the optimal coupling is uniquely determined by contracting the spectrum of the correlation operator via a universal scalar function. This geometric insight facilitates an algorithmic shift from iterative fixed-point schemes (e.g., Sinkhorn) to direct algebraic computation, enabling efficient multi-scale analysis, where a single spectral decomposition allows for the exact evaluation of entropic costs across arbitrary regularization parameters $\\varepsilon > 0$ at negligible additional cost. Furthermore, we investigate the asymptotic behavior as $\\varepsilon \\downarrow 0$ in settings where the unregularized Optimal Transport problem admits non-unique solutions. We establish a selection principle that the regularized limit converges to the most diffusive optimal coupling --characterized as the centroid of the convex set of optimal Kantorovich plans. This demonstrates that in degenerate regimes, the entropic limit systematically rejects deterministic Monge solutions (extremal points) in favor of the optimal solution with minimal Hilbert-Schmidt correlation, effectively filtering out spurious correlations in the null space. Finally, we derive stability bounds and convergence rates, recovering established parametric rates ($\\varepsilon \\log(1/\\varepsilon)$) in finite dimensions while identifying distinct non-parametric rates dependent on spectral decay in infinite-dimensional settings."}
{"id": "2512.19357", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.19357", "abs": "https://arxiv.org/abs/2512.19357", "authors": ["Philipp Bringmann", "Maximilian Brunner", "Dirk Praetorius"], "title": "Newton's method in adaptive iteratively linearized FEM", "comment": null, "summary": "This paper concerns the inclusion of Newton's method into an adaptive finite element method (FEM) for the solution of nonlinear partial differential equations (PDEs). It features an adaptive choice of the damping parameter in the Newton iteration for the discretized nonlinear problems on each level ensuring both global linear and local quadratic convergence. In contrast to energy-based arguments in the literature, a novel approach in the analysis considers the discrete dual norm of the residual as a computable measure for the linearization error. As a consequence, this paper provides the first convergence analysis with optimal rates of an adaptive iteratively linearized FEM beyond energy-minimization problems. The presented theory applies to strongly monotone operators with locally Lipschitz continuous Fréchet derivative. We present a class of semilinear PDEs fitting into this framework and provide numerical experiments to underline the theoretical results."}
{"id": "2512.18990", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.18990", "abs": "https://arxiv.org/abs/2512.18990", "authors": ["Guozhen Li", "Xiaoyue Li", "Xuerong Mao", "Guoting Song"], "title": "Hybrid Stochastic Functional Differential Equations with Infinite Delay: Approximations and Numerics", "comment": null, "summary": "This paper is to investigate if the solution of a hybrid stochastic functional differential equation (SFDE) with infinite delay can be approximated by the solution of the corresponding hybrid SFDE with finite delay. A positive result is established for a large class of highly nonlinear hybrid SFDEs with infinite delay. Our new theory makes it possible to numerically approximate the solution of the hybrid SFDE with infinite delay, via the numerical solution of the corresponding hybrid SFDE with finite delay."}
{"id": "2512.19532", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.19532", "abs": "https://arxiv.org/abs/2512.19532", "authors": ["Jea-Hyun Park", "Abner J. Salgado", "Steven M. Wise"], "title": "A perturbed preconditioned gradient descent method for the unconstrained minimization of composite objectives", "comment": null, "summary": "We introduce a perturbed preconditioned gradient descent (PPGD) method for the unconstrained minimization of a strongly convex objective $G$ with a locally Lipschitz continuous gradient. We assume that $G(v)=E(v)+F(v)$ and that the gradient of $F$ is only known approximately. Our analysis is conducted in infinite dimensions with a preconditioner built into the framework. We prove a linear rate of convergence, up to an error term dependent on the gradient approximation. We apply the PPGD to the stationary Cahn-Hilliard equations with variable mobility under periodic boundary conditions. Numerical experiments are presented to validate the theoretical convergence rates and explore how the mobility affects the computation."}
{"id": "2512.19407", "categories": ["math.NA", "physics.comp-ph", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2512.19407", "abs": "https://arxiv.org/abs/2512.19407", "authors": ["Louis Libat", "Can Selçuk", "Eric Chénier", "Vincent Le Chenadec"], "title": "A Cartesian Cut-Cell Two-Fluid Method for Two-Phase Diffusion Problems", "comment": "31 pages, 20 figures", "summary": "We present a Cartesian cut-cell finite-volume method for sharp-interface two-phase diffusion problems in static geometries. The formulation follows a two-fluid approach: independent diffusion equations are discretized in each phase on a fixed staggered Cartesian grid, while the phases are coupled through embedded interface conditions enforcing continuity of normal flux and a general jump law. Cut cells are treated by integrating the governing equations over phase-restricted control volumes and faces, yielding discrete divergence and gradient operators that are locally conservative within each phase. Interface coupling is achieved by introducing a small set of interfacial unknowns per cut cell on the embedded boundary; the resulting algebraic system involves only bulk and interfacial averages. A key feature of the method is the use of a reduced set of geometric information based solely on low-order moments (trimmed volumes, apertures and interface measures/centroids), allowing robust implementation without constructing explicitly cut-cell polytopes. The method supports steady (Poisson) and unsteady (diffusion) regimes and incorporates Dirichlet, Neumann, Robin boundary conditions and general jumps. We validate the scheme on one-, two- and three-dimensional mono- and diphasic benchmarks, including curved embedded boundaries, Robin conditions and strong property/jump contrasts. The results demonstrate the expected convergence behavior, sharp enforcement of interfacial laws and excellent conservation properties. Extensions to moving interfaces and Stefan-type free-boundary problems are natural perspectives of this framework."}
{"id": "2512.19003", "categories": ["math.PR", "cs.IT", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.19003", "abs": "https://arxiv.org/abs/2512.19003", "authors": ["Mokshay Madiman", "James Melbourne", "Cyril Roberto"], "title": "The stability of log-supermodularity under convolution", "comment": null, "summary": "We study the behavior of log-supermodular functions under convolution. In particular we show that log-concave product densities preserve log-supermodularity, confirming in the special case of the standard Gaussian density, a conjecture of Zartash and Robeva. Additionally, this stability gives a ``conditional'' entropy power inequality for log-supermodular random variables. We also compare the Ahlswede-Daykin four function theorem and a recent four function version of the Prekopa-Leindler inequality due to Cordero-Erausquin and Maurey and giving transport proofs for the two theorems. In the Prekopa-Leindler case, the proof gives a generalization that seems to be new, which interpolates the classical three and the recent four function versions."}
{"id": "2512.19614", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.19614", "abs": "https://arxiv.org/abs/2512.19614", "authors": ["Yannick Werner", "Juan Miguel Morales", "Salvador Pineda", "Line Roald", "Sonja Wogrin"], "title": "Scenario Reduction for the Two-Stage Stochastic Unit Commitment Problem", "comment": null, "summary": "The two-stage stochastic unit commitment problem has become an important tool to support decision-making under uncertainty in power systems. Representing the uncertainty by a large number of scenarios guarantees accurate results but challenges the solution process. One way to overcome this is by using scenario reduction methods, which aim at finding a distribution supported on fewer scenarios, but leading to similar optimal first-stage decisions. In this paper, we recap the classical scenario reduction theory based on the distance of probability distributions and the optimal mass transportation problem. We then review and compare various formulations of the underlying cost function of the latter used in the literature. Using the Forward Selection Algorithm, we show that a specific formulation of the cost function can be proven to select the best possible scenario from a given sample on the first draw with respect to the Relative Approximation Error. We demonstrate this result and compare the quality of the approximation as well as the computational performance of the different cost functions using a modified version of the IEEE RTS 24-Bus System. In many cases, we find that the optimal solution of the two-stage stochastic unit commitment problem with 200 scenarios can be approximated with around 2% scenarios when using this cost function."}
{"id": "2512.19408", "categories": ["math.NA", "cs.CE", "cs.RO", "eess.SY", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.19408", "abs": "https://arxiv.org/abs/2512.19408", "authors": ["Philipp L. Kinon", "Simon R. Eugster", "Peter Betsch"], "title": "Mixed formulation and structure-preserving discretization of Cosserat rod dynamics in a port-Hamiltonian framework", "comment": "37 pages, 16 figures, currently under review", "summary": "An energy-based modeling framework for the nonlinear dynamics of spatial Cosserat rods undergoing large displacements and rotations is proposed. The mixed formulation features independent displacement, velocity and stress variables and is further objective and locking-free. Finite rotations are represented using a director formulation that avoids singularities and yields a constant mass matrix. This results in an infinite-dimensional nonlinear port-Hamiltonian (PH) system governed by partial differential-algebraic equations with a quadratic energy functional. Using a time-differentiated compliance form of the stress-strain relations allows for the imposition of kinematic constraints, such as inextensibility or shear-rigidity. A structure-preserving finite element discretization leads to a finite-dimensional system with PH structure, thus facilitating the design of an energy-momentum consistent integration scheme. Dissipative material behavior (via the generalized-Maxwell model) and non-standard actuation approaches (via pneumatic chambers or tendons) integrate naturally into the framework. As illustrated by selected numerical examples, the present framework establishes a new approach to energy-momentum consistent formulations in computational mechanics involving finite rotations."}
{"id": "2512.19063", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.19063", "abs": "https://arxiv.org/abs/2512.19063", "authors": ["Victor H. de la Pena", "Heyuan Yao", "Demissie Alemayehu"], "title": "Sharp Decoupling Inequalities for the Variances and Second Moments of Sums of Dependent Random Variables", "comment": null, "summary": "Both complete decoupling and tangent decoupling are classical tools aiming to compare two random processes where one has a weaker dependence structure. We give a new proof for the complete decoupling inequality, which provides a lower bound for the sum of dependent square-integrable nonnegative random variables $\\sum\\limits^n_{i=1} d_i$ \\[ \\frac{1}{2} \\mathbb E \\left( \\sum\\limits^n_{i=1} z_i \\right)^2 \\leq \\mathbb E \\left( \\sum\\limits^n_{i=1} d_i \\right)^2, \\] where $z_i \\stackrel{\\mathcal{L}}{=} d_i$ for all $i\\leq n$ and $z_i$'s are mutually independent. We will then provide the following sharp tangent decoupling inequalities \\[\\mathbb Var \\left( \\sum\\limits^n_{i=1} d_i\\right) \\leq 2 \\mathbb Var \\left( \\sum\\limits^n_{i=1} e_i\\right),\\] and \\[\\mathbb E \\left( \\sum\\limits^n_{i=1} d_i\\right)^2 \\leq 2 \\mathbb E \\left( \\sum\\limits^n_{i=1} e_i\\right)^2 - \\left[ \\mathbb E \\left( \\sum\\limits^n_{i=1} e_i\\right) \\right]^2,\\] where $\\{e_i\\}$ is the decoupled sequences of $\\{d_i\\}$ and $d_i$'s are not forced to be nonnegative. Applications to construct Chebyshev-type inequality and Paley-Zygmund-type inequality, and to bound the second moments of randomly stopped sums will be provided."}
{"id": "2512.19536", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.19536", "abs": "https://arxiv.org/abs/2512.19536", "authors": ["Caterina B. Leimer Saglio", "Stefano Pagani", "Paola F. Antonietti"], "title": "A massively parallel non-overlapping Schwarz preconditioner for PolyDG methods in brain electrophysiology", "comment": null, "summary": "We investigate non-overlapping Schwarz preconditioners for the algebraic systems stemming from high-order discretizations of the coupled monodomain and Barreto-Cressman models, with applications to brain electrophysiology. The spatial discretization is based on a high-order Polytopal Discontinuous Galerkin (PolyDG) method, coupled with the Crank-Nicolson time discretization scheme with explicit extrapolation of the ion term. To improve solver efficiency, we consider additive Schwarz preconditioners within the PolyDG framework, which combines (massively parallel) local subdomain solvers with a coarse-grid correction. Numerical experiments demonstrate robustness with respect to the discretization parameters, as well as a significant reduction in iteration counts compared to the unpreconditioned solver. These features make the proposed approach well-suited for parallel large-scale simulations in brain electrophysiology."}
{"id": "2512.19098", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.19098", "abs": "https://arxiv.org/abs/2512.19098", "authors": ["Anatolii A. Puhalskii"], "title": "On large queue lengths in generalised Jackson networks", "comment": null, "summary": "This paper proves a large deviation principle (LDP) for the stationary distribution of queue lengths in a subcritical generalised Jackson network assuming a Cramer condition on the interarrival and service times. The deviation function is given by the quasipotential."}
{"id": "2512.19579", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.19579", "abs": "https://arxiv.org/abs/2512.19579", "authors": ["Xiaozhe Hu", "Francisco J. Gaspar", "Carmen Rodrigo"], "title": "Convergence analysis for non-iterative sequential schemes for Biot's model", "comment": null, "summary": "An alternative to the fully implicit or monolithic methods used for the solution of the coupling of fluid flow and deformation in porous media is a sequential approach in which the fully coupled system is broken into subproblems (flow and mechanics problems) that are solved one after the other. This fully explicit coupling approach is a very simple scheme which allows much flexibility in the implementation and has a lower computational cost, making it quite attractive in practice since smaller linear systems need to be solved in order to obtain the solution for the whole coupled poroelastic system. Due to the appealing advantages of these methods, intensive research is currently being carried out in this direction, as in the present work. Although the application of this type of method is very common in practice, there exist only a few works devoted to their theoretical analysis. In this work, we consider the so-called explicit fixed-stress split scheme, which consists of solving the flow problem first with time-lagging the displacement term, followed by the solution of the mechanics problem. To the best of our knowledge, we provide the first convergence analysis of the explicit fixed-stress split scheme for Biot's equations. In particular, we prove that this algorithm is optimally convergent if the considered finite element discretization satisfies an inf-sup condition. In addition, with the aim of designing the simplest scheme for solving Biot's model, we also propose a similar decoupled algorithm for piecewise linear finite elements for both variables which arises from the novel stabilization recently proposed in \\cite{Pe2025}, and is demonstrated to be optimally convergent."}
{"id": "2512.19293", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.19293", "abs": "https://arxiv.org/abs/2512.19293", "authors": ["Giulia Di Nunno", "Barbara Martinucci", "Serena Spina"], "title": "On a finite quasi birth-death process with catastrophes and its diffusion approximation", "comment": null, "summary": "We study a multi-type Ehrenfest process modeled as a finite quasi-birth-death (QBD) process. We assume that the transitions are allowed only to the two adjacent levels of the same phase and are characterized by linear rates. The crucial element lies in the phase switching mechanism at the origin, which is governed by an irreducible stochastic matrix. The process evolution is interrupted by catastrophic events, whose occurrences are controlled by a Poisson process. Each catastrophe resets the system state to zero, initiating a new cycle of evolution until the next resetting event. We conduct a comprehensive analysis, addressing both the transient and long-term behavior of this process. Furthermore, we derive a diffusive approximation, by proving its convergence to a reflected Ornstein-Uhlenbeck jump diffusion process."}
{"id": "2512.19580", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.19580", "abs": "https://arxiv.org/abs/2512.19580", "authors": ["Zhanybek Baitulenov", "Maxim Olshanskii", "Almas Temirbekov", "Nurlan Temirbekov", "Syrym Kasenov"], "title": "A modified Brinkman penalization fictitious domain method for the unsteady Navier-Stokes equations", "comment": null, "summary": "This paper investigates a modification of the fictitious domain method with continuation in the lower-order coefficients for the unsteady Navier-Stokes equations governing the motion of an incompressible homogeneous fluid in a bounded 2D or 3D domain. The modification enables {a solution-dependent} choice of the critical parameter. Global-in-time existence and convergence of a weak solution to the auxiliary problem are proved, and local-in-time existence and convergence of a unique strong solution are established. For the strong solution, a new higher-order convergence rate estimate in the penalization parameter is obtained. The introduced framework allows us to apply a pointwise divergence free finite element method as a discretization technique, leading to strongly mass conservative discrete fictitious domain method. A numerical example illustrates the performance of the method."}
{"id": "2512.19351", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.19351", "abs": "https://arxiv.org/abs/2512.19351", "authors": ["Nawaf Bou-Rabee", "Victor H. de la Peña"], "title": "Decoupling for Markov Chains", "comment": null, "summary": "Consider a Markov chain $(X_i)_{i\\ge0}$ with invariant measure $μ$ that admits the representation $X_{i+1}=Φ(X_i,U_i)$, where $(U_i)_{i\\ge0}$ are i.i.d. random variables and $Φ$ is a measurable map. We introduce a tangent-decoupled process $(\\widetilde X_i)_{i\\ge0}$ obtained by replacing $(U_i)$ with an independent copy. Conditional on the realized backbone $(X_i)$, the sequence $(f(\\widetilde X_i))$ is independent. Although $(\\widetilde X_i)$ is not Markovian, under the same ergodicity assumptions that ensure a law of large numbers for $(X_i)$, the empirical averages $n^{-1}\\sum_{i=1}^n f(\\widetilde X_i)$ converge almost surely to $μ(f)$. In addition, for every $f\\in L^2(μ)$ and every $N\\ge1$, $$ \\operatorname{Var}\\!\\Bigl(\\sum_{i=1}^N f(X_i)\\Bigr) \\;\\le\\; 2\\,\\operatorname{Var}\\!\\Bigl(\\sum_{i=1}^N f(\\widetilde X_i)\\Bigr), $$ and therefore $σ_f^2 \\le 2\\,\\widetildeσ_f^{\\,2}$ for the corresponding time-average variance constants. The inequality requires neither reversibility nor mixing assumptions. Its proof identifies the two sequences as tangent in the sense of decoupling theory and applies the sharp $L^2$ tangent decoupling inequality of de la Peña, Yao, and Alemayehu (2025)."}
{"id": "2512.19604", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.19604", "abs": "https://arxiv.org/abs/2512.19604", "authors": ["Mohammad Sarhil", "Leonardo Andres Perez Ramirez", "Max Jendrik Voss", "Angela Madeo"], "title": "Static size-effects meet the dynamic scattering properties of finite-sized mechanical metamaterials: a relaxed micromorphic study with parameter identification via two-stage static-dynamic optimization", "comment": null, "summary": "Mechanical metamaterials exhibit size-effects when a few unit-cells are subjected to static loading because no clear micro-macro scale separation holds and the characteristic length of the deformation becomes comparable to the unit-cell size. These size-effects typically manifest themselves as a strengthening of the response in a form summarized as \"smaller is stiffer\". Moreover, the dynamical behavior of mechanical metamaterials is very remarkable, featuring unique phenomena such as dispersive behavior and band-gaps where elastic waves cannot propagate over specific frequency ranges. In these frequency ranges, the wavelength becomes gradually comparable to the unit-cell size, giving rise to microstructure related phenomena which become particularly visible in the reflection/transmission patterns where an incident wave hits the metamaterial's interfaces. This raises the question of whether the static size-effects and dynamic reflection/transmission patterns are correlated.\n  In this work, we investigate the interaction of the static size-effects and the dynamic scattering response of mechanical metamaterials by employing the relaxed micromorphic model. We introduce a two-stage optimization procedure to identify the material parameters. In the first stage, the static material parameters are identified by exploiting the static size-effects through a least squares fitting procedure based on the total energy. The dynamic parameters are determined in the second stage by fitting the dispersion curves of the relaxed micromorphic model to those of the fully discretized microstructure. At this second stage, we assess the results obtained by fitting the dispersion curves in one and in two propagation directions, for both the relaxed micromorphic model (RMM) with curvature and its reduced counterpart (RRMM) without curvature.\n  The full abstract is presented in the paper."}
{"id": "2512.19425", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.19425", "abs": "https://arxiv.org/abs/2512.19425", "authors": ["Tillmann Bühler", "Anna Gusakova", "Konstantin Recke"], "title": "Critical Poisson hyperplane percolation in hyperbolic space has no unbounded cells", "comment": "18 pages + 2 pages appendix, 2 figues. Comments welcome!", "summary": "We show that tessellations of hyperbolic space by isometry-invariant Poisson processes of $(d-1)$-dimensional hyperplanes do not have an unbounded cell at the critical intensity. This extends a result by Porret-Blanc for the hyperbolic plane (C. R. Acad. Sci. Paris, Ser. I, Vol. 344 (2007)) to dimensions $d\\ge3$. We also show that for intensities strictly below the critical intensity, infinitely many unbounded cells exist, while for intensities larger than or equal to the critical intensity, no unbounded cell exists. This completely describes the basic phase transition of this continuum percolation model. Our proof uses a method from discrete percolation theory which we adapt to the continuum and combine with specific computations for Poisson hyperplane processes."}
{"id": "2512.19647", "categories": ["math.NA", "math.AP", "math.FA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19647", "abs": "https://arxiv.org/abs/2512.19647", "authors": ["Felix Kastner", "Katharina Klioba"], "title": "Milstein-type Schemes for Hyperbolic SPDEs", "comment": "47 pages, 3 figure, 4 tables. Comments are welcome!", "summary": "This article studies the temporal approximation of hyperbolic semilinear stochastic evolution equations with multiplicative Gaussian noise by Milstein-type schemes. We take the term hyperbolic to mean that the leading operator generates a contractive, not necessarily analytic $C_0$-semigroup. Optimal convergence rates are derived for the pathwise uniform strong error \\[\n  E_h^\\infty := \\Big(\\mathbb{E}\\max_{1\\le j \\le M}\\|U_{t_j}-u_j\\|_X^p\\Big)^{1/p} \\] on a Hilbert space $X$ for $p\\in [2,\\infty)$. Here, $U$ is the mild solution and $u_j$ its Milstein approximation at time $t_j=jh$ with step size $h>0$ and final time $T=Mh>0$. For sufficiently regular nonlinearity and noise, we establish strong convergence of order one, with the error satisfying $E_h^\\infty\\lesssim h\\sqrt{\\log(T/h)}$ for rational Milstein schemes and $E_h^\\infty \\lesssim h$ for exponential Milstein schemes. This extends previous results from parabolic to hyperbolic SPDEs and from exponential to rational Milstein schemes. Root-mean-square error estimates are strengthened to pathwise uniform estimates. Numerical experiments validate the convergence rates for the stochastic Schrödinger equation. Further applications to Maxwell's and transport equations are included."}
{"id": "2512.19441", "categories": ["math.PR", "math-ph", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.19441", "abs": "https://arxiv.org/abs/2512.19441", "authors": ["Benjamin Bonnefont", "Hermanni Rajamäki", "Vincent Vargas"], "title": "Fourier dimension of imaginary Gaussian multiplicative chaos", "comment": "Comments are welcome", "summary": "We study the Fourier coefficients of imaginary Gaussian multiplicative chaos (GMC) on the unit circle. Under the subcritical phase $β\\in(0,1)$, we show that the Fourier dimension is $1-β^2$ and prove a central limit theorem for the rescaled coefficients."}
{"id": "2512.18990", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.18990", "abs": "https://arxiv.org/abs/2512.18990", "authors": ["Guozhen Li", "Xiaoyue Li", "Xuerong Mao", "Guoting Song"], "title": "Hybrid Stochastic Functional Differential Equations with Infinite Delay: Approximations and Numerics", "comment": null, "summary": "This paper is to investigate if the solution of a hybrid stochastic functional differential equation (SFDE) with infinite delay can be approximated by the solution of the corresponding hybrid SFDE with finite delay. A positive result is established for a large class of highly nonlinear hybrid SFDEs with infinite delay. Our new theory makes it possible to numerically approximate the solution of the hybrid SFDE with infinite delay, via the numerical solution of the corresponding hybrid SFDE with finite delay."}
{"id": "2512.19496", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.19496", "abs": "https://arxiv.org/abs/2512.19496", "authors": ["Tian Shen", "Zhonggen Su", "Xiaolin Wang"], "title": "High-dimensional normal approximations for sums of Langevin Markov chains", "comment": null, "summary": "Consider the well-known Langevin diffusion on $\\mathbb{R}^d$ $$\\mathrm{d} X_t = -\\nabla U(X_t)\\,\\mathrm{d} t + \\sqrt{2}\\mathrm{d} B_t, $$ and its Euler-Maruyama discretization given by $$X_{k+1}=X_k-η\\nabla U(X_k)+\\sqrt{2η}ξ_{k+1},$$ where $η$ is the step size. Under mild conditions, the Langevin diffusion admits $π(\\mathrm{d} x)\\propto \\exp(-U(x))\\mathrm{d} x$ as its unique stationary distribution.\n  In this paper, we mainly study the normal approximation of the normalized partial sum $$ W_n = η^{1/2} n^{-1/2} \\left( \\sum_{i=0}^{n-1} X_i- \\int_{\\mathbb{R}^d} x\\,π(\\mathrm{d} x) \\right).$$ To the best of our knowledge, this work provides the first dimension-explicit convergence rates in high-dimensional settings. Our main tool is a novel upper bound for the 1-Wasserstein distance $W_1(W,γ)$ via the exchange pair approach, where $W$ is any random vector of interest and $γ$ is a $d$-dimensional standard normal random vector."}
{"id": "2512.19532", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.19532", "abs": "https://arxiv.org/abs/2512.19532", "authors": ["Jea-Hyun Park", "Abner J. Salgado", "Steven M. Wise"], "title": "A perturbed preconditioned gradient descent method for the unconstrained minimization of composite objectives", "comment": null, "summary": "We introduce a perturbed preconditioned gradient descent (PPGD) method for the unconstrained minimization of a strongly convex objective $G$ with a locally Lipschitz continuous gradient. We assume that $G(v)=E(v)+F(v)$ and that the gradient of $F$ is only known approximately. Our analysis is conducted in infinite dimensions with a preconditioner built into the framework. We prove a linear rate of convergence, up to an error term dependent on the gradient approximation. We apply the PPGD to the stationary Cahn-Hilliard equations with variable mobility under periodic boundary conditions. Numerical experiments are presented to validate the theoretical convergence rates and explore how the mobility affects the computation."}
{"id": "2512.19501", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.19501", "abs": "https://arxiv.org/abs/2512.19501", "authors": ["Esmée Theewis"], "title": "Large deviations for stochastic evolution equations beyond the coercive case", "comment": null, "summary": "We prove the small-noise large deviation principle (LDP) for stochastic evolution equations in an $L^2$-setting. As the coefficients are allowed to be non-coercive, our framework encompasses a much broader scope than variational settings. To replace coercivity, we require only well-posedness of the stochastic evolution equation and two concrete, verifiable a priori estimates. Furthermore, we accommodate drift nonlinearities satisfying a modified criticality condition, and we allow for vanishing drift perturbations. The latter permits the inclusion of Itô--Stratonovich correction terms, enabling the treatment of both noise interpretations. In another paper, our results have been applied to the 3D primitive equations with full transport noise. In the current paper, we give an application to a reaction-diffusion system which lacks coercivity, further demonstrating the versatility of the framework. Finally, we show that even in the coercive case, we obtain new LDP results for equations with critical nonlinearities that rely on our modified criticality condition, including the stochastic 2D Allen--Cahn equation in the weak setting."}
{"id": "2512.19517", "categories": ["math.PR", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.19517", "abs": "https://arxiv.org/abs/2512.19517", "authors": ["Cédric Bernardin", "Vsevolod Vladimirovich Tarsamaev"], "title": "Spiking and Resetting", "comment": null, "summary": "We consider a one-dimensional piecewise deterministic Markov process (PDMP) on $[0,1]$ with resetting at $0$ and depending on a small parameter $\\varepsilon>0$. In the singular vanishing limit $\\varepsilon \\to 0$ we prove that the `` resetting '' simple point process associated to the PDMP converges to a point process described by a jump Markov process decorated by ``spikes'' distributed as a time-space Poisson point process with intensity proportional to $dt \\otimes x^{-2} dx$. This proves rigorously results appeared previously in \\cite{SBDKC25} and also justifies partially a conjecture formulated there."}
{"id": "2512.19541", "categories": ["math.PR", "math-ph", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.19541", "abs": "https://arxiv.org/abs/2512.19541", "authors": ["Antonio Agresti", "Esmée Theewis"], "title": "The large deviation principle for the stochastic 3D primitive equations with transport noise", "comment": null, "summary": "We prove the small-noise large deviation principle for the three-dimensional primitive equations with transport noise and turbulent pressure. Transport noise is important for geophysical fluid dynamics applications, as it takes into account the effect of small scales on the large scale dynamics. The main mathematical challenge is that we allow for the transport noise to act on the full horizontal velocity, therefore leading to a non-trivial turbulent pressure, which requires an involved analysis to obtain the necessary energy bounds. Both Stratonovich and Itô noise are treated."}
{"id": "2512.19672", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.19672", "abs": "https://arxiv.org/abs/2512.19672", "authors": ["Arthur Blanc-Renaudie", "Asaf Nachmias"], "title": "Critical percolation on the discrete torus in high dimensions", "comment": "79 pages, 3 figures", "summary": "We consider percolation on the discrete torus $\\mathbb{Z}_n^d$ at $p_c(\\mathbb{Z}^d)$, the critical value for percolation on the corresponding infinite lattice $\\mathbb{Z}^d$, and within the scaling window around it. We assume that $d$ is a large enough constant for the nearest neighbor model, or any fixed $d>6$ for spread-out models. We prove that there exist constants $\\mathbf{C},\\mathbf{C}'$ depending only on the dimension and the spread-out parameter such that for any $λ\\in \\mathbb{R}$ if the edge probability is $p_c(\\mathbb{Z}^d)+\\mathbf{C} λn^{-d/3} + o(n^{-d/3})$, then the joint distribution of the largest clusters normalized by $\\mathbf{C}' n^{-2d/3}$ converges as $n\\to \\infty$ to the ordered lengths of excursions above past minimum of an inhomogeneous Brownian motion started at $0$ with drift $λ-t$ at time $t\\in[0,\\infty)$. This canonical limit was identified by Aldous in the context of critical Erdős--Rényi graphs."}
{"id": "2512.17974", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.17974", "abs": "https://arxiv.org/abs/2512.17974", "authors": ["Nicolas Chenavier", "Samuel Delepoulle", "Christophe Renaud", "Franck Vandewièle"], "title": "Voronoi integration of the rendering equation", "comment": null, "summary": "In photorealistic image rendering, Monte Carlo methods form the foundation for the integration of the rendering equation in modern approaches. However, despite their effectiveness, traditional Monte Carlo methods often face challenges in controlling variance, resulting in noisy visual artifacts in regions that are difficult to render. In this work, we propose a new approach to the integration of the rendering equation by introducing a Voronoi tessellation reweighting scheme combined with a Poisson point process sampling strategy to address some of the limitations of standard Monte Carlo methods. From a theoretical point of view, we show that the variance induced by a Poisson-Voronoi tessellation is smaller than that of the Monte Carlo method when the intensity of the underlying process is arbitrarily large and when the function to be integrated satisfies a Holder continuity condition."}
{"id": "2512.19023", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19023", "abs": "https://arxiv.org/abs/2512.19023", "authors": ["Haijun Li"], "title": "Operator Tail Densities of Multivariate Copulas", "comment": null, "summary": "Operator regular variation of a multivariate distribution can be decomposed into the operator tail dependence of the underlying copula and the regular variation of the univariate marginals. In this paper, we introduce operator tail densities for copulas and show that an operator-regularly-varying density can be characterized through the operator tail density of its copula together with the marginal regular variation. As an example, we demonstrate that although a Liouville copula is not available in closed form, it nevertheless admits an explicit operator tail-dependence function."}
{"id": "2512.19201", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19201", "abs": "https://arxiv.org/abs/2512.19201", "authors": ["Sebastian Zimper", "Ana Djurdjevac", "Carsten Hartmann", "Christof Schütte", "Nataša Djurdjevac Conrad"], "title": "Mean-field optimal control with stochastic leaders", "comment": null, "summary": "We consider interacting agent systems with a large number of stochastic agents (or particles) influenced by a fixed number of external stochastic lead agents. Such examples arise, for example in models of opinion dynamics, where a small number of leaders (influencers) can steer the behaviour of a large population of followers. In this context, we study a partial mean-field limit where the number of followers tends to infinity, while the number of leaders stays constant. The partial mean-field limit dynamics is then given by a McKean-Vlasov stochastic differential equation (SDE) for the followers, coupled to a controlled Itô-SDE governing the dynamics of the lead agents. For a given cost functional that the lead agents seek to minimise, we show that the unique optimal control of the finite agent system convergences to the optimal control of the limiting system. This establishes that the low-dimensional control of the partial (mean-field) system provides an effective approximation for controlling the high-dimensional finite agent system. In addition, we propose a stochastic gradient descent algorithm that can efficiently approximate the mean-field control. Our theoretical results are illustrated on opinion dynamics model with lead agents, where the control objective is to drive the followers to reach consensus in finite time."}
{"id": "2512.19446", "categories": ["math.OC", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19446", "abs": "https://arxiv.org/abs/2512.19446", "authors": ["Alessandro Baldi"], "title": "An alternative approach to well-posedness of McKean-Vlasov equations arising in Consensus-Based Optimization", "comment": null, "summary": "In this work we study the mean-field description of Consensus-Based Optimization (CBO), a derivative-free particle optimization method. Such a description is provided by a non-local SDE of McKean-Vlasov type, whose fields lack of global Lipschitz continuity. We propose a novel approach to prove the well-posedness of the mean-field CBO equation based on a truncation argument. The latter is performed through the introduction of a cut-off function, defined on the space of probability measures, acting on the fields. This procedure allows us to study the well-posedness problem in the classical framework of Sznitman. Through this argument, we recover the established result on the existence of strong solutions, and we extend the class of solutions for which pathwise uniqueness holds."}
{"id": "2512.19647", "categories": ["math.NA", "math.AP", "math.FA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.19647", "abs": "https://arxiv.org/abs/2512.19647", "authors": ["Felix Kastner", "Katharina Klioba"], "title": "Milstein-type Schemes for Hyperbolic SPDEs", "comment": "47 pages, 3 figure, 4 tables. Comments are welcome!", "summary": "This article studies the temporal approximation of hyperbolic semilinear stochastic evolution equations with multiplicative Gaussian noise by Milstein-type schemes. We take the term hyperbolic to mean that the leading operator generates a contractive, not necessarily analytic $C_0$-semigroup. Optimal convergence rates are derived for the pathwise uniform strong error \\[\n  E_h^\\infty := \\Big(\\mathbb{E}\\max_{1\\le j \\le M}\\|U_{t_j}-u_j\\|_X^p\\Big)^{1/p} \\] on a Hilbert space $X$ for $p\\in [2,\\infty)$. Here, $U$ is the mild solution and $u_j$ its Milstein approximation at time $t_j=jh$ with step size $h>0$ and final time $T=Mh>0$. For sufficiently regular nonlinearity and noise, we establish strong convergence of order one, with the error satisfying $E_h^\\infty\\lesssim h\\sqrt{\\log(T/h)}$ for rational Milstein schemes and $E_h^\\infty \\lesssim h$ for exponential Milstein schemes. This extends previous results from parabolic to hyperbolic SPDEs and from exponential to rational Milstein schemes. Root-mean-square error estimates are strengthened to pathwise uniform estimates. Numerical experiments validate the convergence rates for the stochastic Schrödinger equation. Further applications to Maxwell's and transport equations are included."}
