{"id": "2512.21411", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.21411", "abs": "https://arxiv.org/abs/2512.21411", "authors": ["Sean Plummer"], "title": "Thermodynamic Characterizations of Singular Bayesian Models: Specific Heat, Susceptibility, and Entropy Flow in Posterior Geometry", "comment": "54 pages, 20 figures", "summary": "Singular learning theory (SLT) \\citep{watanabe2009algebraic,watanabe2018mathematical} provides a rigorous asymptotic framework for Bayesian models with non-identifiable parameterizations, yet the statistical meaning of its second-order invariant, the \\emph{singular fluctuation}, has remained unclear. In this work, we show that singular fluctuation admits a precise and natural interpretation as a \\emph{specific heat}: the second derivative of the Bayesian free energy with respect to temperature. Equivalently, it measures the posterior variance of the log-likelihood observable under the tempered Gibbs posterior. We further introduce a collection of related thermodynamic quantities, including entropy flow, prior susceptibility, and cross-susceptibility, that together provide a detailed geometric diagnosis of singular posterior structure. Through extensive numerical experiments spanning discrete symmetries, boundary singularities, continuous gauge freedoms, and piecewise (ReLU) models, we demonstrate that these thermodynamic signatures cleanly distinguish singularity types, exhibit stable finite-sample behavior, and reveal phase-transition--like phenomena as temperature varies. We also show empirically that the widely used WAIC estimator \\citep{watanabe2010asymptotic, watanabe2013widely} is exactly twice the thermodynamic specific heat at unit temperature, clarifying its robustness in singular models.Our results establish a concrete bridge between singular learning theory and statistical mechanics, providing both theoretical insight and practical diagnostics for modern Bayesian models."}
{"id": "2512.21417", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.21417", "abs": "https://arxiv.org/abs/2512.21417", "authors": ["Alejandro Cholaquidis", "Ricardo Fraiman", "Manuel Hernández-Banadik", "Stanislav Nagy"], "title": "Estimating axial symmetry using random projections", "comment": "27 pages, 6 figures, 3 tables", "summary": "This paper studies the problem of identifying directions of axial symmetry in multivariate distributions. Theoretical results are derived on how the measure or cardinality of the set of symmetry directions relates to spherical symmetry. The problem is framed using random projections, leading to a proof that in \\(\\RR^2\\), agreement on two random projections is enough to identify the true axes of symmetry. A corresponding result for higher dimensions is conjectured. An estimator for the symmetry directions is proposed and proved to be consistent in the plane."}
{"id": "2512.21504", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.21504", "abs": "https://arxiv.org/abs/2512.21504", "authors": ["Xiaoda Xu", "Jun Xian"], "title": "Expected star discrepancy based on stratified sampling", "comment": null, "summary": "We present two main contributions to the expected star discrepancy theory. First, we derive a sharper expected upper bound for jittered sampling, improving the leading constants and logarithmic terms compared to the state-of-the-art [Doerr, 2022]. Second, we prove the strong partition principle for star discrepancy, showing that any equal-measure stratified sampling yields a strictly smaller expected discrepancy than simple random sampling, thereby resolving an open question in [Kiderlen and Pausinger, 2022]. Numerical simulations confirm our theoretical advances and illustrate the superiority of stratified sampling in low to moderate dimensions."}
{"id": "2512.21639", "categories": ["math.ST", "cs.IT"], "pdf": "https://arxiv.org/pdf/2512.21639", "abs": "https://arxiv.org/abs/2512.21639", "authors": ["Nicholas G. Polson", "Daniel Zantedeschi"], "title": "Rational Inattention: A Bayesian Predictive Approach", "comment": null, "summary": "We recast rational inattention as a Bayesian predictive decision problem in which the agent reports a predictive distribution and is evaluated by a proper local scoring rule. This yields a direct link to rate-distortion theory and shows that Shannon entropy emerges endogenously as the honest local utility for predictive refinement. Bernardo's characterization of proper local scoring rules together with Shannon's amalgamation invariance imply that the logarithmic score, and hence mutual information, is the unique information measure consistent with coherent prediction under refinement of the state space. Information costs, therefore, need not be assumed: they arise as expected predictive utility. Within this framework we establish a supported complete-class result: the optimal policies are Gibbs-Boltzmann channels, with the classical rational-inattention family recovered as a special case. Canonical models appear as geometric specializations of the same structure, including multinomial logit (and IIA) under entropic regularization, James-Stein shrinkage as optimal capacity allocation in Gaussian learning, and linear-quadratic-Gaussian control as the capacity-optimal Gaussian channel. Overall, the Bayesian predictive formulation reframes bounded rationality as an optimal design principle: finite information capacity is an endogenous solution to a well-posed predictive problem, and behaviors often attributed to cognitive frictions, soft choice, regularization, sparsity, and screening arise as rational responses to the geometry of predictive refinement."}
{"id": "2512.21443", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21443", "abs": "https://arxiv.org/abs/2512.21443", "authors": ["S. M. Mallikarjunaiah"], "title": "An $hp$-adaptive finite element framework for static cracks: The impact of pointwise density variations on mode I, mode II, and mixed-mode fracture", "comment": null, "summary": "A robust $hp$-adaptive finite element framework is presented for the investigation of static cracks in materials characterized by complex, pointwise density variations. Within such heterogeneous media, the equilibrium equation governed by the divergence of the stress tensor is reduced to a vector-valued quasilinear partial differential equation, wherein significant gradients and nonlinearities are introduced into the governing constitutive relations by spatial density variations. To ensure that these localized field variables are accurately captured, an automated $hp$-refinement strategy is implemented so that element sizes ($h$) and polynomial degrees ($p$) are concurrently optimized. A dual-indicator approach is employed by the framework. In this approach, $h$-refinement is driven by the Kelly error estimator, which utilizes the jump of the normal derivative across element interfaces, while $p$-refinement is determined by the decay of Legendre-Fourier coefficients to assess the local smoothness of the solution. Optimal convergence rates are ensured by this dual-refinement strategy, particularly within the singular regions surrounding the crack tip where material heterogeneities and geometric discontinuities intersect. The performance of the proposed method is rigorously evaluated across three distinct loading regimes: pure tensile (Mode I), pure shear (Mode II), and mixed-mode loading. It is demonstrated through numerical simulations that the intricate interaction between the fracture process zone and the underlying material heterogeneities is effectively resolved by the $hp$-adaptive scheme. Furthermore, the influence of specific density-dependent constitutive relations on the resulting crack-tip stress fields and strain energy density distributions is analyzed in detail."}
{"id": "2512.21742", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21742", "abs": "https://arxiv.org/abs/2512.21742", "authors": ["Alejandro Caicedo", "Leonid Kolesnikov"], "title": "Sharpness of the percolation phase transition for weighted random connection models", "comment": null, "summary": "We establish the sharpness of the percolation phase transition for a class of infinite-range weighted random connection models. The vertex set is given by a marked Poisson point process on $\\mathbb{R}^d$ with intensity $λ>0$, where each vertex carries an independent weight. Pairs of vertices are then connected independently with a probability that depends on both their spatial displacement and their respective weights. It is well known that such models undergo a phase transition in $λ$ with respect to the existence of an infinite cluster (under suitable assumptions on the connection probabilities and the weight distribution). We prove that in the subcritical regime the cluster-size distribution has exponentially decaying tails, whereas in the supercritical regime the percolation probability grows at least linearly with respect to $λ$ near criticality. Our proof follows the approach of Duminil-Copin, Raoufi, and Tassion, applying the OSSS inequality to a finite-lattice approximation of the continuum model in order to derive a new differential inequality, which we then analyze and pass to the limit. In addition to the classical random connection model, we consider weighted models with unbounded weights satisfying the min-reach condition under which the neighborhood of each vertex is deterministically bounded by a radius depending solely on its weight. Notably, finite range is not assumed -- that is, we allow unbounded edge lengths -- but the weight distribution is required to satisfy appropriate moment conditions. We expect that our method extends to a broad class of weighted random connection models."}
{"id": "2512.21341", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21341", "abs": "https://arxiv.org/abs/2512.21341", "authors": ["Abdelhamid Moussaoui"], "title": "Novel Perturbed b-Metric and Perturbed Extended b-Metric Spaces with Banach-Type Fixed Point Theorem", "comment": null, "summary": "In this paper, we introduce a new general framework, called \\emph{perturbed extended $b$-metric spaces}, denoted by $(X,\\mathcal{D}_ζ,\\hbar)$, which extends the classical and extended $b$-metric structures through the inclusion of an explicit perturbation mapping $\\hbar$. This formulation is motivated by the observation that distance measurements in many analytical and applied contexts are often affected by intrinsic or external deviations that cannot be captured by the usual metric-type geometries. We also identify a meaningful specialization arising when the control function $ζ$ is constant, leading to the notion of a \\emph{perturbed $b$-metric space}, introduced here as a natural restriction of the general framework.\n  We establish several fundamental properties of spaces of the form $(X,\\mathcal{D}_ζ,\\hbar)$ and develop a Banach-type fixed point theorem in the perturbed extended $b$-metric setting. Conditions ensuring the existence and uniqueness of fixed points of a self-map $T:X\\to X$ are derived, together with convergence of Picard iterations $T^{n}v \\to \\vartheta$. Illustrative examples are provided to show that the presence of the perturbation term $\\hbar$, together with the influence of the control function $ζ$, may cause $\\mathcal{D}_ζ$ to lose the usual extended $b$-metric behaviour and prevent $\\mathcal{D}_ζ$ from satisfying the standard extended $b$-metric axioms. We further discuss natural extensions of this perturbation philosophy to multi-point settings, encompassing $S$-metric spaces and their extended and $S_b$-metric variants. The results presented here open new directions for the study of contractive operators and fixed point theory in generalized metric environments."}
{"id": "2512.21700", "categories": ["math.ST", "stat.CO", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.21700", "abs": "https://arxiv.org/abs/2512.21700", "authors": ["Xueying Sun", "Ting Yan", "Binyan Jiang"], "title": "Inference in the $p_0$ model for directed networks under local differential privacy", "comment": null, "summary": "We explore the edge-flipping mechanism, a type of input perturbation, to release the directed graph under edge-local differential privacy. By using the noisy bi-degree sequence from the output graph, we construct the moment equations to estimate the unknown parameters in the $p_0$ model, which is an exponential family distribution with the bi-degree sequence as the natural sufficient statistic. We show that the resulting private estimator is asymptotically consistent and normally distributed under some conditions. In addition, we compare the performance of input and output perturbation mechanisms for releasing bi-degree sequences in terms of parameter estimation accuracy and privacy protection. Numerical studies demonstrate our theoretical findings and compare the performance of the private estimates obtained by different types of perturbation methods. We apply the proposed method to analyze the UC Irvine message network."}
{"id": "2512.21489", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21489", "abs": "https://arxiv.org/abs/2512.21489", "authors": ["Dinh Dũng"], "title": "Laguerre- and Laplace-weighted integration of mixed-smoothness functions", "comment": null, "summary": "We investigate the approximation of generalized Laguerre- or Laplace-weighted integrals over $\\mathbb{R}^d_+$ or $\\mathbb{R}^d$ of functions from generalized Laguerre- or Laplace-weighted Sobolev spaces of mixed smoothness, respectively. We prove upper and lower bounds of the convergence rate of optimal quadratures with respect to $n$ integration nodes for functions from these spaces. The upper bound is performed by sparse-grid quadratures with integration nodes on step hyperbolic corners or hyperbolic crosses in the function domain $\\mathbb{R}^d_+$ or $\\mathbb{R}^d$, respectively."}
{"id": "2512.21977", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.21977", "abs": "https://arxiv.org/abs/2512.21977", "authors": ["Umberto De Ambroggio", "Luca Makowiec"], "title": "Repeat times and a two-weight UST model", "comment": "32 pages. Comments are welcome!", "summary": "We study a model of random weighted uniform spanning trees on the complete graph with $n$ vertices, where each edge is assigned a weight of $n^{1+γ}$ with probability $1/n$ and $1$ otherwise. Whenever $γ$ is large enough, we prove that the diameter of the resulting tree is typically of order $n^{1/3} \\log n$, up to a $\\log \\log n$ correction. Our approach uses estimates on repeat times for selecting components in a critical Erdős-Rényi graph, as well as concentration bounds on the sums of diameters of these components."}
{"id": "2512.21350", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.21350", "abs": "https://arxiv.org/abs/2512.21350", "authors": ["Shreehari Anand Bodas", "Harsha Honnappa", "Michel Mandjes", "Liron Ravner"], "title": "A stochastic optimization algorithm for revenue maximization in a service system with balking customers", "comment": null, "summary": "This paper analyzes a service system modeled as a single-server queue, in which the service provider aims to dynamically maximize the expected revenue per unit of time. This is achieved by constructing a stochastic gradient descent algorithm that dynamically adjusts the price. A key feature of our modeling framework is that customers may choose to balk - that is, decide not to join - when facing high congestion. A notable strength of our approach is that the revenue-maximizing algorithm relies solely on information about effective arrivals, meaning that only the behavior of customers who choose not to balk is observable and used in decision-making. This results in an elaborate interplay between the pricing policy and the effective arrival process, yielding a non-standard state dependent queueing process. An important contribution of our work concerns a novel Infinitesimal Perturbation Analysis (IPA) procedure that is able to consistently estimate the stationary effective arrival rate. This is further leveraged to construct an iterative algorithm that converges, under mild regularity conditions, to the optimal price with provable asymptotic guarantees."}
{"id": "2512.21806", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.21806", "abs": "https://arxiv.org/abs/2512.21806", "authors": ["Douglas P. Wiens"], "title": "Optimal Robust Bounded Bias and Bounded Variance Designs", "comment": null, "summary": "Designs which are minimax in the presence of model misspecifications have been constructed so as to minimize the maximum, over classes of alternate response models, of the integrated mean squared error of the predicted values. This mean squared error decomposes into a term arising solely from variation, and a bias term arising from the model errors. Here we consider two associated problems: (i) design so as to minimize the variance, subject to a bound on the bias, and (ii) design so as to minimize the bias, subject to a bound on the variance. We show that solutions to both problems are given by the minimax designs, with appropriately chosen values of their tuning constant. Conversely, any minimax design solves both problems for appropriate choices of the bounds on the bias or variance."}
{"id": "2512.21588", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21588", "abs": "https://arxiv.org/abs/2512.21588", "authors": ["Sudheer Mishra", "Sundararajan Natarajan", "Natarajan E"], "title": "A stabilized virtual element framework for the steady state Boussinesq equation with temperature-dependent parameters", "comment": null, "summary": "This work presents a new conforming stabilized virtual element method for the generalized Boussinesq equation with temperature-dependent viscosity and thermal conductivity. A gradient-based local projection stabilization method is introduced in the discrete formulation to circumvent the violation of the discrete inf-sup condition. The well-posedness of the continuous problem is established under sufficiently small datum. We derive a stabilized virtual element problem for the Boussinesq equation using equal-order virtual element approximations. The proposed method has several advantages, such as being more straightforward to implement, free from higher-order derivative terms, providing separate stabilization terms without introducing coupling between solution components, and minimizing the number of globally coupled degrees of freedom. The existence of a discrete solution to the stabilized virtual element problem is demonstrated using the Brouwer fixed-point theorem. The error estimates are derived in the energy norm. Additionally, several numerical examples are presented to show the efficiency and robustness of the proposed method, confirming the theoretical results."}
{"id": "2512.21350", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.21350", "abs": "https://arxiv.org/abs/2512.21350", "authors": ["Shreehari Anand Bodas", "Harsha Honnappa", "Michel Mandjes", "Liron Ravner"], "title": "A stochastic optimization algorithm for revenue maximization in a service system with balking customers", "comment": null, "summary": "This paper analyzes a service system modeled as a single-server queue, in which the service provider aims to dynamically maximize the expected revenue per unit of time. This is achieved by constructing a stochastic gradient descent algorithm that dynamically adjusts the price. A key feature of our modeling framework is that customers may choose to balk - that is, decide not to join - when facing high congestion. A notable strength of our approach is that the revenue-maximizing algorithm relies solely on information about effective arrivals, meaning that only the behavior of customers who choose not to balk is observable and used in decision-making. This results in an elaborate interplay between the pricing policy and the effective arrival process, yielding a non-standard state dependent queueing process. An important contribution of our work concerns a novel Infinitesimal Perturbation Analysis (IPA) procedure that is able to consistently estimate the stationary effective arrival rate. This is further leveraged to construct an iterative algorithm that converges, under mild regularity conditions, to the optimal price with provable asymptotic guarantees."}
{"id": "2512.21469", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.21469", "abs": "https://arxiv.org/abs/2512.21469", "authors": ["Daiki Tsuzuki", "Kentaro Ohki"], "title": "Convergence Analysis of Natural Power Method and Its Applications to Control", "comment": "6 pages. submitted", "summary": "This paper analyzes the discrete-time natural power method, demonstrating its convergence to the dominant $r$-dimensional subspace corresponding to the $r$ eigenvalues with the largest absolute values. This contrasts with the Oja flow, which targets eigenvalues with the largest real parts. We leverage this property to develop methods for model order reduction and low-rank controller synthesis for discrete-time LTI systems, proving preservation of key system properties. We also extend the low-rank control framework to slowly-varying LTV systems, showing its utility for tracking time-varying dominant subspaces."}
{"id": "2512.21981", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.21981", "abs": "https://arxiv.org/abs/2512.21981", "authors": ["Rami V. Tabri"], "title": "A Sieve-based Estimator for Entropic Optimal Transport", "comment": null, "summary": "The entropically regularized optimal transport problem between probability measures on compact Euclidean subsets can be represented as an information projection with moment inequality constraints. This allows its Fenchel dual to be approximated by a sequence of convex, finite-dimensional problems using sieve methods, enabling tractable estimation of the primal value and dual optimizers from samples. Assuming only continuity of the cost function, I establish almost sure consistency of these estimators. I derive a finite-sample convergence rate for the primal value estimator, showing logarithmic dependence on sieve complexity, and quantify uncertainty for the dual optimal value estimator via matching stochastic bounds involving suprema of centered Gaussian processes. These results provide the first statistical guarantees for sieve-based estimators of entropic optimal transport, extending beyond the empirical Sinkhorn approach."}
{"id": "2512.21656", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21656", "abs": "https://arxiv.org/abs/2512.21656", "authors": ["Yingying Yu", "Yashu Liu", "Jiaxuan Li", "Xin Li", "Ye Ji", "Chungang Zhu"], "title": "Regularity analysis and verification of Coons volume mappings", "comment": null, "summary": "The Coons volume provides a classical approach for constructing three-dimensional parametric mappings via boundary surface interpolation and is widely employed in volumetric mesh generation, computer-aided geometric design, and isogeometric analysis. However, due to curvature variations and continuity limitations of the boundary surfaces, the Jacobian determinant of a Coons volume may locally vanish or become negative, resulting in a non-regular mapping. This undermines mesh quality and compromises the stability of subsequent numerical computations. Ensuring the regularity of Coons volumes is therefore critical for robust parametric modeling. This paper develops a systematic framework for analyzing and verifying the regularity of Coons volumes. We first derive a general sufficient condition applicable to arbitrary boundary parameterizations, independent of specific analytical forms. For Bézier-form Coons volumes, we introduce a criterion based on the Bézier coefficients of the Jacobian determinant, transforming the verification problem into checking the positivity of control coefficients. Furthermore, we construct a necessary condition by applying a subdivision strategy combined with the Bézier blossoming technique, ensuring that regularity is preserved in all subdomains. By integrating these conditions, we design an efficient verification algorithm whose correctness and computational performance are validated through numerical experiments. We observe that the regularity of a Coons volume is closely related to the geometric similarity of its opposite boundary surfaces. Moreover, through Bézier extraction, the algorithm is extended to multi-patch B-spline volumes of arbitrary topology. Numerical tests show that the method completes regularity verification in milliseconds, enabling real-time application."}
{"id": "2512.21504", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.21504", "abs": "https://arxiv.org/abs/2512.21504", "authors": ["Xiaoda Xu", "Jun Xian"], "title": "Expected star discrepancy based on stratified sampling", "comment": null, "summary": "We present two main contributions to the expected star discrepancy theory. First, we derive a sharper expected upper bound for jittered sampling, improving the leading constants and logarithmic terms compared to the state-of-the-art [Doerr, 2022]. Second, we prove the strong partition principle for star discrepancy, showing that any equal-measure stratified sampling yields a strictly smaller expected discrepancy than simple random sampling, thereby resolving an open question in [Kiderlen and Pausinger, 2022]. Numerical simulations confirm our theoretical advances and illustrate the superiority of stratified sampling in low to moderate dimensions."}
{"id": "2512.21585", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21585", "abs": "https://arxiv.org/abs/2512.21585", "authors": ["Lijun Bo", "Dongfang Yang", "Shihua Wang"], "title": "Dynamic Data Pricing: A Mean Field Stackelberg Game Approach", "comment": "30 pages", "summary": "This paper studies the dynamic pricing mechanism for data products in demand-driven markets through a game-theoretic framework. We develop a three-tier Stackelberg game model to capture the hierarchical strategic interactions among key market entities: a single data buyer, an intermediary broker, and a competitive seller group. To characterize the temporal dynamics of data quality evolution, we establish a coupled system of stochastic differential equations (SDEs) where sellers' quality investments interact through mean field effects. Given exogenous pricing policies, we derive approximate Nash equilibrium adjustment strategies for competitive sellers using the mean field game (MFG) approach. The broker's optimal pricing strategy is subsequently established by solving a Stackelberg leadership problem, while the buyer's procurement policy is determined through an optimal control formulation involving conditional mean field forward-backward SDEs (FBSDEs). Under some regularity conditions, the proposed strategies are shown to collectively form an $(ε_1,ε_2,ε_3)$-Stackelberg equilibrium."}
{"id": "2512.21744", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21744", "abs": "https://arxiv.org/abs/2512.21744", "authors": ["Katherina Bick", "Reinhard Nabben"], "title": "Factorized sparse approximate inverse preconditioning for singular M-matrices", "comment": "Preprint 17 pages", "summary": "Here we consider the factorized sparse approximate inverse (FSAI) preconditioner. We apply the FSAI preconditioner to singular irreducible M-matrices. These matrices arise e.g. in discrete Markov chain modeling or as graph Laplacians. We show, that there are some restrictions on the nonzero pattern needed for a stable construction of the FSAI preconditioner in this case. With these restrictions FSAI is well-defined. Moreover, we proved that the FSAI preconditioner shares some important properties with the original system. The lower triangular matrix $L_G$ and the upper triangular matrix $U_G$, generated by FSAI, are non-singular and non-negative. The diagonal entries of $L_GAU_G$ are positive and $L_GAU_G$, the preconditioned matrix, is a singular M-matrix. Even more, we establish that a (1,2)-inverse is computed for the complete nonzero patter."}
{"id": "2512.21620", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21620", "abs": "https://arxiv.org/abs/2512.21620", "authors": ["Sumit Roy"], "title": "A Mathematical Model to Predict Growth and Treatment for UPS Cancer", "comment": null, "summary": "We study how a fast-growing cancer Undifferentiated Pleomorphic Sarcoma (UPS) grows and how well treatments work. We create a set of equations to describe the tumor's life. We look at four main things: how surgery removes the mass, how the body heals after surgery, the best time to give radiation using on-off rules, and how the immune system fights the cancer. We checked our results against real data, and they match very well. This work helps us predict how a patient will do after treatment."}
{"id": "2512.21821", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.21821", "abs": "https://arxiv.org/abs/2512.21821", "authors": ["Lingyun Qiu", "Shenwen Yu"], "title": "Optimal-Transport Stability of Inverse Point-Source Problems for Elliptic and Parabolic Equations", "comment": null, "summary": "We establish quantitative global stability estimates, formulated in terms of optimal transport (OT) cost, for inverse point-source problems governed by elliptic and parabolic equations with spatially varying coefficients. The key idea is that the Kantorovich dual potential can be represented as a boundary functional of suitable adjoint solutions, thereby linking OT geometry with boundary observations. In the elliptic case, we construct complex geometric optics solutions that enforce prescribed pointwise constraints, whereas in the parabolic case we employ controllable adjoint solutions that transfer interior information to the boundary. Under mild regularity and separation assumptions, we obtain estimates of the form \\[ \\mathcal{T}_c(μ,ν) \\le C\\,\\|u_1 - u_2\\|_{L^2(\\partialΩ)} \\quad \\text{and} \\quad \\mathcal{T}_c(μ,ν) \\le C\\,\\|u_1 - u_2\\|_{L^2(\\partialΩ\\times[0,T])}, \\] where $μ$ and $ν$ are admissible point-source measures. These results provide a unified analytical framework connecting inverse source problems and optimal transport, and establish OT-based stability theory for inverse source problems governed by partial differential equations with spatially varying coefficients."}
{"id": "2512.21630", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21630", "abs": "https://arxiv.org/abs/2512.21630", "authors": ["Manali Dutta", "Rahul Singh", "Shalabh Bhatnagar"], "title": "Jointly Optimal Policies for Remote Estimation of Autoregressive Markov Processes over Time-Correlated Fading Channel", "comment": null, "summary": "We study a remote estimation setup with an autoregressive (AR) Markov process, a sensor, and a remote estimator. The sensor observes the process and sends encoded observations to the estimator as packets over an unreliable communication channel modeled as the Gilbert-Elliot (GE) channel. We assume that the sensor gets to observe the channel state by the ACK/NACK feedback mechanism only when it attempts a transmission while it does not observe the channel state when no transmission attempt is made. The objective is to design a transmission scheduling strategy for the sensor, and an estimation strategy for the estimator that are jointly optimal, i.e., they minimize the expected value of an infinite-horizon cumulative discounted cost defined as the sum of squared estimation error over time and the sensor's transmission power. Since the sensor and the estimator have access to different information sets, this constitutes a decentralized stochastic control problem. We formulate this problem as a partially observed Markov decision process (POMDP) and show the existence of jointly optimal transmission and estimation strategies that have a simple structure. More specifically, an optimal transmission strategy exhibits a threshold structure, i.e., the sensor attempts a transmission only when its belief about the channel being in a good state exceeds a threshold that depends on a certain error. Moreover, an optimal estimation strategy follows a `Kalman-like' update rule. When the channel parameters are unknown, we exploit this structure to design an actor-critic reinforcement learning algorithm that converges to a locally optimal policy. Simulations show the learned policy performs close to a globally optimal one, with about a 5.5% average relative gap across evaluated parameters."}
{"id": "2512.21838", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21838", "abs": "https://arxiv.org/abs/2512.21838", "authors": ["Xiaoda Xu"], "title": "Weighted $L_p$-Discrepancy Bounds for Parametric Stratified Sampling and Applications to High-Dimensional Integration", "comment": null, "summary": "This paper studies the expected $L_p$-discrepancy ($2 \\leq p < \\infty$) for stratified sampling schemes under importance sampling. We introduce a parametric family of equivolume partitions $Ω_{θ,\\sim}$ and leverage recent exact formulas for the expected $L_2$-discrepancy \\cite{xian2025improved}. Our main contribution is a weighted discrepancy reduction lemma that relates weighted $L_p$-discrepancy to standard $L_p$-discrepancy with explicit constants depending on the weight function. For $p=2$, we obtain explicit bounds using the exact discrepancy formulas. For $p>2$, we derive probabilistic bounds via dyadic chaining techniques. The results yield uniform error estimates for multivariate integration in Sobolev spaces $\\mathcal{H}^1(K)$ and $F^*_{d,q}$, demonstrating improved performance over classical jittered sampling in importance sampling scenarios. Numerical experiments validate our theoretical findings and illustrate the practical advantages of parametric stratified sampling."}
{"id": "2512.21731", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21731", "abs": "https://arxiv.org/abs/2512.21731", "authors": ["Stefan Pilot", "Murwan Siddig"], "title": "Sequential Decision-making for Ride-hailing Fleet Control: A Unifying Perspective", "comment": null, "summary": "This paper provides a unified framework for the problem of controlling a fleet of ride-hailing vehicles under stochastic demand. We introduce a sequential decision-making model that consolidates several problem characteristics and can be easily extended to include additional characteristics. To solve the problem, we design an efficient procedure for enumerating all feasible vehicle-to-request assignments, and we introduce scalable techniques to deal with the exploration-exploitation tradeoff. We construct reusable benchmark instances that are based on real-world data and that capture a range of spatial structures and demand distributions. Our proposed modelling framework, policies and benchmark instances allow us to analyze interactions between problem characteristics that were not previously studied. We find no significant difference between revenue generated by internal combustion engine fleets and fast-charging electric fleets, but both significantly outperform slow-charging electric fleets. We also find that pooling increases the revenue, and reduces revenue variability, for all fleet types. Our contributions can help coordinate the significant research effort that this problem continues to receive."}
{"id": "2512.21891", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21891", "abs": "https://arxiv.org/abs/2512.21891", "authors": ["Fatma Zürnacı-Yetiş"], "title": "Non-polynomial divided difference and blossoming", "comment": null, "summary": "Two notable examples of dual functionals in approximation theory and computer-aided geometric design are the blossom and the divided difference operator. Both of these dual functionals satisfy a similar set of formulas and identities. Moreover, the divided differences of polynomials can be expressed in terms of the blossom. In this paper, an extended non-polynomial homogeneous blossom for a wide collection of spline spaces, including trigonometric splines, hyperbolic splines, and special Müntz spaces of splines, is defined. It is shown that there is a relation between the non-polynomial divided difference and the blossom, which is analogous to the polynomial case."}
{"id": "2512.21812", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21812", "abs": "https://arxiv.org/abs/2512.21812", "authors": ["James Saunderson"], "title": "Sparsification of sums with respect to convex cones", "comment": "31 pages", "summary": "Let $x_1,x_2,\\ldots,x_m$ be elements of a convex cone $K$ such that their sum, $e$, is in the relative interior of $K$. An $ε$-sparsification of the sum involves taking a subset of the $x_i$ and reweighting them by positive scalars, so that the resulting sum is $ε$-close to $e$, where error is measured in a relative sense with respect to the order induced by $K$. This generalizes the influential spectral sparsification model for sums of positive semidefinite matrices.\n  This paper introduces and studies the sparsification function of a convex cone, which measures, in the worst case over all possible sums from the cone, the smallest size of an $ε$-sparsifier. The linear-sized spectral sparsification theorem of Batson, Spielman, and Srivastava can be viewed as a bound on the sparsification function of the cone of positive semidefinite matrices. This result is generalized to a family of convex cones (including all hyperbolicity cones) that admit a $ν$-logarithmically homogeneous self-concordant barrier with certain additional properties. For these cones, the sparsification function is bounded above by $\\lceil4ν/ε^2\\rceil$. For general convex cones that only admit an ordinary $ν$-logarithmically homogeneous self-concordant barrier, the sparsification function is bounded above by $\\lceil(4ν/ε)^2\\rceil$. Furthermore, the paper explores how sparsification functions interact with various convex geometric operations (such as conic lifts), and describes implications of sparsification with respect to cones for certain conic optimization problems."}
{"id": "2512.22006", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.22006", "abs": "https://arxiv.org/abs/2512.22006", "authors": ["Jinsil Lee", "Youngjoon Hong", "Seungchan Ko", "Jae Yong Lee"], "title": "Data-free Asymptotics-Informed Operator Networks for Singularly Perturbed PDEs", "comment": null, "summary": "Recent advances in machine learning (ML) have opened new possibilities for solving partial differential equations (PDEs), yet robust performance in challenging regimes remains limited. In particular, singularly perturbed differential equations exhibit sharp boundary or interior layers with rapid transitions, where standard ML surrogates often fail without extensive resolution. Generating training data for such problems is also costly, as accurate reference solutions typically require massive adaptive mesh refinement. In this work, we propose eFEONet, an enriched Finite Element Operator Network tailored to singularly perturbed problems. Guided by classical singular perturbation theory, eFEONet augments the operator-learning framework with specialized enrichment basis functions that encode the asymptotic structure of layer solutions. This design enables accurate approximation of sharp transitions without relying on large datasets, and can operate with minimal supervision-or even in a data-free manner under appropriate settings. We further provide a rigorous convergence analysis of the proposed method and demonstrate its effectiveness through extensive experiments on representative problems featuring both boundary and interior layers."}
{"id": "2512.21918", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21918", "abs": "https://arxiv.org/abs/2512.21918", "authors": ["Misir J. Mardanov", "Telman K. Melikov", "Samin T. Malik"], "title": "On sufficient conditions in the classical problem of the calculus of variations", "comment": "Dear Colleagues, We sent you tex file of our manuscript for possible publication in arxiv.org. With best regards, Misir J.Mardanov", "summary": "This article is devoted to obtain new sufficient conditions for an extremum in problems of classical calculus of variations. The concept of a set of integrands is introduced. Using this concept, first and second order sufficient conditions for a weak and strong local minimum, as well as an absolute minimum were obtained. Also, this concept, in particular, allows us to define a class of variation problems for which the necessary Weierstrass condition is also sufficient condition. It is shown that the sufficient conditions for a minimum obtained here have new areas of application compared to the known sufficient conditions of the classical calculus of variations. The effectiveness of the obtained results is illustrated by examples."}
{"id": "2512.21972", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21972", "abs": "https://arxiv.org/abs/2512.21972", "authors": ["Xin Xu"], "title": "On Convergence of Regularized Barzilai-Borwein Method", "comment": "17 pages, 3 figures", "summary": "The regularized Barzilai-Borwein (RBB) method represents a promising gradient-based optimization algorithm. In this paper, by splitting the gradient into two parts and analyzing the dynamical system of difference equations governing the ratio of their magnitudes, we establish that the RBB method achieves R-linear convergence for strongly convex quadratic functions of arbitrary dimensions. Specifically, for the two-dimensional case, we provide a concise proof demonstrating that the method exhibits at least R-linear convergence. We propose a simple yet effective adaptive regularization parameter scheme to further improve its performance. A typical numerical example verifies the effectiveness of this scheme."}
{"id": "2512.21986", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21986", "abs": "https://arxiv.org/abs/2512.21986", "authors": ["Thai P. D. Nguyen", "Hong T. M. Chu", "Kim-Chuan Toh"], "title": "Time-integrated Optimal Transport: A Robust Minimax Framework", "comment": null, "summary": "Comparing time series in a principled manner requires capturing both temporal alignment and distributional similarity of features. Optimal transport (OT) has recently emerged as a powerful tool for this task, but existing OT-based approaches often depend on manually selected balancing parameters and can be computationally intensive. In this work, we introduce the Time-integrated Optimal Transport (TiOT) framework, which integrates temporal and feature components into a unified objective and yields a well-defined metric on the space of probability measures. This metric preserves fundamental properties of the Wasserstein distance, while avoiding the need for parameter tuning. To address the corresponding computational challenges, we introduce an entropic regularized approximation of TiOT, which can be efficiently solved using a block coordinate descent algorithm. Extensive experiments on both synthetic and real-world time series datasets demonstrate that our approach achieves improved accuracy and stability while maintaining comparable efficiency."}
{"id": "2512.21989", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21989", "abs": "https://arxiv.org/abs/2512.21989", "authors": ["Thomas Bartz-Beielstein", "Eva Bartz", "Alexander Hinterleitner", "Christoph Leitenmeier", "Ihab Abd El Hussein"], "title": "Multi-Objective Optimization with Desirability and Morris-Mitchell Criterion", "comment": null, "summary": "Existing experimental designs in industry are often unplanned, biased, and lack optimal space-filling properties, making them unrepresentative of the input space. This article presents an approach to improve such designs by increasing coverage quality while simultaneously optimizing experimental results. We utilize the intensified Morris-Mitchell criterion, a size-invariant extension of the standard criterion, to quantify and improve input space coverage for existing designs. Using the Python package spotdesirability, we define a multi-objective desirability function that combines predictions from surrogate models (Random Forest) with the Morris-Mitchell improvement into a single score. This approach is demonstrated using a case study from compressor development, optimizing two performance objectives alongside the space-filling criterion. The Python package spotoptim is used for the optimization, and infill-point plots are introduced to visualize the placement of new design points relative to existing ones. This methodology effectively balances the exploration-exploitation trade-off in multi-objective optimization."}
{"id": "2512.22038", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.22038", "abs": "https://arxiv.org/abs/2512.22038", "authors": ["Wataru Nozawa"], "title": "Mean-Field Analysis and Optimal Control of a Dynamic Rating and Matchmaking System", "comment": null, "summary": "Large-scale competitive platforms are interacting multi-agent systems in which latent skills drift over time and pairwise interactions are shaped by matchmaking. We study a controlled rating dynamics in the mean-field limit and derive a kinetic description for the joint evolution of skills and ratings. In the Gaussian regime, we prove an exact moment closure and obtain a low-dimensional deterministic state dynamics for rating accuracy. This yields three main insights. First, skill drift imposes an intrinsic ceiling on long-run accuracy (the ``Red Queen'' effect). Second, with period-by-period scale control, the information content of interactions satisfies an invariance principle: under signal-matched scaling, the one-step accuracy transition is independent of matchmaking intensity. Third, the optimal platform policy separates: filtering is implemented by a greedy choice of the gain and rating scale, while matchmaking reduces to a static trade-off between match utility and sorting costs."}
