{"id": "2512.20737", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.20737", "abs": "https://arxiv.org/abs/2512.20737", "authors": ["Dimitrios Antonopoulos", "Dimitrios Mitsotakis"], "title": "A dichotomy of finite element spaces and its application to an energy-conservative scheme for the regularized long wave equation", "comment": null, "summary": "Certain energy-conservative Galerkin discretizations for nonlinear dispersive wave equations have revealed an unusual convergence behavior: optimal convergence is attained when continuous Lagrange finite element spaces of odd polynomial degree are employed, whereas the use of even-degree polynomials leads to reduced accuracy. The present work demonstrates that this behavior is intrinsic to the structure of the finite element spaces themselves. In particular, it is shown to be closely connected to the standard $L^2$-projection of derivatives, which possesses a super-approximation property exclusively for odd polynomial degrees. We also examine the implications of this feature for an energy-conservative Galerkin approximation of the regularized long-wave equation where the energy is a cubic functional. Although the resulting scheme conserves both mass and energy, we further show that the impulse is approximated with high accuracy, and we establish {\\em a priori} error bounds for the associated semi-discrete formulation."}
{"id": "2512.20750", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.20750", "abs": "https://arxiv.org/abs/2512.20750", "authors": ["V. N. Temlyakov"], "title": "On stability of Weak Greedy Algorithm in the presence of noise", "comment": null, "summary": "This paper is devoted to the theoretical study of the efficiency, namely, stability of some greedy algorithms. In the greedy approximation theory researchers are mostly interested in the following two important properties of an algorithm -- convergence and rate of convergence. In this paper we present some results on one more important property of an algorithm -- stability. Stability means that small perturbations do not result in a large change in the outcome of the algorithm. In this paper we discuss one kind of perturbations -- noisy data."}
{"id": "2512.20763", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.20763", "abs": "https://arxiv.org/abs/2512.20763", "authors": ["Tim Brüers", "Christoph Lehrenfeld", "Max Wardetzky"], "title": "Streamfunction-vorticity formulation for incompressible viscid and inviscid flows on general surfaces", "comment": null, "summary": "This paper presents a streamfunction-vorticity formulation for the Navier--Stokes and Euler equations on general surfaces. Notably, this includes non-simply connected surfaces, on which the harmonic components of the velocity field play a fundamental role in the dynamics. By relying only on scalar and finite-dimensional quantities, our formulation ensures that the resulting methods give exactly tangential and incompressible velocity fields, while also being pressure robust. Compared to traditional methods based on velocity-pressure formulations, where one can only guarantee these structural properties by increasing the computational costs, this is a key advantage. We rigorously validate our formulation by proving its equivalence to the well understood velocity-pressure formulation under reasonable regularity assumptions. Furthermore, we demonstrate the applicability of the approach with numerical examples."}
{"id": "2512.20840", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.20840", "abs": "https://arxiv.org/abs/2512.20840", "authors": ["Valeria Banica", "Georg Maierhofer", "Katharina Schratz"], "title": "Computing nonlinear Schrödinger equations with Hermite functions beyond harmonic traps", "comment": null, "summary": "Hermite basis functions are a powerful tool for spatial discretisation of Schrödinger equations with harmonic potential. In this work we show that their stability properties extend to the simulation of Schrödinger equations without potential, thus leading them as a natural basis for computation of nonlinear dispersive equations on unbounded domains."}
{"id": "2512.20914", "categories": ["math.ST", "stat.AP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.20914", "abs": "https://arxiv.org/abs/2512.20914", "authors": ["Ian Bounos", "Pablo Groisman", "Mariela Sued", "Esteban Tabak"], "title": "Invariant Feature Extraction Through Conditional Independence and the Optimal Transport Barycenter Problem: the Gaussian case", "comment": null, "summary": "A methodology is developed to extract $d$ invariant features $W=f(X)$ that predict a response variable $Y$ without being confounded by variables $Z$ that may influence both $X$ and $Y$.\n  The methodology's main ingredient is the penalization of any statistical dependence between $W$ and $Z$ conditioned on $Y$, replaced by the more readily implementable plain independence between $W$ and the random variable $Z_Y = T(Z,Y)$ that solves the [Monge] Optimal Transport Barycenter Problem for $Z\\mid Y$. In the Gaussian case considered in this article, the two statements are equivalent.\n  When the true confounders $Z$ are unknown, other measurable contextual variables $S$ can be used as surrogates, a replacement that involves no relaxation in the Gaussian case if the covariance matrix $Σ_{ZS}$ has full range. The resulting linear feature extractor adopts a closed form in terms of the first $d$ eigenvectors of a known matrix. The procedure extends with little change to more general, non-Gaussian / non-linear cases."}
{"id": "2512.20818", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.20818", "abs": "https://arxiv.org/abs/2512.20818", "authors": ["S. N. Ethier", "L. Stefanello"], "title": "Long-term behavior of casino games", "comment": "27 pages, 1 figure", "summary": "We study the asymptotic behavior of the ratio of total return (or total profit) to total amount bet in a casino game. While the limit is well understood when the sequence of wagers is independent and identically distributed, here we consider the case in which bet sizes vary over time and may depend on past outcomes. We propose a general framework that yields such results under mild conditions on the conditional expectations of bets, returns, and profits. The set-up applies to many casino games (including compound games and those in which wagers are not immediately resolved), expressing the long-term behavior in terms of intrinsic parameters, namely return to player (RTP) and house advantage (HA). As an application, we examine the roulette win documented in Leigh's (1976) Thirteen against the Bank and attempt to quantify the likelihood that the story is true."}
{"id": "2512.20772", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.20772", "abs": "https://arxiv.org/abs/2512.20772", "authors": ["Daniel Cortild", "Meggie Marschner", "Mathias Staudigl"], "title": "Regularization methods for solving hierarchical variational inequalities with complexity guarantees", "comment": null, "summary": "We consider hierarchical variational inequality problems, or more generally, variational inequalities defined over the set of zeros of a monotone operator. This framework includes convex optimization over equilibrium constraints and equilibrium selection problems. In a real Hilbert space setting, we combine a Tikhonov regularization and a proximal penalization to develop a flexible double-loop method for which we prove asymptotic convergence and provide rate statements in terms of gap functions. Our method is flexible, and effectively accommodates a large class of structured operator splitting formulations for which fixed-point encodings are available. Finally, we validate our findings numerically on various examples."}
{"id": "2512.20844", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.20844", "abs": "https://arxiv.org/abs/2512.20844", "authors": ["Weizhang Huang", "Zhuoran Wang"], "title": "Parameter-free inexact block Schur complement preconditioning for linear poroelasticity under a hybrid Bernardi-Raugel and weak Galerkin finite element discretization", "comment": null, "summary": "This work investigates inexact block Schur complement preconditioning for linear poroelasticity problems discretized using a hybrid approach: Bernardi-Raugel elements for solid displacement and lowest-order weak Galerkin elements for fluid pressure. When pure Dirichlet boundary conditions are applied to the displacement, the leading block of the resulting algebraic system becomes almost singular in the nearly incompressible (locking) regime, hindering efficient iterative solution. To overcome this, the system is reformulated as a three-field problem with an inherent regularization that maintains the original solution while ensuring nonsingularity. Analysis shows that both the minimal residual (MINRES) and generalized minimal residual (GMRES) methods, when preconditioned with inexact block diagonal and triangular Schur complement preconditioners, achieve convergence independent of mesh size and the locking parameter for the regularized system. Similar theoretical results are established for the situation with displacement subject to mixed boundary conditions, even without regularization. Numerical experiments in 2D and 3D confirm the benefits of regularization under pure Dirichlet conditions and the robustness of the preconditioners with respect to mesh size and the locking parameter in both boundary condition scenarios. Finally, a spinal cord simulation with discontinuous material parameters further illustrates the effectiveness and robustness of the proposed iterative solvers."}
{"id": "2512.21111", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.21111", "abs": "https://arxiv.org/abs/2512.21111", "authors": ["Alexandra Carpentier", "Nicolas Verzelen"], "title": "Statistical and computational challenges in ranking", "comment": null, "summary": "We consider the problem of ranking $n$ experts according to their abilities, based on the correctness of their answers to $d$ questions. This is modeled by the so-called crowd-sourcing model, where the answer of expert $i$ on question $k$ is modeled by a random entry, parametrized by $M_{i,k}$ which is increasing linearly with the expected quality of the answer. To enable the unambiguous ranking of the experts by ability, several assumptions on $M$ are available in the literature. We consider here the general isotonic crowd-sourcing model, where $M$ is assumed to be isotonic up to an unknown permutation $π^*$ of the experts - namely, $M_{π^{*-1}(i),k} \\geq M_{π^{*-1}(i+1),k}$ for any $i\\in [n-1], k \\in [d]$. Then, ranking experts amounts to constructing an estimator of $π^*$. In particular, we investigate here the existence of statistically optimal and computationally efficient procedures and we describe recent results that disprove the existence of computational-statistical gaps for this problem. To provide insights on the key ideas, we start by discussing simpler and yet related sub-problems, namely sub-matrix detection and estimation. This corresponds to specific instances of the ranking problem where the matrix $M$ is constrained to be of the form $λ\\mathbf 1\\{S\\times T\\}$ where $S\\subset [n], T\\subset [d]$. This model has been extensively studied. We provide an overview of the results and proof techniques for this problem with a particular emphasis on the computational lower bounds based on low-degree polynomial methods. Then, we build upon this instrumental sub-problem to discuss existing results and algorithmic ideas for the general ranking problem."}
{"id": "2512.21026", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21026", "abs": "https://arxiv.org/abs/2512.21026", "authors": ["Rafael Frongillo"], "title": "Minimax Duality in Game-Theoretic Probability", "comment": null, "summary": "Game-theoretic probability uses the structure of gambles to define a concept like probability, but which is more flexible and robust. We show that results in game-theoretic probability can be thought of as minimax theorems for specific zero-sum games between two players, Gambler and World. The traditional measure-theoretic versions arise when World must play first. This perspective suggests the possibility of a more general minimax theorem from which a wide array of game-theoretic results would follow. After developing a new framing of game-theoretic probability via gamble spaces, we prove such a theorem for finite time. Applying this minimax theorem to games derived from existing measure-theoretic statements, we prove several existing and novel game-theoretic statements. This general minimax theorem can be thought of as a composite Ville's theorem, as we discuss along with future directions."}
{"id": "2512.20791", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.20791", "abs": "https://arxiv.org/abs/2512.20791", "authors": ["Pavel Dvurechensky", "Meggie Marschner", "Shimrit Shtern", "Mathias Staudigl"], "title": "Extragradient methods with complexity guarantees for hierarchical variational inequalities", "comment": null, "summary": "In the framework of a real Hilbert space we consider the problem of approaching solutions to a class of hierarchical variational inequality problems, subsuming several other problem classes including certain mathematical programs under equilibrium constraints, constrained min-max problems, hierarchical game problems, optimal control under VI constraints, and simple bilevel optimization problems. For this general problem formulation, we establish rates of convergence in terms of suitably constructed gap functions, measuring feasibility gaps and optimality gaps. We present worst-case iteration complexity results on both levels of the variational problem, as well as weak convergence under a geometric weak sharpness condition on the lower level solution set. Our results match and improve the state of the art in terms of their iteration complexity and the generality of the problem formulation."}
{"id": "2512.21164", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21164", "abs": "https://arxiv.org/abs/2512.21164", "authors": ["Jifeng Ge", "Bastien Vieublé", "Juan Zhang"], "title": "Mixed Precision General Alternating-Direction Implicit Method for Solving Large Sparse Linear Systems", "comment": null, "summary": "In this article, we introduce a three-precision formulation of the General Alternating-Direction Implicit method (GADI) designed to accelerate the solution of large-scale sparse linear systems $Ax=b$. GADI is a framework that can represent many existing Alternating-Direction Implicit (ADI) methods. These methods are a class of linear solvers based on a splitting of $A$ such that the solution of the original linear system can be decomposed into the successive computation of easy-to-solve structured subsystems. Our proposed mixed precision scheme for GADI solves these subsystems in low precision to reduce the overall execution time while computing the residual and solution update in high precision to enable the solution to converge to high accuracy. We develop a rounding error analysis of mixed precision GADI that establishes the rates of convergence of the forward and backward errors to certain limiting accuracies. Our analysis also highlights the conditions on the splitting matrices under which mixed precision GADI is guaranteed to converge for a given set of precisions. We then discuss a systematic and robust strategy for selecting the GADI regularization parameter $α$, whose adjustment is critical for performance. Specifically, our proposed strategy makes use of a Gaussian Process Regression (GPR) model trained on a dataset of low-dimensional problems to initialize $α$. Finally, we proceed to a performance analysis of mixed precision GADI on an NVIDIA A100 GPU to validate our approach. Using low precision (Bfloat16 or FP32) to solve the subsystems, we obtain speedups of $2.6\\times$, $1.7\\times$, and $3.1\\times$ over a full double precision GADI implementation on large-scale 2D, 3D convection-diffusion and complex reaction-diffusion problems (up to $1.3\\times 10^{8}$ unknowns), respectively."}
{"id": "2512.21300", "categories": ["math.ST", "math.PR", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.21300", "abs": "https://arxiv.org/abs/2512.21300", "authors": ["Ben Chugg", "Aaditya Ramdas"], "title": "Closed-form empirical Bernstein confidence sequences for scalars and matrices", "comment": "36 pages; 6 figures", "summary": "We derive a new closed-form variance-adaptive confidence sequence (CS) for estimating the average conditional mean of a sequence of bounded random variables. Empirically, it yields the tightest closed-form CS we have found for tracking time-varying means, across sample sizes up to $\\approx 10^6$. When the observations happen to have the same conditional mean, our CS is asymptotically tighter than the recent closed-form CS of Waudby-Smith and Ramdas [38]. It also has other desirable properties: it is centered at the unweighted sample mean and has limiting width (multiplied by $\\sqrt{t/\\log t}$) independent of the significance level. We extend our results to provide a CS with the same properties for random matrices with bounded eigenvalues."}
{"id": "2512.21146", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21146", "abs": "https://arxiv.org/abs/2512.21146", "authors": ["Peng Jin", "Jiaqi Zhou"], "title": "Boundary behavior of continuous-state interacting multi-type branching processes with immigration", "comment": null, "summary": "In this paper, we study continuous-state interacting multi-type branching processes with immigration (CIMBI processes), where inter-specific interactions -- whether competitive, cooperative, or of a mixed type -- are proportional to the product of their type-population masses. We establish sufficient conditions for the CIMBI process to never hit the boundary $\\partial\\mathbb{R}_{+}^{d}$ when starting from the interior of $\\mathbb{R}_{+}^{d}$. Additionally, we present two results concerning boundary attainment. In the first, we consider the diffusion case and prove that when the constant immigration rate is small and diffusion noise is present in each direction, the CIMBI process will almost surely hit the boundary $\\partial\\mathbb{R}_{+}^{d}$. In the second result, under similar conditions on the constant immigration rate and diffusion noise, but with jumps of finite activity, we show that the CIMBI process hits the boundary $\\partial\\mathbb{R}_{+}^{d}$ with positive probability."}
{"id": "2512.20911", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.20911", "abs": "https://arxiv.org/abs/2512.20911", "authors": ["Jing Guo", "Xiushan Jiang", "Weihai Zhang"], "title": "Model-free stochastic linear quadratic control for discrete-time systems with multiplicative and additive noises via semidefinite programming", "comment": null, "summary": "This paper investigates a model-free solution to the stochastic linear quadratic regulation (LQR) problem for linear discrete-time systems with both multiplicative and additive noises. We formulate the stochastic LQR problem as a nonconvex optimization problem and rigorously analyze its dual problem structure. By exploiting the inherent convexity of the dual problem and analyzing Karush-Kuhn-Tucker conditions with respect to optimality in convex optimization, we establish an explicit relationship between the optimal point of the dual problem and the parameters of the associated Q-function. This theoretical insight, combined with the technique of the matrix direct sum, makes it possible to develop a novel model-free sample-efficient, non-iterative semidefinite programming algorithm that directly estimates optimal control gain without requiring an initial stabilizing controller, or noises measurability. The robustness of the model-free SDP method to errors is investigated. Our approach provides a new optimization-theoretic framework for understanding Q-learning algorithms while advancing the theoretical foundations of reinforcement learning in stochastic optimal control. Numerical validation on a pulse-width modulated inverter system demonstrates the algorithm's effectiveness, particularly in achieving a single-step non-iterative solution without hyper-parameter tuning."}
{"id": "2512.21297", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21297", "abs": "https://arxiv.org/abs/2512.21297", "authors": ["Liet Vo"], "title": "A mixed finite element method for the stochastic Boussinesq equations with multiplicative noise", "comment": "29 pages", "summary": "This work investigates a fully discrete mixed finite element method for the stochastic Boussinesq system driven by multiplicative noise. The spatial discretization is performed using a standard mixed finite element method, while the temporal discretization is based on a semi-implicit Euler-Maruyama scheme. By combining a localization technique with high-moment stability estimates, we establish error bounds for the velocity, pressure, and temperature approximations. As a direct consequence, we prove convergence in probability for the fully discrete method in both $L^2$ and $H^1$-type norms. Several numerical experiments are presented to validate the theoretical error estimates and demonstrate the effectiveness of the proposed scheme."}
{"id": "2512.21159", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21159", "abs": "https://arxiv.org/abs/2512.21159", "authors": ["Yutao Liang", "Yan-Xia Ren", "Quan Shi", "Fan Yang"], "title": "From multitype branching Brownian motions to branching Markov additive processes", "comment": "44 pages", "summary": "We study a class of multitype branching Lévy processes, where particles move according to type-dependent Lévy processes, switch types via an irreducible Markov chain, and branch according to type-dependent laws. This framework generalizes multitype branching Brownian motions.\n  Using techniques of Markov additive processes, we develop a spine decomposition. This approach further enables us to prove convergence results for the additive martingales and derivative martingales, and establish the existence and uniqueness of travelling wave solutions to the corresponding multitype FKPP equations. In particular, applying our results to the on-off branching Brownian motion model resolves several open problems posed by Blath et al.(2025)."}
{"id": "2512.21051", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.21051", "abs": "https://arxiv.org/abs/2512.21051", "authors": ["Jintao Sun", "Michael Cantoni"], "title": "Energy-Gain Control of Time-Varying Systems: Receding Horizon Approximation", "comment": "Accepted to appear in IEEE TAC", "summary": "Standard formulations of prescribed worstcase disturbance energy-gain control policies for linear time-varying systems depend on all forward model data. In a discrete-time setting, this dependence arises through a backward Riccati recursion. The aim herein is to consider the infinite-horizon $\\ell_2$ gain performance of state feedback policies with only finite receding-horizon preview of the model parameters. The proposed synthesis of controllers subject to such a constraint leverages the strict contraction of lifted Riccati operators under uniform controllability and observability. The main approximation result establishes a sufficient number of preview steps for the performance loss to remain below any set tolerance, relative to the baseline gain bound of the associated infinite-preview controller. Aspects of the main result are explored in the context of a numerical example."}
{"id": "2512.21306", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.21306", "abs": "https://arxiv.org/abs/2512.21306", "authors": ["Lorenzo Micalizzi", "Eleuterio Toro"], "title": "FORCE-$α$ Numerical Fluxes within the Arbitrary High Order Semidiscrete WENO-DeC Framework: A Competitive Alternative to Upwind Fluxes", "comment": null, "summary": "This work systematically investigates the performance of FORCE--$α$ numerical fluxes within an arbitrary high order semidiscrete finite volume (FV) framework for hyperbolic partial differential equations (PDEs). Such numerical fluxes have been recently introduced by Toro, Saggiorato, Tokareva, and Hidalgo (Journal of Computational Physics, 416, 2020), and constitute a family of centred fluxes obtained from a suitable modification of First--Order Centred (FORCE) numerical fluxes. In contrast with upwind fluxes, such as Rusanov, Harten--Lax--van Leer (HLL) or the exact Riemann solver (RS) numerical flux, centred ones do not consider in any way the structure of the Riemann problem at cell interfaces. Adopting centred numerical fluxes leads to a high level of flexibility of the resulting numerical schemes, for example in the context of complicated hyperbolic systems, for which RSs may be impossible to construct or computationally expensive.\n  The baseline framework adopted in this investigation is a FV semidiscrete approach with Weighted Essentially Non--Oscillatory (WENO) spatial reconstruction and Deferred Correction (DeC) time discretization, and results are reported up to order 7. Previous investigations involving the same framework have established that increasing the order of accuracy tends to decrease the differences in the results obtained through different numerical fluxes. The goal of this paper is to show that the employment of FORCE--$α$ numerical fluxes within such a framework is a competitive alternative to the adoption of more classical upwind fluxes. The hyperbolic system considered for this investigation is the ideal Euler equations in one and two space dimensions."}
{"id": "2512.21160", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21160", "abs": "https://arxiv.org/abs/2512.21160", "authors": ["Lingyan Cheng", "Caihong Gu", "Wei Liu", "Fengwu Zhu"], "title": "Large and Moderate deviation principles for the Multivalued McKean-Vlasov SDEs with jumps", "comment": null, "summary": "By using the weak convergence method, we establish the large and moderate deviation principles for the multivalued McKean-Vlasov SDEs with non-Lipschitz coefficients driven by Lévy noise in this paper. The Bihari's inequality is used to overcome the challenges arising from the non-Lipschitz conditions on the coefficients."}
{"id": "2512.21096", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21096", "abs": "https://arxiv.org/abs/2512.21096", "authors": ["Jiayun Li", "Yiwen Lu", "Yilin Mo", "Jie Chen"], "title": "Identification with Orthogonal Basis Functions: Convergence Speed, Asymptotic Bias, and Rate-Optimal Pole Selection", "comment": null, "summary": "This paper is concerned with performance analysis and pole selection problem in identifying linear time-invariant (LTI) systems using orthogonal basis functions (OBFs), a system identification approach that consists of solving least-squares problems and selecting poles within the OBFs. Specifically, we analyze the convergence properties and asymptotic bias of the OBF algorithm, and propose a pole selection algorithm that robustly minimizes the worst-case identification bias, with the bias measured under the $\\mathcal{H}_2$ error criterion. Our results include an analytical expression for the convergence rate and an explicit bound on the asymptotic identification bias, which depends on both the true system poles and the preselected model poles. Furthermore, we demonstrate that the pole selection algorithm is asymptotically optimal, achieving the fundamental lower bound on the identification bias. The algorithm explicitly determines the model poles as the so-called Tsuji points, and the asymptotic identification bias decreases exponentially with the number of basis functions, with the rate of decrease governed by the hyperbolic Chebyshev constant. Numerical experiments validate the derived bounds and demonstrate the effectiveness of the proposed pole selection algorithm."}
{"id": "2512.21319", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.21319", "abs": "https://arxiv.org/abs/2512.21319", "authors": ["Yuan Qiu", "Wolfgang Dahmen", "Peng Chen"], "title": "Variationally correct operator learning: Reduced basis neural operator with a posteriori error estimation", "comment": null, "summary": "Minimizing PDE-residual losses is a common strategy to promote physical consistency in neural operators. However, standard formulations often lack variational correctness, meaning that small residuals do not guarantee small solution errors due to the use of non-compliant norms or ad hoc penalty terms for boundary conditions. This work develops a variationally correct operator learning framework by constructing first-order system least-squares (FOSLS) objectives whose values are provably equivalent to the solution error in PDE-induced norms. We demonstrate this framework on stationary diffusion and linear elasticity, incorporating mixed Dirichlet-Neumann boundary conditions via variational lifts to preserve norm equivalence without inconsistent penalties. To ensure the function space conformity required by the FOSLS loss, we propose a Reduced Basis Neural Operator (RBNO). The RBNO predicts coefficients for a pre-computed, conforming reduced basis, thereby ensuring variational stability by design while enabling efficient training. We provide a rigorous convergence analysis that bounds the total error by the sum of finite element discretization bias, reduced basis truncation error, neural network approximation error, and statistical estimation errors arising from finite sampling and optimization. Numerical benchmarks validate these theoretical bounds and demonstrate that the proposed approach achieves superior accuracy in PDE-compliant norms compared to standard baselines, while the residual loss serves as a reliable, computable a posteriori error estimator."}
{"id": "2512.21254", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21254", "abs": "https://arxiv.org/abs/2512.21254", "authors": ["F. Thomas Bruss", "Davy Paindaveine"], "title": "Win rates at first-passage times for biased simple random walks", "comment": "12 pages, 2 figures", "summary": "We study the win rate $R_{N_d}/N_d$ of a biased simple random walk $S_n$ on $\\mathbb{Z}$ at the first-passage time $N_d=\\inf\\{n\\ge 0:S_n=d\\}$, with $p=P[X_1=+1]\\in[1/2,1)$. Using generating-function techniques and integral representations, we derive explicit formulas for the expectation and variance of $R_{N_d}/N_d$ along with monotonicity properties in the threshold $d$ and the bias $p$. We also provide closed-form expressions and use them to design unbiased coin-flipping estimators of $π$ based on first-passage sampling; the resulting schemes illustrate how biasing the coin can dramatically improve both approximation accuracy and computational cost."}
{"id": "2512.21266", "categories": ["math.OC", "eess.SY", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.21266", "abs": "https://arxiv.org/abs/2512.21266", "authors": ["Papri Dey"], "title": "$\\mathcal{K}$-Lorentzian Polynomials, Semipositive Cones, and Cone-Stable EVI Systems", "comment": "23 pages, 5 figures", "summary": "Lorentzian and completely log-concave polynomials have recently emerged as a unifying framework for negative dependence, log-concavity, and convexity in combinatorics and probability. We extend this theory to variational analysis and cone-constrained dynamics by studying $K$-Lorentzian and $K$-completely log-concave polynomials over a proper convex cone $K\\subset\\mathbb{R}^n$. For a $K$-Lorentzian form $f$ and $v\\in\\operatorname{int}K$, we define an open cone $K^\\circ(f,v)$ and a closed cone $K(f,v)$ via directional derivatives along $v$, recovering the usual hyperbolicity cone when $f$ is hyperbolic. We prove that $K^\\circ(f,v)$ is a proper cone and equals $\\operatorname{int}K(f,v)$. If $f$ is $K(f,v)$-Lorentzian, then $K(f,v)$ is convex and maximal among convex cones on which $f$ is Lorentzian.\n  Using the Rayleigh matrix $M_f(x)=\\nabla f(x)\\nabla f(x)^T - f(x)\\nabla^2 f(x)$, we obtain cone-restricted Rayleigh inequalities and show that two-direction Rayleigh inequalities on $K$ are equivalent to an acuteness condition for the bilinear form $v^T M_f(x) w$. This yields a cone-restricted negative-dependence interpretation linking the curvature of $\\log f$ to covariance properties of associated Gibbs measures. For determinantal generating polynomials, we identify the intersection of the hyperbolicity cone with the nonnegative orthant as the classical semipositive cone, and we extend this construction to general proper cones via $K$-semipositive cones. Finally, for linear evolution variational inequality (LEVI) systems, we show that if $q(x)=x^T A x$ is (strictly) $K$-Lorentzian, then $A$ is (strictly) $K$-copositive and yields Lyapunov (semi-)stability on $K$, giving new Lyapunov criteria for cone-constrained dynamics."}
{"id": "2512.21269", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.21269", "abs": "https://arxiv.org/abs/2512.21269", "authors": ["Kewang Chen", "Yongqiu Jiang", "Kees Vuik"], "title": "The Dynamical Anatomy of Anderson Acceleration:From Adaptive Momentum to Variable-Mass ODEs", "comment": null, "summary": "This paper provides a rigorous derivation and analysis of accelerated optimization algorithms through the lens of High-Resolution Ordinary Differential Equations (ODEs). While classical Nesterov acceleration is well-understood via asymptotic vanishing damping, the dynamics of Anderson Acceleration (AA) remain less transparent. This work makes significant theoretical contributions to AA by bridging discrete acceleration algorithms with continuous dynamical systems, while also providing practical algorithmic innovations. Our work addresses fundamental questions about the physical nature of Anderson Acceleration that have remained unanswered since its introduction in 1965. Firstly, we prove that AA can be exactly rewritten as an adaptive momentum method and, in the high-resolution limit, converges to a second-order ODE with Variable Effective Mass. Through a Lyapunov energy analysis, we reveal the specific instability mechanism of standard AA: unchecked growth in effective mass acts as negative damping, physically injecting energy into the system and violating dissipation constraints. Conversely, high-resolution analysis identifies an implicit Hessian-driven damping term that provides stabilization in stiff regimes. Leveraging these dynamical insights, we then propose Energy-Guarded Anderson Acceleration (EG-AA), an algorithm that acts as an inertial governor to enforce thermodynamic consistency. Morevoer, our convergence analysis, formulated via the Acceleration Gain Factor, proves that EG-AA improves upon gradient descent by maximizing the geometric contraction of the linear subspace projection while actively suppressing nonlinear approximation errors. Theoretical bounds confirm that EG-AA is no worse than standard AA, and numerical experiments demonstrate strictly improved convergence stability and rates in ill-conditioned convex composite problems compared to standard Anderson mixing."}
{"id": "2512.21261", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2512.21261", "abs": "https://arxiv.org/abs/2512.21261", "authors": ["Camilo Hernández", "Ludovic Tangpi"], "title": "Marginal flows of non-entropic weak Schrödinger bridges", "comment": null, "summary": "This paper introduces a dynamic formulation of divergence-regularized optimal transport with weak targets on the path space. In our formulation, the classical relative entropy penalty is replaced by a general convex divergence, and terminal constraints are imposed in a weak sense. We establish well-posedness and a convex dual formulation of the problem, together with explicit structural characterizations of primal and dual optimizers. Specifically, the optimal path measure is shown to admit an explicit density relative to a reference diffusion, generalizing the classical Schrödinger system. For the pure Schrödinger case, i.e., when the transport cost is zero, we further characterize the flow of time marginals of the optimal bridge, recovering known results in the entropic setting and providing new descriptions for non-entropic divergences including the chi-divergence."}
{"id": "2512.21269", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.21269", "abs": "https://arxiv.org/abs/2512.21269", "authors": ["Kewang Chen", "Yongqiu Jiang", "Kees Vuik"], "title": "The Dynamical Anatomy of Anderson Acceleration:From Adaptive Momentum to Variable-Mass ODEs", "comment": null, "summary": "This paper provides a rigorous derivation and analysis of accelerated optimization algorithms through the lens of High-Resolution Ordinary Differential Equations (ODEs). While classical Nesterov acceleration is well-understood via asymptotic vanishing damping, the dynamics of Anderson Acceleration (AA) remain less transparent. This work makes significant theoretical contributions to AA by bridging discrete acceleration algorithms with continuous dynamical systems, while also providing practical algorithmic innovations. Our work addresses fundamental questions about the physical nature of Anderson Acceleration that have remained unanswered since its introduction in 1965. Firstly, we prove that AA can be exactly rewritten as an adaptive momentum method and, in the high-resolution limit, converges to a second-order ODE with Variable Effective Mass. Through a Lyapunov energy analysis, we reveal the specific instability mechanism of standard AA: unchecked growth in effective mass acts as negative damping, physically injecting energy into the system and violating dissipation constraints. Conversely, high-resolution analysis identifies an implicit Hessian-driven damping term that provides stabilization in stiff regimes. Leveraging these dynamical insights, we then propose Energy-Guarded Anderson Acceleration (EG-AA), an algorithm that acts as an inertial governor to enforce thermodynamic consistency. Morevoer, our convergence analysis, formulated via the Acceleration Gain Factor, proves that EG-AA improves upon gradient descent by maximizing the geometric contraction of the linear subspace projection while actively suppressing nonlinear approximation errors. Theoretical bounds confirm that EG-AA is no worse than standard AA, and numerical experiments demonstrate strictly improved convergence stability and rates in ill-conditioned convex composite problems compared to standard Anderson mixing."}
{"id": "2512.21322", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.21322", "abs": "https://arxiv.org/abs/2512.21322", "authors": ["Magnus H. Haaland", "Anđela Šarković"], "title": "Mixing time of the random walk on the giant component of the random geometric graph", "comment": "16 pages, 4 figures", "summary": "We consider a random geometric graph obtained by placing a Poisson point process of intensity 1 in the d-dimensional torus of side length n^(1/d) and connecting two points by an edge if their distance is at most r. We consider the case of d>=2 and r in [r_min, r_max], where r_min<r_max are any constants with r_min>r_g and r_g is a constant above which this graph has a giant component with high probability. We show that, with high probability, the mixing time and the relaxation time of the simple random walk on the giant component in this case are both of order n^(2/d) and that therefore there is no cutoff. We also obtain bounds for the isoperimetric profile of subsets of the giant component of at least polylogarithmic size."}
{"id": "2512.21275", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.21275", "abs": "https://arxiv.org/abs/2512.21275", "authors": ["Irene Benedetti", "Paola Rubbioni"], "title": "Impulsive delay differential inclusions applied to optimization problems", "comment": null, "summary": "We study a class of semilinear impulsive differential inclusions with infinite delay in Banach spaces. The model incorporates multivalued nonlinearities, impulsive effects, and infinite memory, allowing for the description of systems influenced by long-lasting past states and sudden changes. We prove the existence of mild solutions and the compactness of the solution set using fixed point methods and measures of noncompactness. The theoretical results are applied to an abstract optimization problem and to a population dynamics model."}
{"id": "2512.21300", "categories": ["math.ST", "math.PR", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.21300", "abs": "https://arxiv.org/abs/2512.21300", "authors": ["Ben Chugg", "Aaditya Ramdas"], "title": "Closed-form empirical Bernstein confidence sequences for scalars and matrices", "comment": "36 pages; 6 figures", "summary": "We derive a new closed-form variance-adaptive confidence sequence (CS) for estimating the average conditional mean of a sequence of bounded random variables. Empirically, it yields the tightest closed-form CS we have found for tracking time-varying means, across sample sizes up to $\\approx 10^6$. When the observations happen to have the same conditional mean, our CS is asymptotically tighter than the recent closed-form CS of Waudby-Smith and Ramdas [38]. It also has other desirable properties: it is centered at the unweighted sample mean and has limiting width (multiplied by $\\sqrt{t/\\log t}$) independent of the significance level. We extend our results to provide a CS with the same properties for random matrices with bounded eigenvalues."}
{"id": "2512.21261", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2512.21261", "abs": "https://arxiv.org/abs/2512.21261", "authors": ["Camilo Hernández", "Ludovic Tangpi"], "title": "Marginal flows of non-entropic weak Schrödinger bridges", "comment": null, "summary": "This paper introduces a dynamic formulation of divergence-regularized optimal transport with weak targets on the path space. In our formulation, the classical relative entropy penalty is replaced by a general convex divergence, and terminal constraints are imposed in a weak sense. We establish well-posedness and a convex dual formulation of the problem, together with explicit structural characterizations of primal and dual optimizers. Specifically, the optimal path measure is shown to admit an explicit density relative to a reference diffusion, generalizing the classical Schrödinger system. For the pure Schrödinger case, i.e., when the transport cost is zero, we further characterize the flow of time marginals of the optimal bridge, recovering known results in the entropic setting and providing new descriptions for non-entropic divergences including the chi-divergence."}
