{"id": "2512.12192", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.12192", "abs": "https://arxiv.org/abs/2512.12192", "authors": ["Ramon van den Akker", "Bas J. M. Werker", "Bo Zhou"], "title": "Local Asymptotic Normality for Multi-Armed Bandits", "comment": null, "summary": "Van den Akker, Werker, and Zhou (2025) showed that the limit experiment, in the sense of H\\a'{a}jek-Le Cam, for (contextual) bandits whose arms' expected payoffs differ by $O(T^{-1/2})$, is Locally Asymptotically Quadratic (LAQ) but highly non-standard, being characterized by a system of coupled stochastic differential equations. The present paper considers the complementary case where the arms' expected payoffs are fixed with a unique optimal (in the sense of highest expected payoff) arm. It is shown that, under sampling schemes satisfying mild regularity conditions (including UCB and Thompson sampling), the model satisfies the standard Locally Asymptotically Normal (LAN) property."}
{"id": "2512.12257", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.12257", "abs": "https://arxiv.org/abs/2512.12257", "authors": ["Matjaž Omladič", "Damjan Škulj"], "title": "A complete characterization of maximal copulas with a given track section", "comment": "23 pages, 8 figures", "summary": "Bivariate copulas with prescribed diagonal section were first studied by Bertino. Their maximality was studied so far only from the point of view of upper bounds which brings quasi-copulas into the picture and limits the resulting set substantially. We propose to study maximality of these families in the order theoretic sense. A copula C with given diagonal section δ is called undominated if there is no copula C' {\\neq} C with the same diagonal section δ such that C {\\leq} C'. The main contribution of this paper is a new method that provides copulas of the kind. This method generates a much wider class that contains the known upper bounds as a very small subclass. There was a recent call for the study of asymmetry which is addressed by our class better than by the known ones. Corresponding quasi-copulas can be obtained from our copulas via splicing techniques. Most results are given on the level of tracks."}
{"id": "2512.12265", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.12265", "abs": "https://arxiv.org/abs/2512.12265", "authors": ["Tomaž Košir", "Petra Lazić", "Matjaž Omladič"], "title": "Marshall-Olkin copulas revisited", "comment": "19 pages, 3 figures", "summary": "Almost seventy years old Marshall-Olkin copulas, then wider Marshall copulas, and finally even wider shock model (SM) copulas constitute a substantial part of nowadays copula theory due to numerous applications. Recently, Christian Genest with some coauthors introduced a new stochastic model for a special subclass of SM copulas which gives not only a new angle on these copulas but also widens the range of applications. In this paper we extend this type of stochastic model to all known subclasses of SM copulas. We also introduce a novel class of SM copulas and extend the new stochastic model to this class as well."}
{"id": "2512.12363", "categories": ["math.ST", "math.PR", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.12363", "abs": "https://arxiv.org/abs/2512.12363", "authors": ["Zeusu Sato"], "title": "On the epsilon-delta Structure Underlying Chatterjee's Rank Correlation", "comment": "11 pages", "summary": "We provide an epsilon-delta interpretation of Chatterjee's rank correlation by tracing its origin to a notion of local dependence between random variables. Starting from a primitive epsilon-delta construction, we show that rank-based dependence measures arise naturally as epsilon to zero limits of local averaging procedures. Within this framework, Chatterjee's rank correlation admits a transparent interpretation as an empirical realization of a local L1 residual.\n  We emphasize that the probability integral transform plays no structural role in the underlying epsilon-delta mechanism, and is introduced only as a normalization step that renders the final expression distribution-free. We further consider a moment-based analogue obtained by replacing the absolute deviation with a squared residual. This L2 formulation is independent of rank transformations and, under a Gaussian assumption, recovers Pearson's coefficient of determination."}
{"id": "2512.12119", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12119", "abs": "https://arxiv.org/abs/2512.12119", "authors": ["Raluca M. Balan", "Michael Salins"], "title": "Gaussian fluctuations for the nonlinear stochastic heat equation with drift", "comment": "37 pages", "summary": "In this article, we prove the Quantitative Central Limit Theorem (QCLT) for the spatial average of the solution of the nonlinear stochastic heat equation with constant initial condition, driven by space-time Gaussian white noise in dimension 1. The novelty is that the equation contains a drift term. We assume that the drift and diffusion coefficients are twice differentiable with bounded first and second order derivatives. For the proof, we use Malliavin calculus, and the second-order Poincaré inequality due to Vidotto (2020). To estimate the moment of the second Malliavin derivative of the solution, we develop a novel estimate for the product of two heat kernels, which is of independent interest. Finally, we provide the functional result corresponding to this CLT."}
{"id": "2512.12039", "categories": ["math.NA", "math-ph", "math.AP", "math.SP"], "pdf": "https://arxiv.org/pdf/2512.12039", "abs": "https://arxiv.org/abs/2512.12039", "authors": ["Peter Hofhansel", "Alexander B. Watson"], "title": "Discrete-to-continuum convergence of the density of states for Mathieu's equation", "comment": "44 pages, 2 figures. PH's undergraduate research project at University of Minnesota supervised by ABW", "summary": "The density of states of a self-adjoint operator generalizes the eigenvalue distribution of a Hermitian matrix. We prove convergence of the density of states for a tight-binding model with a slowly-varying periodic potential to the density of states of its continuum approximation, a Mathieu-type equation."}
{"id": "2512.12111", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2512.12111", "abs": "https://arxiv.org/abs/2512.12111", "authors": ["Navid Mojahed", "Hooman Fatoorehchi", "Shima Nazari"], "title": "Fractional Calculus in Optimal Control and Game Theory: Theory, Numerics, and Applications -- A Survey", "comment": "42 pages, 1 figure, comprehensive survey on fractional calculus in optimal control and game theory", "summary": "Many physical, biological, and engineered systems exhibit memory effects that challenge Markovian models. Fractional calculus provides nonlocal operators to capture hereditary dynamics. This survey connects modeling, analysis, and controller/game design for systems with memory. We unify notation for Caputo, Riemann-Liouville, and Grunwald-Letnikov derivatives and relate them to practical approximations, including diffusive (sum-of-exponentials) state augmentation and frequency-domain realizations (e.g., Oustaloup). We review fractional extensions of the calculus of variations and the Pontryagin maximum principle, and dynamic-programming formulations with memory, including path-dependent HJB for optimal control and HJI for zero-sum games. We cover design tools such as LQR, MPC, and fractional-order PID, as well as fractional differential games with Nash, Stackelberg, and minimax equilibria. Computational approaches are compared across time-domain schemes, frequency-domain approximations, and diffusive augmentations, highlighting accuracy-complexity trade-offs and remedies for the curse of history (windowing and sum-of-exponentials). We conclude with applications and open problems on equilibria with memory, Isaacs-type conditions, constraint handling, and scalable solvers."}
{"id": "2512.12379", "categories": ["math.ST", "math.HO"], "pdf": "https://arxiv.org/pdf/2512.12379", "abs": "https://arxiv.org/abs/2512.12379", "authors": ["Hans Fischer"], "title": "Early Highlights in the History of the Bernstein-von Mises Theorem", "comment": "17 pages", "summary": "The designation ``Bernstein-von Mises theorem'' is apparently due to Lucien Le Cam. Roughly, the assertion of this theorem states that the posterior distribution of a parameter, conditioned on a large sample, is approximately normal, independent of a particular prior. The present paper discusses important steps in the development of this theorem and its applications, from Laplace in 1774 to Le Cam in 1953. Regarding Bernstein and his disciple Neyman, it thereby relies on sources which were widely unknown and hard to obtain until recently."}
{"id": "2512.12124", "categories": ["math.PR", "cond-mat.stat-mech", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.12124", "abs": "https://arxiv.org/abs/2512.12124", "authors": ["Johannes Bäumler", "Tom Hutchcroft"], "title": "A discontinuous percolation phase transition on the hierarchical lattice", "comment": "52 pages", "summary": "For long-range percolation on $\\mathbb{Z}$ with translation-invariant edge kernel $J$, it is a classical theorem of Aizenman and Newman (1986) that the phase transition is discontinuous when $J(x,y)$ is of order $|x-y|^{-2}$ and that there is no phase transition at all when $J(x,y)=o(|x-y|^{-2})$. We prove a strengthened version of this theorem for the hierarchical lattice, where the relevant threshold is at $|x-y|^{-2d} \\log\\log |x-y|$ rather than $|x-y|^{-2}$: There is a continuous phase transition for kernels of larger order, a discontinuous phase transition for kernels of exactly this order, and no phase transition at all for kernels of smaller order. As such, $|x-y|^{-2d} \\log\\log |x-y|$ is essentially the \\emph{only} kernel that produces a discontinuous phase transition. We also prove a hierarchical analogue of the ``$M^2β=1$'' conjecture of Imbrie and Newman (1988), which gives an exact formula for the density of the infinite cluster at the point of discontinuous phase transition and remains open in the Euclidean setting."}
{"id": "2512.12050", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12050", "abs": "https://arxiv.org/abs/2512.12050", "authors": ["Michael Neilan", "Maxim Olshanskii", "Henry von Wahl"], "title": "An unfitted divergence-free higher order finite element method for the Stokes problem", "comment": null, "summary": "The paper develops and analyzes a higher-order unfitted finite element method for the incompressible Stokes equations, which yields a strongly divergence-free velocity field up to the physical boundary. The method combines an isoparametric Scott--Vogelius velocity-pressure pair on a cut background mesh with a stabilized Nitsche/Lagrange multiplier formulation for imposing Dirichlet boundary conditions. We construct finite element spaces that admit robust numerical implementation using standard elementwise polynomial mappings and produce exactly divergence-free discrete velocities. The key components of the analysis are a new inf-sup stability result for the isoparametric Scott--Vogelius pair on unfitted meshes and a combined inf-sup stability result for the bilinear forms associated with the pressure and the Lagrange multiplier. The finite element formulation employs a higher-order Lagrange multiplier space, which ensures stability and mitigates the loss of pressure robustness typically associated with the weak enforcement of boundary conditions for the normal velocity component.\n  The paper provides a complete stability and convergence theory in two dimensions, accounting for the geometric errors introduced by the isoparametric approximation. The analysis demonstrates optimal-order velocity convergence in both the $H^1$ and $L^2$ norms and establishes optimal $H^1$-convergence and nearly optimal $L^2$-convergence of a post-processed pressure. Numerical experiments illustrate and confirm the theoretical findings."}
{"id": "2512.12235", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.12235", "abs": "https://arxiv.org/abs/2512.12235", "authors": ["Sayantan Choudhury"], "title": "Next-Generation Iterative Algorithms for Large-Scale Min-Max Optimization: Design and Analysis", "comment": "PhD thesis, 310 pages", "summary": "This thesis investigates the design of algorithms for solving min-max optimization problems, which form the mathematical foundation of many modern applications in machine learning, game theory, and optimization. This work offers new theoretical insights and practical algorithms that address the limitations of existing methods in various problem settings."}
{"id": "2512.12750", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.12750", "abs": "https://arxiv.org/abs/2512.12750", "authors": ["Antônio Catão", "Lucas Resende", "Paulo Orenstein"], "title": "Improved Concentration for Mean Estimators via Shrinkage", "comment": "26 pages, 3 figures", "summary": "We study a class of robust mean estimators $\\widehatμ$ obtained by adaptively shrinking the weights of sample points far from a base estimator $\\widehatκ$. Given a data-dependent scaling factor $\\widehatα$ and a weighting function $w:[0, \\infty) \\to [0,1]$, we let $\\widehatμ = \\widehatκ + \\frac{1}{n}\\sum_{i=1}^n(X_i - \\widehatκ)w(\\widehatα|X_i-\\widehatκ|) $. We prove that, under mild assumptions over $w$, these estimators achieve stronger concentration bounds than the base estimate $\\widehatκ$, including sub-Gaussian guarantees. This framework unifies and extends several existing approaches to robust mean estimation in $\\mathbb{R}$. Through numerical experiments, we show that our shrinking approach translates to faster concentration, even for small sample sizes."}
{"id": "2512.12254", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.12254", "abs": "https://arxiv.org/abs/2512.12254", "authors": ["Silouanos Brazitikos", "Christos Pandis"], "title": "Sharp inequalities for symmetric polynomials, Hunter's conjecture, and moments of exponential random variables", "comment": null, "summary": "We prove Hunter's conjecture on complete homogeneous symmetric polynomials. For even $n$ and every integer $k\\geq 1$, we show that under the constraint $\\sum_{i=1}^n a_i^2=1$ the global minimum of the even-degree polynomial $h_{2k}(a_1,\\dots,a_n)$ is attained precisely at the half-plus/half-minus vector and we compute the optimal value in closed form. The proof combines algebraic properties of $h_{2k}$ with the probabilistic representation $k!\\,h_k(a)=\\mathbb{E}(\\sum_{i=1}^n a_iX_i)^k$, where $X_1,\\dots,X_n$ are i.i.d. standard exponential random variables with density $e^{-x}1_{x>0}$ and a combinatorial identity. This viewpoint further yields sharp upper and lower bounds for $\\mathbb{E}|\\sum_{i=1}^n a_iX_i|^{q}$ under natural constraints on the coefficients, including the spherical constraint $\\sum a_i^2=1$ combined with the non-negative regime $a_i\\ge0$, or the centred regime $\\sum a_i=0$. Moreover, we determine the exact minimum of $h_{2k}$ on the $\\ell_\\infty$-sphere $S_\\infty = \\{a \\in \\mathbb{R}^n : \\|a\\|_\\infty = 1\\}$, which yields sharp norm comparison inequalities between the matrix norms induced by complete homogeneous symmetric polynomials and the classical operator and Schatten norms."}
{"id": "2512.12062", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12062", "abs": "https://arxiv.org/abs/2512.12062", "authors": ["Morgan Görtz", "Moritz Hauck", "Axel Målqvist", "Andreas Rupp", "Lucia Swoboda"], "title": "Numerical Simulation of Beam Network Models", "comment": "26 pages, 9 figures", "summary": "Network models are used as efficient representation of materials with complex, interconnected locally one-dimensional structures. They typically accurately capture the mechanical properties of a material, while substantially reducing computational cost by avoiding full three-dimensional resolution. Applications include the simulation of fiber-based materials, porous media, and biological systems such as vascular networks. This article focuses on two representative problems: a stationary formulation describing the elastic deformation of beam networks, and a time-dependent formulation modeling elastic wave propagation in such materials. We propose a two-level additive domain decomposition method to efficiently solve the linear system associated with the stationary problem, as well as the linear systems that arise at each time step of the time-dependent problem through implicit time discretization. We present a rigorous convergence analysis of the domain decomposition method when used as a preconditioner, quantifying the convergence rate with respect to network connectivity and heterogeneity. The efficiency and robustness of the proposed approach are demonstrated through numerical simulations of the mechanical properties of commercial-grade paperboard."}
{"id": "2512.12502", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.12502", "abs": "https://arxiv.org/abs/2512.12502", "authors": ["Matthew K Tam", "Liam Timms", "Lele Zhang"], "title": "A decentralised forward-backward-type algorithm with network-independent heterogenous agent step sizes", "comment": null, "summary": "Consider the problem of finding a zero of a finite sum of maximally monotone operators, where some operators are Lipschitz continuous and the rest are potentially set-valued. We propose a forward-backward-type algorithm for this problem suitable for decentralised implementation. In each iteration, agents evaluate a Lipschitz continuous operator and the resolvent of a potentially set-valued operator, and then communicate with neighbouring agents. Agents choose their step sizes independently using only local information, and the step size upper bound has no dependence on the communication graph. We demonstrate the potential advantages of the proposed algorithm with numerical results for min-max problems and aggregative games."}
{"id": "2512.13073", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.13073", "abs": "https://arxiv.org/abs/2512.13073", "authors": ["Jocelyn Nembé"], "title": "Spectral Equivariance and Geometric Transport in Reproducing Kernel Hilbert Spaces: A Unified Framework for Orthogonal Polynomial and Kernel Estimation", "comment": null, "summary": "We develop a unified geometric framework for nonparametric estimation based on the notion of Twin Kernel Spaces, defined as orbits of a reproducing kernel under a group action. This structure induces a family of transported RKHS geometries in which classical orthogonal polynomial estimators, kernel estimators, and spectral smoothing methods arise as projections onto transported eigenfunction systems. Our main contribution is a Spectral Equivariance Theorem showing that the eigenfunctions of any transported kernel are obtained by unitary transport of the base eigenfunctions. As a consequence, orthogonal polynomial estimators are equivariant under geometric deformation, kernel estimators correspond to soft spectral filtering in a twin space, and minimax rates and bias--variance tradeoffs are invariant under transport. We provide examples based on Hermite and Legendre polynomials, affine and Gaussian groups, and illustrate the effectiveness of twin transport for adaptive and multimodal estimation. The framework reveals a deep connection between group actions, RKHS geometry, and spectral nonparametrics, offering a unified perspective that encompasses kernel smoothing, orthogonal series, splines, and multiscale methods."}
{"id": "2512.12262", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12262", "abs": "https://arxiv.org/abs/2512.12262", "authors": ["Francesco Camellini", "Wissam Ghantous", "Andrea M. Lanocita", "Layna E. Mangiapanello", "Steven J. Miller", "Garrett Tresch", "Elif Z. Yildirim"], "title": "On a Roll Again: Analysis of a Dice Removal Game", "comment": "22 pages, 6 figures, submitted to the PUMP Journal of Undergraduate Research", "summary": "Suppose we have $n$ dice, each with $s$ faces (assume $s\\geq n$). On the first turn, roll all of them, and remove from play those that rolled an $n$. Roll all of the remaining dice. In general, if at a certain turn you are left with $k$ dice, roll all of them and remove from play those that rolled a $k$. The game ends when you are left with no dice to roll. For $n,s \\in \\mathbb{N} \\setminus \\{0\\}$ such that $s \\geq n$, let $Y_n^s$ be the random variable for the number of turns to finish the game rolling $n$ dice with $s$ faces. We find recursive and non-recursive solutions for $\\mathbb{E}(Y_n^{s})$ and $\\mathrm{Var}(Y_n^{s})$, and bounds for both values. We conclude that the expected value grows linearly in both the number of dice and the number of faces, while the standard deviation grows linearly in the number of faces. Moreover, we show that $Y_n^{s}$ can also be modeled as the maximum of a sequence of i.i.d. geometrically distributed random variables. Although, as far as we know, this game hasn't been studied before, similar problems have."}
{"id": "2512.12099", "categories": ["math.NA", "math-ph", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.12099", "abs": "https://arxiv.org/abs/2512.12099", "authors": ["Jan L. Cieśliński", "Maciej Jurgielewicz"], "title": "An explicit integrator uniform in the true anomaly and exactly preserving all integrals of motion in the three-dimensional Kepler problem", "comment": "13 pages, 4 figures", "summary": "We develop a numerical scheme for the Kepler problem that preserves exactly all first integrals: angular momentum, total energy, and the Laplace-Runge-Lenz vector. This property ensures that orbital trajectories retain their precise shape and orientation over long times, avoiding the spurious precession typical of many standard methods. The scheme uses an adaptive time step derived from a constant angular increment. Analytical considerations and numerical experiments demonstrate that the algorithm combines high accuracy with long-term stability."}
{"id": "2512.12555", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.12555", "abs": "https://arxiv.org/abs/2512.12555", "authors": ["Friedemann Krannich"], "title": "A Benamou-Brenier formulation for the multi-marginal optimal transport problem with infimal convolution cost", "comment": "7 pages", "summary": "We present a dynamical version for the multi-marginal optimal transport problem with infimal convolution cost, using the theory of Wasserstein barycentres. We show, how our formulation relates to the dynamical version of the multi-marginal optimal transport problem developed by Pass and Shenfeld (arXiv:2509.22494v2)."}
{"id": "2512.13310", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.13310", "abs": "https://arxiv.org/abs/2512.13310", "authors": ["Bufan Li", "Xinghao Qiao", "Weichi Wu", "Holger Dette"], "title": "Convergence of covariance and spectral density estimates for high-dimensional functional time series", "comment": null, "summary": "Second-order characteristics including covariance and spectral density functions are fundamentally important for both statistical applications and theoretical analysis in functional time series. In the high-dimensional setting where the number of functional variables is large relative to the length of functional time series, non-asymptotic theory for covariance function estimation has been developed for Gaussian and sub-Gaussian functional linear processes. However, corresponding non-asymptotic results for high-dimensional non-Gaussian and nonlinear functional time series, as well as for spectral density function estimation, are largely unexplored. In this paper, we introduce novel functional dependence measures, based on which we establish systematic non-asymptotic concentration bounds for estimates of (auto)covariance and spectral density functions in high-dimensional and non-Gaussian settings. We then illustrate the usefulness of our convergence results through two applications to dynamic functional principal component analysis and sparse spectral density function estimation. To handle the practical scenario where curves are discretely observed with errors, we further develop convergence rates of the corresponding estimates obtained via a nonparametric smoothing method. Finally, extensive simulation studies are conducted to corroborate our theoretical findings."}
{"id": "2512.12323", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.12323", "abs": "https://arxiv.org/abs/2512.12323", "authors": ["Zhiqi Peng", "Youzhou Zhou"], "title": "Precise Deviations for the Ewens-Pitman Model", "comment": "17 pages, 1 figure", "summary": "In this paper, we derive an integral representation for the distribution of the number of types $K_n$ in the Ewens-Pitman model. Based on this representation, we also establish precise large deviations and precise moderate deviations for $K_n$. After careful examination, we find that the rate function exhibits a second-order phase transition and the critical point is $α=\\frac{1}{2}$."}
{"id": "2512.12144", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12144", "abs": "https://arxiv.org/abs/2512.12144", "authors": ["Shangyou Zhang"], "title": "$C^1$-$Q_k$ serendipity finite elements on rectangular meshes", "comment": null, "summary": "A $C^1$-$Q_k$ serendipity finite element is a sub-element of $C^1$-$Q_k$ BFS finite element such that the element remains $C^1$-continuous and includes all $P_k$ polynomials. In other words, it is a minimum of $Q_k$ bubbles enriched $P_k$ finite element. We enrich the $P_4$ and $P_5$ spaces by $9$ $Q_4$ and $11$ $Q_5$-bubble functions, respectively. For all $k\\ge 6$, we enrich the $P_k$ spaces exactly by $12$ $Q_k$ bubble functions. We show the uni-solvence and quasi-optimality of the newly defined $C^1$-$Q_k$ serendipity elements. Numerical experiments by the $C^1$-$Q_k$ serendipity elements, $4\\le k\\le 8$, are performed."}
{"id": "2512.12561", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.12561", "abs": "https://arxiv.org/abs/2512.12561", "authors": ["Kedarnath Buda", "B. V. Rathish Kumar", "Anil Rathi"], "title": "Finite Element Analysis of Nash Equilibrium of Bi-objective Optimal Control Problem Governed by Stokes Equation with $L^2$-norm State-Constraints", "comment": null, "summary": "This paper investigates the Nash equilibrium of a bi-objective optimal control problem governed by the Stokes equations. A multi-objective Nash strategy is formulated, and fundamental theoretical results are established, including the existence, uniqueness, and analytical characterization of the equilibrium. A finite element framework is developed to approximate the coupled optimal control system, and the corresponding optimality conditions for both the continuous and discrete formulations are rigorously derived and analyzed. Furthermore, \\textit{a priori} finite element error estimates are obtained for the discrete problem, ensuring convergence and stability of the proposed method. The theoretical results are corroborated by numerical experiments, which demonstrate the accuracy and computational efficiency of the finite element approach."}
{"id": "2512.12323", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.12323", "abs": "https://arxiv.org/abs/2512.12323", "authors": ["Zhiqi Peng", "Youzhou Zhou"], "title": "Precise Deviations for the Ewens-Pitman Model", "comment": "17 pages, 1 figure", "summary": "In this paper, we derive an integral representation for the distribution of the number of types $K_n$ in the Ewens-Pitman model. Based on this representation, we also establish precise large deviations and precise moderate deviations for $K_n$. After careful examination, we find that the rate function exhibits a second-order phase transition and the critical point is $α=\\frac{1}{2}$."}
{"id": "2512.12392", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12392", "abs": "https://arxiv.org/abs/2512.12392", "authors": ["Douglas Buchanan"], "title": "Scaling limits in dependent random environments: relating a random walk, a branching process and a spatial branching process", "comment": "45 pages", "summary": "We extend existing connections between random walks, branching processes, and spatial branching processes, and their respective scaling limits, to include processes in dependent random environments. More specifically, we prove new scaling limits of a random walk in a dependent random environment, an associated branching process in a dependent random environment, and a spatial branching process in a dependent random environment. We show that the scaling limits are related in ways reminiscent of existing results in fixed environments. A Ray-Knight Theorem relates the scaling limits of the random walk in the random environment and the branching process in the random environment. The Brownian snake relates the scaling limit of the spatial branching process in the random environment to the scaling limit of the random walk in the random environment."}
{"id": "2512.12152", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12152", "abs": "https://arxiv.org/abs/2512.12152", "authors": ["Shangyou Zhang"], "title": "Rectangular $C^1$-$P_k$ finite elements with $Q_k$-bubble enrichment", "comment": null, "summary": "We enrich the $P_k$ polynomial space by $5$ ($k=4$), or $7$ ($k=5$), or 8 (all $k\\ge 6$) $Q_k$ bubble functions to obtain a family of $C^1$-$P_k$ ($k\\ge 4$) finite elements on rectangular meshes. We show the uni-solvency, the $C^1$-continuity and the quasi-optimal convergence. Numerical tests on the new $C^1$-$P_k$, $k=4,5,6,7$ and $8$, elements are performed."}
{"id": "2512.12831", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.12831", "abs": "https://arxiv.org/abs/2512.12831", "authors": ["Marcelo Bongarti", "Michael Hintermüller"], "title": "Structure versus regularity of set-valued maps in convex generalized Nash equilibrium problems in Banach spaces", "comment": null, "summary": "A generalized Nash equilibrium problem (GNEP) in Banach space consists of $N>1$ optimal control problems with couplings in both the objective functions and, most importantly, in the feasible sets. We address the existence of equilibria for convex GNEPs in Banach space. We show that the standard assumption of lower semicontinuity of the set-valued constraint maps - foundational in the current literature on GNEPs - can be replaced by graph convexity or the so-called Knaster-Kuratowski-Mazurkiewicz (KKM) property. Lower semicontinuity is often essential for obtaining upper semicontinuity of best response maps, crucial for the existence theory based on Kakutani-Fan fixed-point arguments. However, in function spaces or PDE-constrained settings, verifying lower semicontinuity becomes much more challenging (even in convex cases), whereas graph convexity, for example, is often straightforward to check. Our results unify several existence theorems in the literature and clarify the structural role of constraint maps. We also extend Rosen's uniqueness condition to Banach spaces using a multiplier bias framework. Additionally, we present a geometric counterpart to our analytic framework using preference maps. This geometric is intended as a complement to, rather than a replacement for, the analytic theory developed in the main body of the paper."}
{"id": "2512.12937", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.12937", "abs": "https://arxiv.org/abs/2512.12937", "authors": ["Sayak Chatterjee", "Anirban Chatterjee", "Abhinav Chakraborty", "Bhaswar B. Bhattacharya"], "title": "Asymptotic Normality of Subgraph Counts in Sparse Inhomogeneous Random Graphs", "comment": "26 pages, 2 figures", "summary": "In this paper, we derive the asymptotic distribution of the number of copies of a fixed graph $H$ in a random graph $G_n$ sampled from a sparse graphon model. Specifically, we provide a refined analysis that separates the contributions of edge randomness and vertex-label randomness, allowing us to identify distinct sparsity regimes in which each component dominates or both contribute jointly to the fluctuations. As a result, we establish asymptotic normality for the count of any fixed graph $H$ in $G_n$ across the entire range of sparsity (above the containment threshold for $H$ in $G_n$). These results provide a complete description of subgraph count fluctuations in sparse inhomogeneous networks, closing several gaps in the existing literature that were limited to specific motifs or suboptimal sparsity assumptions."}
{"id": "2512.12408", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12408", "abs": "https://arxiv.org/abs/2512.12408", "authors": ["Antar Bandyopadhyay", "Kunal Joshi"], "title": "Generalised De-Preferential Random Graphs", "comment": "13 pages, 2 figures", "summary": "We consider some further generalizations of the novel random graph models as introduced by Bandyopadhyay and Sen \\cite{BaSe2025} and find asymptotic for the degree of a fixed vertex and along with the asymptotic degree distribution. We show that in the \\emph{case of the inverse power law} the order of these statistics is much slower than the case of the simple inverse function, which was considered in \\cite{BaSe2025}. However, the results for the linear case remain exactly the same even after introducing a \"shift\" parameter."}
{"id": "2512.12200", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12200", "abs": "https://arxiv.org/abs/2512.12200", "authors": ["Rubing Han", "Shuonan Wu", "Hao Zhou"], "title": "Local discontinuous Galerkin method for the integral fractional Laplacian", "comment": null, "summary": "We develop and analyze a local discontinuous Galerkin (LDG) method for solving integral fractional Laplacian problems on bounded Lipschitz domains. The method is based on a three-field mixed formulation involving the primal variable, its gradient, and the corresponding Riesz potential, yielding a flux-based structure well suited for LDG discretizations while retaining the intrinsic nonlocal interaction. A key ingredient of our analysis is a rigorous study of the weighted Hölder and Sobolev regularity of the Riesz potential, which enables accurate characterization of boundary singularities. Guided by these regularity results, we propose LDG schemes on quasi-uniform and graded meshes, with additional stabilization in the graded case to reconcile the discrepancy between the discrete spaces for the Riesz potential and flux fields. Optimal a priori error estimates are established, and numerical experiments corroborate the theoretical results."}
{"id": "2512.12854", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.12854", "abs": "https://arxiv.org/abs/2512.12854", "authors": ["Enrique Otarola", "Daniel Quero", "Matias Sasso"], "title": "A bilinear pointwise tracking optimal control problem for a semilinear elliptic PDE", "comment": null, "summary": "We consider a bilinear optimal control problem with pointwise tracking for a semilinear elliptic PDE in two and three dimensions. The control variable enters the PDE as a (reaction) coefficient and the cost functional contains point evaluations of the state variable. These point evaluations lead to an adjoint problem with a linear combination of Dirac measures as a forcing term. In Lipschitz domains, we derive the existence of optimal solutions and analyze first and necessary and sufficient second order optimality conditions. We also prove that every locally optimal control $\\bar u$ belongs to $H^1(Ω)$. Finally, assuming that the domain $Ω\\subset \\mathbb{R}^2$ is a convex polygon, we prove that $\\bar u \\in C^{0,1}(\\bar Ω)$."}
{"id": "2512.13123", "categories": ["math.OC", "cs.LG", "math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.13123", "abs": "https://arxiv.org/abs/2512.13123", "authors": ["Liviu Aolaritei", "Michael I. Jordan"], "title": "Stopping Rules for Stochastic Gradient Descent via Anytime-Valid Confidence Sequences", "comment": null, "summary": "We study stopping rules for stochastic gradient descent (SGD) for convex optimization from the perspective of anytime-valid confidence sequences. Classical analyses of SGD provide convergence guarantees in expectation or at a fixed horizon, but offer no statistically valid way to assess, at an arbitrary time, how close the current iterate is to the optimum. We develop an anytime-valid, data-dependent upper confidence sequence for the weighted average suboptimality of projected SGD, constructed via nonnegative supermartingales and requiring no smoothness or strong convexity. This confidence sequence yields a simple stopping rule that is provably $\\varepsilon$-optimal with probability at least $1-α$ and is almost surely finite under standard stochastic approximation stepsizes. To the best of our knowledge, these are the first rigorous, time-uniform performance guarantees and finite-time $\\varepsilon$-optimality certificates for projected SGD with general convex objectives, based solely on observable trajectory quantities."}
{"id": "2512.12711", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12711", "abs": "https://arxiv.org/abs/2512.12711", "authors": ["Yuanyuan Xu", "Qiang Zeng"], "title": "Large deviations for the extremal eigenvalues of Ginibre ensembles", "comment": "16 pages, 2 figures", "summary": "We establish large deviation principles for the extremal eigenvalues of the Ginibre ensembles with good rate functions. In contrast to the typical estimates for the extremal eigenvalues, the large deviations for the real Ginibre ensemble come from the eigenvalues lying on the real line. Moreover, we also derive deviation estimates for the second leading term in the asymptotic expansion of the extremal eigenvalues. These polynomially small deviation estimates are universal for any i.i.d. matrices under a mild moment condition."}
{"id": "2512.12414", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.12414", "abs": "https://arxiv.org/abs/2512.12414", "authors": ["Wangtao Lu", "Kuanrong Shen", "Ruming Zhang"], "title": "A boundary integral equation method for wave scattering in periodic structures via the Floquet-Bloch transform", "comment": null, "summary": "This paper is concerned with the problem of an acoustic wave scattering in a locally perturbed periodic structure. As the total wavefield is non-quasi-periodic, effective truncation techniques are pursued for high-accuracy numerical solvers. We adopt the Green's function for the background periodic structure to construct a boundary integral equation (BIE) on an artificial curve enclosing the perturbation. It serves as a transparent boundary condition (TBC) to truncate the unbounded domain. We develop efficient algorithms to compute such background Green's functions based on the Floquet-Bloch transform and its inverse. Spectrally accurate quadrature rules are developed to discretize the BIE-based TBC. Effective algorithms based on leap and pullback procedures are further developed to compute the total wavefield everywhere in the structure. A number of numerical experiments are carried out to illustrate the efficiency and accuracy of the new solver. They exhibit that our method for the non-quasi-periodic problem has a time complexity that is even comparable to that of a single quasi-periodic problem."}
{"id": "2512.12954", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.12954", "abs": "https://arxiv.org/abs/2512.12954", "authors": ["Felipe Atenas", "Farhana Ahmed Simi", "Matthew K Tam"], "title": "Linear convergence of relocated fixed-point iterations", "comment": null, "summary": "We establish linear convergence of relocated fixed-point iterations as introduced by Atenas et al. (2025) assuming the algorithmic operator satisfies a linear error bound. In particular, this framework applies to the setting where the algorithmic operator is a contraction. As a key application of our framework, we obtain linear convergence of the relocated Douglas--Rachford algorithm for finding a zero in the sum of two monotone operators in a setting with Lipschitz continuity and strong monotonicity assumptions. We also apply the framework to deduce linear convergence of variable stepsize resolvent splitting algorithms for multioperator monotone inclusions."}
{"id": "2512.13246", "categories": ["math.NA", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.13246", "abs": "https://arxiv.org/abs/2512.13246", "authors": ["Xiaomei Yang", "Zhiliang Deng"], "title": "q-Analogue of Hamiltonian Monte Carlo method", "comment": null, "summary": "Building upon Lagrangian mechanics on Wess's $q$-commutative spaces, we derive the $q$-deformed Hamiltonian dynamics as formulated by Lavagno et al. (2006). We then develop a computationally tractable scheme and propose a novel Hamiltonian Monte Carlo sampler ($q$-HMC). The proposed $q$-HMC method is shown to satisfy the detailed balance principle. Numerical experiments on distributions with explicit potential functions demonstrate its efficacy, particularly in exploring stiff energy landscapes. This method is also applied to draw samples from the Bayesian posterior distribution of inverse problems. The numerical test for the posterior distribution with stiff potential further shows the advantage of $q$-HMC. And it yields the identical computational implementation process to that of HMC when used to deal with functional reconstruction problems."}
{"id": "2512.12766", "categories": ["math.PR", "math.DG"], "pdf": "https://arxiv.org/pdf/2512.12766", "abs": "https://arxiv.org/abs/2512.12766", "authors": ["Yihan Guo", "Lek-Heng Lim"], "title": "Eigen, singular, cosine-sine, and Autonne--Takagi vectors distributions of random matrix ensembles", "comment": "21 pages", "summary": "We show that some of the best-known matrix decompositions of some of the best-known random matrix ensembles give us the unique $G$-invariant uniform distributions on some of the best-known manifolds. The eigenvectors distributions of the Gaussian, Laguerre, and Jacobi ensembles are all given by the uniform distribution on the complete flag manifold. The singular vectors distributions of Ginibre ensembles are given by the uniform distribution on a product of the complete flag manifold with a Stiefel manifold. Circular ensembles split into two types: The cosine-sine vectors distributions of circular real, unitary, and quaternionic ensembles are given by the uniform distributions on products of a (partial) flag manifold with copies of the orthogonal, unitary, or compact symplectic groups. The Autonne--Takagi vectors distributions of circular orthogonal, Lagrangian, and symplectic ensembles are given by the uniform distributions on Lagrangian Grassmannians."}
{"id": "2512.12538", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12538", "abs": "https://arxiv.org/abs/2512.12538", "authors": ["Martin J. Gander", "Yao-Lin Jiang", "Hui Zhang"], "title": "Hierarchical Coarse Basis by Randomised SVD: the Helmholtz Problem", "comment": "8 pages, submitted to DD29 conference proceedings (in peer review)", "summary": "The oscillatory waves require sufficient degrees of freedom to resolve. That restriction usually applies also to coarse problems for Schwarz methods. The resulting coarse problem is then too large. To address the issue, a new form of Schwarz methods with coarse correction is proposed for the Helmholtz problem. There are two components in the proposed form: randomised SVD of interface iteration, and hierarchical domain decomposition. The resulting coarse problem is hierarchical and can be solved in a decoupled way at each level of hierarchy."}
{"id": "2512.13017", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13017", "abs": "https://arxiv.org/abs/2512.13017", "authors": ["Vaibhav Rajoriya", "Prateek Priyaranjan Pradhan", "Ketan Rajawat"], "title": "Hinge-Proximal Stochastic Gradient Methods for Convex Optimization with Functional Constraints", "comment": "34 pages, 2 figures", "summary": "This paper considers stochastic convex optimization problems with smooth functional constraints arising in constrained estimation and robust signal recovery. We operate in the high-dimensional and highly-constrained setting, where oracle access is restricted to one or a few objective and constraint gradients per-iteration, as in streaming or online estimation. Existing approaches to solve such problems are based on either the stochastic primal-dual or stochastic subgradient methods, and require globally Lipschitz continuous constraint functions. In this work, we develop a hinge-proximal framework that utilizes an exact penalty reformulation to yield updates involving only one linearized constraint (and hence accessing one constraint gradient) per-iteration. The updates also admit a novel hinge-proximal three-point inequality relying on smoothness rather than global Lipschitz continuity of the constraint functions. The framework leads to three algorithms: a baseline hinge-proximal SGD (HPS), a variance-reduced HPS version for finite-sum settings, and a nested HPS version whose performance depends on a geometric regularity constant of the constraint region rather than explicitly on the number of constraints, while achieving near-SGD sample complexity. The superior empirical performance of the proposed algorithms is demonstrated on a robust regression problem with noisy features, representative of errors-in-variables estimation."}
{"id": "2512.12796", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12796", "abs": "https://arxiv.org/abs/2512.12796", "authors": ["Maher Boudabra"], "title": "Optimal design for the planar Skorokhod embedding problem", "comment": null, "summary": "We revisit the planar Skorokhod embedding problem introduced by Gross and developed further by Boudabra-Markowsky, and we place it in a fully variational framework. For a centered probability measure $μ$ with finite second moment, we show that Gross' $μ$ -domain $U_μ^{G}$ uniquely minimizes the area among all simply connected $μ$ -domains. Equivalently, $U_μ^{G}$ minimizes a natural $H^{\\frac{1}{2}}$-type boundary energy, providing an optimal design interpretation of the planar Skorokhod embedding problem. The proof relies on the Fourier characterization of fractional Sobolev spaces on the circle, symmetric decreasing rearrangement of the quantile of $μ$ , and a one-dimensional fractional $Pólya-Szegő$ inequality. Within the Schlicht class, we obtain a sharp model case: under a natural normalization of the quantile, the Gross area is uniquely minimized by the shifted arcsine distribution. This identifies the Gross domain of the arcsine law as the extremal Schlicht solution to the planar Skorokhod embedding problem. In the second part of the paper we return to Brownian symmetrization. Using the optimality of $U_μ^{G}$, we prove that Brownian symmetrization is area-nonincreasing and, in fact, dominates Steiner symmetrization in this regard. We then quantify the ratio $$ρ(U):=\\frac{\\mathcal{A}(U_μ^{G})}{\\mathcal{A}(U)},$$showing that, among simply connected domains of fixed area, every value in $(0,1]$ is attained. A family of thin rectangles provides a striking example where the associated one-dimensional laws collapse to a Dirac mass in $L^{2}$ while the Gross domain does not shrink, illustrating the genuinely fractional nature of the underlying $H^{\\frac{1}{2}}$-geometry. Altogether, our results clarify the geometric content of the planar Skorokhod embedding and open a systematic program of \"optimal design\" via Brownian symmetrization."}
{"id": "2512.12684", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12684", "abs": "https://arxiv.org/abs/2512.12684", "authors": ["M. Griebel", "H. Harbrecht"], "title": "Kernel interpolation in Sobolev spaces of hybrid regularity", "comment": null, "summary": "Kernel interpolation in tensor product reproducing kernel Hilbert spaces allows for the use of sparse grids to mitigate the curse of the dimension. Typically, besides the generic constant, only a dimension dependent power of a logarithm term enters here into complexity estimates. We show that optimized sparse grids can avoid this logarithmic factor when the interpolation error is measured with respect to Sobolev spaces of hybrid regularity. Consequently, in such a situation, the complexity of kernel interpolation does not suffer from the curse of dimension."}
{"id": "2512.13041", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13041", "abs": "https://arxiv.org/abs/2512.13041", "authors": ["Daniel Veldman", "Yue Wang"], "title": "A Random Batch Method for the Efficient Simulation and Optimal Control of Networked 1-D Wave Equations", "comment": null, "summary": "In this paper, a stochastic algorithm for the efficient simulation and optimal control of networked wave equations based on the random batch method is proposed and analyzed. The random approximation is constructed by dividing the time interval into subintervals and restricting the dynamics to a randomly chosen subnetwork during each of these subintervals. It is proven that the solution for this randomized system converges in expectation to the solution on the original network when the length of the subintervals approaches zero. Furthermore, the optimal controls for the randomized system converge (in $H^2$ and in expectation) to the optimal controls for the original system. The computational advantage of the proposed method is demonstrated in two numerical examples."}
{"id": "2512.12861", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.12861", "abs": "https://arxiv.org/abs/2512.12861", "authors": ["Shyam Popat", "Zhengyan Wu"], "title": "Ergodicity for the Dean--Kawasaki Equation with Dirichlet Boundary Conditions: Taming the Square-Root", "comment": "44 pages", "summary": "In this paper, we establish the ergodicity of generalized Dean--Kawasaki equations with correlated noise and Dirichlet boundary conditions. In contrast to the ergodicity results of Fehrman, Gess, and Gvalani arXiv:2206.14789, our analysis accommodates irregular, square-root type noise coefficients. For such irregular coefficients, we prove that the law of the classical Dean--Kawasaki equation converges exponentially fast to equilibrium, while for the porous medium type Dean--Kawasaki equation, the convergence occurs at a polynomial rate. Furthermore, we obtain a regularization by noise effect, showing that the polynomial convergence rate improves to an exponential one whenever the noise coefficient is sufficiently regular, including the case of conservative multiplicative linear noise. Our approach relies on establishing a supercontraction property in a suitably weighted Lebesgue space, achieved through a refined doubling of variables argument. The construction of the weight function crucially exploits the specific structure of the Dean--Kawasaki-type correlated noise."}
{"id": "2512.12752", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.12752", "abs": "https://arxiv.org/abs/2512.12752", "authors": ["Elisabetta Carlini", "Ahmad Zorkot"], "title": "Newton Methods for Mean Field Games: A Numerical Study", "comment": null, "summary": "We address the numerical solution of second-order Mean Field Game problems through Newton iterations in infinite dimensions, introduced in [14], where quadratic convergence of the method was rigorously established. Building upon this theoretical framework, we develop new numerical discretization techniques, including both a finite difference and a semi-Lagrangian scheme, that enable an effective computational implementation of the infinite-dimensional iterations.\n  The proposed methods are tested on several benchmark problems, and the resulting numerical experiments demonstrate their robustness, accuracy, and efficiency. A comparative analysis between the two schemes and existing approaches from the literature is also presented, highlighting the potential of Newton-based solvers for MFG systems."}
{"id": "2512.13066", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.13066", "abs": "https://arxiv.org/abs/2512.13066", "authors": ["Hoai-Minh Nguyen"], "title": "Local controllability in finite time and the controllable time of the Korteweg-De Vries equation using the right Neumann controls", "comment": null, "summary": "We investigate the local boundary controllability of the Korteweg-de Vries (KdV) equation with right Neumann boundary controls at critical lengths. We show that the KdV system is not locally null-controllable in small time for all critical lengths for which the unreachable subspace of the linearized system has dimension at least two. This result extends the work of Coron, Koenig, and Nguyen, who established it for a subclass of these lengths. We also obtain a new controllability time for such systems for all but two critical lengths. It is worth noting that the latest results on the controllability time prior to this work date back to the work of Cerpa (2007) and Cerpa and Crepeau (2009)."}
{"id": "2512.12864", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12864", "abs": "https://arxiv.org/abs/2512.12864", "authors": ["Paulo Henrique da Costa", "Alberto Ohashi", "Francesco Russo"], "title": "Forward stochastic integration for adapted processes w.r.t. Riemann-Liouville fractional Brownian motion (Full version)", "comment": "43 pages", "summary": "This paper provides the time-dependent $L^2$-martingale representation of the forward stochastic integral where the driving noise is the Riemann-Liouville fractional Brownian motion with parameter $\\frac{1}{2} < H < 1$ and the integrand is a square-integrable adapted process. As a by-product, we obtain the exact $L^2$-isometry of the forward stochastic integrals based on suitable conditions on time-dependent martingale representations of adapted integrands combined with the Nelson's stochastic derivative of the underlying Gaussian driving noise."}
{"id": "2512.12836", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.12836", "abs": "https://arxiv.org/abs/2512.12836", "authors": ["Harri Hakula", "Oona Rainio", "Matti Vuorinen"], "title": "Fast capacity computation for maze-like configurations", "comment": null, "summary": "We study the conformal capacity ${\\rm cap}(Ω,K)$ where $Ω$ is a bounded domain of $\\mathbb{R}^2$ and $K$ is a compact connected set in $Ω$. Because the exact numerical value of the capacity is known only in a handful of special cases, it is important to find estimates for the capacity in terms of domain functionals, simpler than the capacity itself. Here, we study condensers of maze-like structure and compute their capacity by means of a high-order $hp$- finite element method. We compare these numerical results to the estimates given by the quasihyperbolic length and perimeter of the compact set. In particular, we consider the behaviour of these value pairs, numerical results and estimates, when the structure parameters vary and the walls of the maze approach the compact set. Over the configurations covered in the numerical experiments, the quasihyperbolic estimates are shown to have the desired asymptotic properties and superior computational efficiencies once the case-specific analysis is completed."}
{"id": "2512.13123", "categories": ["math.OC", "cs.LG", "math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.13123", "abs": "https://arxiv.org/abs/2512.13123", "authors": ["Liviu Aolaritei", "Michael I. Jordan"], "title": "Stopping Rules for Stochastic Gradient Descent via Anytime-Valid Confidence Sequences", "comment": null, "summary": "We study stopping rules for stochastic gradient descent (SGD) for convex optimization from the perspective of anytime-valid confidence sequences. Classical analyses of SGD provide convergence guarantees in expectation or at a fixed horizon, but offer no statistically valid way to assess, at an arbitrary time, how close the current iterate is to the optimum. We develop an anytime-valid, data-dependent upper confidence sequence for the weighted average suboptimality of projected SGD, constructed via nonnegative supermartingales and requiring no smoothness or strong convexity. This confidence sequence yields a simple stopping rule that is provably $\\varepsilon$-optimal with probability at least $1-α$ and is almost surely finite under standard stochastic approximation stepsizes. To the best of our knowledge, these are the first rigorous, time-uniform performance guarantees and finite-time $\\varepsilon$-optimality certificates for projected SGD with general convex objectives, based solely on observable trajectory quantities."}
{"id": "2512.12902", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12902", "abs": "https://arxiv.org/abs/2512.12902", "authors": ["Panagiota Birmpa", "Patrícia Gonçalves", "Dimitrios Tsagkarogiannis"], "title": "Non-equilibrium fluctuations for the stirring process with births and deaths", "comment": null, "summary": "We consider the one-dimensional stirring process on the segment $\\{-N,\\ldots,N\\}$, coupled to boundary dynamics that inject particles from the right reservoir and remove particles from the left reservoir, each acting on a window of size $K$. We investigate the non-equilibrium fluctuations of the system, starting from a product measure associated with a smooth initial profile. Given our initial state, the fluctuations are given by an Ornstein-Uhlenbeck process whose characteristic operators are the Laplacian and gradient operators. The domains of these operators include functions with boundary conditions that depend on the hydrodynamic profile. A central ingredient in our analysis is the derivation of sharp bounds on the space and space-time $v$-functions of arbitrary degree for the centered occupation variables. In particular, we prove that the $v$-functions of degree $2$ and $3$ are of order $N^{-1}$, while those of degree at least $4$ are of order $N^{-1-ζ}$ for some $ζ> 0$."}
{"id": "2512.13068", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.13068", "abs": "https://arxiv.org/abs/2512.13068", "authors": ["Zexin Pan"], "title": "Sharp convergence bounds for sums of POD and SPOD weights", "comment": null, "summary": "This work analyzes the convergence of sums of the form $S_{\\boldsymbolγ}(m)=\\sum_{v\\subseteq \\mathbb{N}}γ_v m^{|v|}$, where $γ_v$ are product and order dependent (POD) weights. We establish that for nonnegative sequence $\\{Υ_j\\mid j\\in \\mathbb{N}\\}$, $$\\sum_{v\\subseteq \\mathbb{N}} |v|! m^{|v|}\\prod_{j\\in v} Υ_j<\\infty \\text{ for } m>0 \\text{ if and only if } \\sum_{j=1}^\\infty Υ_j<\\infty.$$ We further characterize the growth of $S_{\\boldsymbolγ}(m)$ when $γ_v=(|v|!)^σ\\prod_{j\\in v}j^{-ρ}$ and prove that $\\log S_{\\boldsymbolγ}(m)$ exhibits asymptotic order $m^{1/(ρ-σ)}$ when $ρ>σ$. All results are subsequently generalized to smoothness-driven product and order dependent (SPOD) weights."}
{"id": "2512.13195", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13195", "abs": "https://arxiv.org/abs/2512.13195", "authors": ["Adam Braun", "Jean Auriol", "Lucas Brivadis"], "title": "A Spectral Exponential Stability Criterion for Integral Difference Equations and Delay Differential Equations in various state spaces", "comment": null, "summary": "It is well-known that the exponential stability of Integral Difference Equations and Delay Difference Equations, in the usual state space of continuous functions, is equivalent to the location of the roots of its associated characteristic equation strictly in the open left half-plane (see e.g. [16, Chapter 9]). In this paper, we use results from [15, Chapter 4] to show that this characterization still holds for other functional state spaces: Lebesgue spaces, the space of Borel measurable bounded functions, and the space of functions with bounded variation."}
{"id": "2512.12937", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.12937", "abs": "https://arxiv.org/abs/2512.12937", "authors": ["Sayak Chatterjee", "Anirban Chatterjee", "Abhinav Chakraborty", "Bhaswar B. Bhattacharya"], "title": "Asymptotic Normality of Subgraph Counts in Sparse Inhomogeneous Random Graphs", "comment": "26 pages, 2 figures", "summary": "In this paper, we derive the asymptotic distribution of the number of copies of a fixed graph $H$ in a random graph $G_n$ sampled from a sparse graphon model. Specifically, we provide a refined analysis that separates the contributions of edge randomness and vertex-label randomness, allowing us to identify distinct sparsity regimes in which each component dominates or both contribute jointly to the fluctuations. As a result, we establish asymptotic normality for the count of any fixed graph $H$ in $G_n$ across the entire range of sparsity (above the containment threshold for $H$ in $G_n$). These results provide a complete description of subgraph count fluctuations in sparse inhomogeneous networks, closing several gaps in the existing literature that were limited to specific motifs or suboptimal sparsity assumptions."}
{"id": "2512.13171", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.13171", "abs": "https://arxiv.org/abs/2512.13171", "authors": ["Abdul Rab"], "title": "Mathematical modelling and simulation of HIV dynamics", "comment": null, "summary": "We study within-host HIV dynamics using a three--component nonlinear ordinary differential equation model for healthy CD4$^{+}$ T cells, infected CD4$^{+}$ T cells, and free virus. In addition to the baseline model without treatment, we consider two treatment extensions that incorporate antiretroviral therapy: (i) separate efficacy terms for Reverse Transcriptase inhibitors and Protease inhibitors acting on infection and virus production, and (ii) a simplified formulation using a single combined efficacy parameter. For each model we determine equilibrium points and apply linearization to obtain the Jacobian matrix and local stability conditions near equilibrium. We perform numerical simulations using the classical fourth--order Runge--Kutta method to illustrate the evolution of cell populations and viral load under different therapy levels and treatment start times, including continuous treatment scenarios. The simulations highlight how therapy strength and timing shape transient behavior and can lead to sustained viral suppression."}
{"id": "2512.13216", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13216", "abs": "https://arxiv.org/abs/2512.13216", "authors": ["Odile Bellenguez", "Nadia Brauner", "Christine Solnon", "Alexis Tsoukias"], "title": "Integrating ethical, societal and environmental issues into algorithm design courses", "comment": null, "summary": "This document, intended for computer science teachers, describes a case study that puts into practice a questioning of ethical, societal and environmental issues when designing or implementing a decision support system. This study is based on a very popular application, namely road navigation software that informs users of real-time traffic conditions and suggests routes between a starting point and a destination, taking these conditions into account (such as Waze). The approach proposes to intertwine technical considerations (optimal path algorithms, data needed for location, etc.) with a broader view of the ethical, environmental and societal issues raised by the tools studied. Based on the authors' experience conducting sessions with students over several years, this document discusses the context of such a study, suggests teaching resources for implementing it, describes ways to structure discussions, and shares scenarios in different teaching contexts."}
{"id": "2512.12971", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2512.12971", "abs": "https://arxiv.org/abs/2512.12971", "authors": ["Andrei Zlotchevski", "Linan Chen"], "title": "A Regime-Switching Approach to the Unbalanced Schrödinger Bridge Problem", "comment": "31 pages, 2 figures", "summary": "The unbalanced Schrödinger bridge problem (uSBP) seeks to interpolate between a probability measure $ρ_0$ and a sub-probability measure $ρ_T$ while minimizing KL divergence to a reference measure $\\mathbf{R}$ on a path space. In this work, we investigate the case where $\\mathbf{R}$ is the path measure of a diffusion process with killing, which we interpret as a regime-switching diffusion. In addition to matching the initial and terminal distributions of trajectories that survive up to time $T$, we consider a general constraint $ψ(t,x)$ on the distribution of killing times and/or killing locations.\n  We investigate the uSBPs corresponding to four choices of $ψ$ in detail which reflect different levels of information available to an observer. We also provide a rigorous analysis of the connections and the comparisons among the outcomes of these four cases. Our results are novel in the field of uSBP. The regime-switching approach proposed in this work provides a unified framework for tackling different uSBP scenarios, which not only reconciles but also extends the existing literature on uSBP."}
{"id": "2512.13246", "categories": ["math.NA", "math.ST"], "pdf": "https://arxiv.org/pdf/2512.13246", "abs": "https://arxiv.org/abs/2512.13246", "authors": ["Xiaomei Yang", "Zhiliang Deng"], "title": "q-Analogue of Hamiltonian Monte Carlo method", "comment": null, "summary": "Building upon Lagrangian mechanics on Wess's $q$-commutative spaces, we derive the $q$-deformed Hamiltonian dynamics as formulated by Lavagno et al. (2006). We then develop a computationally tractable scheme and propose a novel Hamiltonian Monte Carlo sampler ($q$-HMC). The proposed $q$-HMC method is shown to satisfy the detailed balance principle. Numerical experiments on distributions with explicit potential functions demonstrate its efficacy, particularly in exploring stiff energy landscapes. This method is also applied to draw samples from the Bayesian posterior distribution of inverse problems. The numerical test for the posterior distribution with stiff potential further shows the advantage of $q$-HMC. And it yields the identical computational implementation process to that of HMC when used to deal with functional reconstruction problems."}
{"id": "2512.13217", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.13217", "abs": "https://arxiv.org/abs/2512.13217", "authors": ["Lorenzo Sabug", "Eric Kerrigan"], "title": "Rethinking Physics-Informed Regression Beyond Training Loops and Bespoke Architectures", "comment": null, "summary": "We revisit the problem of physics-informed regression, and propose a method that directly computes the state at the prediction point, simultaneously with the derivative and curvature information of the existing samples. We frame each prediction as a constrained optimisation problem, leveraging multivariate Taylor series expansions and explicitly enforcing physical laws. Each individual query can be processed with low computational cost without any pre- or re-training, in contrast to global function approximator-based solutions such as neural networks. Our comparative benchmarks on a reaction-diffusion system show competitive predictive accuracy relative to a neural network-based solution, while completely eliminating the need for long training loops, and remaining robust to changes in the sampling layout."}
{"id": "2512.12991", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.12991", "abs": "https://arxiv.org/abs/2512.12991", "authors": ["Soobin Cho", "Panki Kim", "Renming Song", "Zoran Vondraček"], "title": "Heat kernel estimates for Markov processes in bounded sets with jump kernels decaying at the boundary", "comment": "52 pages", "summary": "In this paper, we study two types of purely discontinuous symmetric Markov processes $X$ in bounded smooth subsets of $\\mathbb R^d$: conservative processes and processes killed either upon approaching the boundary of the set or by a killing potential $κ$. The jump kernel of $X$ is of the form $J(x,y)={\\cal B}(x,y)|x-y|^{-d-α}$, $α\\in (0,2)$, where the function ${\\cal B}(x,y)$ decays to 0 at the boundary and is described in terms of two $O$-regularly varying functions and one slowly varying function. Under the conditions, introduced in \\cite{CKSV24}, on ${\\cal B}(x,y)$ and on the killing potential $κ$, we establish sharp two-sided estimates on the heat kernel of $X$: in Lipschitz sets when $X$ is conservative, and in $C^{1,1}$ open sets for the killed process."}
{"id": "2512.13594", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.13594", "abs": "https://arxiv.org/abs/2512.13594", "authors": ["Simon Jacobsson"], "title": "A homogeneous geometry of low-rank tensors", "comment": null, "summary": "We consider sets of fixed CP, multilinear, and TT rank tensors, and derive conditions for when (the smooth parts of) these sets are smooth homogeneous manifolds. For CP and TT ranks, the conditions are essentially that the rank is sufficiently low. These homogeneous structures are then used to derive Riemannian metrics whose geodesics are both complete and efficient to compute."}
{"id": "2512.13227", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.13227", "abs": "https://arxiv.org/abs/2512.13227", "authors": ["Sarit Khirirat", "Abdurakhmon Sadiev", "Yury Demidovich", "Peter Richtárik"], "title": "Better LMO-based Momentum Methods with Second-Order Information", "comment": null, "summary": "The use of momentum in stochastic optimization algorithms has shown empirical success across a range of machine learning tasks. Recently, a new class of stochastic momentum algorithms has emerged within the Linear Minimization Oracle (LMO) framework--leading to state-of-the-art methods, such as Muon, Scion, and Gluon, that effectively solve deep neural network training problems. However, traditional stochastic momentum methods offer convergence guarantees no better than the ${O}(1/K^{1/4})$ rate. While several approaches--such as Hessian-Corrected Momentum (HCM)--have aimed to improve this rate, their theoretical results are generally restricted to the Euclidean norm setting. This limitation hinders their applicability in problems, where arbitrary norms are often required. In this paper, we extend the LMO-based framework by integrating HCM, and provide convergence guarantees under relaxed smoothness and arbitrary norm settings. We establish improved convergence rates of ${O}(1/K^{1/3})$ for HCM, which can adapt to the geometry of the problem and achieve a faster rate than traditional momentum. Experimental results on training Multi-Layer Perceptrons (MLPs) and Long Short-Term Memory (LSTM) networks verify our theoretical observations."}
{"id": "2512.12994", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.12994", "abs": "https://arxiv.org/abs/2512.12994", "authors": ["Boyuan Ning", "Yasutaka Shimizu"], "title": "From CKLS Process to CIR-type and OU-type Processes: Using a Twice-differentiable Mapping and Generalized Girsanov's Theorem", "comment": null, "summary": "We study a twice-differentiable transformation applied to a CKLS-type short-rate model with linear drift and power-type diffusion. The transformation yields a new process whose diffusion component has a square-root structure and whose drift becomes nonlinear. A critical reassessment of earlier studies using similar transformations reveals fundamental errors in model specification and derivations. To address this, we introduce a generalized Girsanov change of measure that adjusts the drift of the transformed process. Under the resulting equivalent measure, the dynamics reduce to the classical Cox-Ingersoll-Ross (CIR) model. Using the Yamada-Watanabe-Engelbert theorem, we establish existence, uniqueness, and positivity of solutions, and show that the combined transformation and measure change is valid only under specific parameter restrictions, including those most relevant for financial applications. The CIR representation allows us to exploit known results on stationary distributions, moments, and boundary behavior. Under an additional coefficient relationship, the process can be further linked to an Ornstein-Uhlenbeck framework, yielding explicit distributional properties under the equivalent measure. Finally, since standard martingale conditions are not applicable, we prove directly that the associated Radon-Nikodym derivative is a true martingale by invoking a recent criterion based on Feller's explosion test and boundary classification."}
{"id": "2512.13619", "categories": ["math.NA", "cs.CE"], "pdf": "https://arxiv.org/pdf/2512.13619", "abs": "https://arxiv.org/abs/2512.13619", "authors": ["Andrew Welter", "Ngoc Cuong Nguyen"], "title": "Preconditioning Techniques for Hybridizable Discontinuous Galerkin Discretizations on GPU Architectures", "comment": null, "summary": "We present scalable iterative solvers and preconditioning strategies for Hybridizable Discontinuous Galerkin (HDG) discretizations of partial differential equations (PDEs) on graphics processing units (GPUs). The HDG method is implemented using GPU-tailored algorithms in which local element degrees of freedom are eliminated in parallel, and the globally condensed system is assembled directly on the device using dense-block operations. The global matrix is stored in a block format that reflects the natural HDG structure, enabling all iterative solver kernels to be executed with strided batched dense matrix-vector multiplications. This implementation avoids sparse data structures, increases arithmetic intensity, and sustains high memory throughput across a range of meshes and polynomial orders. The nonlinear solver combines Newton's method with preconditioned GMRES, integrating scalable preconditioners such as block-Jacobi, additive Schwarz domain decomposition, and polynomial smoothers. All preconditioners are implemented in batched form with architecture-aware optimizations--including dense linear algebra kernels, memory-coalesced vector operations, and shared-memory acceleration--to minimize memory traffic and maximize parallel occupancy. Comprehensive studies are conducted for a variety of PDEs (including Poisson equation, Burgers equation, linear and nonlinear elasticity, Euler equations, Navier-Stokes equations, and Reynolds-Averaged Navier-Stokes equations) using structured and unstructured meshes with different element types and polynomial orders on both NVIDIA and AMD GPU architectures."}
{"id": "2512.13466", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13466", "abs": "https://arxiv.org/abs/2512.13466", "authors": ["Mohammed N. Khamees", "Kai Sun"], "title": "A Voronoi Diagram-Based Approach for AC Optimal Power Flow", "comment": "Accepted for publication in IET Generation, Transmission & Distribution", "summary": "The primary goal of Optimal Power Flow (OPF) is to optimize the operation of a power system while meeting the demand and adhering to operational constraints. This paper presents a new approach for AC OPF. First, the approach constructs a Voronoi diagram by distributing multiple sample points representing potential solutions throughout the search space. Then, it recursively adds new sample points including a tentative optimal point from the continuous gradient-projection method, a point in the most sparsely populated region to ensure high fidelity, and the connecting point, until the stopping criterion is met. The proposed approach is illustrated in detail using the IEEE 9-bus system and then validated on the IEEE 39-bus and 118-bus systems to verify the quality of the obtained solution."}
{"id": "2512.13067", "categories": ["math.PR", "cs.IT", "math.GR", "stat.CO"], "pdf": "https://arxiv.org/pdf/2512.13067", "abs": "https://arxiv.org/abs/2512.13067", "authors": ["Michael C. H. Choi", "Ryan J. Y. Lim", "Youjia Wang"], "title": "Group-averaged Markov chains II: tuning of group action in finite state space", "comment": "44 pages, 3 figures", "summary": "We study group-averaged Markov chains obtained by augmenting a $π$-stationary transition kernel $P$ with a group action on the state space via orbit kernels. Given a group $\\mathcal{G}$ with orbits $(\\mathcal{O}_i)_{i=1}^k$, we analyse three canonical orbit kernels: namely the Gibbs $(G)$, Metropolis-Hastings $(M)$, and Barker $(B)$ kernels, as well as their multiplicative sandwiches $QPQ$ and the additive mixtures $\\frac{1}{2}(P+Q)$ where $Q\\in\\{G,M,B\\}$. We show that $M^t, B^t \\to G$ blockwise as $t \\to \\infty$ under suitable conditions, that the projection chains induced by $(\\mathcal{O}_i)_{i=1}^k$ coincide for $GPG$ and $P$, and that orbit averaging never deteriorates the absolute spectral gap or asymptotic variance when $P$ is reversible. We give a direct and simple proof of Pythagorean identity under the Kullback-Leibler (KL) divergence, showing that $GPG$ arises naturally as an information projection of $P$ onto the set of $G$-invariant transition matrices. For a given $P$, we characterise the optimal choice of $G$ with a fixed number of orbits that minimises the one-step KL divergence to stationarity. Analogously, for a given $G$, we characterise the optimal choice of $P$ and give sufficient conditions under which $GPG = Π$. We further show that alternating projections over multiple group actions converge at a rate governed by the singular values of an overlap matrix, and that in structured cases, this yields exact sampling where the number of group actions grows logarithmically with the size of the state space. Based on the theory, we propose two heuristics to tune $G$ in practice. We also illustrate the results on discrete uniform and multimodal examples, including the Curie-Weiss model where $GPG$ achieves polynomial (in inverse temperature and dimension) mixing while Glauber dynamics remains exponentially slow."}
{"id": "2512.13631", "categories": ["math.NA", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.13631", "abs": "https://arxiv.org/abs/2512.13631", "authors": ["Sicheng He", "Hang Li", "Kivanc Ekici"], "title": "Torus Time-Spectral Method for Quasi-Periodic Problems", "comment": null, "summary": "Quasi-periodic trajectories with two or more incommensurate frequencies are ubiquitous in nonlinear dynamics, yet the classical Fourier-based time-spectral method is tied to strictly periodic responses. We introduce a torus time-spectral method that lifts the governing equations to an extended angular phase space, applies double-Fourier collocation on the invariant torus, and solves for the state. The formulation exhibits spectral convergence for quasi-periodic problem which we give a rigorous mathematical proof and also verify numerically. We demonstrate the approach on Duffing oscillators and a nonlinear Klein-Gordon system, documenting spectral error decay on the torus and tight agreement with time-accurate integrations while using modest frequency grids. The method extends naturally to higher-dimensional tori and offers a computationally efficient framework for analyzing quasi-periodic phenomena in fluid mechanics, plasma physics, celestial mechanics, and other domains where multi-frequency dynamics arise."}
{"id": "2512.13467", "categories": ["math.OC", "math-ph", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.13467", "abs": "https://arxiv.org/abs/2512.13467", "authors": ["Maike C. de Jongh", "Cristian Spitoni", "Emilio N. M. Cirillo"], "title": "Optimal strategies for the growth of dual-seeded lattice structures", "comment": null, "summary": "Optimal growth of structures governed by spatially stochastic dynamics arises in many scientific settings, for example in processes such as solution-based crystallization and the formation of microbial biofilms on patterned substrates or microfluidic networks. In this work, we investigate lattice growth using a two-dimensional, zero-temperature stochastic model of short-range spin interactions. Our goal is to determine how external perturbations can be optimized to steer the system efficiently toward the uniformly positive state, starting from two initial clusters of positive sites. To achieve this, we cast the problem as a Markov decision process adapted for a two-dimensional Ising model with zero-temperature dynamics. Within this framework, we compare alternative growth geometries and identify the structure of optimal strategies across three representative regimes."}
{"id": "2512.13148", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.13148", "abs": "https://arxiv.org/abs/2512.13148", "authors": ["Fabio Coppini", "Wioletta M. Ruszel"], "title": "Central limit theorems for non-linear functionals of Gaussian fields via Wiener chaos decomposition", "comment": null, "summary": "We review and present some known results for non-linear functionals of Gaussian variables in the context of discrete Gaussian fields defined on the $d$ dimensional lattice. Our main result is a Central Limit Theorem in the spirit of the classical Breuer-Major theorem, together with applications to the powers of the Gaussian Free Field. Notably, we show that even powers of the discrete Gaussian Free Field converge to the Gaussian white noise, while odd powers converge to a continuous Gaussian Free Field with explicit covariance. The proofs are based on the Wiener chaos decomposition and the fourth moment theorem (Nualart-Peccati, 2005), and include a tightness result. Even if these tools are well-known in the literature, their application to Gaussian fields on the lattice appears to be new."}
{"id": "2512.13522", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13522", "abs": "https://arxiv.org/abs/2512.13522", "authors": ["Frédéric Blondeel", "Lorenzo Pareschi", "Giovanni Samaey"], "title": "Collective Annealing by Switching Temperatures: a Boltzmann-type description", "comment": null, "summary": "The design of effective cooling strategies is a crucial component in simulated annealing algorithms based on the Metropolis method. Traditionally, this is achieved through inverse logarithmic decays of the temperature to ensure convergence to global minima. In this work, we propose Collective Annealing by Switching Temperatures (CAST), a novel collective simulated annealing dynamic in which agents interact to learn an adaptive cooling schedule. Inspired by the particle-swapping mechanism of parallel tempering, we introduce a Boltzmann-type framework in which particles exchange temperatures through stochastic binary interactions. This process leads to a gradual decrease of the average temperature in the system. Numerical results demonstrate that the proposed approach consistently outperforms classical simulated annealing with both logarithmic and geometric cooling schedules, particularly in terms of convergence speed."}
{"id": "2512.13150", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.13150", "abs": "https://arxiv.org/abs/2512.13150", "authors": ["Mikael Escobar-Bach", "Alexandre Popier", "Malo Sahin"], "title": "Ratio limit theorem for renewal processes", "comment": null, "summary": "We consider a renewal process which models a cumulative shock model that fails when the accumulation of shocks up-crosses a certain threshold. The ratio limit properties of the probabilities of non-failure after n cumulative shocks are studied. We establish that the ratio of survival probabilities converges to the probability that the renewal epoch equals zero. This limit holds for any renewal process, subject only to mild regularity conditions on the individual shock random variable. Precisions on the rates of convergence are provided depending on the support structure and the regularity of the distribution. Arguments are provided to highlight the coherence between this new results and the pre-existing results on the behavior of summands of i.i.d. real random variables."}
{"id": "2512.13537", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13537", "abs": "https://arxiv.org/abs/2512.13537", "authors": ["Lin Feng", "Hailiang Liu"], "title": "A Generalized Energy-Based Adaptive Gradient Method for Optimization", "comment": null, "summary": "Adaptive Gradient Descent with Energy (AEGD) is a variant of gradient descent (GD) designed to mitigate step-size sensitivity through an energy-based formulation. AEGD is notable for its unconditional energy stability, which guarantees monotonic energy decay and convergence independently of the initial step size. In this work, we propose the Generalized Energy-Based Adaptive Gradient (gAEGD) method, which extends AEGD by replacing the square-root energy with a broader class of admissible energy functions. We show that gAEGD preserves unconditional energy stability, remains robust to step-size selection, and exhibits a two-phase adaptive dynamic: the effective step size first adjusts automatically and then stabilizes within a regime that ensures decay of the objective function values. We establish an optimal convergence rate of $O(\\frac{1}{k})$ for attaining an $ε$-stationary point, and further derive improved convergence rates for the objective gap under a local Kurdyka-Łojasiewicz (KL) condition. Extensive numerical experiments corroborate our theoretical results and demonstrate that a particular instance of gAEGD-ALEGD, which employs a logarithmic energy function-often outperforms AEGD across a range of benchmark optimization problems."}
{"id": "2512.13200", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.13200", "abs": "https://arxiv.org/abs/2512.13200", "authors": ["Marc Arnaudon", "Jean-François Chassagneux", "Sergey Nadtochiy", "Adrien Richou"], "title": "Martingales On A Euclidean Manifold With A Boundary And Reflected BSDES In Non-Convex Domains", "comment": null, "summary": "The purpose of this paper is twofold. First, we introduce the notion of a $Γ$-martingale on a Euclidean manifold with a boundary (i.e., the closure of an open connected domain in R d ), we provide its equivalent characterization through the $Γ$-convex functions, and we establish its connection with the reflected backward stochastic differential equations (BSDEs) in the associated domain. Second, we show how the tools of stochastic geometry can be used to develop a new method for proving existence and uniqueness of solutions to reflected BSDEs. We implement this method and obtain a well-posedness result for reflected BSDEs in any bounded, two-dimensional, simply-connected domain that is locally C2 -diffeomorphic to a convex set. This work extends the results of [6] and [16]."}
{"id": "2512.13547", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.13547", "abs": "https://arxiv.org/abs/2512.13547", "authors": ["Nghia Nguyen-Trung", "Quoc Tran-Dinh"], "title": "A Class of Accelerated Fixed-Point-Based Methods with Delayed Inexact Oracles and Its Applications", "comment": "38 pages and 5 figures", "summary": "In this paper, we develop a novel accelerated fixed-point-based framework using delayed inexact oracles to approximate a fixed point of a nonexpansive operator (or equivalently, a root of a co-coercive operator), a central problem in scientific computing. Our approach leverages both Nesterov's acceleration technique and the Krasnosel'skii-Mann (KM) iteration, while accounting for delayed inexact oracles, a key mechanism in asynchronous algorithms. We also introduce a unified approximate error condition for delayed inexact oracles, which can cover various practical scenarios. Under mild conditions and appropriate parameter updates, we establish both $\\mathcal{O}(1/k^2)$ non-asymptotic and $o(1/k^2)$ asymptotic convergence rates in expectation for the squared norm of residual. Our rate significantly improves the $\\mathcal{O}(1/k)$ rates in classical KM-type methods, including their asynchronous variants. We also establish $o(1/k^2)$ almost sure convergence rates and the almost sure convergence of iterates to a solution of the problem. Within our framework, we instantiate three settings for the underlying operator: (i) a deterministic universal delayed oracle; (ii) a stochastic delayed oracle; and (iii) a finite-sum structure with asynchronous updates. For each case, we instantiate our framework to obtain a concrete algorithmic variant for which our convergence results still apply, and whose iteration complexity depends linearly on the maximum delay. Finally, we verify our algorithms and theoretical results through two numerical examples on both matrix game and shallow neural network training problems."}
{"id": "2512.13289", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.13289", "abs": "https://arxiv.org/abs/2512.13289", "authors": ["Fanny Augeri", "Ofer Zeitouni"], "title": "Maximum of the characteristic polynomial of random Jacobi matrices", "comment": null, "summary": "We compute the second order asymptotics of the maximum of the absolute value of the log-characteristic polynomial of random Jacobi matrices whose coefficients satisfy some exponential integrability condition. In particular, by the triadiagonal representation of Dumitriu and Eldelman of Gaussian $β$ Ensembles, this result partially confirms the Fydorov-Simm conjecture."}
{"id": "2512.13577", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13577", "abs": "https://arxiv.org/abs/2512.13577", "authors": ["Lokendra Kumar", "Neelesh S. Upadhye", "Kannan Piedy"], "title": "Adaptive Efficiency Optimization in SDLC: An MILP Approach for Balanced and Cost-Effective Resource Allocation", "comment": "9 Pages, 2 Figures", "summary": "The efficient allocation of human resources is a critical concern in software development and other industries. This paper introduces a rigorous mathematical methodology for task assignment, employing Mixed Integer Linear Programming (MILP) to ensure both balanced workloads and cost minimization. The proposed model systematically integrates individual employee efficiency, task complexity, and performance metrics to reflect real organizational dynamics. The formulation is guided by two principal objectives: firstly, to achieve equitable work load distribution commensurate with employee efficiency, and secondly, to minimize overall project costs by accounting for task difficulty and individual proficiency. Furthermore, the approach incorporates adaptive updates to efficiency parameters based on observed performance, thereby enhancing its practical applicability. Empirical evaluation using simulated datasets demonstrates the superiority of the proposed method over conventional assignment strategies in terms of both workload fairness and cost reduction. The findings underscore the potential of this MILP based framework as a robust, scalable, and adaptable solution for contemporary human resource allocation challenges in project management contexts."}
{"id": "2512.13449", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.13449", "abs": "https://arxiv.org/abs/2512.13449", "authors": ["Xiao Han"], "title": "A few observations around Gaussian domination and continuous symmetry breaking for spin O(N) model", "comment": null, "summary": "We investigate the notion of Gaussian domination for the spin $O(N)$ model on general finite graphs. We begin by proving a general inequality for spin correlations under the assumption of Gaussian domination, which directly implies long-range order at low temperatures for graphs with bounded Green's function. Usually, Gaussian domination is proved via reflection positivity, but this requires strict symmetries and is very rigid. In this article we also probe the boundaries of elementary methods for proving Gaussian domination. Although we did not find a way to get uniform bounds, we do offer new views for Gaussian domination at low and high temperatures for finite graphs, and a few counterexamples illustrating the interplay between correlation estimates and Gaussian domination and how local changes in the graph structure can affect the presence of Gaussian domination."}
{"id": "2512.13589", "categories": ["math.OC", "math.CA"], "pdf": "https://arxiv.org/pdf/2512.13589", "abs": "https://arxiv.org/abs/2512.13589", "authors": ["Ignacio Huerta", "Pablo Monzón"], "title": "Reciprocal relationship between detectability and observability in a non-uniform setting", "comment": "32 pages", "summary": "Building on the recent notion of non-uniform complete observability, and on the fact that this property ensures non-uniform exponential detectability, this paper establishes the converse implication under suitable additional assumptions. Specifically, we investigate conditions under which non-uniform exponential detectability guarantees non-uniform complete observability. Our approach is based on a refined analysis of the associated output feedback systems and on the preservation of non-uniform observability properties under such feedback transformations. These results extend the classical equivalence between observability and detectability beyond the uniform framework and provide new tools for the qualitative analysis of time-varying control systems."}
{"id": "2512.13620", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.13620", "abs": "https://arxiv.org/abs/2512.13620", "authors": ["Olga Aryasova", "Ilya Pavlyukevich", "Andrey Pilipenko"], "title": "Limit theorems for sticky SDEs with local times and applications to stochastic homogenization", "comment": "28 pages", "summary": "In this paper, we establish a general convergence theorem for solutions of multivariate stochastic differential equations with countably many singular terms expressed as integrals with respect to local times. The processes under consideration describe diffusions in the presence of semipermeable hyperplane interfaces. These interfaces may become sticky after applying a random time change that depends on the amount of local time accumulated on each interface.\n  We show that, as the distance between the interfaces tends to zero, the local-time terms converge to a limiting homogenized drift term. When the interfaces are sticky, the limiting diffusion also decelerates, meaning that its diffusion coefficient is effectively reduced.\n  Such limit theorems illustrate a form of stochastic homogenization for diffusions evolving in a heterogeneous medium interleaved with semipermeable, sticky interfaces."}
{"id": "2512.13626", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.13626", "abs": "https://arxiv.org/abs/2512.13626", "authors": ["Dev Prakash Jha", "Raju K. George"], "title": "Memory-Type Null Controllability of Parabolic Equations with Moving Controls: A Geometric Characterization", "comment": null, "summary": "We study memory-type null controllability for linear parabolic equations with hereditary terms and time-dependent control regions. In contrast with classical null controllability, systems with memory require the simultaneous annihilation of both the state and the accumulated memory at the terminal time in order to prevent post-control reactivation of the dynamics.\n  Assuming that the memory kernel is a finite sum of exponentials, we reformulate the problem as a coupled parabolic--ODE system. Within this framework, we introduce a geometric condition on moving control regions, referred to as the Memory Geometric Control Condition (MGCC), which requires that every spatial point be visited by the control region during the control horizon.\n  Under MGCC, we establish an augmented observability inequality for the adjoint system by means of a flow-adapted Carleman estimate. This observability result, which explicitly accounts for the memory variables, allows us to derive memory-type null controllability via the Hilbert Uniqueness Method. We also discuss the limitations of the approach and explain why full geometric necessity results remain out of reach in the presence of memory effects.\n  The analysis provides a rigorous sufficient geometric condition for memory-type null controllability of parabolic equations with exponential memory kernels and moving controls."}
{"id": "2512.13624", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.13624", "abs": "https://arxiv.org/abs/2512.13624", "authors": ["Romain Panis", "Bruno Schapira"], "title": "Sharp bounds on the half-space two-point function for high-dimensional Bernoulli percolation", "comment": "15 pages, 2 figures", "summary": "We consider Bernoulli percolation on $\\mathbb Z^d$ with $d>6$. We prove an up-to-constant estimate for the critical two-point function restricted to a half-space. This completes previous results of Chatterjee and Hanson (Commun. Pure Appl. Math., 2021), and Chatterjee, Hanson, and Sosoe (Commun. Math. Phys., 2023), and solves a question asked by Hutchcroft, Michta, and Slade (Ann. Probab., 2023)."}
{"id": "2512.12971", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2512.12971", "abs": "https://arxiv.org/abs/2512.12971", "authors": ["Andrei Zlotchevski", "Linan Chen"], "title": "A Regime-Switching Approach to the Unbalanced Schrödinger Bridge Problem", "comment": "31 pages, 2 figures", "summary": "The unbalanced Schrödinger bridge problem (uSBP) seeks to interpolate between a probability measure $ρ_0$ and a sub-probability measure $ρ_T$ while minimizing KL divergence to a reference measure $\\mathbf{R}$ on a path space. In this work, we investigate the case where $\\mathbf{R}$ is the path measure of a diffusion process with killing, which we interpret as a regime-switching diffusion. In addition to matching the initial and terminal distributions of trajectories that survive up to time $T$, we consider a general constraint $ψ(t,x)$ on the distribution of killing times and/or killing locations.\n  We investigate the uSBPs corresponding to four choices of $ψ$ in detail which reflect different levels of information available to an observer. We also provide a rigorous analysis of the connections and the comparisons among the outcomes of these four cases. Our results are novel in the field of uSBP. The regime-switching approach proposed in this work provides a unified framework for tackling different uSBP scenarios, which not only reconciles but also extends the existing literature on uSBP."}
{"id": "2512.12363", "categories": ["math.ST", "math.PR", "stat.ME"], "pdf": "https://arxiv.org/pdf/2512.12363", "abs": "https://arxiv.org/abs/2512.12363", "authors": ["Zeusu Sato"], "title": "On the epsilon-delta Structure Underlying Chatterjee's Rank Correlation", "comment": "11 pages", "summary": "We provide an epsilon-delta interpretation of Chatterjee's rank correlation by tracing its origin to a notion of local dependence between random variables. Starting from a primitive epsilon-delta construction, we show that rank-based dependence measures arise naturally as epsilon to zero limits of local averaging procedures. Within this framework, Chatterjee's rank correlation admits a transparent interpretation as an empirical realization of a local L1 residual.\n  We emphasize that the probability integral transform plays no structural role in the underlying epsilon-delta mechanism, and is introduced only as a normalization step that renders the final expression distribution-free. We further consider a moment-based analogue obtained by replacing the absolute deviation with a squared residual. This L2 formulation is independent of rank transformations and, under a Gaussian assumption, recovers Pearson's coefficient of determination."}
{"id": "2512.13467", "categories": ["math.OC", "math-ph", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.13467", "abs": "https://arxiv.org/abs/2512.13467", "authors": ["Maike C. de Jongh", "Cristian Spitoni", "Emilio N. M. Cirillo"], "title": "Optimal strategies for the growth of dual-seeded lattice structures", "comment": null, "summary": "Optimal growth of structures governed by spatially stochastic dynamics arises in many scientific settings, for example in processes such as solution-based crystallization and the formation of microbial biofilms on patterned substrates or microfluidic networks. In this work, we investigate lattice growth using a two-dimensional, zero-temperature stochastic model of short-range spin interactions. Our goal is to determine how external perturbations can be optimized to steer the system efficiently toward the uniformly positive state, starting from two initial clusters of positive sites. To achieve this, we cast the problem as a Markov decision process adapted for a two-dimensional Ising model with zero-temperature dynamics. Within this framework, we compare alternative growth geometries and identify the structure of optimal strategies across three representative regimes."}
