{"id": "2601.09010", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.09010", "abs": "https://arxiv.org/abs/2601.09010", "authors": ["Leandro Farias Maia"], "title": "Block Decomposable Methods for Large-Scale Optimization Problems", "comment": null, "summary": "This dissertation explores block decomposable methods for large-scale optimization problems. It focuses on alternating direction method of multipliers (ADMM) schemes and block coordinate descent (BCD) methods. Specifically, it introduces a new proximal ADMM algorithm and proposes two BCD methods. The first part of the research presents a new proximal ADMM algorithm. This method is adaptive to all problem parameters and solves the proximal augmented Lagrangian (AL) subproblem inexactly. This adaptiveness facilitates the highly efficient application of the algorithm to a broad swath of practical problems. The inexact solution of the proximal AL subproblem overcomes many key challenges in the practical applications of ADMM. The resultant algorithm obtains an approximate solution of an optimization problem in a number of iterations that matches the state-of-the-art complexity for the class of proximal ADMM schemes. The second part of the research focuses on an inexact proximal mapping for the class of block proximal gradient methods. Key properties of this operator is established, facilitating the derivation of convergence rates for the proposed algorithm. Under two error decreases conditions, the algorithm matches the convergence rate of its exactly computed counterpart. Numerical results demonstrate the superior performance of the algorithm under a dynamic error regime over a fixed one. The dissertation concludes by providing convergence guarantees for the randomized BCD method applied to a broad class of functions, known as Hölder smooth functions. Convergence rates are derived for non-convex, convex, and strongly convex functions. These convergence rates match those furnished in the existing literature for the Lipschtiz smooth setting."}
{"id": "2601.09024", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.09024", "abs": "https://arxiv.org/abs/2601.09024", "authors": ["Leandro Farias Maia", "Robert Baraldi", "Drew P. Kouri"], "title": "An Inexact Weighted Proximal Trust-Region Method", "comment": null, "summary": "In [R. J. Baraldi and D. P. Kouri, Math. Program., 201:1 (2023), pp. 559-598], the authors introduced a trust-region method for minimizing the sum of a smooth nonconvex and a nonsmooth convex function, the latter of which has an analytical proximity operator. While many functions satisfy this criterion, e.g., the $\\ell_1$-norm defined on $\\ell_2$, many others are precluded by either the topology or the nature of the nonsmooth term. Using the $δ$-Fréchet subdifferential, we extend the definition of the inexact proximity operator and enable its use within the aforementioned trust-region algorithm. Moreover, we augment the analysis for the standard trust-region convergence theory to handle proximity operator inexactness with weighted inner products. We first introduce an algorithm to generate a point in the inexact proximity operator and then apply the algorithm within the trust-region method to solve an optimal control problem constrained by Burgers' equation."}
{"id": "2601.09193", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.09193", "abs": "https://arxiv.org/abs/2601.09193", "authors": ["Dev Prakash Jha", "Raju K. George"], "title": "Delay and Memory-Type Null Controllability for Heat Equations in Finite Dimensions", "comment": null, "summary": "We study null controllability for linear heat-type systems in finite dimensions that incorporate both memory and time-delay effects. A strengthened notion of controllability, referred to as delay and memory-type null controllability, is introduced, which requires the state, the memory functional, and the delayed history to vanish at the terminal time. Using a duality approach, we establish an augmented observability inequality for the adjoint system and show its equivalence to controllability. In the finite-dimensional setting, this leads to sharp necessary and sufficient algebraic rank conditions extending the classical Kalman criterion to systems with memory and delay."}
{"id": "2601.09194", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.09194", "abs": "https://arxiv.org/abs/2601.09194", "authors": ["Zahra Sobhani", "Mahmoud Shahrokhi"], "title": "System Availability Optimization: Integrating Quantity Discounts and Delivery Lead Time Considerations", "comment": null, "summary": "Purpose: The model allocates the system components orders to the suppliers to minimize the parts price and the system construction delay penalties and maximize the system availability during its use. It considers the quantity-based discount and variation of delivery lead time by ordering similar components. The model also reflects the prerequisite relationships between construction activities and calculates the delay penalty resulting from parts delivery lead time. Design/methodology/approach: This research presents a model for selecting suppliers of components of an industrial series-parallel multi-state system. A nonlinear binary mathematical program uses the Markov process results to select system components. It minimizes the total system construction phase costs, including the components' price, and the system construction delay penalty, and the system exploitation phase costs, including the system shutdown and working at half capacity. Findings: The model allocates the optimal orders for a typical industrial system's components, composing four elements. The proposed approach combines the nonlinear binary program and the Markov process results to optimize the system life cycle parameters, including the system construction cost and operational availability. Originality/value: Using the Markov chain results in binary nonlinear mathematical programming, this study attempts to strike the right balance between the construction phase's objectives and an industrial unit's operation phase."}
{"id": "2601.09007", "categories": ["math.ST", "math.NA", "stat.CO"], "pdf": "https://arxiv.org/pdf/2601.09007", "abs": "https://arxiv.org/abs/2601.09007", "authors": ["Sven Wang"], "title": "Global polynomial-time estimation in statistical nonlinear inverse problems via generalized stability", "comment": "46 pages, 2 figures", "summary": "Non-linear statistical inverse problems pose major challenges both for statistical analysis and computation. Likelihood-based estimators typically lead to non-convex and possibly multimodal optimization landscapes, and Markov chain Monte Carlo (MCMC) methods may mix exponentially slowly. We propose a class of computationally tractable estimators--plug-in and PDE-penalized M-estimators--for inverse problems defined through operator equations of the form $L_f u = g$, where $f$ is the unknown parameter and $u$ is the observed solution. The key idea is to replace the exact PDE constraint by a weakly enforced relaxation, yielding conditionally convex and, in many PDE examples, nested quadratic optimization problems that avoid evaluating the forward map $G(f)$ and do not require PDE solvers. For prototypical non-linear inverse problems arising from elliptic PDEs, including the Darcy flow model $L_f u = \\nabla\\!\\cdot(f\\nabla u)$ and a steady-state Schrödinger model, we prove that these estimators attain the best currently known statistical convergence rates while being globally computable in polynomial time. In the Darcy model, we obtain an explicit sub-quadratic $o(N^2)$ arithmetic runtime bound for estimating $f$ from $N$ noisy samples. Our analysis is based on new generalized stability estimates, extending classical stability beyond the range of the forward operator, combined with tools from nonparametric M-estimation. We also derive adaptive rates for the Darcy problem, providing a blueprint for designing provably polynomial-time statistical algorithms for a broad class of non-linear inverse problems. Our estimators also provide principled warm-start initializations for polynomial-time Bayesian computation."}
{"id": "2601.08979", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08979", "abs": "https://arxiv.org/abs/2601.08979", "authors": ["Sarah Nataj", "Magnus Appel", "Joe Alexandersen"], "title": "Space-time spectral element method for topology optimization of transient heat conduction", "comment": null, "summary": "We develop a space-time spectral element method for topology optimization of transient heat conduction. The forward problem is discretized with summation-by-parts (SBP) operators, and interface/boundary and initial/terminal conditions are imposed weakly via simultaneous approximation terms (SAT), yielding a stable monolithic space-time scheme on heterogeneous domains. Stability is proven under specific conditions on the SAT parameters, scaled with the spatial mesh resolution and material properties. We compute design sensitivities using a discrete space-time adjoint scheme that is dual-consistent with the primal SBP-SAT scheme. Dual consistency ensures that the discrete adjoint consistently approximates the continuous dual problem and, under standard smoothness assumptions, yields superconvergent functional estimates. We validate the resulting optimal designs by comparison with an independently computed reference optimal design and report time-to-solution and cost-of-accuracy curves, comparing against low-order time-marching and all-at-once solvers for the forward and adjoint systems. The proposed scheme attains high accuracy with fewer space-time degrees of freedom and remains stable, reducing time-to-solution and memory compared with an alternative all-at-once solver. This makes it a future candidate for large-scale topology optimization of time-dependent thermal systems."}
{"id": "2601.08983", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.08983", "abs": "https://arxiv.org/abs/2601.08983", "authors": ["Yinon Spinka", "Oren Yakir"], "title": "Optimal factor matchings for point processes on non-amenable unimodular graphs", "comment": "19 pages", "summary": "Consider a unit-intensity point process $Π$ on the vertex set $V$ of a transitive non-amenable unimodular graph. We study invariant matchings between $Π$ and $V$ having small typical matching distances. When $Π$ is either a Poisson process or i.i.d. perturbations of the vertex set, we determine the optimal matching distance and show that it can be attained by a factor matching scheme (that is, a deterministic and equivariant function of $Π$)."}
{"id": "2601.09210", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.09210", "abs": "https://arxiv.org/abs/2601.09210", "authors": ["Yumiharu Nakano"], "title": "On the Identification of Latent Objectives in Stochastic Control", "comment": null, "summary": "We propose a variational formulation of an inverse problem in continuous-time stochastic control, aimed at identifying control costs consistent with a given distribution over trajectories. The formulation is based on minimizing the suboptimality gap of observed behavior. We establish a connection between the inverse problem and a generalized dynamic Schrödinger problem, showing that their optimal values coincide. This result links inverse stochastic control with stochastic optimal transport, offering a new conceptual viewpoint on inverse inference in controlled diffusions."}
{"id": "2601.09016", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09016", "abs": "https://arxiv.org/abs/2601.09016", "authors": ["Christopher Blier-Wong"], "title": "Stochastic representation of Sarmanov copulas", "comment": null, "summary": "Sarmanov copulas offer a simple and tractable way to build multivariate distributions by perturbing the independence copula. They admit closed-form expressions for densities and many functionals of interest, making them attractive for practical applications. However, the complex conditions on the dependence parameters to ensure that Sarmanov copulas are valid limit their application in high dimensions. Verifying the $d$-increasing property typically requires satisfying a combinatorial set of inequalities that makes direct construction difficult. To circumvent this issue, we develop a stochastic representation for bivariate Sarmanov copulas. We prove that every admissible Sarmanov can be realized as a mixture of independent univariate distributions indexed by a latent Bernoulli pair. The stochastic representation replaces the problem of verifying copula validity with the problem of ensuring nonnegativity of a Bernoulli probability mass function. The representation also recovers classical copula families, including Farlie--Gumbel--Morgenstern, Huang--Kotz, and Bairamov--Kotz--Bekçi as special cases. We further derive sharp global bounds for Spearman's rho and Kendall's tau. We then introduce a Bernoulli-mixing construction in higher dimensions, leading to a new class of multivariate Sarmanov copulas with easily verifiable parameter constraints and scalable simulation algorithms. Finally, we show that powered versions of bivariate Sarmanov copulas admit a similar stochastic representation through block-maximal order statistics."}
{"id": "2601.08990", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08990", "abs": "https://arxiv.org/abs/2601.08990", "authors": ["Patrick Henning", "Laura Huynh"], "title": "Nonlinear Inverse Iterations for Spin-Orbit Coupled Quantum Gases", "comment": null, "summary": "This work concerns the computation of ground states of two-component spin-orbit coupled Bose-Einstein condensates (SO-coupled BECs), modelled by a coupled nonlinear eigenvalue problem of Gross-Pitaevskii type. Spin-orbit coupling gives rise to fascinating phenomena, including supersolid-like phases with spatially modulated densities. However, in such complex settings, conventional numerical approaches, such as generalized inverse iterations or gradient descent, often converge very slowly. To overcome this issue, we apply the concept of the J-method [E.~Jarlebring, S.~Kvaal, W.~Michiels. SIAM~J.~Sci.~Comput.~36-4,~2014] to construct a nonlinear inverse iteration scheme whose convergence can be accelerated through spectral shifting, analogous to techniques used for linear eigenproblems. For a fixed shift parameter, we establish local linear convergence rates determined by spectral gaps in the neighbourhood of each quasi-unique ground state. With adaptively chosen shifts, superlinear convergence is observed, which we verify through numerical experiments."}
{"id": "2601.09197", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09197", "abs": "https://arxiv.org/abs/2601.09197", "authors": ["Luc Tri Tuyen"], "title": "On strong law of large numbers for weakly stationary $\\varphi$-mixing set-valued random variable sequences", "comment": null, "summary": "In this paper we extend the notion of $\\varphi$-mixing to set-valued random sequences that take values in the family of closed subsets of a Banach space. Several strong laws of large numbers for such $\\varphi$-mixing sequences are stated and proved. Illustrative examples show that the hypotheses of the theorems are both natural and sharp."}
{"id": "2601.09311", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09311", "abs": "https://arxiv.org/abs/2601.09311", "authors": ["Marco Fuhrman", "Huyên Pham", "Silvia Ruda"], "title": "Optimal control of McKean-Vlasov systems under partial observation and hidden Markov switching", "comment": "51 pages", "summary": "We study a class of mean-field control problems under partial observation. The controlled dynamics are of McKean-Vlasov type and are subject to regime switching driven by a hidden Markov chain. The observation process depends on the control and on the joint distribution of the state and control, which prevents the direct application of standard filtering techniques. The main contribution of this paper is to show how this distribution dependence can be handled within a change-of-probability framework, leading to a well-posed separated control problem. We derive a Zakai equation with a specific structure for the unnormalized filter, and show that the corresponding value function satisfies a dynamic programming principle. This yields a Bellman equation posed on a convex subset of a Wasserstein space, characterizing the optimal control problem under partial observation."}
{"id": "2601.09122", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.09122", "abs": "https://arxiv.org/abs/2601.09122", "authors": ["Ruchira Ray", "Marco Avella Medina", "Cynthia Rush"], "title": "Statistical Guarantees for Data-driven Posterior Tempering", "comment": null, "summary": "Posterior tempering reduces the influence of the likelihood in the calculation of the posterior by raising the likelihood to a fractional power $α$. The resulting power posterior - also known as an $α$-posterior or fractional posterior - has been shown to exhibit appealing properties, including robustness to model misspecification and asymptotic normality (Bernstein-von Mises theorem). However, practical recommendations for selecting the tempering parameter and statistical guarantees for the resulting power posterior remain open questions. Cross-validation-based approaches to tuning this parameter suggest interesting asymptotic regimes for the selected $α$, which can either vanish or behave like a mixture distribution with a point mass at infinity and the remaining mass converging to zero. We formalize the asymptotic properties of the power posterior in these regimes. In particular, we provide sufficient conditions for (i) consistency of the power posterior moments and (ii) asymptotic normality of the power posterior mean. Our analysis required us to establish a new Laplace approximation that is interesting in its own right and is the key technical tool for showing a critical threshold $α\\asymp 1/\\sqrt{n}$ where the asymptotic normality of the posterior mean breaks. Our results allow for the power to depend on the data in an arbitrary way."}
{"id": "2601.09337", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09337", "abs": "https://arxiv.org/abs/2601.09337", "authors": ["Marcella Bonazzoli", "Gabriele Ciaramella", "Ilario Mazzieri"], "title": "On the unmapped tent pitching for the heterogeneous wave equation", "comment": null, "summary": "The Unmapped Tent Pitching (UTP) algorithm is a space--time domain decomposition method for the parallel solution of hyperbolic problems. It was originally introduced for the homogeneous one-dimensional wave equation in [Ciaramella, Gander, Mazzieri, 2024]. UTP is inspired by the Mapped Tent Pitching (MTP) algorithm [Gopalakrishnan, Sch{ö}berl, Wintersteiger, 2017], which constructs the solution by iteratively building polytopal space--time subdomains, referred to as tents. In MTP, each physical tent is mapped onto a space--time rectangle, where local problems are solved before being mapped back to the original domain. In contrast, UTP avoids the nonlinear and potentially singular mapping step by computing the solution directly on a physical space--time rectangle that contains the tent, at the expense of redundant computations in the region outside the tent. In this work, we investigate several strategies to extend UTP to heterogeneous media, where the wave propagation speed is piecewise constant over two subregions of the domain. Among the considered approaches, the most efficient in terms of computational time is the one employing space--time subdomains with identical spatial and temporal dimensions in both regions, determined by the maximum propagation speed."}
{"id": "2601.09204", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09204", "abs": "https://arxiv.org/abs/2601.09204", "authors": ["Yutao Ma", "Xujia Meng"], "title": "Deviation probabilities and Sharp Berry-Esseen bound for rightmost eigenvalue of large non-Hermitian chiral random matrices", "comment": null, "summary": "This paper provides a quantitative analysis of the rightmost eigenvalue for a chiral non-Hermitian random Dirac matrix in the maximally non-Hermitian regime ($τ=0$). Let $(σ_i)_{1\\le i\\le n}$ be the eigenvalues with positive real part. We define the normalization constants \\[ s_n = \\frac{4n(n+v)}{2n+v}, \\qquad γ_n = \\frac{1}{2}\\log s_n - \\frac{5}{4}\\log(\\log s_n) - \\log\\bigl(2^{1/4}π\\bigr), \\] and the centered and scaled variable \\[ X_n = \\sqrt{2s_n\\log s_n}\\,\\bigl(\\bigl(\\tfrac{n}{n+v}\\bigr)^{1/4}\\,\\max_{1\\le i\\le n}\\Reσ_i \\;-\\; 1 \\;-\\; \\frac{γ_n}{\\sqrt{2s_n\\log s_n}}\\bigr). \\] Our main result is the following sharp Berry--Esseen bound for the convergence of $X_n$ to the Gumbel distribution: \\[ \\sup_{x \\in \\mathbb{R}} \\bigl|\\mathbb{P}(X_n \\le x) - e^{-e^{-x}}\\bigr| = \\frac{25 (\\log\\log s_n)^2}{16 e \\,\\log s_n}\\,\\bigl(1 + o(1)\\bigr), \\] which holds as $n \\to \\infty$ for an arbitrary parameter $v \\ge 0$ (which may depend on $n$). As a byproduct of our analysis, we also obtain precise large- and moderate-deviation principles for the scaled rightmost eigenvalue $\\bigl(\\frac{n}{n+v}\\bigr)^{1/4} \\max_{1\\le i\\le n}\\Reσ_i$, characterizing its rate of convergence to the value $1$."}
{"id": "2601.09471", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.09471", "abs": "https://arxiv.org/abs/2601.09471", "authors": ["Changran He", "Jie Huang"], "title": "A Canonical Internal Model for Disturbance Rejection for a Class of Nonlinear Systems Subject to Trigonometric-Polynomial Disturbances", "comment": null, "summary": "In this paper, we propose a novel framework for disturbance rejection in a class of nonautonomous nonlinear systems affected by trigonometric-polynomial disturbances. The core of our approach is the design of a canonical internal model that directly converts the disturbance rejection problem into an adaptive stabilization problem for an augmented system. Unlike conventional methods, this internal model is synthesized directly from the given nonlinear plant and the knowledge of the exosystem, without relying on the solution of the regulator equations. This makes the approach applicable to a significantly broader class of nonautonomous nonlinear systems. Furthermore, we develop an adaptive disturbance observer comprising the canonical nonlinear internal model, a Luenberger-type state observer, and a parameter adaptation law. This observer ensures global asymptotic convergence of the disturbance estimate to the true disturbance without requiring persistent excitation (PE). Under the PE condition, both the disturbance estimation error and the parameter estimation error converge exponentially. By incorporating the disturbance estimate as a feedforward compensation signal, we establish sufficient conditions for achieving global trajectory tracking and asymptotic disturbance rejection. The effectiveness of the proposed method is demonstrated through a numerical simulation of a flexible-joint robotic manipulator."}
{"id": "2601.09659", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.09659", "abs": "https://arxiv.org/abs/2601.09659", "authors": ["Miguel de Carvalho"], "title": "On the Kolmogorov Superposition Theorem and Regular Means", "comment": null, "summary": "While Kolmogorov's probability axioms are widely recognized, it is less well known that in an often-overlooked 1930 note, Kolmogorov proposed an axiomatic framework for a unifying concept of the mean -- referred to as regular means. This framework yields a well-defined functional form encompassing the arithmetic, geometric, and harmonic means, among others.\n  In this article, we uncover an elegant connection between two key results of Kolmogorov by showing that the class of regular means can be derived directly from the Kolmogorov superposition theorem. This connection is conceptually appealing and illustrates that the superposition theorem deserves wider recognition in Statistics -- not only because of its link to regular means as shown here, but also due to its influence on the development of neural models and its potential connections with other statistical frameworks. In addition, we establish a stability property of regular means, showing that they vary smoothly under small perturbations of the generator. Finally, we provide insights into a recent universal central limit theorem that applies to the broad class of regular means."}
{"id": "2601.09383", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09383", "abs": "https://arxiv.org/abs/2601.09383", "authors": ["Cedric Riethmüller", "Lars von Wolff", "Dominik Göddeke", "Christian Rohde"], "title": "Thermodynamically consistent phase-field modeling and numerical simulation for two-phase fluid-solid dynamics", "comment": null, "summary": "We introduce a coupled Cahn-Hilliard Navier-Stokes model that governs the two-phase dynamics of a system that consists of a fluid and a solid phase and prove its thermodynamic consistency. Moreover, we present an associated fully-discrete numerical method that relies on a continuous finite element approach and a semi-implicit time-stepping method. As the main theoretical result we show that the fully-discrete method satisfies a discrete analog of the free energy dissipation inequality. Numerical experiments confirm the theoretical findings and show the applicability of the method for realistic settings including an extension to chemically reacting flow. In this context, we provide a preprocessing strategy that enables computing fluid flow in complex geometries given a sharp-interface formulation of the initial phase distribution. Moreover, we briefly introduce different solution strategies for the novel discretization based on the monolithic and partitioned solution paradigms and assess these in a comparative study."}
{"id": "2601.09214", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09214", "abs": "https://arxiv.org/abs/2601.09214", "authors": ["Jiří Černý", "Flavio Dalessi"], "title": "Tightness of the maximum of branching random walk in random environment and zero-crossings of solutions to discrete parabolic differential equations", "comment": null, "summary": "We study branching random walk on $\\mathbb{Z}$ in a bounded i.i.d. random environment. For this process, we prove that, for almost every realization of the environment, the distributions of the maximally displaced particle (re-centered around their medians) are tight. This extends the result of arXiv:2408.01555 , where tightness was established in the annealed sense, and of arXiv:2212.12390 , where a similar quenched result was proved for branching Brownian motion in random environment. Our proof relies on studying certain discrete-space linear PDEs and establishing that the number of zero-crossings of their solutions is non-increasing in time. We observe that our technique requires no additional assumptions on the environment, in contrast to arXiv:2408.01555 , arXiv:2212.12390 ."}
{"id": "2601.09486", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.09486", "abs": "https://arxiv.org/abs/2601.09486", "authors": ["Ismail Huseynov", "Arzu Ahmadova", "Agamirza E. Bashirov"], "title": "Partially Exact Controllability of Semilinear Heat Exchanger Systems", "comment": null, "summary": "In this paper, we study two semilinear systems describing a monotubular and a two-stream heat exchanger. Neither system is exactly controllable; however, for each we specify a subspace of the state space with respect to which the system is exactly controllable, thus establishing partial exact controllability."}
{"id": "2601.09437", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09437", "abs": "https://arxiv.org/abs/2601.09437", "authors": ["Sani Biswas"], "title": "A Randomized Milstein Scheme for SDEs with Superlinear Drift Coefficient", "comment": null, "summary": "This work presents a randomized-tamed Milstein scheme for stochastic differential equations whose drift coefficient exhibits superlinear growth in the state variable and limited temporal regularity, quantified by $β$-Hölder continuity with $β\\in (0,1]$. The scheme combines a taming mechanism to control the superlinear state dependence with a drift randomization strategy designed to address the challenges posed by low temporal regularity. Under suitable assumptions on temporal smoothness, the scheme achieves an optimal strong $\\mathscr{L}^p$-convergence rate of order one."}
{"id": "2601.09314", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09314", "abs": "https://arxiv.org/abs/2601.09314", "authors": ["Gerold Alsmeyer", "Anita Behme"], "title": "Tail behavior of Markov-modulated generalized Ornstein-Uhlenbeck processes", "comment": null, "summary": "We study the tail behavior of Markov-modulated generalized Ornstein-Uhlenbeck processes -- that is, solutions to Langevin-type stochastic differential equations driven by a background continuous-time Markov chain. To this end, we consider a sequence of Markov modulated random affine functions $ Ψ_{n} : \\mathbb{R} \\to \\mathbb{R} $, $ n \\in \\mathbb{N} $, and the associated iterated function system defined recursively by $ X_0^x := x $ and $ X_{n}^x := Ψ_{n-1}(X_{n-1}^x) $ for $ x \\in \\mathbb{R} $, $n \\in \\mathbb{N}$. We analyze the tail behavior of the stationary distribution of such a Markov chain using tools from Markov renewal theory. Our approach extends Goldie's implicit renewal theory~\\cite{Goldie:91} and can be seen as an adaptation of Kesten's work on products of random matrices~\\cite{Kesten:73} to the one-dimensional setting of random affine function systems. These results have applications in diverse areas of applied probability, including queueing theory, econometrics, mathematical finance, and population dynamics."}
{"id": "2601.09559", "categories": ["math.OC", "math.AP", "math.PR", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.09559", "abs": "https://arxiv.org/abs/2601.09559", "authors": ["Nunzia Gavitone", "David Krejcirik", "Gloria Paoli"], "title": "Sharp estimates for the Laplacian torsional rigidity with negative Robin boundary conditions", "comment": "13 pages", "summary": "Motivated by pioneering works of Bandle and Wagner, given a bounded Lipschitz domain $Ω\\subset \\mathbb R^d$ with $d\\ge3$, we consider the Robin-Laplacian torsional rigidity $τ_α(Ω)$ with negative boundary parameter $α$ and we show that sharp inequalities for $τ_α(Ω)$ hold if $|α|$ is small enough. In particular, we prove that, if $|α|$ is smaller than the first non-trivial Steklov-Laplacian eigenvalue, then the ball maximises $τ_α(Ω)$ among all convex domains under perimeter or volume constraints.This solves an open problem raised by Bandle and Wagner. We also prove the result in the planar case among simply connected sets and under perimeter constraint."}
{"id": "2601.09450", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09450", "abs": "https://arxiv.org/abs/2601.09450", "authors": ["Patrick Ersing", "Andrew R. Winters"], "title": "A new class of entropy stable fluctuations for the discontinuous Galerkin method with application to the Saint-Venant-Exner model", "comment": null, "summary": "In this work we consider entropy stable discontinuous Galerkin methods applied to nonconservative hyperbolic systems. We introduce a new class of entropy conservative fluctuations that allow us to construct entropy conservative schemes without any system-specific derivations. We demonstrate that a loss of entropy symmetrization for nonconservative systems restricts the design of entropy stable fluctuations and propose a novel blending procedure to construct entropy stable dissipation terms from general numerical viscosity matrices. The resulting methodology is applied to develop a high-order, entropy stable, and well-balanced approximation for the Saint-Venant-Exner system. Numerical tests are presented to verify the theoretical findings and demonstrate the performance and robustness of the proposed scheme."}
{"id": "2601.09324", "categories": ["math.PR", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2601.09324", "abs": "https://arxiv.org/abs/2601.09324", "authors": ["Masaaki Fukasawa"], "title": "Martingale expansion for stochastic volatility", "comment": null, "summary": "The martingale expansion provides a refined approximation to the marginal distributions of martingales beyond the normal approximation implied by the martingale central limit theorem. We develop a martingale expansion framework specifically suited to continuous stochastic volatility models. Our approach accommodates both small volatility-of-volatility and fast mean-reversion models, yielding first-order perturbation expansions under essentially minimal conditions."}
{"id": "2601.09646", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09646", "abs": "https://arxiv.org/abs/2601.09646", "authors": ["K. L. Helmes", "R. H. Stockbridge", "C. Zhu"], "title": "Long-Term Average Impulse and Singular Control of a Growth Model with Two Revenue Sources", "comment": "arXiv admin note: substantial text overlap with arXiv:2505.11345", "summary": "This paper analyzes and explicitly solves a class of long-term average impulse control problems and a related class of singular control problems. The underlying process is a general one-dimensional diffusion with appropriate boundary behavior. The model is motivated by applications such as the optimal long-term management of renewable resources and financial portfolio management. A large class of admissible policies is identified over which the agent seeks to maximize her long-term average reward, consisting of a running reward and income from either discrete impulses or singular actions. The long-term expected total reward and its relation to overtaking optimality is also considered. Sensitivity analysis with regard to the parameters of the impulse control model are performed. Key connections between the impulse and singular control problems are displayed."}
{"id": "2601.09479", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09479", "abs": "https://arxiv.org/abs/2601.09479", "authors": ["Gaurav Saini", "Bappa Ghosh", "Sunita Chand", "Jugal Mohapatra"], "title": "Qualitative and Numerical Simulation of a Time-Fractional SEIR Mpox Model Arising in Population Epidemiology", "comment": null, "summary": "Epidemiological modeling is vital in understanding disease dynamics and guiding public health interventions. This study presents a time-fractional SEIR model to describe the transmission dynamics of Mpox, incorporating memory effects via the fractional derivative. We perform an extensive qualitative investigation, proving that there is a unique solution and that the solutions are Hyers-Ulam stable. To approximate the model numerically, we implement the L1 finite difference scheme for the Caputo derivative and solve the resulting nonlinear system using the Newton-Raphson technique. A detailed error analysis is provided, demonstrating that the scheme achieves algebraic convergence. Comparative results with the Fractional Modified Euler method (FMEM) confirm the superior accuracy and stability of the proposed approach. Numerical simulations under biologically relevant parameters illustrate the impact of the non-integer order and vaccination rate on disease progression. The study underscores the effectiveness of fractional order models in capturing epidemic memory effects and positions the L1 scheme as a robust numerical tool for simulating such dynamics."}
{"id": "2601.09427", "categories": ["math.PR", "math-ph", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.09427", "abs": "https://arxiv.org/abs/2601.09427", "authors": ["Sung-Soo Byun", "Yeong-Gwang Jung", "Guido Mazzuca"], "title": "$q$-deformation of the Marchenko-Pastur law", "comment": "35 pages, 8 figures", "summary": "We study a $q$-deformed random unitary ensemble associated with the little-$q$ Laguerre weight, which provides a discrete analogue of the classical Laguerre unitary ensemble. In the double scaling regime $q=e^{-λ/N}$, where $N$ is the system size and $λ\\ge 0$, we derive the limiting spectral distribution as $N\\to \\infty$, which yields a $q$-deformation of the Marchenko-Pastur law. The limiting density undergoes a phase transition at an explicitly determined critical value $λ_c$: for $λ<λ_c$, the support consists of a single band region, whereas for $λ>λ_c$ an additional saturated region emerges adjacent to the band region. Our derivation of the limiting distribution is based on three complementary approaches: the method of moments, the analysis of a constrained equilibrium problem, and the asymptotic zero distribution of orthogonal polynomials. As a consequence, we establish the convergence of the empirical measure as well as a large deviation principle. In addition, we derive closed-form expressions for the spectral moments using the combinatorial structure of orthogonal polynomials, and obtain large-$N$ expansions for these moments."}
{"id": "2601.09595", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09595", "abs": "https://arxiv.org/abs/2601.09595", "authors": ["Stefano Berrone", "Moreno Pintore", "Gioana Teora"], "title": "Two continuous extensions of the Neural Approximated Virtual Element Method", "comment": null, "summary": "We propose two globally continuous neural-based variants of the Neural Approximated Virtual Element Method (NAVEM), termed B-NAVEM and P-NAVEM. Both approaches construct local basis functions using pre-trained fully connected neural networks while ensuring exact continuity across adjacent mesh elements. B-NAVEM leverages a Physics-Informed Neural Network to approximately solve the local Laplace problem that defines the virtual element basis functions, whereas P-NAVEM directly enforces polynomial reproducibility via a tailored loss function, without requiring harmonicity within the element interior. Numerical experiments assess the methods in terms of computational cost, memory usage, and accuracy during both training and testing phases."}
{"id": "2601.09485", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09485", "abs": "https://arxiv.org/abs/2601.09485", "authors": ["Jianhang Ai", "Christos Pelekis"], "title": "On lower bounds for hypergeometric tails", "comment": "14 pages", "summary": "Let $n,k$ be positive integers such that $n\\geq k$, and let $H$ be a hypergeometric random variable counting the number of black marbles in a sample without replacement of size $k$ from an urn that contains $i\\in \\{1,\\ldots, n\\}$ black and $n - i$ white marbles. It is shown that \\[ \\mathbb{P}(H \\ge \\mathbb{E}(H)) \\ge k/n\\, , \\, \\text{when} \\,\\, n\\ge 8k \\, . \\] Furthermore, provided that $1\\le \\mathbb{E}(H)\\le \\min\\{i,k\\}-2$ as well as that $\\frac{(n-i)(n-k)}{n}>1$, it is shown that \\[ \\mathbb{P}(H\\ge \\mathbb{E}(H)) \\,\\ge\\, \\frac{e^{-1/8}}{4\\sqrt{2}} \\cdot \\sqrt{\\frac{n-1}{n}} \\cdot\\frac{ \\sqrt{\\text{Var}(H)} }{1 + \\sqrt{1+ \\frac{n-1}{n-k}\\cdot\\text{Var}(H)}}\\, . \\] Auxiliary results which may be of independent interest include an upper bound on the tail conditional expectation and a lower bound on the mean absolute deviation of the hypergeometric distribution."}
{"id": "2601.09623", "categories": ["math.NA", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2601.09623", "abs": "https://arxiv.org/abs/2601.09623", "authors": ["Shenhui Ruan", "Andreas G. Class", "Gianluigi Rozza"], "title": "Introduction to the Combination of Reduced Order Models and Domain Decomposition: State of the Art and Perspectives", "comment": null, "summary": "Reduced Order Models (ROMs) have been regarded as an efficient alternative to conventional high-fidelity Computational Fluid Dynamics (CFD) for accelerating the design and optimization processes in engineering applications. Many industrial geometries feature repeating subdomains or contain sub-regions governed by distinct physical phenomena, making them well-suited to Domain Decomposition (DD) techniques. The integration of ROM and DD is promising to further reduce computational costs by constructing local ROMs and assembling them into global solutions. Due to the complexity and necessity of coupling ROMs, many approaches have been proposed in recent years. This review provides a concise overview of existing methodologies combining ROM and DD. We categorize existing methods into intrusive (projection-based) and non-intrusive (data-driven) frameworks. Various strategies for generating local reduced bases and coupling them across subdomains are illustrated. Particular emphasis is placed on intrusive techniques, including equations, numerical algorithms, and practical implementations. The non-intrusive framework is also discussed, highlighting its general procedures, basic formulations, and underlying principles. Finally, we summarise the state of the literature, identify open challenges, and present perspectives on future implementation from an engineering viewpoint."}
{"id": "2601.09537", "categories": ["math.PR", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2601.09537", "abs": "https://arxiv.org/abs/2601.09537", "authors": ["Bjarki Eldon"], "title": "Gene genealogies in haploid populations evolving according to sweepstakes reproduction", "comment": "52 pages, 9 figures", "summary": "Sweepstakes reproduction may be generated by chance matching of reproduction with favorable environmental conditions. Gene genealogies generated by sweepstakes reproduction are in the domain of attraction of multiple-merger coalescents where a random number of lineages merges at such times. We consider population genetic models of sweepstakes reproduction for haploid panmictic populations of both constant ($N$), and varying population size, and evolving in a random environment. We construct our models so that we can recover the observed number of new mutations in a given sample without requiring strong assumptions regarding the population size or the mutation rate. Our main results are {\\it (i)} continuous-time coalescents that are either the Kingman coalescent or specific families of Beta- or Poisson-Dirichlet coalescents; when combining the results the parameter $α$ of the Beta-coalescent ranges from 0 to 2, and the Beta-coalescents may be incomplete due to an upper bound on the number of potential offspring an arbitrary individual may produce; {\\it (ii)} in large populations we measure time in units proportional to either $ N/\\log N$ or $N$ generations; {\\it (iii)} incorporating fluctuations in population size leads to time-changed multiple-merger coalescents where the time-change does not depend on $α$; {\\it (iv)} using simulations we show that in some cases approximations of functionals of a given coalescent do not match the ones of the ancestral process in the domain of attraction of the given coalescent; {\\it (v)} approximations of functionals obtained by conditioning on the population ancestry (the ancestral relations of all gene copies at all times) are broadly similar (for the models considered here) to the approximations obtained without conditioning on the population ancestry."}
{"id": "2601.09657", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09657", "abs": "https://arxiv.org/abs/2601.09657", "authors": ["Constantin Bacuta"], "title": "Explaining oscillatory behavior in convection-diffusion discretization", "comment": "8 figures on 23 pages", "summary": "For a model convection-diffusion problem, we address the presence of oscillatory discrete solutions, and study difficulties in recovering standard approximation results for its solution. We justify the presence of non-physical oscillations and propose ways to eliminate oscillations. A new approach for error analysis that requires establishing optimal discrete infinity error as a first step is introduced and justified. We emphasize that the discretization of two dimensional convection dominated problems benefit from the efficient discretization of the corresponding one dimensional problem along each stream line. Our results are useful in building new and robust discretizations for multi-dimensional convection dominated problems."}
{"id": "2601.09704", "categories": ["math.PR", "math.CO", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.09704", "abs": "https://arxiv.org/abs/2601.09704", "authors": ["Jiahe Shen"], "title": "Quantative universality for cokernels of matrices with symmetries", "comment": "43 pages. Comments welcome!", "summary": "We prove universality for cokernels of random integral matrices with symmetries via an approach different from the classical surjection moment method introduced by Wood (arXiv:1402.5149). In the symmetric case, we reprove Hodges' universality theorem (arXiv:2311.07078), i.e. the version incorporating the canonical pairing from Wood's setting, and in the alternating case we reprove the local universality theorem of Nguyen-Wood (arXiv:2210.08526). A key advantage of our method is that it is quantitative: we obtain explicit error bounds, which are exponentially small in most regimes, thereby addressing Wood's question on effective convergence rates. Our argument is inspired by Maples' exposure-process and coupling viewpoint (arXiv:1301.1239) and uses a generalized form of Fourier-analytic estimates in the exponentially sharp style of Ferber-Jain-Sah-Sawhney (arXiv:2106.04049)."}
{"id": "2601.09007", "categories": ["math.ST", "math.NA", "stat.CO"], "pdf": "https://arxiv.org/pdf/2601.09007", "abs": "https://arxiv.org/abs/2601.09007", "authors": ["Sven Wang"], "title": "Global polynomial-time estimation in statistical nonlinear inverse problems via generalized stability", "comment": "46 pages, 2 figures", "summary": "Non-linear statistical inverse problems pose major challenges both for statistical analysis and computation. Likelihood-based estimators typically lead to non-convex and possibly multimodal optimization landscapes, and Markov chain Monte Carlo (MCMC) methods may mix exponentially slowly. We propose a class of computationally tractable estimators--plug-in and PDE-penalized M-estimators--for inverse problems defined through operator equations of the form $L_f u = g$, where $f$ is the unknown parameter and $u$ is the observed solution. The key idea is to replace the exact PDE constraint by a weakly enforced relaxation, yielding conditionally convex and, in many PDE examples, nested quadratic optimization problems that avoid evaluating the forward map $G(f)$ and do not require PDE solvers. For prototypical non-linear inverse problems arising from elliptic PDEs, including the Darcy flow model $L_f u = \\nabla\\!\\cdot(f\\nabla u)$ and a steady-state Schrödinger model, we prove that these estimators attain the best currently known statistical convergence rates while being globally computable in polynomial time. In the Darcy model, we obtain an explicit sub-quadratic $o(N^2)$ arithmetic runtime bound for estimating $f$ from $N$ noisy samples. Our analysis is based on new generalized stability estimates, extending classical stability beyond the range of the forward operator, combined with tools from nonparametric M-estimation. We also derive adaptive rates for the Darcy problem, providing a blueprint for designing provably polynomial-time statistical algorithms for a broad class of non-linear inverse problems. Our estimators also provide principled warm-start initializations for polynomial-time Bayesian computation."}
{"id": "2601.09016", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09016", "abs": "https://arxiv.org/abs/2601.09016", "authors": ["Christopher Blier-Wong"], "title": "Stochastic representation of Sarmanov copulas", "comment": null, "summary": "Sarmanov copulas offer a simple and tractable way to build multivariate distributions by perturbing the independence copula. They admit closed-form expressions for densities and many functionals of interest, making them attractive for practical applications. However, the complex conditions on the dependence parameters to ensure that Sarmanov copulas are valid limit their application in high dimensions. Verifying the $d$-increasing property typically requires satisfying a combinatorial set of inequalities that makes direct construction difficult. To circumvent this issue, we develop a stochastic representation for bivariate Sarmanov copulas. We prove that every admissible Sarmanov can be realized as a mixture of independent univariate distributions indexed by a latent Bernoulli pair. The stochastic representation replaces the problem of verifying copula validity with the problem of ensuring nonnegativity of a Bernoulli probability mass function. The representation also recovers classical copula families, including Farlie--Gumbel--Morgenstern, Huang--Kotz, and Bairamov--Kotz--Bekçi as special cases. We further derive sharp global bounds for Spearman's rho and Kendall's tau. We then introduce a Bernoulli-mixing construction in higher dimensions, leading to a new class of multivariate Sarmanov copulas with easily verifiable parameter constraints and scalable simulation algorithms. Finally, we show that powered versions of bivariate Sarmanov copulas admit a similar stochastic representation through block-maximal order statistics."}
{"id": "2601.09311", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09311", "abs": "https://arxiv.org/abs/2601.09311", "authors": ["Marco Fuhrman", "Huyên Pham", "Silvia Ruda"], "title": "Optimal control of McKean-Vlasov systems under partial observation and hidden Markov switching", "comment": "51 pages", "summary": "We study a class of mean-field control problems under partial observation. The controlled dynamics are of McKean-Vlasov type and are subject to regime switching driven by a hidden Markov chain. The observation process depends on the control and on the joint distribution of the state and control, which prevents the direct application of standard filtering techniques. The main contribution of this paper is to show how this distribution dependence can be handled within a change-of-probability framework, leading to a well-posed separated control problem. We derive a Zakai equation with a specific structure for the unnormalized filter, and show that the corresponding value function satisfies a dynamic programming principle. This yields a Bellman equation posed on a convex subset of a Wasserstein space, characterizing the optimal control problem under partial observation."}
{"id": "2601.09437", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09437", "abs": "https://arxiv.org/abs/2601.09437", "authors": ["Sani Biswas"], "title": "A Randomized Milstein Scheme for SDEs with Superlinear Drift Coefficient", "comment": null, "summary": "This work presents a randomized-tamed Milstein scheme for stochastic differential equations whose drift coefficient exhibits superlinear growth in the state variable and limited temporal regularity, quantified by $β$-Hölder continuity with $β\\in (0,1]$. The scheme combines a taming mechanism to control the superlinear state dependence with a drift randomization strategy designed to address the challenges posed by low temporal regularity. Under suitable assumptions on temporal smoothness, the scheme achieves an optimal strong $\\mathscr{L}^p$-convergence rate of order one."}
{"id": "2601.09559", "categories": ["math.OC", "math.AP", "math.PR", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.09559", "abs": "https://arxiv.org/abs/2601.09559", "authors": ["Nunzia Gavitone", "David Krejcirik", "Gloria Paoli"], "title": "Sharp estimates for the Laplacian torsional rigidity with negative Robin boundary conditions", "comment": "13 pages", "summary": "Motivated by pioneering works of Bandle and Wagner, given a bounded Lipschitz domain $Ω\\subset \\mathbb R^d$ with $d\\ge3$, we consider the Robin-Laplacian torsional rigidity $τ_α(Ω)$ with negative boundary parameter $α$ and we show that sharp inequalities for $τ_α(Ω)$ hold if $|α|$ is small enough. In particular, we prove that, if $|α|$ is smaller than the first non-trivial Steklov-Laplacian eigenvalue, then the ball maximises $τ_α(Ω)$ among all convex domains under perimeter or volume constraints.This solves an open problem raised by Bandle and Wagner. We also prove the result in the planar case among simply connected sets and under perimeter constraint."}
{"id": "2601.09646", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.09646", "abs": "https://arxiv.org/abs/2601.09646", "authors": ["K. L. Helmes", "R. H. Stockbridge", "C. Zhu"], "title": "Long-Term Average Impulse and Singular Control of a Growth Model with Two Revenue Sources", "comment": "arXiv admin note: substantial text overlap with arXiv:2505.11345", "summary": "This paper analyzes and explicitly solves a class of long-term average impulse control problems and a related class of singular control problems. The underlying process is a general one-dimensional diffusion with appropriate boundary behavior. The model is motivated by applications such as the optimal long-term management of renewable resources and financial portfolio management. A large class of admissible policies is identified over which the agent seeks to maximize her long-term average reward, consisting of a running reward and income from either discrete impulses or singular actions. The long-term expected total reward and its relation to overtaking optimality is also considered. Sensitivity analysis with regard to the parameters of the impulse control model are performed. Key connections between the impulse and singular control problems are displayed."}
