{"id": "2601.17175", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17175", "abs": "https://arxiv.org/abs/2601.17175", "authors": ["Michael J. Klass", "Victor H. de la Pena"], "title": "Beyond Wald's Equation and the Optional Sampling Theorem", "comment": "7 pages", "summary": "From the perspective of expectations of randomly stopped sums, Wald's equation and the Optional Sampling Theorem identify situations in which the stopping time can be decoupled from the stopping place, acting as if the two were independent. Herein we consider arbitrary mean zero Martingales and their extended-valued stopping times, proving two fundamental theorems and a general corollary. Examples, counter-examples and discussion are also included.\n  The first theorem establishes conditions under which a stopped martingale's expected value can be characterized by a finite real number, also yielding a new expectation limit. Two corollaries and an application provide information on the rate of decay of the tail probability of the stopping time.\n  The second theorem provides sufficient conditions to ensure that an extended-valued stopping time is finite with probability one. We demonstrate these results through various examples and explore their implications for different families of martingales. Our findings extend classical results in martingale theory and provide new insights into the behavior of stopped martingales, especially when the expected values are the stopped Martingale on the set where the extended-valued stopping time $T$ is finite is different from the expected value of the Martingale at time 1."}
{"id": "2601.17250", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17250", "abs": "https://arxiv.org/abs/2601.17250", "authors": ["Hanwu Li"], "title": "Conditional Reflected Backward Stochastic Differential Equations with Two Barriers", "comment": null, "summary": "In this paper, we study the doubly conditional reflected backward stochastic differential equations (BSDEs), where constraints are made on the conditional expectation of the first component of the solution with respect to a general subfiltration. With the help of the Skorokhod problem on a time-dependent interval and the Dynkin game in a general framework, we establish the existence and uniqueness result under the Mokobodski condition for the obstacles. The relation between the conditional expectation of the solution and the value function of a certain Dynkin game with partial information is obtained. As a by-product, we obtain a weaker version of the comparison theorem. Finally, we provide an application to the starting and stopping problem in reversible investments under partial information."}
{"id": "2601.17306", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17306", "abs": "https://arxiv.org/abs/2601.17306", "authors": ["Barkat Mian"], "title": "Planar diffusions with a point interaction on a finite time horizon", "comment": "31 pages, 3 figures", "summary": "The skew-product diffusion [Ann. Appl. Probab. 35, 3150--3214 (2025)] and exponentially tilted planar Brownian motion [Electron. J. Probab. 30, 1--97 (2025)] are canonical examples of planar diffusions with a point interaction at the origin in the sense that their drifts are singular only at the origin and allow visits there with positive probability. However, in this article we propose an axiomatic framework for such diffusions on a finite time horizon. We isolate admissibility conditions and additional regularity hypotheses on a general driving family under which the associated diffusion, constructed as a Doob transform of point-interaction Schrödinger semigroup kernels, exhibits the same point interaction structure. In particular, for the ground-state driving family, we obtain a heuristic alternative construction of the skew-product diffusion based on Kolmogorov continuity arguments. We also consider formal applications of this framework to some driving families generated by measures, including the Lebesgue-driven diffusion, which is the exponentially tilted planar Brownian motion."}
{"id": "2601.17392", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17392", "abs": "https://arxiv.org/abs/2601.17392", "authors": ["Pierre Del Moral", "Bouchra Nasri", "Bruno Rémillard"], "title": "Fluctuations and Long-Time Stability of Multivariate Ensemble Kalman Filters", "comment": null, "summary": "We develop a self contained stochastic perturbation theory for discrete generation and multivariate Ensemble Kalman filters. Unlike their continuous-time counterparts, discrete EnKF algorithms are defined through a two steps prediction update mechanism and exhibit non Gaussian fluctuations, even in linear settings. In the multivariate case, these fluctuations take the form of non central Wishart type perturbations, which significantly complicate the mathematical analysis. We establish non asymptotic, time-uniform stability and error estimates for the ensemble covariance matrix processes under minimal structural assumptions on the signal observation model, allowing for possibly unstable dynamics. Our results quantify the impact of ensemble size, dimension, and observation noise, and provide explicit bounds on the propagation of stochastic errors over long time horizons. The analysis relies on a detailed study of stochastic Riccati difference equations driven by matrix-valued noncentral Wishart fluctuations. Beyond their relevance to data assimilation, these results contribute to the probabilistic understanding of ensemble-based filtering methods in high dimension and offer new tools for the analysis of interacting particle systems with matrix-valued dynamics."}
{"id": "2601.17302", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.17302", "abs": "https://arxiv.org/abs/2601.17302", "authors": ["John H. J. Einmahl", "Yi He"], "title": "Tighter confidence intervals for quantiles of heterogeneous data", "comment": null, "summary": "It is well known that the asymptotic variance of sample quantiles can be reduced under heterogeneity relative to the i.i.d. setting. However, asymptotically correct confidence intervals for quantiles are not yet available. We propose a novel, consistent estimator of the reduced asymptotic variance arising when quantiles are computed from groups of observations, leading to asymptotically correct confidence intervals. Simulation studies show that our confidence intervals are substantially shorter than those in the i.i.d. case and attain nearly correct coverage across a wide range of heterogeneous settings."}
{"id": "2601.17283", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17283", "abs": "https://arxiv.org/abs/2601.17283", "authors": ["Jacob Linden", "Travis Askham", "Jeremy Hoskins"], "title": "A Boundary Integral Formulation of an Acoustic Boundary Layer Model in 2D", "comment": "23 pages, 10 figures", "summary": "We present a boundary integral formulation of the Helmholtz equation with visco-thermal boundary conditions, in two dimensions. Such boundary conditions allow for the accurate simulation of viscous and thermal losses in the vicinity of the boundary, which are particularly relevant in acoustic devices with narrow features. Using cancellations between hyper-singular operators, a variant of the method of images technique, and analytic pre-conditioners, we derive integral equations that are Fredholm second-kind, up to the application of a boundedly invertible operator. This approach allows for the fast and accurate solution of acoustics problems with boundary layers."}
{"id": "2601.17128", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.17128", "abs": "https://arxiv.org/abs/2601.17128", "authors": ["Anran Li", "John P. Swensen", "Mehdi Hosseinzadeh"], "title": "A Block-Alternating Iterative Approach for a Class of Non-Convex Optimization Problems", "comment": null, "summary": "Constrained non-convex optimization problems frequently arise in control applications. Solving such problems is inherently challenging, as existing methods often converge to suboptimal local minima or incur prohibitive computational costs. To address this challenge, this paper proposes a novel block-alternating iterative method that decomposes the original problem into variable-specific subproblems, which are solved iteratively. Under the assumption that the problem is convex with respect to each decision variable, the proposed approach reformulates the original problem into a sequence of convex subproblems. Theoretical results are established regarding the convergence and optimality of the method. In addition, a numerical example and a real-world control engineering application are presented to demonstrate its effectiveness. Finally, this paper introduces a ready-to-use Python platform that implements the proposed method, together with existing algorithms, to facilitate comparison and adoption."}
{"id": "2601.17501", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.17501", "abs": "https://arxiv.org/abs/2601.17501", "authors": ["A. Arriaza", "F. Belzunce", "C. Martínez-Riquelme"], "title": "Sufficient conditions for some transform orders based on the quantile density ratio", "comment": "29 pages. Author accepted manuscript", "summary": "In this paper we focus on providing sufficient conditions for some transform orders for which the quantile densities ratio is non-monotone and, therefore, the convex transform order does not hold. These results are interesting for comparing random variables with a non-explicit expression of their quantile functions or they are computationally complex. In addition, the main results are applied to compare two Tukey generalized distributed random variables and to establish new relationships among non-monotone and positive aging notions."}
{"id": "2601.17511", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.17511", "abs": "https://arxiv.org/abs/2601.17511", "authors": ["F. Belzunce", "C. Martínez-Riquelme"], "title": "A new stochastic dominance criterion for dependent random variables with applications", "comment": "12 pages. Author accepted manuscript", "summary": "In this paper we develop a new tool for the comparison of paired data based on a new criterion of stochastic dominance that takes into account the dependence structure of the random variables under comparison. This new procedure provides a more detailed comparison of dependent random variables and overcomes some difficulties of standard techniques like Student's t and Wilcoxon-Mann-Whitney tests for non normal data. This tool provides an alternative to the usual stochastic dominance criterion which only considers the marginal distributions in the comparison. We show how this new tool can be fruitfully used for the comparison of paired asset returns."}
{"id": "2601.17305", "categories": ["math.NA", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.17305", "abs": "https://arxiv.org/abs/2601.17305", "authors": ["C G Krishnanunni", "Jonathan Wittmer", "Tan Bui-Thanh", "Quoc P. Nguyen"], "title": "A New Look at the Ensemble Kalman Filter for Inverse Problems: Duality, Non-Asymptotic Analysis and Convergence Acceleration", "comment": null, "summary": "This work presents new results and understanding of the Ensemble Kalman filter (EnKF) for inverse problems. In particular, using a Lagrangian dual perspective we show that EnKF can be derived from the sample average approximation (SAA) of the Lagrangian dual function. The beauty of this new duality perspective is that it facilitates us to prove and numerically verify a novel non-asymptotic convergence result for the EnKF. Motivated by the new perspective, we also present a new convergence improvement strategy for the Ensemble Kalman Inversion Algorithm (EnKI), which is an iterative version of the EnKF for inverse problems. In particular, we propose an adaptive multiplicative correction to the sample covariance matrix at each iteration and we call this new algorithm as EnKI-MC (I). Based on the new duality perspective, we derive an expression for the optimal correction factor at each iteration of the EnKI algorithm to accelerate the convergence. In addition, we also consider an ensemble specific multiplicative covariance correction strategy (EnKI-MC (II)) where a different correction is employed for each ensemble. By viewing EnKI through the lens of fixed-point iteration, we also provide theoretical results that guarantees the convergence of EnKI-MC (I) algorithm. Numerical investigations for the deconvolution problem, initial condition inversion in advection-convection problem, initial condition inversion in a Lorenz 96 model, and inverse problem constrained by elliptic partial differential equation are conducted to verify the non-asymptotic results for EnKF and to assess the performance of convergence improvement strategies for EnKI. The numerical results suggest that the proposed strategies for EnKI not only led to faster convergence in comparison to the currently employed techniques but also better quality solutions at termination of the algorithm."}
{"id": "2601.17171", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.17171", "abs": "https://arxiv.org/abs/2601.17171", "authors": ["Yehya Cheryala", "Mokhtar Z. Alaya", "Salim Bouzebda"], "title": "A Unified Kantorovich Duality for Multimarginal Optimal Transport", "comment": null, "summary": "Multimarginal optimal transport (MOT) has gained increasing attention in recent years, notably due to its relevance in machine learning and statistics, where one seeks to jointly compare and align multiple probability distributions. This paper presents a unified and complete Kantorovich duality theory for MOT problem on general Polish product spaces with bounded continuous cost function. For marginal compact spaces, the duality identity is derived through a convex-analytic reformulation, that identifies the dual problem as a Fenchel-Rockafellar conjugate. We obtain dual attainment and show that optimal potentials may always be chosen in the class of $c$-conjugate families, thereby extending classical two-marginal conjugacy principle into a genuinely multimarginal setting. In non-compact setting, where direct compactness arguments are unavailable, we recover duality via a truncation-tightness procedure based on weak compactness of multimarginal transference plans and boundedness of the cost. We prove that the dual value is preserved under restriction to compact subsets and that admissible dual families can be regularized into uniformly bounded $c$-conjugate potentials. The argument relies on a refined use of $c$-splitting sets and their equivalence with multimarginal $c$-cyclical monotonicity. We then obtain dual attainment and exact primal-dual equality for MOT on arbitrary Polish spaces, together with a canonical representation of optimal dual potentials by $c$-conjugacy. These results provide a structural foundation for further developments in probabilistic and statistical analysis of MOT, including stability, differentiability, and asymptotic theory under marginal perturbations."}
{"id": "2601.17541", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17541", "abs": "https://arxiv.org/abs/2601.17541", "authors": ["Manfred Marvin Marchione", "Enzo Orsingher"], "title": "One-dimensional and planar random motions with variable propagation speeds", "comment": null, "summary": "In this paper, we study univariate and planar random motions with variable propagation speeds. We first consider motions with space-varying velocity, which can be reduced to constant-velocity motions by means of suitable nonlinear transformations. We examine a special case of a motion which is confined within the unit interval. To provide a general expression of the moments of this process, we introduce a new family of polynomials which generalize the classical Euler polynomials. We then examine a planar extension of this process which moves along orthogonal directions. A process with velocity depending on the direction is also examined, and its mean conditional on the initial direction and the number of direction changes is given in terms of confluent hypergeometric functions. We conjecture that, in the hydrodynamic limit, this process is absorbed at a point in an arbitrarily small time. We finally study a motion with time-dependent velocity. We prove that this process can be represented as an integral with respect to a standard telegraph process, and we obtain its covariance function explicitly. Moreover, we show that this process behaves as a Itô integral with respect to Brownian motion in the hydrodynamic limit."}
{"id": "2601.17518", "categories": ["math.ST", "stat.AP", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.17518", "abs": "https://arxiv.org/abs/2601.17518", "authors": ["Belzunce", "F.", "Martínez-Riquelme", "C.", "Mercader", "J. A.", "Ruiz", "J. M"], "title": "Comparisons of policies based on relevation and replacement by a new one unit in reliability", "comment": "17 pages. Author accepted manuscript", "summary": "The purpose of this paper is to study the role of the relevation transform, where a failed unit is replaced by a used unit with the same age as the failed one, as an alternative to the policy based on the replacement by a new one. In particular, we compare the stochastic processes arising from a policy based on the replacement of a failed unit by a new one and from the one in which the unit is being continuously subjected to a relevation policy. The comparisons depend on the aging properties of the units under repair."}
{"id": "2601.17318", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17318", "abs": "https://arxiv.org/abs/2601.17318", "authors": ["Qinghua Wei", "Xiaopeng Zhu", "Zhongyi Huang"], "title": "The direct-line method for forward and inverse linear elasticity problems of composite materials in general domains with multiple singularities", "comment": null, "summary": "In this work, a combined strategy of domain decomposition and the direct-line method is implemented to solve the forward and inverse linear elasticity problems of composite materials in general domains with multiple singularities. Domain decomposition technology treats the general domain as the union of some star-shaped subdomains, which can be handled using the direct-line method. The direct-line method demonstrates rapid convergence of the semi-discrete eigenvalues towards the exact eigenvalues of the elliptic operator, thereby naturally capturing the singularities. We also establish optimal error estimates for the proposed method. Especially, our method can handle multiple singular point problems in general regions, which are difficult to deal with by most methods. On the other hand, the inverse elasticity problem is constructed as a energy functional minimization problem with total variational regularization, we use the aforementioned method as a forward solver to reconstruct the lamé coefficient of multiple singular points in general regions. Our method can simultaneously deduce heterogeneous $μ$ and $λ$ between different materials. Through numerical experiments on three forward and inverse problems, we systematically verified the accuracy and reliability of this method to solve forward and inverse elastic problems in general domains with multiple singularities."}
{"id": "2601.17362", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.17362", "abs": "https://arxiv.org/abs/2601.17362", "authors": ["Jingtao Lin", "Jingtao Shi"], "title": "A Partially Observed Stochastic Linear Stackelberg Differential Game with Poisson Jumps under Mean-Variance Criteria", "comment": "26 pages", "summary": "In this paper, a partially observed stochastic linear Stackelberg differential game with mean-variance criteria is studied. Randomness comes from Brownian motions and Poisson random measures. which leads to a circular dependency. We follow the orthogonal decomposition method to overcome the circular dependency of the control and state processes. Both original problems of the follower and leader are decomposed into several fully observed problems with mean-variance criteria. During these processes, non-linear stochastic filtering with Poisson random measures, developed in this paper, plays an important role. Besides the follower's problem is embedded into a class of auxiliary stochastic linear-quadratic optimal control problem of stochastic differential equations with Poisson jumps, the leader's problem is also embedded into a class of auxiliary stochastic linear-quadratic optimal control problem of forward-backward stochastic differential equations with Poisson jumps. Observable state feedback Stackelberg equilibria are obtained, via some Riccati equations."}
{"id": "2601.17591", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.17591", "abs": "https://arxiv.org/abs/2601.17591", "authors": ["Julia Gaudio", "Andrew Jin"], "title": "Exact Recovery in the Geometric Hidden Community Model", "comment": null, "summary": "Hidden community problems, such as community detection in the Stochastic Block Model (SBM), submatrix localization, and $\\mathbb{Z}_2$ synchronization, have received considerable attention in the probability, statistics, and information-theory literature. Motivated by transitive behavior in social networks, which tend to exhibit high triangle density, recent works have considered hidden community models in spatially-embedded networks. In particular, Baccelli and Sankararaman proposed the Geometric SBM, a spatially-embedded analogue of the standard SBM with dramatically more triangles. In this paper, we consider the problem of exact recovery for the Geometric Hidden Community Model (GHCM) of Gaudio, Guan, Niu, and Wei, which generalizes the Geometric SBM to allow for arbitrary pairwise observation distributions. Under mild technical assumptions, we find the information-theoretic threshold for exact recovery in the ``distance-dependent'' GHCM, which allows the pairwise distributions to depend on distance as well as community labels, thus completing the picture of exact recovery in spatially-embedded hidden community models."}
{"id": "2601.17565", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.17565", "abs": "https://arxiv.org/abs/2601.17565", "authors": ["Enrique de Amo", "David García-Fernández", "Manuel Úbeda-Flores"], "title": "Directional footrule-coefficients", "comment": null, "summary": "Rank-based dependence measures such as Spearman's footrule are robust and invariant, but they often fail to capture directional or asymmetric dependence in multivariate settings. This paper introduces a new family of directional Spearman's footrule coefficients for multivariate data, defined within the copula framework to clearly separate marginal behavior from dependence structure. We establish their main theoretical properties, showing full consistency with the classical footrule, including behavior under independence and extreme dependence, as well as symmetry and reflection properties. Nonparametric rank-based estimators are proposed and their asymptotic consistency is discussed. Explicit expressions for several known families of copulas illustrate the ability of the proposed coefficients to detect directional dependence patterns undetected by classical measures."}
{"id": "2601.17375", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17375", "abs": "https://arxiv.org/abs/2601.17375", "authors": ["Peiyi Liu", "Zhaoqiang Liu", "Yiqi Gu"], "title": "Operator splitting based diffusion samplers and improved convergence analysis", "comment": null, "summary": "In this paper, we develop a class of samplers for the diffusion model using the operator-splitting technique. The linear drift term and the nonlinear score-driven drift of the probability flow ordinary differential equation are split and applied by flow maps alternatively. Moreover, we conduct detailed analyses for the second-order sampler, establishing a non-asymptotic total variation distance error bound of order $O(d/T^2+\\sqrt{d}\\varepsilon_{\\mathrm{score}}+d\\varepsilon_{\\mathrm{Jac}})$, where $d$ is the data dimension; $T$ is the number of sampling steps; $\\varepsilon_{\\mathrm{score}}$ and $\\varepsilon_{\\mathrm{Jac}}$ measure the discrepancy between the actual score function and learned score function. Our bound is sharper than existing works, yielding bounds of $O(d^p/T^2)$ with some $p>1$ for specific second-order samplers. Numerical experiments on a two-dimensional synthetic dataset corroborate the established quadratic dependence on the step size $1/T$ in the error bound."}
{"id": "2601.17521", "categories": ["math.OC", "cs.GT", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.17521", "abs": "https://arxiv.org/abs/2601.17521", "authors": ["Dean Kraizberg"], "title": "Winning Criteria for Open Games: A Game-Theoretic Approach to Prefix Codes", "comment": null, "summary": "We study two-player games with alternating moves played on infinite trees. Our main focus is on the case where the trees are full (regular) and the winning set is open (with respect to the product topology on the tree). Gale and Stewart showed that in this setting one of the players always has a winning strategy, though it is not known in advance which player. We present simple necessary conditions for the first player to have a winning strategy, and establish an equivalence between winning sets that guarantee a win for the first player and maximal prefix codes. Using this equivalence, we derive a necessary algebraic condition for winning, and exhibit a family of games for which this algebraic condition is in fact equivalent to winning. We introduce the concept of coverings, and show that by covering the graph with an infinite labeled tree corresponding to the free group, we can derive a simple trait of maximal prefix codes."}
{"id": "2601.17634", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.17634", "abs": "https://arxiv.org/abs/2601.17634", "authors": ["Alexander Omelchenko"], "title": "Balanced weighted Motzkin paths: Pearson structure and saddlepoint asymptotics", "comment": "20 pages, 5 figures", "summary": "We analyse weighted Motzkin paths with step multiplicities that vary linearly with height. In the balanced case the associated exponential generating function satisfies a Pearson-type PDE, and solving by characteristics yields closed expressions in all drift regimes. These formulas reveal a moving algebraic singularity that governs both local and global behaviour. Locally this gives a Gaussian central window for the terminal-height distribution, while globally we identify an explicit limit cumulant generating function and prove an $n$-speed large-deviation principle. For finite $n$, Daniels' lattice saddlepoint approximation provides a single formula that is accurate across the full range of $k$; in all quadratic regimes it achieves a uniform interior relative error of order $n^{-1}$. The results link Pearson geometry with uniform saddlepoint methods and extend naturally to other weighted path models and tridiagonal recurrences."}
{"id": "2601.17605", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.17605", "abs": "https://arxiv.org/abs/2601.17605", "authors": ["Oliver Lunding Sandqvist"], "title": "Event history analysis with time-dependent covariates via landmarking supermodels and boosted trees", "comment": null, "summary": "We propose a nonparametric method for dynamic prediction in event history analysis with high-dimensional, time-dependent covariates. The approach estimates future conditional hazards by combining landmarking supermodels with gradient boosted trees. Unlike joint modeling or Cox landmarking models, the proposed estimator flexibly captures interactions and nonlinear effects without imposing restrictive parametric assumptions or requiring the covariate process to be Markovian. We formulate the approach as a sieve M-estimator and establish weak consistency. Computationally, the problem reduces to a Poisson regression, allowing implementation via standard gradient boosting software. A key theoretical advantage is that the method avoids the temporal inconsistencies that arise in landmark Cox models. Simulation studies demonstrate that the method performs well in a variety of settings, and its practical value is illustrated through an analysis of primary biliary cirrhosis data."}
{"id": "2601.17432", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17432", "abs": "https://arxiv.org/abs/2601.17432", "authors": ["Francesco Patrizi", "Alessandra Sestini"], "title": "An algorithmic approach to direct spline products: procedures and computational aspects", "comment": "25 pages, 13 figures", "summary": "We introduce an efficient algorithmic procedure for implementing the direct formula that represents the product of splines in the B-spline basis. We first demonstrate the relevance of this direct approach through numerical evidences showing that implicit methods, such as collocation, may fail in some instances due to severe ill-conditioning of the associated system matrices, whereas the direct formula remains robust. We then recast the direct formula into an algorithmic framework based on the Oslo Algorithm and subsequently enhance it, through a factorization of the terms to be computed, to dramatically improve computational efficiency. Extensive numerical experiments illustrate the substantial reduction in computational cost achieved by the proposed method. Implementation aspects are also discussed to ensure numerical stability and applicability."}
{"id": "2601.17629", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.17629", "abs": "https://arxiv.org/abs/2601.17629", "authors": ["Meysam Babapour", "Ehsan Taheri"], "title": "Robust Spacecraft Low-Thrust Trajectory Design: A Chance-Constrained Covariance-Steering Approach", "comment": "10 pages, 14 figures", "summary": "This paper proposes a systematic method for generating practical and robust low-thrust spacecraft trajectories. One contribution is to consider the change in mass of the spacecraft at two levels: a) the propulsive acceleration and b) the intensity of the stochastic disturbances. A covariance variable formulation is considered, which is computationally more efficient than the factorized covariance implementation. The proposed approach is applied to two- (i.e., planar) and three-dimensional heliocentric phases of spacecraft flight from Earth to Mars under the restricted two-body dynamics. The results highlight the importance of keeping track of mass change to generate more realistic, robust solutions for interplanetary space missions to avoid underestimation of mission risks."}
{"id": "2601.17650", "categories": ["math.PR", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.17650", "abs": "https://arxiv.org/abs/2601.17650", "authors": ["Kush Kinra"], "title": "A note on continuous data assimilation for stochastic convective Brinkman-Forchheimer equations in 2D and 3D", "comment": null, "summary": "Continuous data assimilation (CDA) methods, such as the nudging algorithm introduced by Azouani, Olson, and Titi (AOT), have proven to be highly effective in deterministic settings for asymptotically synchronizing approximate solutions with observed dynamics. In this note, we introduce and analyze an algorithm for CDA for the two- and three-dimensional stochastic convective Brinkman-Forchheimer equations (CBFEs) driven by either additive or multiplicative Gaussian noise. The model is believed to provide an accurate description when the flow velocity exceeds the regime of validity of Darcy's law and the porosity remains moderately large. We derive sufficient conditions on the nudging parameter and the spatial resolution of observations that ensure convergence of the assimilated solution to the true stochastic flow. We demonstrate convergence in the mean-square sense, and additionally establish pathwise convergence in the presence of additive noise. The CBFEs, also known as Navier-Stokes equations with damping, exhibit enhanced stability properties due to the presence of nonlinear damping term. In particular, we show that nonlinear damping not only enables the implementation of CDA in three dimensions but also yields improved convergence results in two dimensions when compared to the classical Navier-Stokes equations."}
{"id": "2601.17805", "categories": ["math.ST", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.17805", "abs": "https://arxiv.org/abs/2601.17805", "authors": ["Yuxin Fan", "Bangti Jin"], "title": "On the contraction rate of the posterior distribution for nonlinear PDE parameter identification", "comment": "26 pages", "summary": "In this work, we investigate the estimation of a parameter $f$ in PDEs using Bayesian procedures, and focus on posterior distributions constructed using Gaussian process priors, and its variational approximation. We establish contraction rates for the posterior distribution and the variational approximation in the regime of low-regularity parameters. The main novelty of the study lies in relaxing the condition that the ground truth parameter must lie in the reproducing kernel Hilbert space of the Gaussian process prior, which is commonly imposed in existing studies on posterior contraction rate analysis [14,40,44]. The analysis relies on a delicate approximation argument that suitably balances various error sources. We illustrate the general theory on three nonlinear inverse problems for PDEs."}
{"id": "2601.17452", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17452", "abs": "https://arxiv.org/abs/2601.17452", "authors": ["Shaoshuai Chu", "Michael Herty", "Alexander Kurganov", "Maria Lukacova-Medviova", "Changsheng Yu"], "title": "Numerical Study of Dissipative Weak Solutions for the Euler Equations of Gas Dynamics", "comment": null, "summary": "We study dissipative weak (DW) solutions of the Euler equations of gas dynamics using the first-, second-, third-, fifth-, seventh-, and ninth-order local characteristic decomposition-based central-upwind (LCDCU), low-dissipation central-upwind (LDCU), and viscous finite volume (VFV) methods, whose higher-order extensions are obtained via the framework of the alternative weighted essentially non-oscillatory (A-WENO) schemes. These methods are applied to several benchmark problems, including several two-dimensional Riemann problems and a Kelvin-Helmholtz instability test. The numerical results demonstrate that for methods converging only weakly in space and time, the limiting solutions are generalized DW solutions, approximated in the sense of ${\\cal K}$-convergence and dependent on the numerical scheme. For all of the studied methods, we compute the associated Young measures and compare the DW solutions using entropy production and energy defect criteria."}
{"id": "2601.17750", "categories": ["math.OC", "math.NA", "physics.med-ph"], "pdf": "https://arxiv.org/pdf/2601.17750", "abs": "https://arxiv.org/abs/2601.17750", "authors": ["Jan Schröeder", "Yair Censor", "Philipp Süss", "Karl-Heinz Küfer"], "title": "Multi-Criteria Inverse Robustness in Radiotherapy Planning Using Semidefinite Programming", "comment": "23 pages, 3 figures", "summary": "Radiotherapy planning naturally leads to a multi-criteria optimization problem which is subject to different sources of uncertainty. In order to find the desired treatment plan, a decision maker must balance these objectives as well as the level of robustness towards uncertainty against each other. This paper showcases a quantitative approach to do so, which combines the theoretical model with the ability to deal with practical challenges. To this end, the uncertainty, which can be expressed via the so-called dose-influence matrix, is modelled using interval matrices. We use inverse robustness to introduce an additional objective, which aims to maximize the volume of the uncertainty set. A multi-criteria approach allows to handle the uncertainty while keeping appropriate values of the other objective functions. We solve the resulting quadratically constrained quadratic optimization problem (QCQP) by first relaxing it to a convex semidefinite problem (SDP) and then reconstructing optimal solutions of the QCQP from solutions of the SDP."}
{"id": "2601.17738", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17738", "abs": "https://arxiv.org/abs/2601.17738", "authors": ["Guy Cohen", "Michael Lin"], "title": "Doeblin's condition, $ρ$-mixing and spectra of convolution operators on the circle", "comment": null, "summary": "We study the asymptotic behavior of Markov operators $P_μ$ defined by convolution with a probability measure $μ$ on the unit circle $\\mathbb T$. We prove that when $μ$ is adapted, $P_μ$ satisfies Doeblin's condition if and only if some power $μ^k$ is non-singular. We give an example of a symmetric probability measure $μ$ on $\\mathbb T$, such that the reversible stationary chain induced by $P_μ$ is $ρ$-mixing, but $P_μ$\n  does not satisfy Doeblin's condition. We look at the spectra of $P_μ$ in the different $L_p$ spaces when $P_μ$ is, or is not, $ρ$-mixing."}
{"id": "2601.17860", "categories": ["math.ST", "econ.EM"], "pdf": "https://arxiv.org/pdf/2601.17860", "abs": "https://arxiv.org/abs/2601.17860", "authors": ["Tetsuya Kaji"], "title": "The Hellinger Bounds on the Kullback-Leibler Divergence and the Bernstein Norm", "comment": "25 pages", "summary": "The Kullback-Leibler divergence, the Kullback-Leibler variation, and the Bernstein \"norm\" are used to quantify discrepancies among probability distributions in likelihood models such as nonparametric maximum likelihood and nonparametric Bayes. They are closely related to the Hellinger distance, which is often easier to work with. Consequently, it is of interest to characterize conditions under which the Hellinger distance serves as an upper bound for these measures. This article characterizes a necessary and sufficient condition for each of the discrepancy measures to be bounded by the Hellinger distance. It accommodates unbounded likelihood ratios and generalizes all previously known results. We then apply it to relax the regularity condition for the sieve maximum likelihood estimator."}
{"id": "2601.17562", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.17562", "abs": "https://arxiv.org/abs/2601.17562", "authors": ["Zihan Shao", "Konstantin Pieper", "Xiaochuan Tian"], "title": "Sparse RBF Networks for PDEs and nonlocal equations: function space theory, operator calculus, and training algorithms", "comment": "30 pages, 7 figures", "summary": "This work presents a systematic analysis and extension of the sparse radial basis function network (SparseRBFnet) previously introduced for solving nonlinear partial differential equations (PDEs). Based on its adaptive-width shallow kernel network formulation, we further investigate its function-space characterization, operator evaluation, and computational algorithm. We provide a unified description of the solution space for a broad class of radial basis functions (RBFs). Under mild assumptions, this space admits a characterization as a Besov space, independent of the specific kernel choice. We further demonstrate how the explicit kernel-based structure enables quasi-analytical evaluation of both differential and nonlocal operators, including fractional Laplacians. On the computational end, we study the adaptive-width network and related three-phase training strategy through a comparison with variants concerning the modeling and algorithmic details. In particular, we assess the roles of second-order optimization, inner-weight training, network adaptivity, and anisotropic kernel parameterizations. Numerical experiments on high-order, fractional, and anisotropic PDE benchmarks illustrate the empirical insensitivity to kernel choice, as well as the resulting trade-offs between accuracy, sparsity, and computational cost. Collectively, these results consolidate and generalize the theoretical and computational framework of SparseRBFnet, supporting accurate sparse representations with efficient operator evaluation and offering theory-grounded guidance for algorithmic and modeling choices."}
{"id": "2601.17800", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.17800", "abs": "https://arxiv.org/abs/2601.17800", "authors": ["Thanawat Sornwanee"], "title": "Differentiable Integer Linear Programming is not Differentiable & it's not a mere technical problem", "comment": null, "summary": "We show how the differentiability method employed in the paper ``Differentiable Integer Linear Programming'', Geng, et al., 2025 as shown in its theorem 5 is incorrect. Moreover, there already exists some downstream work that inherits the same error. The underlying reason comes from that, though being continuous in expectation, the surrogate loss is discontinuous in almost every realization of the randomness, for the stochastic gradient descent."}
{"id": "2601.17778", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.17778", "abs": "https://arxiv.org/abs/2601.17778", "authors": ["Xue Xiaofeng"], "title": "Central limit theorems for additive functionals of long-range zero-range processes", "comment": null, "summary": "In this paper, we extend the central limit theorem of the additive functional of the nearest-neighbor zero-range process given in \\cite{Quastel2002} to the long-range case. Our main results show that in several cases the limit processes are driven by fractional Brownian motions with Hurst parameters in $(1/2, 3/4]$. A local central limit theorem of the long-range random walk and a relaxation to equilibrium theorem of the long-range zero-range process play the key roles in the proofs of our main results."}
{"id": "2601.18178", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.18178", "abs": "https://arxiv.org/abs/2601.18178", "authors": ["Guanjie Lyu", "Frédéric Ouimet", "Cindy Feng"], "title": "Asymptotic properties of multivariate Szász-Mirakyan distribution estimators on the nonnegative orthant", "comment": "35 pages, 2 figures, 3 tables", "summary": "The asymptotic properties of multivariate Szász-Mirakyan estimators for distribution functions supported on the nonnegative orthant are investigated. Explicit bias and variance expansions are derived on compact subsets of the interior, yielding sharp mean squared error characterizations and optimal smoothing rates. The analysis shows that the proposed Poisson smoothing yields a non-negligible variance reduction relative to the empirical distribution function, leading to asymptotic efficiency gains that can be quantified through local and global deficiency measures. The behavior of the estimator near the boundary of its support is examined separately. Under a boundary-layer scaling that preserves nondegenerate Poisson smoothing as the evaluation point approaches the boundary of $[0,\\infty)^d$, bias and variance expansions are obtained that differ fundamentally from those in the interior region. In particular, the variance reduction mechanism disappears at leading order, implying that no asymptotically optimal smoothing parameter exists in the boundary regime. Central limit theorems and almost sure uniform consistency are also established. Together, these results provide a unified asymptotic theory for multivariate Szász-Mirakyan distribution estimation and clarify the distinct roles of smoothing in the interior and boundary regions."}
{"id": "2601.17685", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17685", "abs": "https://arxiv.org/abs/2601.17685", "authors": ["Haixin Jiang", "Xinyu Chen", "Liang Chen"], "title": "Sinh regularized Lagrangian nonuniform sampling series", "comment": "There is a type in page 6 in 10.1007/s12190-025-02709-4 (published by Journal of Applied Mathematics and Computing), \\int s \\frac{1}{F(z)}ds should be \\int_{s}\\frac{1}{F(z)}ds. In this version, we have fixed this type. The email address of the corresponding author has been changed to chenliang3@alumni.sysu.edu.cn", "summary": "Recently, some window functions have been introduced into the nonuniform fast Fourier transform and the regularized Shannon sampling. Inspired by these works, we utilize a sinh-type function to accelerate the convergence of the Lagrangian nonuniform sampling series. Our theoretical error estimates and numerical experiments demonstrate that the sinh regularized nonuniform sampling series achieves a superior convergence rate compared to the fastest existing Gaussian regularized nonuniform sampling series."}
{"id": "2601.17969", "categories": ["math.OC", "math.LO"], "pdf": "https://arxiv.org/pdf/2601.17969", "abs": "https://arxiv.org/abs/2601.17969", "authors": ["Dmytro O. Plutenko"], "title": "Quadratic Programming over Linearly Ordered Fields: Decidability and Attainment of Optimal Solutions", "comment": "15 pages, 2 figures, format B5", "summary": "Classical existence theorems and solution methods for quadratic programming traditionally rely on the analytical properties of real numbers, specifically compactness and completeness. These tools are unavailable in general linearly ordered fields, such as the field of rational numbers or non-Archimedean structures, rendering standard analytical proofs insufficient in these general algebraic settings. In this paper, we establish a unified algebraic framework for the decidability of indefinite quadratic programming subject to linear constraints over general linearly ordered fields. We prove a generalized Eaves' theorem, demonstrating that if a quadratic function -- encompassing convex, non-convex, or degenerate (linear) cases -- is bounded from below on a polyhedron, the minimum is attained within the field itself, regardless of topological completeness. Our approach replaces classical analytical arguments with algebraic induction on dimension and polyhedral decomposition. Based on this foundation, we propose an exact, deterministic algorithm within the Blum--Shub--Smale model of computation that decides boundedness and computes a global minimizer using only field operations. We show that the problem is solvable in finite time via a recursive search over orthant-restricted facets. Finally, we note that linearly constrained quadratic programming represents the maximal class of polynomial optimization problems where exact solutions are structurally guaranteed within the original field, thereby demarcating the algebraic boundary of exact optimization over ordered structures."}
{"id": "2601.17863", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.17863", "abs": "https://arxiv.org/abs/2601.17863", "authors": ["Alexandre Alouadi", "Pierre Henry-Labordère", "Grégoire Loeper", "Othmane Mazhar", "Huyên Pham", "Nizar Touzi"], "title": "A PDE Derivation of the Schrödinger--Bass Bridge", "comment": "10 pages", "summary": "This short paper announces the main results of \\cite{SBB2026}, where the Schrödinger--Bass Bridge (SBB) problem is introduced and studied in full generality. Here we provide a direct PDE derivation of the SBB system in dimension one, showing how the optimal coupling problem that interpolates between the classical Schrödinger bridge and the Bass martingale transport can be solved explicitly via Legendre transforms and the heat equation. A key insight is that the optimal SBB process is a Stretched Schrödinger Bridge: the composition of a monotone transport map with a Schrödinger bridge. This extends the stretched Brownian motion representation of Bass martingales to the semimartingale setting and provides a unified framework that recovers both the Sinkhorn algorithm (in the limit $β\\to \\infty$) and the Bass construction (as $β\\to 0$). We refer to \\cite{SBB2026} for complete proofs, the multidimensional setting, strong duality, dual attainment, and further developments."}
{"id": "2601.18371", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.18371", "abs": "https://arxiv.org/abs/2601.18371", "authors": ["Chengxin Yan", "Dachuan Chen", "Jia Li"], "title": "Nonparametric inference for spot volatility in pure-jump semimartingales", "comment": null, "summary": "We provide a comprehensive analysis of spot volatility inference in pure-jump semimartingales under two asymptotic settings: fixed-$k$, where each local window uses a fixed number of observations, and large-$k$, where this number grows with sampling frequency. For both active- and possibly inactive-jump settings, we derive generally nonstandard, typically non-Gaussian limit distributions and establish valid inference, including when the jump-activity index is consistently estimated. Simulations show that fixed-$k$ asymptotics offer markedly better finite-sample accuracy, underscoring their practical advantage for nonparametric spot volatility inference."}
{"id": "2601.17708", "categories": ["math.NA", "cs.MS"], "pdf": "https://arxiv.org/pdf/2601.17708", "abs": "https://arxiv.org/abs/2601.17708", "authors": ["Ketan Mittal", "Veselin Dobrev", "Tzanio Kolev", "Vladimir Tomov"], "title": "High-Order Mesh r-Adaptivity with Tangential Relaxation and Guaranteed Mesh Validity", "comment": "13 pages, 10 figures", "summary": "High-order meshes are crucial for achieving optimal convergence rates in curvilinear domains, preserving symmetry, and aligning with key flow features in moving mesh simulations, but their quality is challenging to control. In prior work, we have developed techniques based on Target-Matrix Optimization Paradigm (TMOP) to adapt a given high-order mesh to the geometry and solution of the partial differential equation (PDE). Here, we extend this framework to address two key gaps in the literature for high-order mesh r-adaptivity. First, we introduce tangential relaxation on curved surfaces using solely the discrete mesh representation, eliminating the need for access to underlying geometry (e.g., CAD model). Second, we ensure a continuously positive Jacobian determinant throughout the domain. This determinant positivity is essential for using the high-order mesh resulting from r-adaptivity with arbitrary quadrature schemes in simulations. The proposed approach is demonstrated to be robust using a variety of numerical experiments."}
{"id": "2601.17980", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.17980", "abs": "https://arxiv.org/abs/2601.17980", "authors": ["Darsana U", "Atreyee Kundu"], "title": "On maximum hands-off restricted hybrid control for discrete-time switched linear systems", "comment": "11 pages, 0 figures. Work under review", "summary": "This paper deals with design of maximum hands-off hybrid control sequences for discrete-time switched linear systems. It is a sparsest combination of a discrete control sequence (i.e. the switching sequence) and a continuous control sequence, both satisfying pre-specified restrictions on the admissible actions, that steers a given initial state of the switched system to the origin of the state-space in a pre-specified duration of time. Given the subsystems dynamics, the sets of admissible continuous and discrete control, the initial state and the time horizon, we present a new algorithm that, under certain conditions on the subsystems dynamics and the admissible control, designs maximum hands-off hybrid control sequences for the resulting switched system. The key apparatuses for our analysis are graph theory and linear algebra. Numerical examples are presented to demonstrate our results."}
{"id": "2601.17972", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.17972", "abs": "https://arxiv.org/abs/2601.17972", "authors": ["Dor Elboim", "Gady Kozma"], "title": "Once-reinforced random walk in high dimensions", "comment": null, "summary": "We study the once-reinforced random walk on $\\mathbb Z^d$, which is a self-interacting walk that has a higher probability to cross edges that were already visited. We prove that the walk is transient when $d\\ge 6$ and when the reinforcement is small, establishing a conjecture of Sidoravicius in these dimensions. Moreover, in this case we prove that the walk behaves diffusively and can be coupled with Brownian motion.\n  One of the main ideas in the proof is a certain capacity estimate which shows that the trajectory of the walk is nowhere heavy. We also use a game-theoretic-type ingredient that we call ``the demon\" to force spatial independence in the process."}
{"id": "2601.18689", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.18689", "abs": "https://arxiv.org/abs/2601.18689", "authors": ["Benjamin Kang", "Yury Polyanskiy", "Anzo Teh"], "title": "Function estimation in the empirical Bayes setting", "comment": null, "summary": "We study function estimation in the empirical Bayes setting for Poisson and normal means. Specifically, given observations $Y_i\\sim f(\\cdot; θ_i)$ with latent parameters $θ_i\\sim π$, the goal is to estimate $\\mathbb{E}_π[\\ell(θ)|X = x]$. This task lies between classical deconvolution (recovering the full prior $π$), and standard empirical Bayes mean estimation. While the minimax risk for estimating $π$ in the Wasserstein distance is known to decay only logarithmically, we show that estimating certain smooth functions admits dramatically faster rates. In particular, for polynomial functions of degree $k$ in the Poisson model, we establish a tight bound of $Θ(\\frac{1}{n}(\\frac{\\log n}{\\log \\log n})^{k+1})$ and $Θ(\\frac{1}{n}(\\log n)^{2k+1})$ for bounded and subexponential priors, respectively, attainable by estimators mimicking those that achieve optimal regret for the mean estimation problem (Robbins, mininum distance, ERM). Our analysis identifies the approximation-theoretic origin of this improvement: smooth functions can be well-approximated by low-degree polynomials, whereas Lipschitz functions require dense polynomial approximations, incurring a $\\frac{1}{k}$ loss for degree $k$ polynomial approximation. The results reveal a sharp hierarchy in the difficulty of empirical Bayes problems: ranging from slow, logarithmic deconvolution to near-parametric convergence for smooth posterior functionals, and establish new connections between nonparametric empirical Bayes theory, polynomial approximation, and statistical inverse problems. Finally, we complement our analysis with a lower bound of $Ω(\\frac 1n (\\frac{\\log n}{\\log \\log n})^{k+1})$ (bounded priors) and $Ω(\\frac 1n (\\log n)^{k + 1})$ (subgaussian priors) for the normal means model."}
{"id": "2601.17798", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17798", "abs": "https://arxiv.org/abs/2601.17798", "authors": ["Shuai Zhang", "Xuelian Jiang", "Yingxiang Xu"], "title": "Novel Product Manifold Modeling and Orthogonality-Constrained Neural Network Solver for Parameterized Generalized Inverse Eigenvalue Problems", "comment": null, "summary": "A parameterized orthogonality-constrained neural network is proposed for the first time to solve the parameterized generalized inverse eigenvalue problem (PGIEP) on product manifolds, offering a new perspective to address PGIEP. The key contributions are twofold. First, we construct a novel model for the PGIEP, where the optimization variables are located on the product of a Stiefel manifold and a Euclidean manifold. This model enables the application of optimization algorithms on the Stiefel manifold, a capability that is not achievable with existing models. Additionally, the gradient Lipschitz continuity of the objective function is proved. Second, a parameterized Stiefel multilayer perceptron (P-SMLP) that incorporates orthogonality constraints is proposed. Through hard constraints, P-SMLP enables end-to-end training without the need of alternating training between the two manifolds, providing a robust computational framework for generic PGIEPs. Numerical experiments demonstrate the effectiveness of the proposed method."}
{"id": "2601.17999", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.17999", "abs": "https://arxiv.org/abs/2601.17999", "authors": ["Nikolai Krivulin"], "title": "Application of log-Chebyshev approximation and tropical algebra to multicriteria problems of pairwise comparisons", "comment": "16 pages", "summary": "We consider multicriteria problems of evaluating absolute ratings (scores, priorities, weights) of given alternatives for making decisions, which are compared in pairs under several criteria. Given matrices of pairwise comparisons of alternatives for each criterion and a matrix of pairwise comparisons of the criteria, the aim is to calculate a vector of individual ratings of alternatives. We formulate the problem as the Chebyshev approximation of matrices on the logarithmic scale by a common consistent matrix (a symmetrically reciprocal matrix of unit rank). We rearrange the approximation problem as a multi-objective optimization problem of finding a vector that determines the consistent matrix and hence yields a vector of ratings in question. The problem is then transformed into a series of optimization problems in the framework of tropical algebra, which focuses on the theory and application of algebraic systems with idempotent operations. To solve the optimization problems, we apply methods and results of tropical optimization, which yield analytical solutions in a form ready for further analysis and straightforward computation. To illustrate the technique implemented, we give a numerical example of solving a known problem, and compare the obtained solution with results provided by classical methods of analytic hierarchy process and weighted geometrical means."}
{"id": "2601.17988", "categories": ["math.PR", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.17988", "abs": "https://arxiv.org/abs/2601.17988", "authors": ["Nachi Avraham-Re'em", "Emmanuel Roy"], "title": "Ergodicity and weak mixing for group-indexed infinitely divisible stationary processes", "comment": "19 pages", "summary": "We prove that for an arbitrary indexing group, every ergodic infinitely divisible stationary process that is separable in probability is weakly mixing. This shows that, as in the well-known case of Gaussian stationary processes, ergodicity implies weak mixing is intrinsic to infinite divisibility, removing all structural assumptions on the group from prior results. The main ingredient is a general construction of stochastically continuous extensions for separable in probability stationary processes, reducing the problem to stochastically continuous processes indexed by Polish groups and then to countable groups, where we combine the Maruyama representation with an ergodicity criterion for Poisson suspensions."}
{"id": "2601.18770", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.18770", "abs": "https://arxiv.org/abs/2601.18770", "authors": ["Hirai Mukasa"], "title": "Equality between two general ridge estimators and applications in several linear models", "comment": "12 pages", "summary": "General ridge estimators are widely used in the general linear model because they possess desirable properties such as linear sufficiency and linear admissibility. However, when the covariance matrix of the error term is partially unknown, estimation typically requires a two-step procedure. This paper derives conditions under which the general ridge estimator based on the covariance matrix coincides with the one that does not depend on it. In particular, we provide practically verifiable conditions for several linear models, including Rao's mixed-effects model, a seemingly unrelated regression model, first-order spatial autoregressive and spatial moving average models, and serial correlation models. These results enable the use of a covariance-free general ridge estimator, thereby simplifying the two-step estimation procedure."}
{"id": "2601.17904", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.17904", "abs": "https://arxiv.org/abs/2601.17904", "authors": ["Shuang Hu", "Huiteng Li", "Zhenning Cai"], "title": "Stability and Convergence of Mixed Finite Elements for Linear Regularized 13-Moment Equations", "comment": "22 pages, 6 figures", "summary": "We present a stable and convergent mixed finite element method (MFEM) for the linear regularized 13-moment (R13) equations in rarefied gas dynamics. Unlike existing methods that require stabilization via penalty terms, our scheme achieves inherent stability by enriching the finite element basis with bubble functions. We provide a rigorous theoretical analysis, establishing second-order convergence rates in the $L^2$ norm under mild regularity assumptions. Beyond theoretical properties, our scheme demonstrates practical advantages over standard MFEM schemes, yielding robust numerical results even in the presence of geometric singularities."}
{"id": "2601.18038", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18038", "abs": "https://arxiv.org/abs/2601.18038", "authors": ["Tran T. A. Nghia", "Huy N. Pham"], "title": "Isolated Calmness in Regularized Convex Optimization", "comment": "24 pages", "summary": "This paper studies the isolated calmness of the optimal solution mapping and the associated Lagrange system for regularized convex composite optimization problems. Several necessary and sufficient conditions for this property are established. These conditions are geometric in nature and relatively simple to verify. To support the analysis, we also develop a so-called zero-product property for second-order structures, namely the graphical derivative of the subgradient mapping of convex functions."}
{"id": "2601.18170", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.18170", "abs": "https://arxiv.org/abs/2601.18170", "authors": ["James Allen Fill"], "title": "A new fine-scale Berry-Esseen-type Gumbel-limit theorem for multivariate maxima", "comment": "34 pages", "summary": "For $d \\geq 2$ and i.i.d. $d$-dimensional observations $\\mathbf{X}^{(1)}, \\mathbf{X}^{(2)}, \\ldots$ with independent Exponential$(1)$ coordinates, let $\\varphi_n$ denote the minimum $\\ell^1$-norm among the maxima of $\\{\\mathbf{X}^{(1)}, \\ldots, \\mathbf{X}^{(n)}\\}$. (A _maximum_ from this set is an observation $\\mathbf{X}^{(k)}$ with $1 \\leq k \\leq n$ such that $\\mathbf{X}^{(k)} \\not\\prec \\mathbf{X}^{(i)}$ for all $1 \\leq i \\leq n$, where $\\mathbf{x} \\prec \\mathbf{y}$ means that $x_j < y_j$ for $1 \\leq j \\leq d$.) Key roles in the study of multivariate Pareto records are played by $\\varphi_n$ and by the more easily handled maximum with the maximum $\\ell^1$-norm. Fill, Naiman, and Sun (2024) proved that \\[ \\varphi_n = \\ln n - \\ln \\ln \\ln n - \\ln(d - 1) + O_{\\mathrm{p}}\\!\\left( \\frac{1}{\\ln \\ln n} \\right), \\] where $Z_n = O_{\\mathrm{p}}(a_n)$ means that $Z_n / a_n$ is bounded in probability, and conjectured that \\[ (\\ln \\ln n) \\left(\\varphi_n - [\\ln n - \\ln \\ln \\ln n - \\ln(d - 1)] \\right) \\] has a nondegenerate limiting distribution, suggesting that the limiting distribution might be that of $ - G$, where $G$ has a Gumbel distribution with location $ - \\frac{\\ln[(d - 1)!]}{d - 1}$ and scale $\\frac{1}{d - 1}$. In the present paper we prove a Berry-Esseen-type theorem for this convergence in distribution, thereby establishing a very sharp result for $\\varphi_n$."}
{"id": "2601.17501", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.17501", "abs": "https://arxiv.org/abs/2601.17501", "authors": ["A. Arriaza", "F. Belzunce", "C. Martínez-Riquelme"], "title": "Sufficient conditions for some transform orders based on the quantile density ratio", "comment": "29 pages. Author accepted manuscript", "summary": "In this paper we focus on providing sufficient conditions for some transform orders for which the quantile densities ratio is non-monotone and, therefore, the convex transform order does not hold. These results are interesting for comparing random variables with a non-explicit expression of their quantile functions or they are computationally complex. In addition, the main results are applied to compare two Tukey generalized distributed random variables and to establish new relationships among non-monotone and positive aging notions."}
{"id": "2601.17965", "categories": ["math.NA", "eess.SY", "physics.class-ph", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.17965", "abs": "https://arxiv.org/abs/2601.17965", "authors": ["Yaniv Brick", "Francesco P. Andriulli", "Mats Gustafsson"], "title": "Interpreting Moment Matrix Blocks Spectra using Mutual Shadow Area", "comment": null, "summary": "The mutual shadow area of pairs of surface regions is used for guiding the study of the spectral components and rank of their wave interaction, as captured by the corresponding moment matrix blocks. It is demonstrated that the mutual shadow area provides an asymptotically accurate predictor of the location of the singular value curve knee. This predicted knee index is shown to partition the interacting parts of the range and domain of blocks into two subspaces that can be associated with different wave phenomena: an \"aperture\" subspace of dimension that scales with the subdomains area (or length in 2-D) and a remainder \"diffraction\" subspace of dimension that scales much slower with the electrical length, depending on the geometric configuration. For interactions between open surface domains typical for the common hierarchical partitioning in most fast solvers, the latter can be attributed to the domain edges visible by its interacting counterpart. For interactions in 3-D with a small aspect angles between the source and observers, the diffraction subspace dimension is dominant in determining the rank until fairly large electrical lengths are reached. This explains the delayed asymptotic scaling of ranks and impressive fast solver performance observed in recent literature for seemingly arbitrary scatterers with no special geometric characteristics. In the extreme cases of \"endfire\" reduced dimensionality interactions, where the shadow area vanishes, the diffraction governs also the asymptotic rank, which translates to superior asymptotic solver performance."}
{"id": "2601.18212", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18212", "abs": "https://arxiv.org/abs/2601.18212", "authors": ["Hugo Lhachemi", "Christophe Prieur", "Emmanuel Trélat"], "title": "Controllability of wave-heat and heat-wave cascades", "comment": null, "summary": "We study boundary controllability of one-dimensional coupled hyperbolic-parabolic cascades, focusing on the fine structure of reachable sets. The main model is a wave-heat cascade in which a boundary control acts on the wave equation and drives the heat equation through an internal coupling. We provide a sharp minimal time for the hyperbolic part (T > 2L) and a complete spectral characterization of exact controllability in weighted Hilbert spaces, whose definition depends explicitly on the coupling profile through a sequence of modal coefficients. In particular, internal couplings may generate nonstandard highly irregular controllability spaces and yield a generic (full measure) but non-robust controllability property. The analysis relies on Riesz basis decompositions and on an Ingham-M{ü}ntz inequality. We also prove that the exact controllability space is not invariant along Hilbert Uniqueness Method trajectories: even if both endpoints belong to the controllability space, the associated minimal-energy trajectory may leave it at intermediate times. Finally, we compare with the reversed (heat-wave) cascade and discuss how reversing the direction of the coupling transfers the loss of regularity between the parabolic and hyperbolic components."}
{"id": "2601.18236", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.18236", "abs": "https://arxiv.org/abs/2601.18236", "authors": ["Benjamin Massat"], "title": "Limit theorems for non linear (compound marked) Hawkes processes", "comment": null, "summary": "In this article, we fill a gap in the literature on Hawkes processes. In particular, we derive a CLT for a non linear compound marked Hawkes process. We also provide an upper bound on the convergence rate using the functional 1-Wasserstein distance. This result is obtained by discretizing the time line and reducing the problem to the quantification of the distance between finite marginal vectors, as well as between the discretized process and the original one."}
{"id": "2601.17591", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.17591", "abs": "https://arxiv.org/abs/2601.17591", "authors": ["Julia Gaudio", "Andrew Jin"], "title": "Exact Recovery in the Geometric Hidden Community Model", "comment": null, "summary": "Hidden community problems, such as community detection in the Stochastic Block Model (SBM), submatrix localization, and $\\mathbb{Z}_2$ synchronization, have received considerable attention in the probability, statistics, and information-theory literature. Motivated by transitive behavior in social networks, which tend to exhibit high triangle density, recent works have considered hidden community models in spatially-embedded networks. In particular, Baccelli and Sankararaman proposed the Geometric SBM, a spatially-embedded analogue of the standard SBM with dramatically more triangles. In this paper, we consider the problem of exact recovery for the Geometric Hidden Community Model (GHCM) of Gaudio, Guan, Niu, and Wei, which generalizes the Geometric SBM to allow for arbitrary pairwise observation distributions. Under mild technical assumptions, we find the information-theoretic threshold for exact recovery in the ``distance-dependent'' GHCM, which allows the pairwise distributions to depend on distance as well as community labels, thus completing the picture of exact recovery in spatially-embedded hidden community models."}
{"id": "2601.18016", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18016", "abs": "https://arxiv.org/abs/2601.18016", "authors": ["Yuyuan Zhou", "Lorenzo Audibert", "Shixu Meng", "Bo Zhang"], "title": "A theoretical and computational framework for three dimensional inverse medium scattering using the linearized low-rank structure", "comment": null, "summary": "In this work we propose a theoretical and computational framework for solving the three dimensional inverse medium scattering problem, based on a set of data-driven basis arising from the linearized problem. This set of data-driven basis consists of generalizations of prolate spheroidal wave functions to three dimensions (3D PSWFs), the main ingredients to explore a low-rank approximation of the inverse solution. We first establish the fundamentals of the inverse scattering analysis, including regularity in a customized Sobolev space and new a priori estimate. This is followed by a computational framework showcasing computing the 3D PSWFs and the low-rank approximation of the inverse solution. These results rely heavily on the fact that the 3D PSWFs are eigenfunctions of both a restricted Fourier integral operator and a Sturm-Liouville differential operator. Furthermore we propose a Tikhonov regularization method with a customized penalty norm and a localized imaging technique to image a targeting object despite the possible presence of its surroundings. Finally various numerical examples are provided to demonstrate the potential of the proposed method."}
{"id": "2601.18270", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18270", "abs": "https://arxiv.org/abs/2601.18270", "authors": ["Zengyu Li", "Qi Lü", "Yu Wang", "Haitian Yang"], "title": "Exact Controllability for Stochastic First-Order Multi-Dimensional Hyperbolic Systems", "comment": null, "summary": "This paper investigates the exact controllability problem for multi-dimensional stochastic first-order symmetric hyperbolic systems with control inputs acting in two distinct ways: an internal control applied to the diffusion term and a boundary control applied to the drift term. By means of a classical duality argument, the controllability problem is reduced to an observability estimate for the corresponding backward stochastic system. The main technical contribution is the establishment of a new global Carleman estimate for such backward systems, combined with a weighted energy identity. This enables us to prove the desired observability inequality under a geometric structural condition (Condition \\ref{cond1}), which ensures that all characteristic rays propagate toward the boundary within a finite time. As a result, we obtain exact controllability provided the control time $T$ exceeds a sharp threshold $T_0$ given explicitly in terms of the system geometry. Furthermore, we complement the positive result with several negative controllability theorems, which demonstrate that both controls are necessary and must act in a distributed manner. Our analysis not only extends controllability theory from deterministic to stochastic multi-dimensional hyperbolic systems but also provides, as a byproduct, new results for deterministic systems under a structural hypothesis. Applications to stochastic traffic flow, epidemiological models, and shallow-water equations are discussed."}
{"id": "2601.18276", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.18276", "abs": "https://arxiv.org/abs/2601.18276", "authors": ["Claudio Macci", "Barbara Pacchiarotti", "Katerina Papagiannouli", "Giovanni Luca Torrisi", "Dario Trevisan"], "title": "Functional Large Deviations for Wide Deep Neural Networks with Gaussian Initialization and Lipschitz Activations", "comment": null, "summary": "We establish a functional large deviation principle for fully connected multi-layer perceptrons with i.i.d. Gaussian weights (LeCun initialization) and general Lipschitz activation functions, including therefore the popular case of ReLU. The large deviation principle holds for the entire network output process on any compact input set. The proof combines exponential tightness for recursively defined processes, finite-dimensional large deviations, and the Dawson-Gärtner theorem, extending existing results beyond finite input sets and less general activations."}
{"id": "2601.18276", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.18276", "abs": "https://arxiv.org/abs/2601.18276", "authors": ["Claudio Macci", "Barbara Pacchiarotti", "Katerina Papagiannouli", "Giovanni Luca Torrisi", "Dario Trevisan"], "title": "Functional Large Deviations for Wide Deep Neural Networks with Gaussian Initialization and Lipschitz Activations", "comment": null, "summary": "We establish a functional large deviation principle for fully connected multi-layer perceptrons with i.i.d. Gaussian weights (LeCun initialization) and general Lipschitz activation functions, including therefore the popular case of ReLU. The large deviation principle holds for the entire network output process on any compact input set. The proof combines exponential tightness for recursively defined processes, finite-dimensional large deviations, and the Dawson-Gärtner theorem, extending existing results beyond finite input sets and less general activations."}
{"id": "2601.18120", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18120", "abs": "https://arxiv.org/abs/2601.18120", "authors": ["Junping Wang", "Yue Wang"], "title": "A Generalized Weak Galerkin Method for Linear Elasticity with Nonpolynomial Approximations", "comment": "19 pages, 1 figure, 6 tables", "summary": "This paper presents a generalized weak Galerkin (gWG) finite element method for linear elasticity problems on general polygonal and polyhedral meshes. The proposed framework is flexible and efficient, allowing for the use of nonpolynomial approximating functions. The generalized weak differential operators are defined as an element-level correction of the classical differential operators accounting for boundary discontinuities. This construction reduces computational cost and provides greater flexibility than standard weak Galerkin formulations. The gWG framework naturally accommodates arbitrary finite-dimensional approximation spaces, including nonpolynomial activation-based spaces with randomly selected parameters. Error equations and error estimates are established for the proposed method. Numerical experiments demonstrate that the method is locking-free, robust with respect to mesh geometry, and effective on general polygonal and polyhedral partitions. In particular, activation-based interior approximation spaces exhibit convergence behavior comparable to that of classical polynomial spaces."}
{"id": "2601.18279", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18279", "abs": "https://arxiv.org/abs/2601.18279", "authors": ["Jiale Tang", "Bin Zhu"], "title": "Line Spectral Estimation Using a G-Filter: Atomic Norm Minimization with Multiple Output Vectors", "comment": "6 pages, 6 figures. Submitted to the 45th Chinese Control Conference (CCC 2026)", "summary": "We propose an atomic norm minimization (ANM) estimator of frequencies in a noisy complex sinusoidal signal that integrates Georgiou's filter bank (G-filter) with multiple output vectors (MOV). Unlike our previous work on the G-filter version of ANM which is restricted to a single filtered output vector, the proposed method in this paper uses MOV to improve data utilization and robustness of the estimate. The ANM problem with MOV can be reformulated as a semidefinite program thanks to a Carathéodory--Fejér-type decomposition for output covariance matrices of the G-filter. Numerical simulations demonstrate that the proposed approach significantly outperforms the standard ANM and the G-filter version of ANM with a single output vector in recovering the correct number of frequency components when the frequencies fall within the band(s) selected by the G-filter, particularly in the low SNR regime."}
{"id": "2601.18304", "categories": ["math.PR", "math.DS", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.18304", "abs": "https://arxiv.org/abs/2601.18304", "authors": ["Yair Hartman", "Aranka Hrušková", "Omer Segev"], "title": "On the inclusion of bounded harmonic functions of random walks", "comment": "26 pages, no figures", "summary": "We investigate the conditions under which the space of bounded harmonic functions of a probability measure $μ$ on a group $G$ is contained in that of another measure $θ$. We establish that asymptotic commutativity, defined by the condition $\\|μ^{*t}*θ- θ*μ^{*t}\\|_{TV} \\to 0$ as $t \\to \\infty$, is sufficient to guarantee the inclusion $H^\\infty(G, μ) \\subseteq H^\\infty(G, θ)$, provided $θ$ is absolutely continuous with respect to a convex combination of convolution powers of $μ$. By employing martingale convergence techniques rather than ergodic-theoretic arguments, we demonstrate that this result holds without topological assumptions on $G$ (such as local compactness) and extends to general Markov chains. Furthermore, utilizing hitting models for the Poisson boundary, we characterise the inclusion $H^\\infty(G, μ) \\subseteq H^\\infty(G, θ)$ as equivalent to the asymptotic invariance of $θ$ under $μ$ in the weak* topology. We apply these results to provide a probabilistic proof of the Choquet-Deny theorem for nilpotent groups, among other applications."}
{"id": "2601.18390", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.18390", "abs": "https://arxiv.org/abs/2601.18390", "authors": ["Brendan K. Beare", "Tetsuya Kaji"], "title": "A necessary and sufficient condition for convergence in distribution of the P-P process in $L^1[0,1]$", "comment": "11 pages", "summary": "We establish that the procentile-procentile (P-P) process constructed from a random sample of pairs converges in distribution in $L^1[0,1]$ if and only if the P-P curve is absolutely continuous. If the P-P process converges in distribution then it may be approximated using the bootstrap."}
{"id": "2601.18186", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18186", "abs": "https://arxiv.org/abs/2601.18186", "authors": ["Xiaobin Li", "Leevan Ling", "Yizhong Sun"], "title": "Trajectory-Based RBF Collocation Method for Surface Advection-Diffusion Equations", "comment": null, "summary": "We introduce a Trajectory-Based RBF Collocation (TBRBF) method for solving surface advection-diffusion equations on smooth, compact manifolds. TBRBF decouples advection and diffusion by applying a characteristic treatment with a Kansa-type RBF collocation method for diffusion PDE, which yields an operator-split characteristic (OSC) system comprising a characteristic ODE and a diffusion PDE. We rigorously prove the equivalence between the OSC system and the original surface PDE on manifolds by embedding the latter into a narrow band domain. Using an intrinsic approach, we construct a time-continuous embedded PDE with push-forward operators in each chart of the atlas and establish its equivalence with the OSC system in the narrow band. Restricting the solution back to the manifold recovers the OSC system on manifolds, ensuring that the method introduces no operator splitting error. Extensive numerical experiments confirm the robust stability and accuracy of the proposed method."}
{"id": "2601.18358", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18358", "abs": "https://arxiv.org/abs/2601.18358", "authors": ["Keyan Li", "Yan-Ru Wang", "Wei-Kun Chen", "Yu-Hong Dai"], "title": "On strong valid inequalities for a class of mixed-integer nonlinear sets with box constraints", "comment": null, "summary": "In this paper, we investigate the mixed-integer nonlinear set with box constraints $X = \\{(w,x)\\in R\\times Z^n:w\\leq f(a^Tx),0\\leq x\\leq μ\\}$, where $f$ is a univariate concave function, $a\\in R^n$, and $μ\\in Z^n_{++}$. This set arises as a substructure in many mixed-integer nonlinear optimization models and encompasses, as special cases, several previously investigated mixed-integer sets, namely the submodular maximization set, the mixed-integer knapsack set, and the mixed-integer polyhedral conic set. We present the first comprehensive polyhedral study of conv($X$). In particular, we derive a class of seed inequalities for a two-dimensional restriction of $X$, obtained by fixing all but one of the $x$ variables to their bounds in $X$, and develop two lifting procedures to obtain strong valid inequalities for conv($X$). In the first lifting procedure, we derive a subadditive approximation for the exact lifting function of the seed inequalities, and lift all fixed variables in a single phase. In the second lifting procedure, we first lift variables fixed at their lower bounds before those at their upper bounds (and vice versa), using subadditive exact and approximation lifting functions, respectively. The derived single- and two-phase lifted inequalities are shown to be facet-defining for conv($X$) under mild conditions. Moreover, for the aforementioned special cases of conv($X$), we show that the proposed lifted inequalities can either unify existing strong valid inequalities or yield new facet-defining inequalities. Finally, extensive computational experiments on expected utility maximization and weapon-target assignment problems demonstrate that the proposed lifted inequalities can substantially strengthen the continuous relaxations and significantly improve the overall computational performance of branch-and-cut algorithms."}
{"id": "2601.18390", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.18390", "abs": "https://arxiv.org/abs/2601.18390", "authors": ["Brendan K. Beare", "Tetsuya Kaji"], "title": "A necessary and sufficient condition for convergence in distribution of the P-P process in $L^1[0,1]$", "comment": "11 pages", "summary": "We establish that the procentile-procentile (P-P) process constructed from a random sample of pairs converges in distribution in $L^1[0,1]$ if and only if the P-P curve is absolutely continuous. If the P-P process converges in distribution then it may be approximated using the bootstrap."}
{"id": "2601.18224", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18224", "abs": "https://arxiv.org/abs/2601.18224", "authors": ["Haruka Nakamura", "Norikazu Saito"], "title": "On the Generalized Conditional Gradient Method for Mean Field Games with Local Coupling Terms", "comment": "35 pages, 14 figures", "summary": "We study the generalized conditional gradient (GCG) method for time-dependent second-order mean field games (MFG) with local coupling terms. While explicit convergence rates of the GCG method were previously established only for globally coupled interactions, the assumptions used there fail to cover typical local interactions such as congestion effects. To overcome this limitation, we introduce a refined analytical framework adapted to local couplings and derive explicit convergence estimates in terms of the exploitability and optimality gap. The key difficulty lies in establishing uniform bounds on the Hamilton--Jacobi--Bellman solutions; this is solved via the Cole--Hopf transformation under a standard quadratic Hamiltonian with a convection effect. We further provide numerical experiments demonstrating convergence behavior and confirming the theoretical rates. Additionally, the existence and uniqueness of smooth solutions to the MFG system with locally coupled interactions are established."}
{"id": "2601.18360", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18360", "abs": "https://arxiv.org/abs/2601.18360", "authors": ["Weikang Qian", "Keyan Li", "Wei-Kun Chen", "Yu-Hong Dai"], "title": "Polyhedral results for two classes of submodular sets with GUB constraints", "comment": null, "summary": "In this paper, we investigate the polyhedral structure of two submodular sets with generalized upper bound (GUB) constraints, which arise as important substructures in various real-world applications. We derive a class of strong valid inequalities for the two sets using sequential lifting techniques. The proposed lifted inequalities are facet-defining for the convex hulls of two sets and are stronger than the well-known extended polymatroid inequalities (EPIs). We provide a more compact characterization of these inequalities and show that each of them can be computed in linear time. Moreover, the proposed lifted inequalities, together with bound and GUB constraints, can completely characterize the convex hulls of the two sets, and can be separated using a combinatorial polynomial-time algorithm. Finally, computational results on probabilistic covering location and multiple probabilistic knapsack problems demonstrate the superiority of the proposed lifted inequalities over the EPIs within a branch-and-cut framework."}
{"id": "2601.18406", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.18406", "abs": "https://arxiv.org/abs/2601.18406", "authors": ["Anna Logioti", "Guido Schneider"], "title": "Validity of the stochastic Ginzburg-Landau approximation in higher space dimensions -A Wiener algebra approach-", "comment": null, "summary": "We consider an anisotropic $d$-dimensional Swift-Hohenberg model $ \\mathcal{O}(\\varepsilon^2) $-close to the first instability, where $ 0 < \\varepsilon \\ll 1 $ is a small perturbation parameter. This model for pattern formation is perturbed with additive noise in time and space. By a multiple scaling ansatz we derive a stochastic $ d $-dimensional Ginzburg-Landau equation for the approximate description of the bifurcating solutions. We prove the validity of the approximation by this amplitude equation on its natural time scale in case of $ d $-dimensional periodic domains of length $ \\mathcal{O}(1/\\varepsilon) $ for the Swift-Hohenberg model under suitable conditions on the additive noise. In detail, we prove the validity of this approximation for noise whose set of Fourier coefficients with respect to $ x $ is in $ \\ell^1 $ for fixed $ t \\geq 0 $. Moreover, we improve existing approximation results in the sense that the stable part of the noise can be larger."}
{"id": "2601.18364", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18364", "abs": "https://arxiv.org/abs/2601.18364", "authors": ["Robin Herkert", "Tobias Ehring", "Bernard Haasdonk"], "title": "Symplecticity-Preserving Prediction of Hamiltonian Dynamics by Generalized Kernel Interpolation", "comment": "34 pages, 7 figures", "summary": "In this work, a kernel-based surrogate for integrating Hamiltonian dynamics that is symplectic by construction and tailored to large prediction horizons is proposed. The method learns a scalar potential whose gradient enters a symplectic-Euler update, yielding a discrete flow map that exactly preserves the canonical symplectic structure. Training is formulated as a gradient Hermite--Birkhoff interpolation problem in a reproducing kernel Hilbert space, providing a systematic framework for existence, uniqueness, and error control. Algorithmically, the symplectic kernel predictor is combined with structure-preserving model order reduction, enabling efficient treatment of high-dimensional discretized PDEs. Numerical tests for a pendulum, a nonlinear spring--mass chain, and a semi-discrete wave equation show nearly algebraic greedy convergence and long-time trajectory errors reduce by two to three orders of magnitude compared to an implicit midpoint baseline at the same macro time step."}
{"id": "2601.18545", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18545", "abs": "https://arxiv.org/abs/2601.18545", "authors": ["Aida Khajavirad"], "title": "Tight semidefinite programming relaxations for sparse box-constrained quadratic programs", "comment": null, "summary": "We introduce a new class of semidefinite programming (SDP) relaxations for sparse box-constrained quadratic programs, obtained by a novel integration of the Reformulation Linearization Technique into standard SDP relaxations while explicitly exploiting the sparsity of the problem. The resulting relaxations are not implied by the existing LP and SDP relaxations for this class of optimization problems. We establish a sufficient condition under which the convex hull of the feasible region of the lifted quadratic program is SDP-representable; the proof is constructive and yields an explicit extended formulation. Although the resulting SDP may be of exponential size in general, we further identify additional structural conditions on the sparsity of the optimization problem that guarantee the existence of a polynomial-size SDP-representable formulation, which can be constructed in polynomial time."}
{"id": "2601.18665", "categories": ["math.PR", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.18665", "abs": "https://arxiv.org/abs/2601.18665", "authors": ["Jean-Christophe Pain"], "title": "A probabilistic journey through the Newton-Girard identities", "comment": null, "summary": "This article presents a pedagogical probabilistic exploration of the Newton-Girard identities. We show that the coefficients in these classical relations between power sums and elementary symmetric polynomials can be interpreted as the stable limits of integrals over the unit cube, and as ratios of moments of simple probability distributions. Several classes of integrals are studied, including trigonometric and multiplicative forms. In addition, we discuss the spectral implications via the Le Verrier-Souriau-Faddeev algorithm and Random Matrix Theory, providing a unified framework for the asymptotic algebraic behavior of these identities. While the identities are classical, the probabilistic interpretation of the limits of their normalized forms is the specific focus of the present work."}
{"id": "2601.18417", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18417", "abs": "https://arxiv.org/abs/2601.18417", "authors": ["Ivan Batistic", "Pablo Castrillo", "Philip Cardiff"], "title": "A Jacobian-free Newton-Krylov method for high-order cell-centred finite volume solid mechanics", "comment": null, "summary": "This work extends the application of Jacobian-free Newton-Krylov (JFNK) methods to higher-order cell-centred finite-volume formulations for solid mechanics. While conventional schemes are typically limited to second-order accuracy, we present third- and fourth-order formulations employing local least-squares reconstructions for gradient evaluation and Gaussian quadrature at cell faces. These schemes enable accurate resolution of complex stress and deformation fields in linear and nonlinear solids while retaining the flexibility of finite-volume methods. A key contribution is a JFNK solution strategy for these higher-order schemes, eliminating the need to assemble complex Jacobian matrices. A compact-stencil approximate Jacobian is used as a preconditioner, providing efficiency gains similar to second-order frameworks. To enhance robustness on irregular meshes, an alpha-stabilisation scheme is incorporated, damping high-frequency error modes without compromising formal accuracy. The proposed methodology is benchmarked across a suite of two- and three-dimensional test problems involving elastic and nonlinear materials, where key performance metrics, including accuracy, computational cost, memory usage, and robustness, are systematically evaluated. Results confirm that the higher-order formulations deliver substantial accuracy improvements over second-order schemes, while the JFNK approach achieves strong performance with only minimal modifications to existing segregated frameworks. These findings underscore the potential of combining higher-order finite-volume methods with JFNK solvers to advance the state of the art in computational solid mechanics. The implementations are openly released in the solids4foam toolbox for OpenFOAM, supporting further exploration and adoption by the community."}
{"id": "2601.18592", "categories": ["math.OC", "cond-mat.mtrl-sci", "cs.NE"], "pdf": "https://arxiv.org/pdf/2601.18592", "abs": "https://arxiv.org/abs/2601.18592", "authors": ["Konstantin Sozykin", "Nikita Rybin", "Andrei Chertkov", "Anh-Huy Phan", "Ivan Oseledets", "Alexander Shapeev", "Ivan Novikov", "Gleb Ryzhakov"], "title": "Global Optimization of Atomic Clusters via Physically-Constrained Tensor Train Decomposition", "comment": "18 pages, 6 figures", "summary": "The global optimization of atomic clusters represents a fundamental challenge in computational chemistry and materials science due to the exponential growth of local minima with system size (i.e., the curse of dimensionality). We introduce a novel framework that overcomes this limitation by exploiting the low-rank structure of potential energy surfaces through Tensor Train (TT) decomposition. Our approach combines two complementary TT-based strategies: the algebraic TTOpt method, which utilizes maximum volume sampling, and the probabilistic PROTES method, which employs generative sampling. A key innovation is the development of physically-constrained encoding schemes that incorporate molecular constraints directly into the discretization process. We demonstrate the efficacy of our method by identifying global minima of Lennard-Jones clusters containing up to 45 atoms. Furthermore, we establish its practical applicability to real-world systems by optimizing 20-atom carbon clusters using a machine-learned Moment Tensor Potential, achieving geometries consistent with quantum-accurate simulations. This work establishes TT-decomposition as a powerful tool for molecular structure prediction and provides a general framework adaptable to a wide range of high-dimensional optimization problems in computational material science."}
{"id": "2601.18695", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.18695", "abs": "https://arxiv.org/abs/2601.18695", "authors": ["Christian Hirsch", "Moritz Otto", "Anne Marie Svane"], "title": "Normal and Poisson approximation for Gibbs point processes with pair potentials", "comment": "59 pages, 6 figures", "summary": "We provide a Poisson approximation result for dependent thinnings of Gibbs point processes as well as qualitative and quantitative central limit theorems for geometric functionals of Gibbs point processes in increasing observation windows. The present paper extends prior work on finite-range Gibbs processes to processes with repulsive pairwise interaction of unbounded interaction range as well as processes on marked Euclidean space. The proofs rely on coupling different Gibbs processes using the disagreement coupling technique, which we generalize to infinite-volume domains under a suitable non-percolation condition. For the case of repulsive pairwise interactions, we introduce a version of disagreement coupling that constructs the Gibbs process by thinning a random connection model thus making previous approximation methods more flexible."}
{"id": "2601.18425", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18425", "abs": "https://arxiv.org/abs/2601.18425", "authors": ["Emanuel Pfarr", "Radu Timofte", "Frank Werner"], "title": "Analyzing the Error of Generative Diffusion Models: From Euler-Maruyama to Higher-Order Schemes", "comment": null, "summary": "Although generative diffusion models (GDMs) are widely used in practice, their theoretical foundations remain limited, especially concerning the impact of different discretization schemes applied to the underlying stochastic differential equation (SDE). Existing convergence analysis largely focuses on Euler-Maruyama (EM)-like methods and does not extend to higher-order schemes, which are naturally expected to provide improved discretization accuracy. In this paper, we establish asymptotic 2-Wasserstein convergence results for SDE-based discretization methods employed in sampling for GDMs. We provide an all-at-once error bound analysis of the EM method that accounts for all error sources and establish convergence under all prevalent score-matching error assumptions in the literature, assuming a strongly log-concave data distribution. Moreover, we present the first error bound result for arbitrary higher-order SDE-discretization methods with known strong L_2 convergence in dependence on the discretization grid and the score-matching error. Finally, we complement our theoretical findings with an extensive numerical study, providing comprehensive experimental evidence and showing that, contrary to popular believe, higher order discretization methods can in fact retain their theoretical advantage over EM for sampling GDMs."}
{"id": "2601.18662", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.18662", "abs": "https://arxiv.org/abs/2601.18662", "authors": ["Yan Dolinsky", "Or Zuk"], "title": "A Unique Inverse Decomposition of Positive Definite Matrices under Linear Constraints", "comment": null, "summary": "We study a nonlinear decomposition of a positive definite matrix into two components: the inverse of another positive definite matrix and a symmetric matrix constrained to lie in a prescribed linear subspace. Equivalently, the inverse component is required to belong to the orthogonal complement of that subspace with respect to the trace inner product. Under a sharp nondegeneracy condition on the subspace, we show that every positive definite matrix admits a \\emph{unique} decomposition of this form.\n  This decomposition admits a variational characterization as the unique minimizer of a strictly convex log-determinant optimization problem, which in turn yields a natural dual formulation that can be efficiently exploited computationally. We derive several properties, including the stability of the decomposition.\n  We further develop feasibility-preserving Newton-type algorithms with provable convergence guarantees and analyze their per-iteration complexity in terms of algebraic properties of the decomposed matrix and the underlying subspace. Finally, we show that the proposed decomposition arises naturally in exponential utility maximization, a central problem in mathematical finance."}
{"id": "2601.18774", "categories": ["math.PR", "stat.AP"], "pdf": "https://arxiv.org/pdf/2601.18774", "abs": "https://arxiv.org/abs/2601.18774", "authors": ["Jonathan Pipping-Gamón", "Abraham J. Wyner"], "title": "The Blown Lead Paradox: Conditional Laws for the Running Maximum of Binary Doob Martingales", "comment": "Submitted to Stochastic Processes and their Applications. 22 pages, 5 figures", "summary": "Live win-probability forecasts are now ubiquitous in sports broadcasts, and retrospective commentary often cites the largest win probability attained by a team that ultimately loses as evidence of a \"collapse.\" Interpreting such extrema requires a reference distribution under correct specification. Modeling the forecast sequence as the Doob martingale of conditional win probabilities for a binary terminal outcome, we derive sharp distributional laws for its path maximum, including the conditional law given an eventual loss. In discrete time, we quantify explicit correction terms (last-step crossings and overshoots); under continuous-path regularity these corrections disappear, yielding exact identities. We further obtain closed-form distributions for two extensions: the maximal win probability attained by the eventual loser in a two-player game and the minimal win probability attained by the eventual winner in an n-player game. The resulting formulas furnish practical benchmarks for diagnosing sequential forecast calibration."}
{"id": "2601.18454", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.18454", "abs": "https://arxiv.org/abs/2601.18454", "authors": ["Gabriel Barrenechea", "Cristian Cárcamo", "Abner Poza"], "title": "A stabilized finite element method for a flow problem arising from 4D flow magnetic resonance imaging", "comment": null, "summary": "In this work we propose, {analyze}, and validate a stabilized finite element method for a flow problem arising from the assessment of {4D Flow Magnetic Resonance Imaging quality}. Starting from the Navier-Stokes equation and splitting its velocity as the MRI-observed one (considered a datum) plus an ``observation error'', a modified Navier-Stokes problem is derived. This procedure allows us to estimate the quality of the measured velocity fields, while also providing an alternative approach to pressure reconstruction, thereby avoiding invasive procedures. Since equal-order approximations have become a popular choice for problems linked to pressure recovery from MRI images, we design a stabilized finite element method allowing equal-order interpolations for velocity and pressure. In the linearized version of the resulting model, we prove stability and (optimal order) error estimates and test the method with a variety of numerical experiments testing both the linearized case and the more realistic nonlinear one."}
{"id": "2601.17305", "categories": ["math.NA", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.17305", "abs": "https://arxiv.org/abs/2601.17305", "authors": ["C G Krishnanunni", "Jonathan Wittmer", "Tan Bui-Thanh", "Quoc P. Nguyen"], "title": "A New Look at the Ensemble Kalman Filter for Inverse Problems: Duality, Non-Asymptotic Analysis and Convergence Acceleration", "comment": null, "summary": "This work presents new results and understanding of the Ensemble Kalman filter (EnKF) for inverse problems. In particular, using a Lagrangian dual perspective we show that EnKF can be derived from the sample average approximation (SAA) of the Lagrangian dual function. The beauty of this new duality perspective is that it facilitates us to prove and numerically verify a novel non-asymptotic convergence result for the EnKF. Motivated by the new perspective, we also present a new convergence improvement strategy for the Ensemble Kalman Inversion Algorithm (EnKI), which is an iterative version of the EnKF for inverse problems. In particular, we propose an adaptive multiplicative correction to the sample covariance matrix at each iteration and we call this new algorithm as EnKI-MC (I). Based on the new duality perspective, we derive an expression for the optimal correction factor at each iteration of the EnKI algorithm to accelerate the convergence. In addition, we also consider an ensemble specific multiplicative covariance correction strategy (EnKI-MC (II)) where a different correction is employed for each ensemble. By viewing EnKI through the lens of fixed-point iteration, we also provide theoretical results that guarantees the convergence of EnKI-MC (I) algorithm. Numerical investigations for the deconvolution problem, initial condition inversion in advection-convection problem, initial condition inversion in a Lorenz 96 model, and inverse problem constrained by elliptic partial differential equation are conducted to verify the non-asymptotic results for EnKF and to assess the performance of convergence improvement strategies for EnKI. The numerical results suggest that the proposed strategies for EnKI not only led to faster convergence in comparison to the currently employed techniques but also better quality solutions at termination of the algorithm."}
{"id": "2601.17305", "categories": ["math.NA", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.17305", "abs": "https://arxiv.org/abs/2601.17305", "authors": ["C G Krishnanunni", "Jonathan Wittmer", "Tan Bui-Thanh", "Quoc P. Nguyen"], "title": "A New Look at the Ensemble Kalman Filter for Inverse Problems: Duality, Non-Asymptotic Analysis and Convergence Acceleration", "comment": null, "summary": "This work presents new results and understanding of the Ensemble Kalman filter (EnKF) for inverse problems. In particular, using a Lagrangian dual perspective we show that EnKF can be derived from the sample average approximation (SAA) of the Lagrangian dual function. The beauty of this new duality perspective is that it facilitates us to prove and numerically verify a novel non-asymptotic convergence result for the EnKF. Motivated by the new perspective, we also present a new convergence improvement strategy for the Ensemble Kalman Inversion Algorithm (EnKI), which is an iterative version of the EnKF for inverse problems. In particular, we propose an adaptive multiplicative correction to the sample covariance matrix at each iteration and we call this new algorithm as EnKI-MC (I). Based on the new duality perspective, we derive an expression for the optimal correction factor at each iteration of the EnKI algorithm to accelerate the convergence. In addition, we also consider an ensemble specific multiplicative covariance correction strategy (EnKI-MC (II)) where a different correction is employed for each ensemble. By viewing EnKI through the lens of fixed-point iteration, we also provide theoretical results that guarantees the convergence of EnKI-MC (I) algorithm. Numerical investigations for the deconvolution problem, initial condition inversion in advection-convection problem, initial condition inversion in a Lorenz 96 model, and inverse problem constrained by elliptic partial differential equation are conducted to verify the non-asymptotic results for EnKF and to assess the performance of convergence improvement strategies for EnKI. The numerical results suggest that the proposed strategies for EnKI not only led to faster convergence in comparison to the currently employed techniques but also better quality solutions at termination of the algorithm."}
{"id": "2601.18463", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.18463", "abs": "https://arxiv.org/abs/2601.18463", "authors": ["Jan Giesselmann", "Jens Keim", "Fabio Leotta", "Christian Rohde"], "title": "Justification of a Relaxation Approximation for the Navier-Stokes-Cahn-Hilliard System", "comment": null, "summary": "The Navier-Stokes-Cahn-Hilliard (NSCH) system governs the diffuse-interface dynamics of two incompressible and immiscible fluids. We consider a relaxation approximation of the NSCH system that is composed by a system of first-order hyperbolic balance laws and second-order elliptic operators. We prove first that the solutions of an initial boundary value problem for the approximation recover the limiting NSCH system for vanishing relaxation parameters. To cope with the singular limit we exploit the fact that the approximate solutions dissipate an almost quadratic energy, and employ the relative entropy-framework. In the second part of the work we provide numerical evidence for the analytical results, even in flow regimes not covered by the assumptions needed for the theoretical results. Using a novel marker-and-cell conservative finite-difference approach for both the approximation and the limit system, we are able to compute physically relevant interfacial flow problems including Ostwald ripening and high-velocity flow."}
{"id": "2601.17863", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.17863", "abs": "https://arxiv.org/abs/2601.17863", "authors": ["Alexandre Alouadi", "Pierre Henry-Labordère", "Grégoire Loeper", "Othmane Mazhar", "Huyên Pham", "Nizar Touzi"], "title": "A PDE Derivation of the Schrödinger--Bass Bridge", "comment": "10 pages", "summary": "This short paper announces the main results of \\cite{SBB2026}, where the Schrödinger--Bass Bridge (SBB) problem is introduced and studied in full generality. Here we provide a direct PDE derivation of the SBB system in dimension one, showing how the optimal coupling problem that interpolates between the classical Schrödinger bridge and the Bass martingale transport can be solved explicitly via Legendre transforms and the heat equation. A key insight is that the optimal SBB process is a Stretched Schrödinger Bridge: the composition of a monotone transport map with a Schrödinger bridge. This extends the stretched Brownian motion representation of Bass martingales to the semimartingale setting and provides a unified framework that recovers both the Sinkhorn algorithm (in the limit $β\\to \\infty$) and the Bass construction (as $β\\to 0$). We refer to \\cite{SBB2026} for complete proofs, the multidimensional setting, strong duality, dual attainment, and further developments."}
{"id": "2601.18505", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18505", "abs": "https://arxiv.org/abs/2601.18505", "authors": ["Chang Hou", "Hu Chen", "Jian Wang"], "title": "Pointwise-in-time convergence analysis of an Alikhanov scheme for a 2D nonlinear subdiffusion equation", "comment": null, "summary": "In this paper, we discretize the Caputo time derivative of order α\\in (0,1) using the Alikhanov scheme on a quasi-graded temporal mesh, and employ the Newton linearization method to approximate the nonlinear term. This yields a linearized fully discrete scheme for the two-dimensional nonlinear time fractional subdiffusion equation with weakly singular solutions. For the purpose of conducting a pointwise convergence analysis using the comparison principle, we develop a new stability result. The global L^2-norm convergence order is min{αr, 2}, and the local L^2-norm convergence order is min{r, 2} under appropriate conditions and assumptions. Ultimately, the rates of convergence demonstrated by the numerical experiments serve to validate the analytical outcomes."}
{"id": "2601.18520", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18520", "abs": "https://arxiv.org/abs/2601.18520", "authors": ["Chen Greif"], "title": "A BFBt preconditioner for Double Saddle-Point Systems", "comment": null, "summary": "We consider block preconditioners for double saddle-point systems, and investigate the effect of approximating the nested Schur complement associated with the trailing diagonal block on the eigenvalue distribution of the preconditioned matrix. We develop a variant of Elman's BFBt method and adapt it to this family of linear systems. Our findings are illustrated on a Marker-and-Cell discretization of the Stokes-Darcy equations."}
{"id": "2601.18575", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18575", "abs": "https://arxiv.org/abs/2601.18575", "authors": ["Beining Xu", "Haijun Yu", "Jiayu Zhai", "Kejun Tang", "Xiaoliang Wan"], "title": "Moving sample method for solving time-dependent partial differential equations", "comment": null, "summary": "Solving time-dependent partial differential equations (PDEs) that exhibit sharp gradients or local singularities is computationally demanding, as traditional physics-informed neural networks (PINNs) often suffer from inefficient point allocation that wastes resources on regions already well-resolved. This paper presents an adaptive sampling framework for PINNs aimed at efficiently solving time-dependent partial differential equations with pronounced local singularities. The method employs a residual-driven strategy, where the spatial-temporal distribution of training points is iteratively updated according to the error field from the previous iteration. This targeted allocation enables the network to concentrate computational effort on regions with significant residuals, achieving higher accuracy with fewer sampling points compared to uniform sampling. Numerical experiments on representative PDE benchmarks demonstrate that the proposed approach improves solution quality."}
{"id": "2601.18705", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18705", "abs": "https://arxiv.org/abs/2601.18705", "authors": ["Terry Haut", "John Loffeld", "Lukas Einkemmer", "Pierson Guthrey", "Stefan Brunner", "William Schill"], "title": "Efficient SN-like and PN-like Dynamic Low Rank methods for Thermal Radiative Transfer", "comment": null, "summary": "Dynamic Low Rank (DLR) methods are a promising way to reduce the computational cost and memory footprint of the high-dimensional thermal radiative transfer (TRT) equations. The TRT equations are a system of nonlinear PDEs that model the energy exhchange between the material temperature and the radiation energy density; due to their high dimensionality, solving the TRT equations is often bottleneck in multi-physics simulations. DLR methods represent the solution in terms of time-evolving SVD-like factors of angle and space. Although previous work has explored DLR methods for TRT, most of the methods have limitations that make them impractical for realistic scenarios and uncompetitive with current non-DLR production codes.\n  Here we develop new PN-like and SN-like Dynamic Low Rank (DLR) methods for TRT. In the SN-like DLR method, we use the time-evolving angular basis functions to select time-evolving angles; this DLR formulation enables us to use the highly optimized SN transport sweep as our main computational kernel, and results in a practical way of leveraging low-rank methods in production TRT codes. In contrast, our PN-like DLR method uses an even-parity formulation and results in positive-definite linear systems to solve for each time step.\n  We demonstrate the methods on several challenging, highly heterogenous problems in two spatial dimensions $(4$D) that these DLR schemes can give significant reduction in angular artifacts (``ray effects'') with the same cost as gold-standard SN methods."}
{"id": "2601.18721", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18721", "abs": "https://arxiv.org/abs/2601.18721", "authors": ["Ruymán Cruz-Barroso", "Lidia Fernández", "Francisco Marcellán"], "title": "A mixed interpolation-regression method for numerical integration on the unit circle using zeros of para-orthogonal polynomials", "comment": null, "summary": "A new alternative numerical procedure to the Szegő quadrature formulas for the estimation of integrals with respect to a positive Borel measure $μ$ supported on the unit circle is presented. As in many practical situations, we assume that the values of the integrand $F$ are only known at a finite number of points, which we will assume to be uniformly distributed on the unit circle (although this does not actually constitute a restriction). Our technique consists of obtaining an approximating Laurent polynomial $L$ to $F$ by interpolation in the Hermite sense in a collection of these points that mimic the zeros of a para-orthogonal polynomial with respect to $μ$, and to use the values of $F$ at the remaining nodes to improve the accuracy of the approximation by a process of simultaneous complex regression. Some numerical examples are carried out."}
{"id": "2601.18758", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18758", "abs": "https://arxiv.org/abs/2601.18758", "authors": ["Alberth Silgado", "Giuseppe Vacca"], "title": "Divergence-free and mass-conservative virtual element methods for the Navier-Stokes-Cahn-Hilliard system", "comment": "33 pages, 5 figures", "summary": "In this work, we design and analyze semi/fully-discrete virtual element approximations for the time-dependent Navier--Stokes-Cahn--Hilliard equations, modeling the dynamics of two-phase incompressible fluid flows with diffuse interfaces. A new variational formulation is derived involving solely the velocity, pressure, and phase field, together with corresponding a priori energy estimates. The spatial discretization is based on the coupling divergence-free and $C^1$-conforming elements of high-order, while the time discretization employs a classical backward Euler scheme. By introducing a novel skew-symmetric trilinear form to discretize the convective term in the Cahn--Hilliard equation, we propose discrete schemes that satisfy mass conservation and energy bounds. Moreover, optimal error estimates are provided for both formulations. Finally, two numerical experiments are presented to support our theoretical findings and to illustrate the good performance of the proposed schemes for different polynomial degrees and polygonal meshes."}
{"id": "2601.17650", "categories": ["math.PR", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.17650", "abs": "https://arxiv.org/abs/2601.17650", "authors": ["Kush Kinra"], "title": "A note on continuous data assimilation for stochastic convective Brinkman-Forchheimer equations in 2D and 3D", "comment": null, "summary": "Continuous data assimilation (CDA) methods, such as the nudging algorithm introduced by Azouani, Olson, and Titi (AOT), have proven to be highly effective in deterministic settings for asymptotically synchronizing approximate solutions with observed dynamics. In this note, we introduce and analyze an algorithm for CDA for the two- and three-dimensional stochastic convective Brinkman-Forchheimer equations (CBFEs) driven by either additive or multiplicative Gaussian noise. The model is believed to provide an accurate description when the flow velocity exceeds the regime of validity of Darcy's law and the porosity remains moderately large. We derive sufficient conditions on the nudging parameter and the spatial resolution of observations that ensure convergence of the assimilated solution to the true stochastic flow. We demonstrate convergence in the mean-square sense, and additionally establish pathwise convergence in the presence of additive noise. The CBFEs, also known as Navier-Stokes equations with damping, exhibit enhanced stability properties due to the presence of nonlinear damping term. In particular, we show that nonlinear damping not only enables the implementation of CDA in three dimensions but also yields improved convergence results in two dimensions when compared to the classical Navier-Stokes equations."}
{"id": "2601.17750", "categories": ["math.OC", "math.NA", "physics.med-ph"], "pdf": "https://arxiv.org/pdf/2601.17750", "abs": "https://arxiv.org/abs/2601.17750", "authors": ["Jan Schröeder", "Yair Censor", "Philipp Süss", "Karl-Heinz Küfer"], "title": "Multi-Criteria Inverse Robustness in Radiotherapy Planning Using Semidefinite Programming", "comment": "23 pages, 3 figures", "summary": "Radiotherapy planning naturally leads to a multi-criteria optimization problem which is subject to different sources of uncertainty. In order to find the desired treatment plan, a decision maker must balance these objectives as well as the level of robustness towards uncertainty against each other. This paper showcases a quantitative approach to do so, which combines the theoretical model with the ability to deal with practical challenges. To this end, the uncertainty, which can be expressed via the so-called dose-influence matrix, is modelled using interval matrices. We use inverse robustness to introduce an additional objective, which aims to maximize the volume of the uncertainty set. A multi-criteria approach allows to handle the uncertainty while keeping appropriate values of the other objective functions. We solve the resulting quadratically constrained quadratic optimization problem (QCQP) by first relaxing it to a convex semidefinite problem (SDP) and then reconstructing optimal solutions of the QCQP from solutions of the SDP."}
{"id": "2601.17805", "categories": ["math.ST", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.17805", "abs": "https://arxiv.org/abs/2601.17805", "authors": ["Yuxin Fan", "Bangti Jin"], "title": "On the contraction rate of the posterior distribution for nonlinear PDE parameter identification", "comment": "26 pages", "summary": "In this work, we investigate the estimation of a parameter $f$ in PDEs using Bayesian procedures, and focus on posterior distributions constructed using Gaussian process priors, and its variational approximation. We establish contraction rates for the posterior distribution and the variational approximation in the regime of low-regularity parameters. The main novelty of the study lies in relaxing the condition that the ground truth parameter must lie in the reproducing kernel Hilbert space of the Gaussian process prior, which is commonly imposed in existing studies on posterior contraction rate analysis [14,40,44]. The analysis relies on a delicate approximation argument that suitably balances various error sources. We illustrate the general theory on three nonlinear inverse problems for PDEs."}
{"id": "2601.18662", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.18662", "abs": "https://arxiv.org/abs/2601.18662", "authors": ["Yan Dolinsky", "Or Zuk"], "title": "A Unique Inverse Decomposition of Positive Definite Matrices under Linear Constraints", "comment": null, "summary": "We study a nonlinear decomposition of a positive definite matrix into two components: the inverse of another positive definite matrix and a symmetric matrix constrained to lie in a prescribed linear subspace. Equivalently, the inverse component is required to belong to the orthogonal complement of that subspace with respect to the trace inner product. Under a sharp nondegeneracy condition on the subspace, we show that every positive definite matrix admits a \\emph{unique} decomposition of this form.\n  This decomposition admits a variational characterization as the unique minimizer of a strictly convex log-determinant optimization problem, which in turn yields a natural dual formulation that can be efficiently exploited computationally. We derive several properties, including the stability of the decomposition.\n  We further develop feasibility-preserving Newton-type algorithms with provable convergence guarantees and analyze their per-iteration complexity in terms of algebraic properties of the decomposed matrix and the underlying subspace. Finally, we show that the proposed decomposition arises naturally in exponential utility maximization, a central problem in mathematical finance."}
