{"id": "2601.15787", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.15787", "abs": "https://arxiv.org/abs/2601.15787", "authors": ["Shutong Hou", "Mourad Sini", "Haibing Wang"], "title": "Efficient Numerical Reconstruction of Wave Equation Sources via Droplet-Induced Asymptotics", "comment": null, "summary": "In this paper, we develop and numerically implement a novel approach for solving the inverse source problem of the acoustic wave equation in three dimensions. By injecting a small high-contrast droplet into the medium, we exploit the resulting wave field perturbation measured at a single external point over time. The method enables stable source reconstructions where conventional approaches fail due to ill-posedness, with potential applications in medical imaging and non-destructive testing. Key contributions include:\n  1. Implementation of a theoretically justified asymptotic expansion, from [33], using the eigensystem of the Newtonian operator, with error analysis for the spectral truncation.\n  2. Novel numerical schemes for solving the time-domain Lippmann-Schwinger equation and reconstructing the source via Riesz basis expansions and mollification-based numerical differentiations.\n  3. Reconstruction requiring only single-point measurements, overcoming traditional spatial data limitations.\n  4. 3D numerical experiments demonstrating accurate source recovery under noise (SNR of the order $1/a$), with error analysis for the droplet size (of the order $a$) and the number of spectral modes $N$."}
{"id": "2601.15911", "categories": ["math.NA", "math.CA"], "pdf": "https://arxiv.org/pdf/2601.15911", "abs": "https://arxiv.org/abs/2601.15911", "authors": ["Miguel A. Piñar"], "title": "A fully diagonalized spectral method on the unit ball", "comment": "This preprint has not undergone peer review or any post-submission improvements or corrections. The Version of Record of this article is published in Numerical Algorithms, and is available online at https://doi.org/10.1007/s11075-026-02315-w", "summary": "Our main objective in this work is to show how Sobolev orthogonal polynomials emerge as a useful tool within the framework of spectral methods for boundary-value problems. The solution of a boundary-value problem for a stationary Schrödinger equation on the unit ball can be studied from a variational perspective. In this variational formulation, a Sobolev inner product naturally arises. As test functions, we consider the linear space of the polynomials satisfying the boundary conditions on the sphere, and a basis of mutually orthogonal polynomials with respect to the Sobolev inner product is provided. The basis of the proposed method is given in terms of spherical harmonics and univariate Sobolev orthogonal polynomials. The connection formula between these Sobolev orthogonal polynomials and the classical orthogonal polynomials on the ball is established. Consequently, the Sobolev Fourier coefficients of a function satisfying the boundary value problem are recursively derived. Finally, one numerical experiment is presented."}
{"id": "2601.16122", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.16122", "abs": "https://arxiv.org/abs/2601.16122", "authors": ["Jörg Schröder", "Maximilian Vorwerk"], "title": "Canonical structure of the LLG equation for exponential updates in micromagnetism", "comment": null, "summary": "In this contribution we propose an exponential update algorithm for magnetic moments appearing in the framework of micromagnetics and the Landau-Lifshitz-Gilbert (LLG) equation. This algorithm can be interpreted as the geometric integration on spheres, that a priori satisfy the unit length constraint of the normalized magnetization vector. Even though the geometric structures for this are obvious and some works already use an exponential algorithm, to the best of the authors' knowledge, there is no canonical structure of the LLG equation for the exponential update algorithm in micromagnetism. Tensor algebraic reformulations of the LLG equation allow the canonical representation of the evolution equation for the magnetization, which serves as the basis for different integrators. Based on the specific structure of the exponential of skew symmetric matrices an efficient update scheme is derived. The excellent performance of the proposed exponential update algorithm is demonstrated in representative examples."}
{"id": "2601.16124", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.16124", "abs": "https://arxiv.org/abs/2601.16124", "authors": ["Guohui Song", "Congzhi Xia"], "title": "A hybrid reconstruction of piece-wise smooth functions from non-uniform Fourier data", "comment": null, "summary": "In this paper, we consider the problem of reconstructing piece-wise smooth functions from their non-uniform Fourier data. We first extend the filter method for uniform Fourier data to the non-uniform setting by using the techniques of admissible frames. We show that the proposed non-uniform filter method converges exponentially away from the jump discontinuities. However, the convergence rate is significantly slower near the jump discontinuities due to the Gibbs phenomenon. To overcome this issue, we combine the non-uniform filter method with a stable extrapolation method to recover the function values near the jump discontinuities. We show that the proposed hybrid method could achieve exponential accuracy uniformly on the entire domain. Numerical experiments are provided to demonstrate the performance of the proposed method."}
{"id": "2601.15398", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15398", "abs": "https://arxiv.org/abs/2601.15398", "authors": ["Heinz H. Bauschke", "Walaa M. Moursi"], "title": "Understanding FISTA's weak convergence: A step-by-step introduction to the 2025 milestone", "comment": null, "summary": "Beck and Teboulle's FISTA for finding the minimizer of the sum of two convex functions is one of the most important algorithms of the past decades. While function value convergence of the iterates was known, the actual convergence of the iterates remained elusive until October 2025 when Jang and Ryu, as well as Boţ, Fadili, and Nguyen proved weak convergence.\n  In this paper, we provide a gentle self-contained introduction to the proof of their remarkable result."}
{"id": "2601.15603", "categories": ["math.ST", "cs.IT", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.15603", "abs": "https://arxiv.org/abs/2601.15603", "authors": ["Yi Yu", "Yubo Hou", "Yinchong Wang", "Nan Zhang", "Jianfeng Feng", "Wenlian Lu"], "title": "On the Nonasymptotic Scaling Guarantee of Hyperparameter Estimation in Inhomogeneous, Weakly-Dependent Complex Network Dynamical Systems", "comment": null, "summary": "Hierarchical Bayesian models are increasingly used in large, inhomogeneous complex network dynamical systems by modeling parameters as draws from a hyperparameter-governed distribution. However, theoretical guarantees for these estimates as the system size grows have been lacking. A critical concern is that hyperparameter estimation may diverge for larger networks, undermining the model's reliability. Formulating the system's evolution in a measure transport perspective, we propose a theoretical framework for estimating hyperparameters with mean-type observations, which are prevalent in many scientific applications. Our primary contribution is a nonasymptotic bound for the deviation of estimate of hyperparameters in inhomogeneous complex network dynamical systems with respect to network population size, which is established for a general family of optimization algorithms within a fixed observation duration. While we firstly establish a consistency result for systems with independent nodes, our main result extends this guarantee to the more challenging and realistic setting of weakly-dependent nodes. We validate our theoretical findings with numerical experiments on two representative models: a Susceptible-Infected-Susceptible model and a Spiking Neuronal Network model. In both cases, the results confirm that the estimation error decreases as the network population size increases, aligning with our theoretical guarantees. This research proposes the foundational theory to ensure that hierarchical Bayesian methods are statistically consistent for large-scale inhomogeneous systems, filling a gap in this area of theoretical research and justifying their application in practice."}
{"id": "2601.15444", "categories": ["math.PR", "math.MG"], "pdf": "https://arxiv.org/pdf/2601.15444", "abs": "https://arxiv.org/abs/2601.15444", "authors": ["Silouanos Brazitikos", "Minas Pafis"], "title": "Discrete log-concavity and threshold phenomena for atomic measures", "comment": null, "summary": "We investigate threshold phenomena for random polytopes $K_N=\\conv\\{X_1,\\dots,X_N\\}$ generated by i.i.d.\\ samples from an atomic law $μ$. We identify and provide a missing justification in the discrete-hypercube threshold argument of Dyer--Füredi--McDiarmid, where the supporting half-space estimate is derived via a smooth (gradient/uniqueness) step that can fail at boundary contact points. We then compare threshold-driving mechanisms in the continuous log-concave setting -- through the Cramér transform and Tukey's half-space depth -- with their discrete analogues. Within this framework, we establish a sharp threshold for lattice $p$-balls $\\mathbb{Z}^n \\cap rB_p^n$. Finally, we present structural counterexamples showing that sharp thresholds need not hold in general discrete log-concave settings."}
{"id": "2601.15411", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.15411", "abs": "https://arxiv.org/abs/2601.15411", "authors": ["D. Russell Luke", "Johannes-Carl Schnebel", "Mathias Staudigl", "Juan Peypouquet", "Siqi Qu"], "title": "Asymptotic behaviour of coupled random dynamical systems with multiscale aspects", "comment": null, "summary": "We examine a class of stochastic differential inclusions involving multiscale effects designed to solve a class of generalized variational inequalities. This class of problems contains constrained convex non-smooth optimization problems, constrained saddle-point problems and various equilibrium problems in economics and engineering. In order to respect constraints we adopt a penalty approach, introducing an explicit time-dependency into the evolution system. The resulting dynamics are described in terms of a non-autonomous stochastic evolution equation governed by maximally monotone operators in the drift and perturbed by a Brownian motion. We study the asymptotic behavior, as well as finite time convergence rates in terms of gap functions. The condition we use to prove convergence involves a Legendre transform of the function describing the set C, a condition first used by Attouch and Czarnecki (J. Differ. Equations, Vol. 248, Issue 6, 2010) in the context of deterministic evolution equations. We also establish a large deviations principle showing that individual trajectories exhibit exponential concentration around the solution set. Finally we show how our continuous-time approach relates to penalty-regulated algorithms of forward-backward type after performing a suitable Euler-Maruyama discretisation."}
{"id": "2601.16041", "categories": ["math.ST", "cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16041", "abs": "https://arxiv.org/abs/2601.16041", "authors": ["Omar Al-Ghattas"], "title": "Risk reversal for least squares estimators under nested convex constraints", "comment": "31 pages, 5 figures", "summary": "In constrained stochastic optimization, one naturally expects that imposing a stricter feasible set does not increase the statistical risk of an estimator defined by projection onto that set. In this paper, we show that this intuition can fail even in canonical settings.\n  We study the Gaussian sequence model, a deliberately austere test best, where for a compact, convex set $Θ\\subset \\mathbb{R}^d$ one observes \\[ Y = θ^\\star + σZ, \\qquad Z \\sim N(0, I_d), \\] and seeks to estimate an unknown parameter $θ^\\star \\in Θ$. The natural estimator is the least squares estimator (LSE), which coincides with the Euclidean projection of $Y$ onto $Θ$. We construct an explicit example exhibiting \\emph{risk reversal}: for sufficiently large noise, there exist nested compact convex sets $Θ_S \\subset Θ_L$ and a parameter $θ^\\star \\in Θ_S$ such that the LSE constrained to $Θ_S$ has strictly larger risk than the LSE constrained to $Θ_L$. We further show that this phenomenon can persist at the level of worst-case risk, with the supremum risk over the smaller constraint set exceeding that over the larger one.\n  We clarify this behavior by contrasting noise regimes. In the vanishing-noise limit, the risk admits a first-order expansion governed by the statistical dimension of the tangent cone at $θ^\\star$, and tighter constraints uniformly reduce risk. In contrast, in the diverging-noise regime, the risk is determined by global geometric interactions between the constraint set and random noise directions. Here, the embedding of $Θ_S$ within $Θ_L$ can reverse the risk ordering.\n  These results reveal a previously unrecognized failure mode of projection-based estimators: in sufficiently noisy settings, tightening a constraint can paradoxically degrade statistical performance."}
{"id": "2601.15450", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.15450", "abs": "https://arxiv.org/abs/2601.15450", "authors": ["Shi Feng"], "title": "Variance bounds in product measures without exponential tails", "comment": "34 pages", "summary": "We establish analogs of Cheeger's inequality for probability measures with heavy tails. As one of the principal applications, suppose $λ> 3$ and define the (Pareto) probability measure $μ_λ$ on $[1,\\infty)$ by $dμ_λ(x) = (λ- 1) x^{-λ}$. Let $μ_λ^n$ denote the product measure of $μ_λ$ on $\\mathbb{R}^n$. Then, for any $1$-Lipschitz function (with respect to the Euclidean distance) $f : \\mathbb{R}^n \\to \\mathbb{R}$, we obtain the variance bound $\\operatorname{Var}_{μ_λ^n}(f) \\le C(λ)\\, n^{\\frac{2}{λ- 1}}$, where $C(λ)$ is an explicit constant depending only on $λ$. This improves upon the existing bound $\\operatorname{Var}_{μ_λ^n}(f) = O(n)$ derived from the Efron--Stein inequality. Moreover, this bound is asymptotically tight when considering the $1$-Lipschitz function $f(x) = |x|_{\\infty}$ corresponding to the $L^{\\infty}$ norm. In probabilistic terms, suppose $X_1, \\dots, X_n$ are i.i.d.\\ random variables with distribution $μ_λ$. Then, for any $1$-Lipschitz function $f$, we have $\\operatorname{Var}(f(X_1, \\dots, X_n)) \\le C'(λ)\\operatorname{Var}(\\max\\{X_1, \\dots, X_n\\}) = Θ\\!\\left(n^{\\frac{2}{λ- 1}}\\right)$, where $C'(λ)$ is another explicit constant depending only on $λ$."}
{"id": "2601.15499", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15499", "abs": "https://arxiv.org/abs/2601.15499", "authors": ["Oliver Bachtler"], "title": "Folklore in Multi-Objective Optimisation", "comment": null, "summary": "In this paper, we present and prove some results in multi-objective optimisation that are considered folklore. For the most part, proofs for these results exist in special cases, but they are used in more general settings since their proofs can be (largely) transferred. We do this transfer explicitly and try to state the results as generally as possible. In particular, we also aim at providing clean and complete proofs for results where the original papers are not rigorous."}
{"id": "2601.16058", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.16058", "abs": "https://arxiv.org/abs/2601.16058", "authors": ["Claudia Kirch", "Hedvika Ranošová", "Martin Wendler"], "title": "Fully Functional Weighted Testing for Abrupt and Gradual Location Changes in Functional Time Series", "comment": null, "summary": "Change point tests for abrupt changes in the mean of functional data, i.e., random elements in infinite-dimensional Hilbert spaces, are either based on dimension reduction techniques, e.g., based on principal components, or directly based on a functional CUSUM (cumulative sum) statistic. The former have often been criticized as not being fully functional and losing too much information. On the other hand, unlike the latter, they take the covariance structure of the data into account by weighting the CUSUM statistics obtained after dimension reduction with the inverse covariance matrix. In this paper, as a middle ground between these two approaches, we propose an alternative statistic that includes the covariance structure with an offset parameter to produce a scale-invariant test procedure and to increase power when the change is not aligned with the first components. We obtain the asymptotic distribution under the null hypothesis for this new test statistic, allowing for time dependence of the data. Furthermore, we introduce versions of all three test statistics for gradual change situations, which have not been previously considered for functional data, and derive their limit distribution. Further results shed light on the asymptotic power behavior for all test statistics under various ground truths for the alternatives."}
{"id": "2601.15520", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.15520", "abs": "https://arxiv.org/abs/2601.15520", "authors": ["Félix Kahane", "Minmin Wang"], "title": "Colour ratio in Prim's ranking of bipartite graphs", "comment": "34 pages and 1 figure", "summary": "We consider a complete bipartite graph of size $n$ endowed with i.i.d. uniform edge weights and run Prim's Algorithm to obtain a ranking of its vertices. Let $ρ^{(n)}_k$ be the proportion of black vertices among the first $k$ vertices in this ranking. We characterise the limit behaviour of $ρ^{(n)}_k$ as both $n$ and $k$ tend to infinity. Our results show that in general the limit of $ρ^{(n)}_k$, when existing, differs from the overall proportion of the black vertices in the graph."}
{"id": "2601.15531", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15531", "abs": "https://arxiv.org/abs/2601.15531", "authors": ["Felipe Atenas", "Minh N. Dao", "Matthew K. Tam"], "title": "Variable Stepsize Distributed Forward-Backward Splitting Methods as Relocated Fixed-Point Iterations", "comment": "31 pages", "summary": "We present a family of distributed forward-backward methods with variable stepsizes to find a solution of structured monotone inclusion problems. The framework is constructed by means of relocated fixed-point iterations, extending the approach introduced in arXiv:2507.07428 to conically averaged operators, thus including iteration operators for methods of forward-backward type devised by graphs. The family of methods we construct preserve the per-iteration computational cost and the convergence properties of their constant stepsize counterparts. Specifically, we show that the resulting methods generate a sequence that converges to a fixed-point of the underlying iteration operator, whose shadow sequences converge to a solution of the problem. Numerical experiments illustrate the behaviour of our framework in structured sparse optimisation problems."}
{"id": "2601.15950", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.15950", "abs": "https://arxiv.org/abs/2601.15950", "authors": ["Yaakov Malinovsky"], "title": "Extreme Score Distributions in Countable-Outcome Round-Robin Tournaments of Equally Strong Players", "comment": null, "summary": "We consider a general class of round-robin tournament models of equally strong players. In these models, each of the $n$ players competes against every other player exactly once. For each match between two players, the outcome is a value from a countable subset of the unit interval, and the scores of the two players in a match sum to one. The final score of each player is defined as the sum of the scores obtained in matches against all other players. We study the distribution of extreme scores, including the maximum, second maximum, and lower-order extremes. Since the exact distribution is computationally intractable even for small values of $n$, we derive asymptotic results as the number of players $n$ tends to infinity, including limiting distributions, and rates of convergence."}
{"id": "2601.15526", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15526", "abs": "https://arxiv.org/abs/2601.15526", "authors": ["J. H. Ramírez González", "Gustavo O. Carvalho", "Fábio P. Machado"], "title": "The Frog Model on $\\mathbb{Z}$ with Discrete Weibull Lifetimes and Random Parameter $p$", "comment": "23 pages, 2 figures", "summary": "We study the frog model on $\\mathbb{Z}$ with particle wise discrete Weibull lifetimes. Each particle has an i.i.d. survival parameter $π\\in(0,1)$; conditionally on $π=p$, its lifetime $Ξ$ satisfies \\[ P(Ξ\\ge k\\mid π=p)=p^{k^γ},\\qquad k\\in\\mathbb{N}_0,γ>0. \\] The law of $π$ has right edge density \\[ f_π(u)\\sim(1-u)^{β-1},L\\big((1-u)^{-1}\\big)\\qquad (u\\uparrow 1), \\] with $β>0$ and $L$ slowly varying; let $η$ denote the common law of the i.i.d. initial occupation numbers $\\{η_x\\}_{x\\in\\mathbb{Z}}$. The survival parameter distribution strictly extends the Beta family, while the lifetime distribution extends the geometric case. We prove a sharp extinction and survival dichotomy with the $γ-$dependent threshold \\[ β_c:=\\frac{1}{2γ}. \\] If $β>β_c$ and $E(η)<\\infty$, the process becomes extinct almost surely; if $β<β_c$ and $P(η=0)<1$, it survives with positive probability. At the boundary $β=β_c$ we provide explicit criteria in terms of $\\limsup/\\liminf$ of $L(n^{2γ})$. The case $γ=1$ (geometric lifetimes) recovers the benchmark $β_c=\\frac{1}{2}$ and the critical refinements previously obtained for random geometric lifetimes."}
{"id": "2601.15608", "categories": ["math.OC", "stat.AP"], "pdf": "https://arxiv.org/pdf/2601.15608", "abs": "https://arxiv.org/abs/2601.15608", "authors": ["Scott Powers", "Sivaramakrishnan Ramani", "Jacob Hahn", "Andrew J. Schaefer"], "title": "Lead distance under a pickoff limit in Major League Baseball: A sequential game model", "comment": "33 pages", "summary": "Major League Baseball (MLB) recently limited pitchers to three pickoff attempts, creating a cat-and-mouse game between pitcher and runner. Each failed attempt adds pressure on the pitcher to avoid using another, and the runner can intensify this pressure by extending their leadoff toward the next base. We model this dynamic as a two-player zero-sum sequential game in which the runner first chooses a lead distance, and then the pitcher chooses whether to attempt a pickoff. We establish optimality characterizations for the game and present variants of value iteration and policy iteration to solve the game. Using lead distance data, we estimate generalized linear mixed-effects models for pickoff and stolen base outcome probabilities given lead distance, context, and player skill. We compute the game-theoretic equilibria under the two-player model, as well as the optimal runner policy under a simplified one-player Markov decision process (MDP) model. In the one-player setting, our results establish an actionable rule of thumb: the Two-Foot Rule, which recommends that a runner increase their lead by two feet after each pickoff attempt."}
{"id": "2601.15996", "categories": ["math.OC", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.15996", "abs": "https://arxiv.org/abs/2601.15996", "authors": ["Mario Bravo", "Roberto Cominetti", "Jongmin Lee"], "title": "Minimax-optimal Halpern iterations for Lipschitz maps", "comment": null, "summary": "This paper investigates the minimax-optimality of Halpern fixed-point iterations for Lipschitz maps in general normed spaces. Starting from an a priori bound on the orbit of iterates, we derive non-asymptotic estimates for the fixed-point residuals. These bounds are tight, meaning that they are attained by a suitable Lipschitz map and an associated Halpern sequence. By minimizing these tight bounds we identify the minimax-optimal Halpern scheme. For contractions, the optimal iteration exhibits a transition from an initial Halpern phase to the classical Banach-Picard iteration and, as the Lipschitz constant approaches one, we recover the known convergence rate for nonexpansive maps. For expansive maps, the algorithm is purely Halpern with no Banach-Picard phase; moreover, on bounded domains, the residual estimates converge to the minimal displacement bound. Inspired by the minimax-optimal iteration, we design an adaptive scheme whose residuals are uniformly smaller than the minimax-optimal bounds, and can be significantly sharper in practice. Finally, we extend the analysis by introducing alternative bounds based on the distance to a fixed point, which allow us to handle mappings on unbounded domains; including the case of affine maps for which we also identify the minimax-optimal iteration."}
{"id": "2601.15627", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15627", "abs": "https://arxiv.org/abs/2601.15627", "authors": ["Zechun Hu", "Renming Song", "Li Wang"], "title": "Limit behavior of linearly edge-reinforced random walks on the half-line", "comment": "23 pages", "summary": "Motivated by the article [M. Takei, Electron. J. Probab. 26 (2021), article no. 104], we study the limit behavior of linearly edge-reinforced random walks on the half-line $\\mathbb{Z}_+$ with reinforcement parameter $δ>0$, and each edge $\\{x,x+1\\}$ has the initial weight $x^α\\ln^βx$ for $x > 1$ and $1$ for $x = 0, 1$. The aim of this paper is to study the almost sure limit behavior of the walk in the recurrent regime, and extend the results of Takei mentioned above."}
{"id": "2601.15684", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15684", "abs": "https://arxiv.org/abs/2601.15684", "authors": ["Xin Chen", "Chunfeng Cui", "Deren Han", "Liqun Qi"], "title": "Parallelizable Riemannian Alternating Direction Method of Multipliers for Non-convex Pose Graph Optimization", "comment": null, "summary": "Pose graph optimization (PGO) is fundamental to robot perception and navigation systems, serving as the mathematical backbone for solving simultaneous localization and mapping (SLAM). Existing solvers suffer from polynomial growth in computational complexity with graph size, hindering real-time deployment in large-scale scenarios. In this paper, by duplicating variables and introducing equality constraints, we reformulate the problem and propose a Parallelizable Riemannian Alternating Direction Method of Multipliers (PRADMM) to solve it efficiently. Compared with the state-of-the-art methods that usually exhibit polynomial time complexity growth with graph size, PRADMM enables efficient parallel computation across vertices regardless of graph size. Crucially, all subproblems admit closed-form solutions, ensuring PRADMM maintains exceptionally stable performance. Furthermore, by carefully exploiting the structures of the coefficient matrices in the constraints, we establish the global convergence of PRADMM under mild conditions, enabling larger relaxation step sizes within the interval $(0,2)$. Extensive empirical validation on two synthetic datasets and multiple real-world 3D SLAM benchmarks confirms the superior computational performance of PRADMM."}
{"id": "2601.15636", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15636", "abs": "https://arxiv.org/abs/2601.15636", "authors": ["Bihan Chatterjee", "Sigrún Andradóttir", "Hayriye Ayhan"], "title": "Collaboration versus Specialization in Service Systems with Impatient Customers", "comment": null, "summary": "We study tandem queueing systems in which servers work more efficiently in teams than on their own and customers are impatient in that they may leave the system while waiting for service. Our goal is to determine the server assignment policy that maximizes the long-run average throughput. We show that when each server is equally skilled at all tasks, the optimal policy has all the servers working together at all times. We also provide a complete characterization of the optimal policy for Markovian systems with two stations and two servers when each server's efficiency may be task dependent. We show that the throughput is maximized under the policy which assigns one server to each station (based on their relative skill at that station) unless station 2 has no work (in which case both servers work at station 1) or the number of customers in the buffer reaches a threshold whose value we characterize (in which case both servers work at station 2). We study how the optimal policy varies with the level of server synergy (including no synergy) and also compare the optimal policy for systems with different customer abandonment rates (including no abandonments). Finally, we investigate the case where the synergy among collaborating servers can be task-dependent and provide numerical results."}
{"id": "2601.15742", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15742", "abs": "https://arxiv.org/abs/2601.15742", "authors": ["Ruoyu Diao", "Yu-Hong Dai", "Liwei Zhang"], "title": "A sequential linear complementarity problem method for generalized Nash equilibrium problems", "comment": "38 pages, 5 figures", "summary": "We propose a sequential linear complementarity problem (SLCP) method for solving generalized Nash equilibrium problems (GNEPs). By introducing a novel merit function that utilizes the specific structure of GNEPs, we establish global convergence of the method. The conditions guaranteeing global convergence are analogous to those for the classical sequential quadratic programming method with exact Lagrange Hessians, making this a natural and reasonable generalization. Moreover, we provide a detailed analysis of the solvability of the mixed linear complementarity subproblems, which are formulated as affine GNEPs. Sufficient characterizations for the local superlinear convergence are also derived, highlighting the efficiency of the proposed method. Finally, numerical experiments demonstrate the practical performance and effectiveness of the SLCP method in comparison with existing approaches."}
{"id": "2601.15768", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.15768", "abs": "https://arxiv.org/abs/2601.15768", "authors": ["Reo Tsuboya"], "title": "Stochastically forced compressible Navier-Stokes equations with slip boundary conditions of friction type", "comment": "95 pages", "summary": "We study a mathematical model of a compressible viscous fluid driven by stochastic forces under slip boundary conditions of friction type. We introduce a notion of a weak solution that is analytically and probabilistically consistent with this model. Our main result establishes the existence of such weak solutions under slip boundary conditions on bounded domains with $C^{2+ν}$-boundary ($ν>0$). The proof of this result combines an extended version of the four-layer approximation scheme on the torus by Breit/Feireisl/Hofmanová (2018) with the convex approximation method for absolute value functions studied by Nečasová/Ogorzaly/Scherz (2023)."}
{"id": "2601.15789", "categories": ["math.OC", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.15789", "abs": "https://arxiv.org/abs/2601.15789", "authors": ["Antonio Sasaki", "Sophie Demassey", "Valentina Sessa"], "title": "Localization of complementarity eigenvalues", "comment": null, "summary": "Let A, B be symmetric n x n real matrices with B positive definite and strictly diagonally dominant. We derive two localization sets for the complementarity eigenvalues of (A, B), the tightest one assuming additionally that A is copositive. This extends He-Liu-Shen sets to the case where B is not the identity. Moreover, we compare the computable bounds obtained from these new sets with the extreme classical generalized eigenvalues."}
{"id": "2601.15796", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15796", "abs": "https://arxiv.org/abs/2601.15796", "authors": ["Danijel Grahovac", "Magdalena Mikić"], "title": "Superpositions of CARMA processes", "comment": null, "summary": "We introduce supCARMA processes, defined as superpositions of Lévy-driven CARMA processes with respect to a Lévy basis, as a natural extension of the superpositions of Ornstein-Uhlenbeck type processes. We then focus on supCAR$(2)$ processes and show that they can be classified into three distinct types determined by the eigenstructure of the underlying CAR$(2)$ matrix. For each type we provide conditions for existence and derive explicit expressions for the correlation function. The resulting correlation structures may exhibit long-range dependence and can be non-monotone. These features make supCAR$(2)$ processes a flexible class for modeling time series with oscillatory correlations or strong dependence."}
{"id": "2601.15915", "categories": ["math.OC", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.15915", "abs": "https://arxiv.org/abs/2601.15915", "authors": ["Chen Xu"], "title": "Progressive Power Homotopy for Non-convex Optimization", "comment": null, "summary": "We propose a novel first-order method for non-convex optimization of the form $\\max_{\\bm{w}\\in\\mathbb{R}^d}\\mathbb{E}_{\\bm{x}\\sim\\mathcal{D}}[f_{\\bm{w}}(\\bm{x})]$, termed Progressive Power Homotopy (Prog-PowerHP). The method applies stochastic gradient ascent to a surrogate objective obtained by first performing a power transformation and then Gaussian smoothing, $F_{N,σ}(\\bmμ):=\\mathbb{E}_{\\bm{w}\\sim\\mathcal{N}(\\bmμ,σ^2I_d),\\bm{x}\\sim\\mathcal{D}}[e^{Nf_w(\\bm{x})}]$, while progressively increasing the power parameter $N$ and decreasing the smoothing scale $σ$ along the optimization trajectory. We prove that, under mild regularity conditions, Prog-PowerHP converges to a small neighborhood of the global optimum with an iteration complexity scaling nearly as $O(d^2\\varepsilon^{-2})$. Empirically, Prog-PowerHP demonstrates clear advantages in phase retrieval when the samples-to-dimension ratio approaches the information-theoretic limit, and in training two-layer neural networks in under-parameterized regimes. These results suggest that Prog-PowerHP is particularly effective for navigating cluttered non-convex landscapes where standard first-order methods struggle."}
{"id": "2601.15803", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15803", "abs": "https://arxiv.org/abs/2601.15803", "authors": ["Said Hamadène", "Ibtissam Hdhiri"], "title": "Optimal stochastic impulse control problem with delay with actions decided at the execution time", "comment": null, "summary": "In this paper, we consider a class of stochastic impulse control problem when there is a fixed delay $Δ$ between the decision and execution times. The dynamics of the controlled system between two impulses is an arbitrary adapted stochastic process. Unlike the most existing literature, we consider the problem when the impulse sizes are decided at the execution time in both risk-neutral and risk-sensitive cases. This model fits more, in the real life, for some problems such as the pricing of swing options. The horizon T of the problem can be finite or infinite. In each case we show the existence of an optimal strategy. The main tools we use are the notions of reflected Backward Stochastic Differential Equations (BSDEs for short) and the Snell envelope of processes."}
{"id": "2601.15970", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15970", "abs": "https://arxiv.org/abs/2601.15970", "authors": ["Serge Gratton", "Philippe L. Toint"], "title": "Iteration complexity of the Difference-of-Convex Algorithm for unconstrained optimization: a simple proof", "comment": null, "summary": "We propose a simple proof of the worst-case iteration complexity for the Difference of Convex functions Algorithm (DCA) for unconstrained minimization, showing that the global rate of convergence of the norm of the objective function's gradients at the iterates converge to zero like o(1/k). A small example is also provided indicating that the rate cannot be improved."}
{"id": "2601.15950", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.15950", "abs": "https://arxiv.org/abs/2601.15950", "authors": ["Yaakov Malinovsky"], "title": "Extreme Score Distributions in Countable-Outcome Round-Robin Tournaments of Equally Strong Players", "comment": null, "summary": "We consider a general class of round-robin tournament models of equally strong players. In these models, each of the $n$ players competes against every other player exactly once. For each match between two players, the outcome is a value from a countable subset of the unit interval, and the scores of the two players in a match sum to one. The final score of each player is defined as the sum of the scores obtained in matches against all other players. We study the distribution of extreme scores, including the maximum, second maximum, and lower-order extremes. Since the exact distribution is computationally intractable even for small values of $n$, we derive asymptotic results as the number of players $n$ tends to infinity, including limiting distributions, and rates of convergence."}
{"id": "2601.15996", "categories": ["math.OC", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.15996", "abs": "https://arxiv.org/abs/2601.15996", "authors": ["Mario Bravo", "Roberto Cominetti", "Jongmin Lee"], "title": "Minimax-optimal Halpern iterations for Lipschitz maps", "comment": null, "summary": "This paper investigates the minimax-optimality of Halpern fixed-point iterations for Lipschitz maps in general normed spaces. Starting from an a priori bound on the orbit of iterates, we derive non-asymptotic estimates for the fixed-point residuals. These bounds are tight, meaning that they are attained by a suitable Lipschitz map and an associated Halpern sequence. By minimizing these tight bounds we identify the minimax-optimal Halpern scheme. For contractions, the optimal iteration exhibits a transition from an initial Halpern phase to the classical Banach-Picard iteration and, as the Lipschitz constant approaches one, we recover the known convergence rate for nonexpansive maps. For expansive maps, the algorithm is purely Halpern with no Banach-Picard phase; moreover, on bounded domains, the residual estimates converge to the minimal displacement bound. Inspired by the minimax-optimal iteration, we design an adaptive scheme whose residuals are uniformly smaller than the minimax-optimal bounds, and can be significantly sharper in practice. Finally, we extend the analysis by introducing alternative bounds based on the distance to a fixed point, which allow us to handle mappings on unbounded domains; including the case of affine maps for which we also identify the minimax-optimal iteration."}
{"id": "2601.15966", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15966", "abs": "https://arxiv.org/abs/2601.15966", "authors": ["Eliran Subag"], "title": "Geometry of spherical spin glasses", "comment": "ICM 2026 contribution", "summary": "Spherical spin glasses are canonical models for smooth random functions in high dimensions. In this review, we survey several interrelated lines of research on their geometric structure. We begin with results concerning critical points and their relationship to the Gibbs measure. For the pure models, the measure concentrates on spherical bands around critical points that approximately maximize the energy at a particular radius. Next, we present another approach in which a similar picture is derived for general mixed models. At the core of this approach is a free energy functional computed over bands using multiple orthogonal replicas, satisfying a strong concentration of measure. We discuss several implications of this method for a generalized Thouless-Anderson-Palmer (TAP) approach. Finally, we explain how these geometric insights inform optimization algorithms, and briefly relate them to Smale's 17th problem over the real numbers."}
{"id": "2601.16003", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16003", "abs": "https://arxiv.org/abs/2601.16003", "authors": ["Yunan Wang", "Chuxiong Hu", "Zhao Jin"], "title": "Time-Optimal Switching Surfaces for Triple Integrator under Full Box Constraints", "comment": "Accepted by ACC 2026", "summary": "Time-optimal control for triple integrator under full box constraints is a fundamental problem in the field of optimal control, which has been widely applied in the industry. However, scenarios involving asymmetric constraints, non-stationary boundary conditions, and active position constraints pose significant challenges. This paper provides a complete characterization of time-optimal switching surfaces for the problem, leading to novel insights into the geometric and algebraic structure of the optimal control. The active condition of position constraints is derived, which is absent from the literature. An efficient algorithm is proposed, capable of planning time-optimal trajectories under asymmetric full constraints and arbitrary boundary states, with a 100% success rate. Computational time for each trajectory is within approximately 10μs, achieving a 5-order-of-magnitude reduction compared to optimization-based baselines."}
{"id": "2601.16178", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.16178", "abs": "https://arxiv.org/abs/2601.16178", "authors": ["Luca Di Persio", "Matteo Garbelli", "Adrian Zalinescu"], "title": "Mild Solutions for Path-Dependent Parabolic PDEs with Neumann Boundary Conditions via Generalized BSDEs", "comment": null, "summary": "We study a system of Forward-Backward Stochastic Differential Equations (FBSDEs) with time-delayed generators. The forward process includes a reflection component expressed via a Stieltjes integral, while the backward process takes the form of a Generalized BSDE. We establish the connection between this FBSDE system and non-linear path-dependent PDEs with Neumann boundary conditions by deriving a representation formula."}
{"id": "2601.16043", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.16043", "abs": "https://arxiv.org/abs/2601.16043", "authors": ["Nam Van Tran"], "title": "A Second-Order Dynamical System for Solving Generalized Inverse Mixed Variational Inequality problems", "comment": null, "summary": "In this paper, we study a class of generalized inverse mixed variational inequality problems (GIMVIPs). We propose a novel projection-based second-order time-varying dynamical system for solving GIMVIPs. Under the assumptions that the underlying operators are strongly monotone and Lipschitz continuous, we establish the existence and uniqueness of solution trajectories and prove their global exponential convergence to the unique solution of the GIMVIP. Furthermore, a discrete-time realization of the continuous dynamical system is developed, resulting in an inertial projection algorithm. We show that the proposed algorithm achieves linear convergence under suitable choices of parameters. Finally, numerical experiments are presented to illustrate the effectiveness and convergence behavior of the proposed method in solving GIMVIPs."}
{"id": "2601.16128", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.16128", "abs": "https://arxiv.org/abs/2601.16128", "authors": ["Lixin Shen", "Guohui Song"], "title": "Proximity Operator of the $\\ell_1$ over $\\ell_2$ Function", "comment": null, "summary": "We study the proximity operator of the nonconvex, scale-invariant ratio $h(\\vx)=\\|\\vx\\|_{1}/\\|\\vx\\|_{2}$ and show it can be computed exactly in any dimension. By expressing $\\vx=r\\vu$ and exploiting sign and permutation invariance, we reduce the proximal step to a smooth optimization of a rank-one quadratic over the nonnegative orthant of the unit sphere. We prove that every proximal point arises from a finite candidate set indexed by $k\\in\\{1,\\dots,n\\}$: the active subvector is a local, but nonglobal, minimizer on $\\mathbb{S}^{k-1}$ characterized by the roots of an explicit quartic. This yields closed-form candidates, an exact selection rule, and a necessary and sufficient existence test. Building on these characterizations, we develop practical algorithms, including an $O(n)$ implementation via prefix sums and a pruning criterion that avoids unnecessary quartic solves. The method returns all proximal points when the prox is non-unique, and in experiments it attains strictly lower objective values than approaches that guess sparsity or rely on sphere projections with limited scalability."}
{"id": "2601.16194", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16194", "abs": "https://arxiv.org/abs/2601.16194", "authors": ["El Mehdi Er Raqabi", "Kevin Dalmeijer", "Pascal Van Hentenryck"], "title": "A Rolling-Space Branch-and-Price Algorithm for the Multi-Compartment Vehicle Routing Problem with Multiple Time Windows", "comment": null, "summary": "This paper investigates the multi-compartment vehicle routing problem with multiple time windows (MCVRPMTW), an extension of the classical vehicle routing problem with time windows that considers vehicles equipped with multiple compartments and customers requiring service across several delivery time windows. The problem incorporates three key compartment-related features: (i) compartment flexibility in the number of compartments, (ii) item-to-compartment compatibility, and (iii) item-to-item compatibility. The problem also accommodates practical operational requirements such as driver breaks. To solve the MCVRPMTW, we develop an exact branch-and-price (B&P) algorithm in which the pricing problem is solved using a labeling algorithm. Several acceleration strategies are introduced to limit symmetry during label extensions, improve the stability of dual solutions in column generation, and enhance the branching process. To handle large-scale instances, we propose a rolling-space B&P algorithm that integrates clustering techniques into the solution framework. Extensive computational experiments on instances inspired by a real-world industrial application demonstrate the effectiveness of the proposed approach and provide useful managerial insights for practical implementation."}
{"id": "2601.16041", "categories": ["math.ST", "cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16041", "abs": "https://arxiv.org/abs/2601.16041", "authors": ["Omar Al-Ghattas"], "title": "Risk reversal for least squares estimators under nested convex constraints", "comment": "31 pages, 5 figures", "summary": "In constrained stochastic optimization, one naturally expects that imposing a stricter feasible set does not increase the statistical risk of an estimator defined by projection onto that set. In this paper, we show that this intuition can fail even in canonical settings.\n  We study the Gaussian sequence model, a deliberately austere test best, where for a compact, convex set $Θ\\subset \\mathbb{R}^d$ one observes \\[ Y = θ^\\star + σZ, \\qquad Z \\sim N(0, I_d), \\] and seeks to estimate an unknown parameter $θ^\\star \\in Θ$. The natural estimator is the least squares estimator (LSE), which coincides with the Euclidean projection of $Y$ onto $Θ$. We construct an explicit example exhibiting \\emph{risk reversal}: for sufficiently large noise, there exist nested compact convex sets $Θ_S \\subset Θ_L$ and a parameter $θ^\\star \\in Θ_S$ such that the LSE constrained to $Θ_S$ has strictly larger risk than the LSE constrained to $Θ_L$. We further show that this phenomenon can persist at the level of worst-case risk, with the supremum risk over the smaller constraint set exceeding that over the larger one.\n  We clarify this behavior by contrasting noise regimes. In the vanishing-noise limit, the risk admits a first-order expansion governed by the statistical dimension of the tangent cone at $θ^\\star$, and tighter constraints uniformly reduce risk. In contrast, in the diverging-noise regime, the risk is determined by global geometric interactions between the constraint set and random noise directions. Here, the embedding of $Θ_S$ within $Θ_L$ can reverse the risk ordering.\n  These results reveal a previously unrecognized failure mode of projection-based estimators: in sufficiently noisy settings, tightening a constraint can paradoxically degrade statistical performance."}
