{"id": "2602.00233", "categories": ["math.PR", "math.CO", "math.NT", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.00233", "abs": "https://arxiv.org/abs/2602.00233", "authors": ["Alexander Van Werde"], "title": "Exact cospectrality probabilities for uniform random matrices", "comment": "17 pages, 1 figure", "summary": "We study the conjugation action of orthogonal matrices on symmetric random matrices. Given a fixed orthogonal matrix over an algebraic number field and a random matrix with entries sufficiently uniform in the ring of integers, we wonder what the probability is that the conjugate is again integral. Our main result establishes an exact formula for this probability in terms of the Smith ideals associated to the orthogonal matrix.\n  As an illustrative application, we establish exact formulas for the expected number of rational orthogonal matrices that preserve the integrality of a random matrix for every fixed denominator in dimensions two and three. Notably, the dependence on the denominator turns out to be non-monotone due to number-theoretic fluctuations. We also prove bounds on the probability of rational cospectrality with bounded but arbitrarily large denominator."}
{"id": "2602.00623", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.00623", "abs": "https://arxiv.org/abs/2602.00623", "authors": ["Beatrice Acciaio", "Daniel Bartl", "Anne Grass", "Songyan Hou", "Gudmund Pammer"], "title": "The geometry of the adapted Bures--Wasserstein space", "comment": null, "summary": "The adapted Bures--Wasserstein space consists of Gaussian processes endowed with the adapted Wasserstein distance. It can be viewed as the analogue of the classical Bures--Wasserstein space in optimal transport for the setting of stochastic processes, where the standard Wasserstein distance is inadequate and has to be replaced by its adapted counterpart. We develop a comprehensive geometric theory for the adapted Bures--Wasserstein space, thereby also providing the first results on the fine geometric structure of adapted optimal transport. In particular, we show that the adapted Bures--Wasserstein space is an Alexandrov space with non-negative curvature and provide explicit descriptions of tangent cones and exponential maps. Moreover, we show that Gaussian processes satisfying a natural non-degeneracy condition form a geodesically convex subspace. This subspace is characterized precisely by the property that its tangent cones are linear and hence coincide with the tangent space."}
{"id": "2602.00853", "categories": ["math.PR", "math.AP", "math.DS", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.00853", "abs": "https://arxiv.org/abs/2602.00853", "authors": ["Gerardo Barrera", "Jonas M. Tölle"], "title": "Mixing times for the stochastic $p$-Laplace equation", "comment": "18 pages, 43 references", "summary": "We give an overview on existing quantitative results on long-time behavior of the stochastic $p$-Laplace equation with additive Wiener noise, $p>1$. We summarize the existing results in a table. We give explicit quantitative upper and lower estimates for the $\\varepsilon$-mixing times of the stochastic $p$-Laplace equations for $p>1$. We summarize the mixing time asymptotics in a table."}
{"id": "2602.00875", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.00875", "abs": "https://arxiv.org/abs/2602.00875", "authors": ["Shiyu Liu", "Wei Liu", "Lihu Xu"], "title": "Long term convergence rate of Smoluchowski-Kramers approximation by Stein's method", "comment": null, "summary": "We consider the following second-order stochastic differential equation on $\\mathbb{R}^{2d}$:\n  \\begin{equation*}\n  dX_t^m=Y_t^mdt, \\quad\n  mdY_t^m=b(X_t^m)dt+σ(X_t^m)dB_t-Y^m_tdt,\n  \\end{equation*} where $X^m_t$ and $Y^m_t$ represent the position and velocity of a particle at time $t$, $m>0$ denotes its mass, $b:\\mathbb{R}^d \\rightarrow \\mathbb{R}^d$ is the drift field, $σ:\\mathbb{R}^d \\rightarrow \\mathbb{R}^{d \\times d}$ is the diffusion coefficient, and $\\{B_t\\}_{t \\ge 0}$ is a $d$-dimensional standard Brownian motion.\n  The Smoluchowski--Kramers approximation states that as $m \\rightarrow 0$, this system converges to the limiting equation: \\begin{equation*}\n  dX_t=b(X_t)dt+σ(X_t)dB_t.\n  \\end{equation*} Utilizing Stein's method, we prove that the $1$-Wasserstein distance between the invariant distribution of $X_t^m$ and that of its small-mass limit $X_t$ is of order $O(\\sqrt{m}|\\ln m|).$ Particularly, in the one-dimensional case, the convergence rate can be improved to $O(\\sqrt{m}).$"}
{"id": "2602.00244", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.00244", "abs": "https://arxiv.org/abs/2602.00244", "authors": ["Markus Bambach", "Shaoshuai Chu", "Michael Herty", "Yunong Lin"], "title": "A Bayesian Approach to Feedback Control for Hyperbolic Balance Laws", "comment": null, "summary": "We propose a Bayesian framework for feedback boundary control for hyperbolic balance laws. The method propagates a probability distribution over feedback parameters by using Lyapunov decay estimates as a likelihood. In the linear setting, the framework recovers the available analytical results, while simultaneously extending them to nonlinear regimes where such results are not readily accessible. We first validate the method using the first-order local Lax-Friedrichs (LLF) discretizations on linear models -- the decoupled wave system and the linearized Saint-Venant equations -- recovering the known stability intervals and mixed boundary couplings reported in the control literature. We then consider nonlinear and stochastic settings, including the nonlinear Saint-Venant system and Burgers equation with random initial data, as well as a nonconservative perturbation with source terms, and demonstrate that the computed stability domains remain accurate and robust with respect to the choice of indicator and the initial prior. We further show that the methodology carries over to a second-order semi-discrete LLF scheme and to a model with two interacting control parameters for the temperature field development in laser powder bed fusion with feedback power regulation. These numerical experiments confirm consistency with available theory on benchmark cases and highlight the practicality of the proposed, discretization-agnostic feedback selection procedure."}
{"id": "2602.00889", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.00889", "abs": "https://arxiv.org/abs/2602.00889", "authors": ["Adel Magra", "Frank van der Meulen", "Aad van der Vaart"], "title": "Semi-parametric Bernstein-von Mises Theorem in a Parabolic PDE Problem", "comment": null, "summary": "We consider the heat equation with absorption in a bounded domain of $\\mathbb{R}^d$, where both the scalar diffusivity and the absorption function are unknown. We investigate a Bayesian approach for recovering the diffusivity from a noisy observation of the solution to the PDE over the domain. Given a Gaussian process prior on the absorption function, we derive a Bernstein-von Mises theorem for the marginal posterior distribution of the diffusivity under assumptions on the prior and on smoothness properties of the absorption."}
{"id": "2602.00324", "categories": ["math.OC", "cs.CV", "cs.RO", "eess.SP"], "pdf": "https://arxiv.org/pdf/2602.00324", "abs": "https://arxiv.org/abs/2602.00324", "authors": ["Jianing Zhao", "Linglingzhi Zhu", "Anthony Man-Cho So"], "title": "Dual Quaternion SE(3) Synchronization with Recovery Guarantees", "comment": null, "summary": "Synchronization over the special Euclidean group SE(3) aims to recover absolute poses from noisy pairwise relative transformations and is a core primitive in robotics and 3D vision. Standard approaches often require multi-step heuristic procedures to recover valid poses, which are difficult to analyze and typically lack theoretical guarantees. This paper adopts a dual quaternion representation and formulates SE(3) synchronization directly over the unit dual quaternion. A two-stage algorithm is developed: A spectral initializer computed via the power method on a Hermitian dual quaternion measurement matrix, followed by a dual quaternion generalized power method (DQGPM) that enforces feasibility through per-iteration projection. The estimation error bounds are established for spectral estimators, and DQGPM is shown to admit a finite-iteration error bound and achieves linear error contraction up to an explicit noise-dependent threshold. Experiments on synthetic benchmarks and real-world multi-scan point-set registration demonstrate that the proposed pipeline improves both accuracy and efficiency over representative matrix-based methods."}
{"id": "2602.00975", "categories": ["math.PR", "math-ph", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.00975", "abs": "https://arxiv.org/abs/2602.00975", "authors": ["Jiaoyang Huang", "Horng-Tzer Yau"], "title": "Lecture Notes on Edge Universality for Random Regular Graphs", "comment": "65 pages, 7 figures", "summary": "The purpose of this note is to explain the structure, general strategy, and main ideas of the proof in the work of Huang, McKenzie, and Yau (2024) on the Ramanujan property and edge universality of random regular graphs. The core of the argument is the derivation of self-consistent equations and a microscopic version of the loop equations for random $d$-regular graphs. We first recall the local law for random $d$-regular graphs, and then illustrate the main ideas behind the derivation of the self-consistent equations and the first loop equation."}
{"id": "2602.00264", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.00264", "abs": "https://arxiv.org/abs/2602.00264", "authors": ["Minh-Binh Tran", "Bangjie Wang"], "title": "Analysis of a numerical scheme for 3-wave kinetic equations", "comment": null, "summary": "Several numerical schemes for 3-wave kinetic equations have been proposed in recent work and shown to be accurate and computationally efficient [8,33,34,35]. However, their rigorous numerical analysis remains open. This paper aims to close this gap. We establish a comprehensive well-posedness and qualitative theory for the\n  discrete equation arising from those schemes. We prove\n  global existence, uniqueness, and Lipschitz stability of nonnegative classical solutions\n  in $\\ell^1(\\mathbb{N})$, together with uniform bounds and decay of moments. We further\n  show exponential energy decay and a sharp creation and propagation of positivity\n  characterized by the arithmetic structure of the initial support. Finally, we obtain\n  the propagation and instantaneous creation of polynomial, Mittag-Leffler, and\n  exponential moments, providing quantitative control of high energy tails. We validate the theoretical findings by numerical results."}
{"id": "2602.00901", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.00901", "abs": "https://arxiv.org/abs/2602.00901", "authors": ["Adel Magra", "Aad van der Vaart"], "title": "Efficient Bayesian Inference in Strictly Semi-parametric Linear Inverse Problems", "comment": null, "summary": "We consider the efficient inference of finite dimensional parameters arising in the context of inverse problems. Our setup is the observation of a transformation of an unknown infinite dimensional signal $f$ corrupted by statistical noise, with the transformation $K_θ$ being linear but unknown up to a scalar $θ$. We adopt a Bayesian approach and put a prior on the pair $(θ,f)$ and prove a Bernstein-von Mises theorem for the marginal posterior of $θ$ under regularity conditions on the operators $K_θ$ and on the prior. We apply our results to the recovery of location parameters in semi-blind deconvolution problems and to the recovery of attenuation constants in X-ray tomography."}
{"id": "2602.00351", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.00351", "abs": "https://arxiv.org/abs/2602.00351", "authors": ["Tianze Qu", "Sushil Mahavir Varma"], "title": "Efficiency-Reward Trade-Off in Queues with Dynamic Arrivals", "comment": null, "summary": "Motivated by applications in online marketplaces such as ride-hailing platforms and payment channel networks, we study a single-server queue with state-dependent arrival control. The service operator dynamically chooses the arrival rate as a function of the current queue length and receives a reward determined by the induced rate, capturing objectives such as throughput, revenue, or social welfare. The goal is to design control policies that simultaneously achieve high long-run operating reward and low congestion, measured by the expected steady-state queue length.\n  We adopt a regret-based framework relative to an optimal benchmark and characterize the efficiency--reward trade-off under an $\\varepsilon$-optimal reward constraint. Our results reveal a sharp dichotomy between small-market and large-market regimes. In small markets, including state-independent policies, any admissible control incurs poor efficiency, with the expected queue length growing on the order of $1/\\varepsilon$. In contrast, in large markets, state-dependent policies can achieve substantially better performance. When the reward function exhibits sufficient curvature, the optimal queue length scales as $Θ(1/\\sqrt{\\varepsilon})$; otherwise, it scales as $Θ(\\log(1/\\varepsilon))$.\n  For each regime, we establish universal lower bounds on the achievable efficiency and construct simple state-dependent policies that attain these bounds. Our results provide a non-asymptotic heavy-traffic characterization for queues with dynamic arrivals and offer structural insights into the design of efficient pricing and admission control policies."}
{"id": "2602.00988", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.00988", "abs": "https://arxiv.org/abs/2602.00988", "authors": ["Fei Cao", "Sebastien Motsch", "Wendy Garcia Umbarita"], "title": "Wealth exchange under ceiling and flooring constraints: a modified Bennati-Dragulescu-Yakovenko model", "comment": "25 pages, 6 figures", "summary": "We investigate the classical Bennati-Dragulescu-Yakovenko (BDY) dollar exchange model introduced in \\cite{dragulescu_statistical_2000} where the effects of wealth ceiling and wealth flooring are explored. In our model, $N$ identical economical agents involved in the BDY game are also subjected to certain policies issued by a (artificial) government, which prevent agents whose wealth exceeds some prescribed threshold value (denoted by $b \\in \\mathbb N_+$) from receiving money and which prohibit agents whose wealth falls below certain threshold value (denoted by $a \\in \\mathbb N$) from giving out their money. We derive a mean-field system of coupled nonlinear ordinary differential equations (ODEs) governing the evolution of the distribution of money as the number of agents $N$ tends to infinity and study the large time behavior of the resulting ODE system. The impact of a wealth cap and a wealth floor on economic inequality (measured by the Gini index) will also be explored numerically."}
{"id": "2602.00386", "categories": ["math.NA", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.00386", "abs": "https://arxiv.org/abs/2602.00386", "authors": ["Michał P. Karpowicz", "Gilbert Strang"], "title": "Generalized Inverses of Matrix Products: From Fundamental Subspaces to Randomized Decompositions", "comment": null, "summary": "We investigate the Moore-Penrose pseudoinverse and generalized inverse of a matrix product $A=CR$ to establish a unifying framework for generalized and randomized matrix inverses. This analysis is rooted in first principles, focusing on the geometry of the four fundamental subspaces. We examine:\n  (1) the reverse order law, $A^+ = R^+C^+$, which holds when $C$ has independent columns and $R$ has independent rows,\n  (2) the universally correct formula, $A^+ = (C^+CR)^+(CRR^+)^+$, providing a geometric interpretation of the mappings between the involved subspaces,\n  (3) a new generalized randomized formula, $A^+_p = (P^TA)^+P^TAQ(AQ)^+$, which gives $A^+_p = A^+$ if and only if the sketching matrices $P$ and $Q$ preserve the rank of $A$, i.e., $\\mathrm{rank}(P^TA) = \\mathrm{rank}(AQ) = \\mathrm{rank}(A)$.\n  The framework is extended to generalized $\\{1,2\\}$-inverses and specialized forms, revealing the underlying structure of established randomized linear algebra algorithms, including randomized SVD, the Nyström approximation, and CUR decomposition. We demonstrate applications in sparse sensor placement and effective resistance estimation. For the latter, we provide a rigorous quantitative analysis of an approximation scheme, establishing that it always underestimates the true resistance and deriving a worst-case spectral bound on the error of resistance differences."}
{"id": "2602.00939", "categories": ["math.ST", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.00939", "abs": "https://arxiv.org/abs/2602.00939", "authors": ["Fanqi Yan", "Dung Le", "Trang Pham", "Huy Nguyen", "Nhat Ho"], "title": "Improving Minimax Estimation Rates for Contaminated Mixture of Multinomial Logistic Experts via Expert Heterogeneity", "comment": "Fanqi Yan, Dung Le contributed equally to this work. 41 pages, 3 figures, 1 table", "summary": "Contaminated mixture of experts (MoE) is motivated by transfer learning methods where a pre-trained model, acting as a frozen expert, is integrated with an adapter model, functioning as a trainable expert, in order to learn a new task. Despite recent efforts to analyze the convergence behavior of parameter estimation in this model, there are still two unresolved problems in the literature. First, the contaminated MoE model has been studied solely in regression settings, while its theoretical foundation in classification settings remains absent. Second, previous works on MoE models for classification capture pointwise convergence rates for parameter estimation without any guaranty of minimax optimality. In this work, we close these gaps by performing, for the first time, the convergence analysis of a contaminated mixture of multinomial logistic experts with homogeneous and heterogeneous structures, respectively. In each regime, we characterize uniform convergence rates for estimating parameters under challenging settings where ground-truth parameters vary with the sample size. Furthermore, we also establish corresponding minimax lower bounds to ensure that these rates are minimax optimal. Notably, our theories offer an important insight into the design of contaminated MoE, that is, expert heterogeneity yields faster parameter estimation rates and, therefore, is more sample-efficient than expert homogeneity."}
{"id": "2602.00366", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.00366", "abs": "https://arxiv.org/abs/2602.00366", "authors": ["Minduli Wijayatunga", "Nathan Wallace", "Salah Sukkarieh", "Roberto Armellin"], "title": "Learning Safety-Guaranteed, Non-Greedy Control Barrier Functions Using Reinforcement Learning", "comment": null, "summary": "Spacecraft rendezvous and proximity operations (RPO) pose safety risks to high-value assets, so formal safety guarantees are critical. Yet conservative safety controllers can reduce mission efficiency. We propose a unified two-stage reinforcement learning (RL) framework that addresses two complementary limitations of Input-Constrained Control Barrier Functions (ICCBFs) for safety-critical, fuel-limited spacecraft control. Given a certified safe set S, ICCBFs guarantee forward invariance of an inner set C* under input bounds, but the resulting per-step quadratic programme (QP) is greedy and fuel-inefficient within C*, and recoverable states outside C* are conservatively discarded. Stage 1 learns state-dependent class-K-infinity parameters that adapt ICCBF/CLF decay rates, embedding long-horizon cost awareness while preserving invariance in C*. Stage 2 learns a residual barrier h_RL(x) that certifies recoverability for a subset of S minus C*. At run time, the controller selects the appropriate barrier formulation (Stage 1 or Stage 2) and solves a lightweight ZOH QP. Both stages are trained with PPO using rewards that penalise constraint violations, control effort, and task metrics. We evaluate three benchmarks: cruise control, spacecraft rendezvous with a rotating target, and inspection that maximises observability subject to keep-in and keep-out zone constraints. Across test cases, the method reduces median fuel relative to ICCBF baselines by 12 to 25 percent and increases the fraction of trajectories that remain in S by 7 to 8 percent, while retaining real-time QP complexity."}
{"id": "2602.01036", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.01036", "abs": "https://arxiv.org/abs/2602.01036", "authors": ["Van Quyet Nguyen"], "title": "Superconcentration and chaos in Bernoulli percolation", "comment": "25 pages", "summary": "We study the chemical distance of supercritical Bernoulli percolation on $\\mathbb{Z}^d$. Recently, Dembin [Dem22] showed that the chemical distance exhibits sublinear variance, a phenomenon now referred to as superconcentration. In this article, we establish an equivalence between this phenomenon and chaotic behavior of geodesics under small perturbations of the configuration, thereby confirming Chatterjee's general principle relating anomalous fluctuations to chaos in the context of Bernoulli percolation. Our methods rely on a dynamical version of the effective radius, refining the notion first proposed in [CN25], in order to measure the co-influence of a given edge whose weight may be infinite. Together with techniques from the theory of lattice animals, this approach allows us to quantify the total co-influence of edges in terms of the overlap between original and perturbed geodesics."}
{"id": "2602.00517", "categories": ["math.NA", "math.FA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.00517", "abs": "https://arxiv.org/abs/2602.00517", "authors": ["Jiechang Fan", "Weiping Shen", "Yusong Luo", "Enping Lou"], "title": "A Cayley-free Two-Step Algorithm for Inverse Singular Value Problems", "comment": null, "summary": "In this paper, we investigate numerical solutions for inverse singular value problems (for short, ISVPs) arising in various applications. Inspired by the methodologies employed for inverse eigenvalue problems, we propose a Cayley-free two-step algorithm for solving the ISVP. Compared to the existing two-step algorithms for the ISVP, our algorithm eliminates the need for Cayley transformations and consequently avoids solving $2(m+n)$ linear systems during the computation of approximate singular vectors at each outer iteration. Under the assumption that the Jacobian matrix at a solution is nonsingular, we present a convergence analysis for the proposed algorithm and prove a cubic root-convergence rate. Numerical experiments are conducted to validate the effectiveness of our algorithm."}
{"id": "2602.00999", "categories": ["math.ST", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.00999", "abs": "https://arxiv.org/abs/2602.00999", "authors": ["Eunseong Bae", "Wolfgang Polonik"], "title": "Asymptotic expansions for spectral convergence of compact self-adjoint operators on general spectral subsets, with application to kernel Gram matrices", "comment": null, "summary": "We study the spectral convergence of compact, self-adjoint operators on a separable Hilbert space under operator norm perturbations, and derive asymptotic expansions for their eigenvalues and eigenprojections. Our analysis focuses on eigenvalues indexed by a general subset, with minimal restrictions on their selection. The usefulness of the provided expansions is illustrated by an application to kernel Gram matrices, deriving concentration inequalities as well as weak convergence results, which, in contrast to existing literature, are primarily relying on assumptions on the kernel that are easy to check."}
{"id": "2602.00429", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.00429", "abs": "https://arxiv.org/abs/2602.00429", "authors": ["Zayn Wang"], "title": "A Hybrid Relaxation-Heuristic Framework for Solving MIP with Binary Variables", "comment": null, "summary": "Mixed-Integer Programming (MIP), particularly Mixed-Integer Linear Programming (MILP) and Mixed-Integer Quadratic Programming (MIQP), has found extensive applications in domains such as portfolio optimization and network flow control, which inclusion of integer variables or cardinality constraints renders these problems NP-hard, posing significant computational challenges. While traditional approaches have explored approximation methods like heuristics and relaxation techniques (e.g. Lagrangian dual relaxation), the integration of these strategies within a unified hybrid framework remains underexplored. In this paper, we propose a generalized hybrid framework to address MIQP problems with binary variables, which consists of two phases: (1) a Mixed Relaxation Phase, which employs Linear Relaxation, Duality Relaxation, and Augmented Relaxation with randomized sampling to generate a diverse pre-solution pool, and (2) a Heuristic Optimization Phase, which refines the pool using Genetic Algorithms and Variable Neighborhood Search (VNS) to approximate binary solutions effectively. Becuase of the page limit, we will only detailedly evaluate the proposed framework on portfolio optimization problems using benchmark datasets from the OR Library, where the experimental results demonstrate state-of-the-art performance, highlighting the framework's ability to solve larger and more complex MIP problems efficiently. This study offers a robust and flexible methodology that bridges relaxation techniques and heuristic optimization, advancing the practical solvability of challenging MIP problems."}
{"id": "2602.01138", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.01138", "abs": "https://arxiv.org/abs/2602.01138", "authors": ["Jinhuan Wang", "Keyu Li", "Hui Huang"], "title": "Rigorous derivation of the mean-field limit for the signal-dependent Keller-Segel system", "comment": null, "summary": "We rigorously derive a two-dimensional Keller-Segel type system with signal-dependent sensitivity from a stochastic interacting particle model. By employing suitably defined stopping times, we prove that the convergence of the interacting particle system towards the corresponding mean-field limit equations in probability under an algebraic scaling regime which improves upon existing results with logarithmic scaling. Building on this, we apply the relative-entropy method to obtain strong $L^1$ propagation of chaos, and establish an algebraic convergence rate."}
{"id": "2602.00556", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.00556", "abs": "https://arxiv.org/abs/2602.00556", "authors": ["David Cohen", "Stefano Di Giovacchino", "Annika Lang"], "title": "Fully discrete approximation of the semilinear stochastic wave equation on the sphere", "comment": null, "summary": "The semilinear stochastic wave equation on the sphere driven by multiplicative Gaussian noise is discretized by a stochastic trigonometric integrator in time and a spectral Galerkin approximation in space based on the spherical harmonic functions. Strong and almost sure convergence of the explicit fully discrete numerical scheme are shown. Furthermore, these rates are confirmed by numerical experiments."}
{"id": "2602.01144", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.01144", "abs": "https://arxiv.org/abs/2602.01144", "authors": ["Kai Schärer", "Wolfgang Trutschnig"], "title": "Estimating Conditional Distributions via Sklar's Theorem and Empirical Checkerboard Approximations, with Consequences to Nonparametric Regression", "comment": "29 pages, 12 figures", "summary": "We tackle the natural question of whether it is possible to estimate conditional distributions via Sklar's theorem by separately estimating the conditional distributions of the underlying copula and the marginals. Working with so-called empirical checkerboard/Bernstein approximations with suitably chosen resolution/degree, we first show that uniform weak convergence to the true underlying copula can be established under very mild regularity assumptions. Building upon these results and plugging in the univariate empirical marginal distribution functions we then provide an affirmative answer to the afore-mentioned question and prove strong consistency of the resulting estimators for the conditional distributions. Moreover, we show that aggregating our estimators allows to construct consistent nonparametric estimators for the mean, the quantile, and the expectile regression function, and beyond. Some simulations illustrating the performance of the estimators and a real data example complement the established theoretical results."}
{"id": "2602.00437", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.00437", "abs": "https://arxiv.org/abs/2602.00437", "authors": ["Bryan Zhu", "Ziang Chen"], "title": "Exact Instance Compression for Convex Empirical Risk Minimization via Color Refinement", "comment": null, "summary": "Empirical risk minimization (ERM) can be computationally expensive, with standard solvers scaling poorly even in the convex setting. We propose a novel lossless compression framework for convex ERM based on color refinement, extending prior work from linear programs and convex quadratic programs to a broad class of differentiable convex optimization problems. We develop concrete algorithms for a range of models, including linear and polynomial regression, binary and multiclass logistic regression, regression with elastic-net regularization, and kernel methods such as kernel ridge regression and kernel logistic regression. Numerical experiments on representative datasets demonstrate the effectiveness of the proposed approach."}
{"id": "2602.01168", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.01168", "abs": "https://arxiv.org/abs/2602.01168", "authors": ["Philipp Tuchel", "Nina Gantert", "Joscha Prochno"], "title": "Large deviations for sums of multivariate stretched-exponential random variables: the few-big-jumps principle", "comment": null, "summary": "Large deviations for sums of i.i.d.\\ random variables with stretched-exponential tails (also called Weibull or semi-exponential tails) have been well understood since the 60's, going back to Nagaev's seminal work. Many extensions in the $1$-dimensional setting have been developed since then, showing that such deviations are typically governed by a single big jump. In higher dimensions, a corresponding theory has remained largely undeveloped. This work provides such a multivariate extension and establishes large deviation results for sums of i.i.d.\\ random vectors in $\\mathbb{R}^k$ under fairly general assumptions. Roughly speaking, for some $α\\in(0,1)$, the log-probability of one random vector divided by $x$ exceeding a threshold $t$ in all components behaves asymptotically, for large $x$, as $x^α$ times a negative infimum of a function $\\mathcal{J}$. We prove large deviation results for sums of i.i.d.\\ copies, where the rate function is given by a minimization of at most $k$ summands of $\\mathcal{J}$. This establishes a few-big-jumps principle that generalizes the classical $1$-dimensional phenomenon: the deviation is typically realized by \\emph{at most} $k$ independent vectors. The results are applied to absolute powers of multivariate Gaussian vectors as well as to various other examples. They also allow us to study random projections of high-dimensional $\\ell_p^N$-balls, revealing interesting insights about the appearance of light- and heavy-tailed distributions in high-dimensional geometry."}
{"id": "2602.00735", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.00735", "abs": "https://arxiv.org/abs/2602.00735", "authors": ["Yan Xie", "Shihua Gong", "Ivan G. Graham", "Euan A. Spence", "Chen-Song Zhang"], "title": "Massively parallel Schwarz methods for the high frequency Helmholtz equation", "comment": null, "summary": "We investigate the parallel one-level overlapping Schwarz method for solving finite element discretization of high-frequency Helmholtz equations. The resulting linear systems are large, indefinite, ill-conditioned, and complex-valued. We present a practical variant of the restricted additive Schwarz method with Perfectly Matched Layer transmission conditions (RAS-PML), which was originally analyzed in a theoretical setting in {\\tt arXiv:2404.02156}, with some numerical experiments given in {\\tt arXiv:2408.16580}. In our algorithm, the width of the overlap and the additional PML layer on each subdomain is allowed to decrease with $\\mathcal{O}(k^{-1} \\log(k))$, as the frequency $k \\rightarrow \\infty$, and this is observed to ensure good convergence while avoiding excessive communication. In experiments, the proposed method achieves $\\mathcal{O}(k^d)$ parallel scalability under Cartesian domain decomposition and exhibits $\\mathcal{O}(k)$ iteration counts and convergence time for $d$-dimensional Helmholtz problems ($d = 2,3$) as $k$ increases. In this preliminary note we restrict to experiments on 2D problems with constant wave speed. Details, analysis and extensions to variable wavespeed and 3D will be given in future work."}
{"id": "2602.01607", "categories": ["math.ST", "cs.IT", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.01607", "abs": "https://arxiv.org/abs/2602.01607", "authors": ["Rundong Ding", "Yiyun He", "Yizhe Zhu"], "title": "Minimax optimal differentially private synthetic data for smooth queries", "comment": "27 pages", "summary": "Differentially private synthetic data enables the sharing and analysis of sensitive datasets while providing rigorous privacy guarantees for individual contributors. A central challenge is to achieve strong utility guarantees for meaningful downstream analysis. Many existing methods ensure uniform accuracy over broad query classes, such as all Lipschitz functions, but this level of generality often leads to suboptimal rates for statistics of practical interest. Since many common data analysis queries exhibit smoothness beyond what worst-case Lipschitz bounds capture, we ask whether exploiting this additional structure can yield improved utility.\n  We study the problem of generating $(\\varepsilon,δ)$-differentially private synthetic data from a dataset of size $n$ supported on the hypercube $[-1,1]^d$, with utility guarantees uniformly for all smooth queries having bounded derivatives up to order $k$. We propose a polynomial-time algorithm that achieves a minimax error rate of $n^{-\\min \\{1, \\frac{k}{d}\\}}$, up to a $\\log(n)$ factor. This characterization uncovers a phase transition at $k=d$. Our results generalize the Chebyshev moment matching framework of (Musco et al., 2025; Wang et al., 2016) and strictly improve the error rates for $k$-smooth queries established in (Wang et al., 2016). Moreover, we establish the first minimax lower bound for the utility of $(\\varepsilon,δ)$-differentially private synthetic data with respect to $k$-smooth queries, extending the Wasserstein lower bound for $\\varepsilon$-differential privacy in (Boedihardjo et al., 2024)."}
{"id": "2602.00448", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.00448", "abs": "https://arxiv.org/abs/2602.00448", "authors": ["Novel Kumar Dey", "Mohammad Mahdi Ahmadi", "Erfan Yazdandoost Hamedani", "Afrooz Jalilzadeh"], "title": "On the Analysis of Misspecified Variational Inequalities with Nonlinear Constraints", "comment": null, "summary": "In this paper, we study a class of misspecified variational inequalities (VIs) where both the monotone operator and nonlinear convex constraints depend on an unknown parameter learned via a secondary VI. Existing data-driven VI methods typically follow a decoupled learn-then-optimize scheme, causing the approximation error from the learning to propagate the main decision-making problem and hinder convergence. We instead consider a simultaneous approach that jointly solves the main and secondary VIs. To efficiently handle nonlinear constraints with parameter misspecification, we propose a single-loop inexact Augmented Lagrangian method that simultaneously updates the primal decision variables, dual multipliers, and the misspecified parameter. The method combines a forward-reflected-backward step with an Augmented Lagrangian penalty, and explicitly handles misspecification on both the operator and constraint functions. Moreover, we introduce a relaxed performance metric based on the Minty VI gap combined with an aggregated infeasibility metric. By proving boundedness of the dual iterates, we establish $\\mathcal{O}(1/K)$ ergodic convergence rates for these metrics. Numerical Experiments are provided to showcase the superior performance of our algorithm compared to state-of-the-art methods."}
{"id": "2602.01242", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.01242", "abs": "https://arxiv.org/abs/2602.01242", "authors": ["Simona Diaconu"], "title": "On Empirical Spectral Distributions for Random Tensor Product Models", "comment": null, "summary": "In statistics, assuming samples are independent is reasonable. However, this property can fail to hold for the features, a distinction that has led to several lines of work aiming to remove the latter assumption of independence present in the early literature, while preserving the original conclusions. Empirical spectral distributions of covariance matrices are key for understanding the data, and their almost sure convergence is oftentimes desirable. The random tensor product model, $X=(x_{i_1}x_{i_2}...x_{i_d})_{1 \\leq i_1<...<i_d \\leq n}$ for $x_1,x_2,\\hspace{0.05cm}...\\hspace{0.05cm},x_n$ i.i.d., introduced by the machine learning community, has a dependence structure for its features far from trivial and has been studied in recent years. When $x_1 \\in \\mathbb{R}, \\mathbb{E}[x_1^4]<\\infty, \\frac{d}{n^{1/3}}=o(1),$ the empirical spectral distributions of the covariance matrices were proved to converge almost surely to Marchenko-Pastur laws in the random matrix theory regime. This work extends this result to the range $\\frac{d}{n^{1/2}}=~o(1)$ when $x_1$ is symmetric with a subgaussian norm slowly growing in $n$ (the aforesaid range arises naturally, and the result failing when $\\frac{d}{n^{1/2}} \\to \\infty$ appears to be a plausible claim) and shows that similarly to the case with independent features, the almost sure convergence holds under more general conditions on the covariance structure than the isotropic case. The latter result provides a means of deriving convergence for empirical spectral distributions of random matrices, applicable to other models as well so long as their entries exhibit a certain degree of concentration."}
{"id": "2602.00870", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.00870", "abs": "https://arxiv.org/abs/2602.00870", "authors": ["Shiyuan Li", "Hossein Salahshoor"], "title": "Finite Element Eigenfunction Network (FEENet): A Hybrid Framework for Solving PDEs on Complex Geometries", "comment": null, "summary": "Neural operators aim to learn mappings between infinite-dimensional function spaces, but their performance often degrades on complex or irregular geometries due to the lack of geometry-aware representations. We propose the Finite Element Eigenfunction Network (FEENet), a hybrid spectral learning framework grounded in the eigenfunction theory of differential operators. For a given domain, FEENet leverages the Finite Element Method (FEM)toperformaone-timecomputationofaneigenfunctionbasisintrinsictothegeometry. PDE solutions are subsequently represented in this geometry-adapted basis, and learning is reduced to predicting the corresponding spectral coefficients. Numerical experiments conducted across a range of parameterized PDEs and complex two- and three-dimensional geometries, including benchmarks against the seminal DeepONet framework (1), demonstrate that FEENet consistently achieves superior accuracy and computational efficiency. We further highlight key advantages of the proposed approach, including resolution-independent inference, interpretability, and natural generalization to nonlocal operators defined as functions of differential operators. We envision that hybrid approaches of this form, which combine structure-preserving numerical methods with data-driven learning, offer a promising pathway toward solving real-world PDE problems on complex geometries."}
{"id": "2602.02083", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.02083", "abs": "https://arxiv.org/abs/2602.02083", "authors": ["Alexis Ayme", "Rémi Khellaf"], "title": "Handling Covariate Mismatch in Federated Linear Prediction", "comment": null, "summary": "Federated learning enables institutions to train predictive models collaboratively without sharing raw data, addressing privacy and regulatory constraints. In the standard horizontal setting, clients hold disjoint cohorts of individuals and collaborate to learn a shared predictor. Most existing methods, however, assume that all clients measure the same features. We study the more realistic setting of covariate mismatch, where each client observes a different subset of features, which typically arises in multicenter collaborations with no prior agreement on data collection. We formalize learning a linear prediction under client-wise MCAR patterns and develop two modular approaches tailored to the dimensional regime and communication budget. In the low-dimensional setting, we propose a plug-in estimator that approximates the oracle linear predictor by aggregating sufficient statistics to estimate the covariance and cross-moment terms. In higher dimensions, we study an impute-then-regress strategy: (i) impute missing covariates using any exchangeability-preserving imputation procedure, and (ii) fit a ridge-regularized linear model on the completed data. We provide asymptotic and finite-sample learning rates for our predictors, explicitly characterizing their behaviour with the global dimension, the client-specific feature partition, and the distribution of samples across sites."}
{"id": "2602.00544", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.00544", "abs": "https://arxiv.org/abs/2602.00544", "authors": ["Heinz H. Bauschke", "Tran Thanh Tung"], "title": "Extending Meshulam's result on the boundedness of orbits of relaxed projections onto affine subspaces from finite to infinite-dimensional Hilbert spaces", "comment": null, "summary": "In 1996, Meshulam proved that any sequence generated in Euclidean space by randomly projecting onto affine subspaces drawn from a finite collection stays bounded even if the intersection of the subspaces is empty. His proof, which works even for relaxed projections, relies on an ingenious induction on the dimension of the Euclidean space.\n  In this paper, we extend Meshulam's result to the general Hilbert space setting by an induction proof of the number of affine subspaces in the given collection. We require that the corresponding parallel linear subspaces are innately regular -- this assumption always holds in Euclidean space. We also discuss the sharpness of our result and make a connection to randomized block Kaczmarz methods."}
{"id": "2602.01432", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.01432", "abs": "https://arxiv.org/abs/2602.01432", "authors": ["James Tian"], "title": "Subinvariant kernel dynamics", "comment": null, "summary": "We study positive definite kernels pulled back along a finite family of self-maps under a subinvariance inequality for the associated branching operator. Iteration produces an increasing kernel tower with defect kernels. Under diagonal boundedness, the tower has a smallest invariant majorant, with a canonical defect space realization and an explicit diagonal harmonic envelope governing finiteness versus blow-up. We also give probabilistic and boundary representations: a Gaussian martingale model whose quadratic variation is the defect sequence, and canonical Doob path measures with a boundary feature model for the normalized defects."}
{"id": "2602.00897", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.00897", "abs": "https://arxiv.org/abs/2602.00897", "authors": ["Abdellatif Mouhssine"], "title": "A New Combination of Preconditioned Gradient Descent Methods and Vector Extrapolation Techniques for Nonlinear Least-Squares Problems", "comment": null, "summary": "Vector extrapolation methods are widely used in large-scale simulation studies, and numerous extrapolation-based acceleration techniques have been developed to enhance the convergence of linear and nonlinear fixed-point iterative methods. While classical extrapolation strategies often reduce the number of iterations or the computational cost, they do not necessarily lead to a significant improvement in the accuracy of the computed approximations. In this paper, we study the combination of preconditioned gradient-based methods with extrapolation strategies and propose an extrapolation-accelerated framework that simultaneously improves convergence and approximation accuracy. The focus is on the solution of nonlinear least-squares problems through the integration of vector extrapolation techniques with preconditioned gradient descent methods. A comprehensive set of numerical experiments is carried out to study the behavior of polynomial-type extrapolation methods and the vector $\\varepsilon$-algorithm when coupled with gradient descent schemes, with and without preconditioning. The results demonstrate the impact of extrapolation techniques on both convergence rate and solution accuracy, and report iteration counts, computational times, and relative reconstruction errors. The performance of the proposed hybrid approaches is further assessed through a benchmarking study against Gauss--Newton methods based on generalized Krylov subspaces."}
{"id": "2602.02316", "categories": ["math.ST", "stat.AP", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.02316", "abs": "https://arxiv.org/abs/2602.02316", "authors": ["Sebastian Engelke", "Philippe Naveau", "Chen Zhou"], "title": "A Kullback-Leibler divergence test for multivariate extremes: theory and practice", "comment": null, "summary": "Testing whether two multivariate samples exhibit the same extremal behavior is an important problem in various fields including environmental and climate sciences. While several ad-hoc approaches exist in the literature, they often lack theoretical justification and statistical guarantees. On the other hand, extreme value theory provides the theoretical foundation for constructing asymptotically justified tests. We combine this theory with Kullback-Leibler divergence, a fundamental concept in information theory and statistics, to propose a test for equality of extremal dependence structures in practically relevant directions. Under suitable assumptions, we derive the limiting distributions of the proposed statistic under null and alternative hypotheses. Importantly, our test is fast to compute and easy to interpret by practitioners, making it attractive in applications. Simulations provide evidence of the power of our test. In a case study, we apply our method to show the strong impact of seasons on the strength of dependence between different aggregation periods (daily versus hourly) of heavy rainfall in France."}
{"id": "2602.00634", "categories": ["math.OC", "cs.IT", "quant-ph"], "pdf": "https://arxiv.org/pdf/2602.00634", "abs": "https://arxiv.org/abs/2602.00634", "authors": ["Masahito Hayashi"], "title": "Deterministic Zeroth-Order Mirror Descent via Vector Fields with A Posteriori Certification", "comment": null, "summary": "We develop a deterministic zeroth-order mirror descent framework by replacing gradients with a general vector field, yielding a vector-field-driven mirror update that preserves Bregman geometry while accommodating derivative-free oracles. Our analysis provides a unified evaluation template for last-iterate function values under a relative-smoothness-type inequality, with an emphasis on trajectory-wise (a posteriori) certification: whenever a verifiable inequality holds along the realized iterates, we obtain explicit last-iterate guarantees. The framework subsumes a broad class of information-geometric algorithms, including generalized Blahut-Arimoto-type updates, by expressing their dynamics through suitable choices of the vector field. We then instantiate the theory with deterministic central finite differences in moderate dimension, where constructing the vector field via deterministic central finite differences requires 2d off-center function values (and one reusable center value), i.e., 2d+1 evaluations in total, where d is the number of input real numbers. In this deterministic finite-difference setting, the key interface property is not classical convexity alone but a punctured-neighborhood generalized star-convexity condition that isolates an explicit resolution-dependent error floor. Establishing this property for the finite-difference vector field reduces to a robust conic dominance design problem; we give an explicit scaling rule ensuring the required uniform dominance on a circular cone. Together, these results expose a hidden geometric structure linking Bregman telescoping identities, deterministic certification, and robust conic geometry in zeroth-order mirror descent."}
{"id": "2602.01641", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.01641", "abs": "https://arxiv.org/abs/2602.01641", "authors": ["Zhenfu Wang", "Xianliang Zhao"], "title": "Quantitative Convergence and Gaussian Fluctuations for Sequential Interacting Diffusions via Incremental Relative Entropy", "comment": "48 pages, 2 figures", "summary": "We study a sequential system of interacting diffusions in which particle $i$ interacts only with its predecessors through the empirical measure $μ_t^{i-1}$, yielding a directed, non-exchangeable mean-field approximation of a McKean--Vlasov diffusion. Under bounded coefficients and a non-degenerate constant diffusion, we prove the sharp decay of incremental path-space relative entropies,\n  $$\n  R_i(T):=H\\left(P^{1:i}_{[0,T]}\\vert P^{1:i-1}_{[0,T]}\\otimes \\bar P_{[0,T]}\\right)\n  \\ \\lesssim\\ \\frac{1}{i-1}, \\qquad i\\ge2,\n  $$\n  where $P^{1:i}_{[0,T]}$ is the law of the first $i$ particle paths and $\\bar P_{[0,T]}$ the McKean--Vlasov path law.\n  Summing the increments yields the global estimate\n  $$\n  H \\left(P^{1:N}_{[0,T]}\\, \\vert \\,\\bar P_{[0,T]}^{\\otimes N}\\right)\\ \\lesssim\\ \\log N,\n  $$\n  together with quantitative decoupling bounds for tail blocks. As a consequence, the empirical measure converges to the McKean--Vlasov equation in negative Sobolev topologies at the canonical $N^{-1/2}$ scale. We also establish a Gaussian fluctuation limit for the fluctuation measure, where the sequential architecture produces an explicit feedback correction in the limiting linear SPDE. Our proofs rely on a Girsanov representation, a martingale-difference replacement of predecessor empirical measures by average conditional measures, and an upper-envelope argument."}
{"id": "2602.01094", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01094", "abs": "https://arxiv.org/abs/2602.01094", "authors": ["Qi Xin", "Shihua Gong", "Lingyue Shen", "Pinjing Wen", "Yumiao Zhang", "Yan Chen", "Jiarui Han", "Jinchao Xu"], "title": "High-order DLM-ALE discretizations with robust operator preconditioning for fluid-rigid-body interaction", "comment": null, "summary": "Motivated by the design of deterministic lateral displacement (DLD) microfluidic devices, we develop a high-order numerical framework for fluid-rigid-body interaction on fitted moving meshes. Rigid-body motion is enforced by a distributed Lagrange multiplier (DLM) formulation, while the moving fluid domain is treated by an arbitrary Lagrangian-Eulerian (ALE) mapping. In space, we use isoparametric Taylor-Hood elements to achieve high-order accuracy and to represent curved boundaries and the fluid-particle interface. In time, we employ a high-order partitioned Runge-Kutta strategy in which the mesh motion is advanced explicitly and the coupled physical fields are advanced implicitly, yielding high-order accuracy for the particle trajectory. The fully coupled system is linearized into a generalized Stokes problem subject to distributed constraints of incompressibility and rigid-body motion. We establish well-posedness of this generalized Stokes formulation at both the continuous and discrete levels, providing the stability foundation for operator preconditioning that is robust with respect to key physical and discretization parameters. Numerical experiments on representative benchmarks, including a DLD case, demonstrate high-order convergence for the fluid solution and rigid-body dynamics, as well as robust iterative convergence of the proposed preconditioners."}
{"id": "2602.02491", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.02491", "abs": "https://arxiv.org/abs/2602.02491", "authors": ["Karl B. Gregory", "Daniel J. Nordman"], "title": "New explanations and inference for least angle regression", "comment": "50 pages, 9 figures", "summary": "Efron et al. (2004) introduced least angle regression (LAR) as an algorithm for linear predictions, intended as an alternative to forward selection with connections to penalized regression. However, LAR has remained somewhat of a \"black box,\" where some basic behavioral properties of LAR output are not well understood, including an appropriate termination point for the algorithm. We provide a novel framework for inference with LAR, which also allows LAR to be understood from new perspectives with several newly developed mathematical properties. The LAR algorithm at a data level can viewed as estimating a population counterpart \"path\" that organizes a response mean along regressor variables which are ordered according to a decreasing series of population \"correlation\" parameters; such parameters are shown to have meaningful interpretations for explaining variable contributions whereby zero correlations denote unimportant variables. In the output of LAR, estimates of all non-zero population correlations turn out to have independent normal distributions for use in inference, while estimates of zero-valued population correlations have a certain non-normal joint distribution. These properties help to provide a formal rule for stopping the LAR algorithm. While the standard bootstrap for regression can fail for LAR, a modified bootstrap provides a practical and formally justified tool for interpreting the entrance of variables and quantifying uncertainty in estimation. The LAR inference method is studied through simulation and illustrated with data examples."}
{"id": "2602.00752", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.00752", "abs": "https://arxiv.org/abs/2602.00752", "authors": ["Mauro Garavello", "Xiaoqian Gong", "Benedetto Piccoli"], "title": "Properties of Measure Controls and Their Trajectories", "comment": "24 pages, 0 figures", "summary": "This paper deals with the concepts of measure controls and of measure vector fields, within the mathematical framework of measure differential equations (MDEs), recently proposed in~\\cite{piccoli_measure_2019}. Measure controls can be seen as a generalization of relaxed control. Moreover, they are particularly suitable for studying dynamics with uncertainty.\n  The main results of this paper include establishing the existence and well-posedness of control systems with measure controls and proving the equivalence between measure controls and measure vector fields. The stability and closure properties of the trajectory set are also studied."}
{"id": "2602.01735", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.01735", "abs": "https://arxiv.org/abs/2602.01735", "authors": ["Danijel Grahovac", "Péter Kevei", "Orimar Sauri"], "title": "Path properties of Lévy driven mixed moving average processes", "comment": "26 pages", "summary": "We derive general sufficient conditions for the existence of càdlàg and continuous modifications of Lévy-driven mixed moving average processes. The conditions are explicit and easy to verify and applied to supOU, well-balanced supOU, trawl, and power-weighted supOU processes. In these examples, the conditions are shown to be close to optimal."}
{"id": "2602.01143", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01143", "abs": "https://arxiv.org/abs/2602.01143", "authors": ["Pasco Alexandre", "Nouy Anthony"], "title": "Surrogate to Poincaré inequalities on manifolds for structured dimension reduction in nonlinear feature spaces", "comment": "25 pages, 2 figures", "summary": "This paper is concerned with the approximation of continuously differentiable functions with high-dimensional input by a composition of two functions: a feature map that extracts few features from the input space, and a profile function that approximates the target function taking the features as its low-dimensional input. We focus on the construction of structured nonlinear feature maps, that extract features on separate groups of variables, using a recently introduced gradient-based method that leverages Poincaré inequalities on nonlinear manifolds. This method consists in minimizing a non-convex loss functional, which can be a challenging task, especially for small training samples. We first investigate a collective setting, in which we construct a feature map suitable to a parametrized family of high-dimensional functions. In this setting we introduce a new quadratic surrogate to the non-convex loss function and show an upper bound on the latter. We then investigate a grouped setting, in which we construct separate feature maps for separate groups of inputs, and we show that this setting is almost equivalent to multiple collective settings, one for each group of variables."}
{"id": "2602.02217", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.02217", "abs": "https://arxiv.org/abs/2602.02217", "authors": ["Zhi-Jun Cai", "Qi-Man Shao", "Zhuo-Song Zhang"], "title": "Refined Berry-Esseen bounds under local dependence", "comment": "65 pages", "summary": "In this paper, we establish Berry--Esseen bounds for both self-normalized and non-self-normalized sums of locally dependent random variables. The proofs are based on Stein's method together with a concentration inequality approach. We develop a new class of concentration inequalities that extend classical results and achieve optimal convergence rates under more general dependence structures. As applications, we apply our main results to derive sharper Berry--Esseen bounds for graph dependency, distributed $U$-statistics, constrained $U$-statistics, and decorated injective homomorphism sums."}
{"id": "2602.00921", "categories": ["math.OC", "cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.00921", "abs": "https://arxiv.org/abs/2602.00921", "authors": ["Eric Gelphman", "Deepanshu Verma", "Nicole Tianjiao Yang", "Stanley Osher", "Samy Wu Fung"], "title": "On the Convergence of Jacobian-Free Backpropagation for Optimal Control Problems with Implicit Hamiltonians", "comment": "19 Pages, 6 figures, 1 table. Submitted to ICML and is pending review", "summary": "Optimal feedback control with implicit Hamiltonians poses a fundamental challenge for learning-based value function methods due to the absence of closed-form optimal control laws. Recent work~\\cite{gelphman2025end} introduced an implicit deep learning approach using Jacobian-Free Backpropagation (JFB) to address this setting, but only established sample-wise descent guarantees. In this paper, we establish convergence guarantees for JFB in the stochastic minibatch setting, showing that the resulting updates converge to stationary points of the expected optimal control objective. We further demonstrate scalability on substantially higher-dimensional problems, including multi-agent optimal consumption and swarm-based quadrotor and bicycle control. Together, our results provide both theoretical justification and empirical evidence for using JFB in high-dimensional optimal control with implicit Hamiltonians."}
{"id": "2602.01944", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.01944", "abs": "https://arxiv.org/abs/2602.01944", "authors": ["Nhat-Thang Le"], "title": "A forward algorithm for a class of Markov zero-sum stopping games", "comment": null, "summary": "In this paper, we propose a new efficient algorithm to compute the value function for zero-sum stopping games featuring two players with opposing interests. This can be seen as a game version of the ''forward algorithm'' for (one-player) optimal stopping problem, first introduced by Irle [6] for discrete-time Markov processes and later revisited by Miclo \\& Villeneuve [8] for continuous-time Markov processes on general state spaces. This paper focuses on a game driven by a homogeneous Markov process taking values in a finite state space and also discusses about the number of iterations needed. Illustrated computational implementations for a few particular examples are also provided."}
{"id": "2602.01175", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01175", "abs": "https://arxiv.org/abs/2602.01175", "authors": ["Xiaoli Li", "Jie Shen", "Xinhui Wang"], "title": "Novel linear, decoupled, and energy dissipative schemes for the Navier-Stokes-Darcy model and extension to related two-phase flow", "comment": null, "summary": "We construct efficient original-energy-dissipative schemes for the Navier-Stokes-Darcy model and related two-phase flows using a prediction-correction framework. A new relaxation technique is incorporated in the correction step to guarantee dissipation of the original energy, thereby ensuring unconditional boundedness of the numerical solutions for velocity and hydraulic head in the $l^{\\infty}(L^2)$ and $l^2(H^1)$ norms. At each time step, the schemes require solving only a sequence of linear equations with constant coefficients. We rigorously prove that the schemes dissipate the original energy and, as an example, carry out a rigorous error analysis of the first-order scheme for the Navier-Stokes-Darcy model. Finally, a series of benchmark numerical experiments are conducted to demonstrate the accuracy, stability, and effectiveness of the proposed methods."}
{"id": "2602.01152", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01152", "abs": "https://arxiv.org/abs/2602.01152", "authors": ["Zhuolin Du", "Yisheng Song"], "title": "An Efficient Memory Gradient Method for Extreme M-Eigenvalues of Elastic type Tensors", "comment": "30 Pages", "summary": "M-eigenvalues of fourth order hierarchically symmetric tensors play a significant role in nonlinear elastic material analysis and quantum entanglement problems. This paper focuses on computing extreme M-eigenvalues for such tensors. To achieve this, we first reformulate the M-eigenvalue problem as a sequence of unconstrained optimization problems by introducing a shift parameter. Subsequently, we develop a memory gradient method specifically designed to approximate these extreme M-eigenvalues. Under this framework, we establish the global convergence of the proposed method. Finally, comprehensive numerical experiments demonstrate the efficacy and stability of our approach."}
{"id": "2602.02109", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.02109", "abs": "https://arxiv.org/abs/2602.02109", "authors": ["Matteo Cagnotti"], "title": "$L^p$-sup Convergence of the Euler-Maruyama Scheme for SDEs with Distributional Besov Drift", "comment": null, "summary": "In this paper we extend existing results on the numerical approximation of one-dimensional SDEs with drift in a negative order Besov space and driven by Brownian motion. Using the Yamada-Watanabe approximation technique, we prove rates in $L^p$, for all $p\\geq 2$, applying a Gronwall-type lemma previously used in the literature for SDEs with Hölder continuous coefficients. Additionally, we obtain an explicit convergence rate in the $L^1$-$\\sup$ norm."}
{"id": "2602.01301", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01301", "abs": "https://arxiv.org/abs/2602.01301", "authors": ["Khalide Jbilou"], "title": "A survey of scalar and vector extrapolation", "comment": null, "summary": "Scalar extrapolation and convergence acceleration methods are central tools in numerical analysis for improving the efficiency of iterative algorithms and the summation of slowly convergent series. These methods construct transformed sequences that converge more rapidly to the same limit without altering the underlying iterative process, thereby reducing computational cost and enhancing numerical accuracy. Historically, the origins of such techniques can be traced back to classical algebraic methods by AlKhwarizmi and early series acceleration techniques by Newton, while systematic approaches emerged in the 20th century with Aitken process and Richardson extrapolation. Later developments, including the Shanks transformation and Wynn epsilon algorithm, provided general frameworks capable of eliminating multiple dominant error components, with deep connections to Pade approximants and rational approximations of generating functions. This paper presents a comprehensive review of classical scalar extrapolation methods, including Richardson extrapolation, Aitken process, Shanks transformation, Wynn epsilon algorithm, and other algorithms. We examine their theoretical foundations, asymptotic error models, convergence properties, numerical stability, and practical implementation considerations. The second part of this work is dedicated to vector extrapolation methods: polynomial based ones and epsilon algorithm generalizations to vector sequences. Additionally, we highlight modern developments such as their applications to iterative solvers, Krylov subspace methods, and large-scale computational simulations. The aim of this review is to provide a unified perspective on scalar and vector extrapolation techniques, bridging historical origins, theoretical insights, and contemporary computational applications."}
{"id": "2602.01164", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.01164", "abs": "https://arxiv.org/abs/2602.01164", "authors": ["Martin Doff-Sotta", "Zaheen A-Rahman", "Mark Cannon"], "title": "Computationally Tractable Robust Nonlinear Model Predictive Control using DC Programming", "comment": null, "summary": "We propose a computationally tractable, tube-based robust nonlinear model predictive control (MPC) framework using difference-of-convex (DC) functions and sequential convex programming. For systems with differentiable discrete time dynamics, we show how to construct systematic, data-driven DC model representations using polynomials and machine learning techniques. We develop a robust tube MPC scheme that convexifies the online optimization by linearizing the concave components of the model, and we provide guarantees of recursive feasibility and robust stability. We present three data-driven procedures for computing DC models and compare performance using a planar vertical take-off and landing (PVTOL) aircraft case study."}
{"id": "2602.02217", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.02217", "abs": "https://arxiv.org/abs/2602.02217", "authors": ["Zhi-Jun Cai", "Qi-Man Shao", "Zhuo-Song Zhang"], "title": "Refined Berry-Esseen bounds under local dependence", "comment": "65 pages", "summary": "In this paper, we establish Berry--Esseen bounds for both self-normalized and non-self-normalized sums of locally dependent random variables. The proofs are based on Stein's method together with a concentration inequality approach. We develop a new class of concentration inequalities that extend classical results and achieve optimal convergence rates under more general dependence structures. As applications, we apply our main results to derive sharper Berry--Esseen bounds for graph dependency, distributed $U$-statistics, constrained $U$-statistics, and decorated injective homomorphism sums."}
{"id": "2602.01315", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.01315", "abs": "https://arxiv.org/abs/2602.01315", "authors": ["Shishu Pal Singh", "Sudeep Kundu"], "title": "Finite element theta schemes for the viscous Burgers' equation with nonlinear Neumann boundary feedback control", "comment": null, "summary": "In this article, we develop a fully discrete numerical scheme for the one-dimensional (1D) and two-dimensional (2D) viscous Burgers equations with nonlinear Neumann boundary feedback control. The temporal discretization employs a $θ$-scheme, while a conforming finite element method is used for the spatial approximation. The existence and uniqueness of the fully discrete solution are established. We further prove that the scheme is unconditionally exponentially stable for $θ\\in [1/2, 1]$, thereby ensuring that the stabilization property of the continuous model is retained at the discrete level. In addition, optimal error estimates are obtained for both the state variable and the boundary control inputs in 1D and 2D frameworks. Finally, several numerical experiments are presented to validate our theoretical findings and to demonstrate the effectiveness of the proposed stabilization strategy under varying model parameters."}
{"id": "2602.01209", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01209", "abs": "https://arxiv.org/abs/2602.01209", "authors": ["Elif Radová Garajová", "Miroslav Rada"], "title": "Heuristics for the Worst Optimal Value of Interval Transportation Problems", "comment": "22 pages, 4 figures, 3 tables", "summary": "An interval transportation problem represents a model for a transportation problem in which the values of supply, demand, and transportation costs are affected by uncertainty and can vary independently within given interval ranges. One of the main tasks of solving interval programming models is computing the best and worst optimal value over all possible choices of the interval data. Although the best optimal value of an interval transportation problem can be computed in polynomial time, computing the worst (finite) optimal value was proved to be NP-hard. In this paper, we strengthen a previous result showing a quasi-extreme decomposition for finding the worst optimal value, and building on the result, we design heuristics for efficiently approximating the value. Using a simplified encoding of the scenarios, we first derive a local search method and a genetic algorithm for approximating the worst optimal value. Then, we integrate the two methods into a memetic algorithm, which combines the evolutionary improvement of a genetic algorithm with individual learning implemented via local search. Moreover, we include numerical experiments for a practical comparison of the three different approaches. We also show that the proposed memetic algorithm is competitive with the available state-of-the-art methods for approximating the worst optimal value of interval transportation problems, this is demonstrated by finding the new best solutions for several instances, among others."}
{"id": "2602.02346", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.02346", "abs": "https://arxiv.org/abs/2602.02346", "authors": ["Vladimir Vatutin", "Elena Dyakonova"], "title": "Population size of critical Galton-Watson processes under small deviations and infinite variance", "comment": "21 pages", "summary": "We study the evolution of the population size distribution of a critical Galton-Watson process with infinite variance of the offspring size of particles assuming that the population size is unusually small at the distant moment $n$ of observation."}
{"id": "2602.01397", "categories": ["math.NA", "cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.01397", "abs": "https://arxiv.org/abs/2602.01397", "authors": ["Jan S. Hesthaven", "Benjamin Peherstorfer", "Benjamin Unger"], "title": "Nonlinear model reduction for transport-dominated problems", "comment": null, "summary": "This article surveys nonlinear model reduction methods that remain effective in regimes where linear reduced-space approximations are intrinsically inefficient, such as transport-dominated problems with wave-like phenomena and moving coherent structures, which are commonly associated with the Kolmogorov barrier. The article organizes nonlinear model reduction techniques around three key elements -- nonlinear parametrizations, reduced dynamics, and online solvers -- and categorizes existing approaches into transformation-based methods, online adaptive techniques, and formulations that combine generic nonlinear parametrizations with instantaneous residual minimization."}
{"id": "2602.01251", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01251", "abs": "https://arxiv.org/abs/2602.01251", "authors": ["Iman Malmir"], "title": "Novel closed-loop controllers for fractional linear quadratic tracking systems", "comment": null, "summary": "Anew method for finding closed-loop optimal controllers of fractional tracking quadratic optimal control problems is introduced. The optimality conditions for the fractional optimal control problem are obtained. Illustrative examples are presented to show the applicability and capabilities of the method."}
{"id": "2602.02391", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.02391", "abs": "https://arxiv.org/abs/2602.02391", "authors": ["Massimiliano Goldwurm", "Claudio Macci", "Marco Vignati", "Elena Villa"], "title": "Analysis of multivariate symbol statistics in primitive rational models", "comment": null, "summary": "We study the asymptotic behaviour of sequences of multivariate random variables representing the number of occurrences of a given set of symbols in a word of length $n$ generated at random according to a rational stochastic model. Assuming primitive the matrix of the total weights of transitions of the model, we first determine asymptotic expressions for the mean values and the covariances of such statistics. Then we establish two asymptotic results that generalize known univariate cases to different regimes: a large deviation principle with speed $n$, implying almost sure convergence, and a multivariate Gaussian limit. Additionally, we introduce a novel moderate deviation result as a bridge between these regimes. Central to our proofs is a quasi-power property for the moment generating function of the statistics, allowing us to employ the Gärtner-Ellis Theorem for both large and moderate deviations."}
{"id": "2602.01449", "categories": ["math.NA", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.01449", "abs": "https://arxiv.org/abs/2602.01449", "authors": ["Lorenzo Baldassari", "Josselin Garnier", "Knut Solna", "Maarten V. de Hoop"], "title": "Dimension-Free Multimodal Sampling via Preconditioned Annealed Langevin Dynamics", "comment": null, "summary": "Designing algorithms that can explore multimodal target distributions accurately across successive refinements of an underlying high-dimensional problem is a central challenge in sampling. Annealed Langevin dynamics (ALD) is a widely used alternative to classical Langevin since it often yields much faster mixing on multimodal targets, but there is still a gap between this empirical success and existing theory: when, and under which design choices, can ALD be guaranteed to remain stable as dimension increases? In this paper, we help bridge this gap by providing a uniform-in-dimension analysis of continuous-time ALD for multimodal targets that can be well-approximated by Gaussian mixture models. Along an explicit annealing path obtained by progressively removing Gaussian smoothing of the target, we identify sufficient spectral conditions - linking smoothing covariance and the covariances of the Gaussian components of the mixture - under which ALD achieves a prescribed accuracy within a single, dimension-uniform time horizon. We then establish dimension-robustness to imperfect initialization and score approximation: under a misspecified-mixture score model, we derive explicit conditions showing that preconditioning the ALD algorithm with a sufficiently decaying spectrum is necessary to prevent error terms from accumulating across coordinates and destroying dimension-uniform control. Finally, numerical experiments illustrate and validate the theory."}
{"id": "2602.01321", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.01321", "abs": "https://arxiv.org/abs/2602.01321", "authors": ["Shishu Pal Singh", "Sudeep Kundu"], "title": "Global stabilization and finite element analysis of the viscous Burgers' equation with memory subject to Neumann boundary feedback control", "comment": null, "summary": "This paper presents a global stabilization result of the viscous Burgers' equation with the memory term by applying Neumann boundary feedback control laws. We construct suitable feedback control inputs using the control Lyapunov functional and establish stabilization in the \\(L^{2}, H^{1},\\) and \\(H^{2}\\)-norms. The existence and uniqueness of the solution are established through the Faedo-Galerkin method. Moreover, we show the global stabilization where the diffusion coefficient $ν$ is unknown. Then, we apply a \\(C^{0}\\)-conforming finite element method to the spatial variable while keeping the time variable continuous. Furthermore, we obtain global stabilization of the semi-discrete scheme and optimal error estimates for the state variable in the \\(L^{\\infty}\\), \\(L^{2}\\), and \\(H^{1}\\)-norms, using the Ritz-Volterra projection. Additionally, error estimates for the feedback control laws are established. Lastly, we present some numerical simulations to demonstrate the theoretical findings."}
{"id": "2602.00351", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.00351", "abs": "https://arxiv.org/abs/2602.00351", "authors": ["Tianze Qu", "Sushil Mahavir Varma"], "title": "Efficiency-Reward Trade-Off in Queues with Dynamic Arrivals", "comment": null, "summary": "Motivated by applications in online marketplaces such as ride-hailing platforms and payment channel networks, we study a single-server queue with state-dependent arrival control. The service operator dynamically chooses the arrival rate as a function of the current queue length and receives a reward determined by the induced rate, capturing objectives such as throughput, revenue, or social welfare. The goal is to design control policies that simultaneously achieve high long-run operating reward and low congestion, measured by the expected steady-state queue length.\n  We adopt a regret-based framework relative to an optimal benchmark and characterize the efficiency--reward trade-off under an $\\varepsilon$-optimal reward constraint. Our results reveal a sharp dichotomy between small-market and large-market regimes. In small markets, including state-independent policies, any admissible control incurs poor efficiency, with the expected queue length growing on the order of $1/\\varepsilon$. In contrast, in large markets, state-dependent policies can achieve substantially better performance. When the reward function exhibits sufficient curvature, the optimal queue length scales as $Θ(1/\\sqrt{\\varepsilon})$; otherwise, it scales as $Θ(\\log(1/\\varepsilon))$.\n  For each regime, we establish universal lower bounds on the achievable efficiency and construct simple state-dependent policies that attain these bounds. Our results provide a non-asymptotic heavy-traffic characterization for queues with dynamic arrivals and offer structural insights into the design of efficient pricing and admission control policies."}
{"id": "2602.01467", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01467", "abs": "https://arxiv.org/abs/2602.01467", "authors": ["Junping Wang"], "title": "Beyond Taylor: Divergence-Based Functional Expansions and Their Application to Numerical Integration", "comment": "20 pages, 1 figure, original", "summary": "This paper introduces a new functional expansion framework that extends classical ideas beyond the Taylor series. Unlike traditional Taylor expansions based on local polynomial approximations, the proposed approach arises from exact differential identities that link a function and its derivatives through polynomial weight factors. This formulation expresses smooth functions via divergence-based relations connecting derivatives of all orders with systematically scaled polynomial coefficients. This framework provides a natural foundation for constructing high-order numerical quadrature formulas, particularly for multi-dimensional domains. By exploiting the divergence structure, volume integrals are systematically transformed into boundary integrals using the Divergence Theorem, recursively reducing the integration domain from an $n$-dimensional body to its $(n-1)$-dimensional facets, and ultimately to its vertices.\n  The article further enhances the framework's accuracy by introducing a complex-shift technique. It is demonstrated that by positioning the expansion center at specific roots of unity in the complex plane, lower-order error terms are annihilated, yielding high-order real-valued quadrature rules with minimal function evaluations. Additionally, a rigorous geometric analysis of the affine transformations required for surface integration is provided, deriving explicit formulas for the transformation of normal vectors and surface measures. The proposed method offers a robust, systematic, and computationally efficient alternative to tessellation-based quadrature for arbitrary flat-faced polytopes."}
{"id": "2602.01337", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.01337", "abs": "https://arxiv.org/abs/2602.01337", "authors": ["T. J. Meijer", "V. S. Dolk", "W. P. M. H. Heemels"], "title": "On Poly-Quadratic Stabilizability and Detectability of Polytopic LPV Systems", "comment": "To appear in Automatica", "summary": "In this technical communique, we generalize the well-known Lyapunov-based stabilizability and detectability tests for discrete-time linear time-invariant systems to polytopic linear parameter-varying systems using the class of so-called poly-quadratic Lyapunov functions."}
{"id": "2602.01449", "categories": ["math.NA", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.01449", "abs": "https://arxiv.org/abs/2602.01449", "authors": ["Lorenzo Baldassari", "Josselin Garnier", "Knut Solna", "Maarten V. de Hoop"], "title": "Dimension-Free Multimodal Sampling via Preconditioned Annealed Langevin Dynamics", "comment": null, "summary": "Designing algorithms that can explore multimodal target distributions accurately across successive refinements of an underlying high-dimensional problem is a central challenge in sampling. Annealed Langevin dynamics (ALD) is a widely used alternative to classical Langevin since it often yields much faster mixing on multimodal targets, but there is still a gap between this empirical success and existing theory: when, and under which design choices, can ALD be guaranteed to remain stable as dimension increases? In this paper, we help bridge this gap by providing a uniform-in-dimension analysis of continuous-time ALD for multimodal targets that can be well-approximated by Gaussian mixture models. Along an explicit annealing path obtained by progressively removing Gaussian smoothing of the target, we identify sufficient spectral conditions - linking smoothing covariance and the covariances of the Gaussian components of the mixture - under which ALD achieves a prescribed accuracy within a single, dimension-uniform time horizon. We then establish dimension-robustness to imperfect initialization and score approximation: under a misspecified-mixture score model, we derive explicit conditions showing that preconditioning the ALD algorithm with a sufficiently decaying spectrum is necessary to prevent error terms from accumulating across coordinates and destroying dimension-uniform control. Finally, numerical experiments illustrate and validate the theory."}
{"id": "2602.01497", "categories": ["math.NA", "physics.comp-ph", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2602.01497", "abs": "https://arxiv.org/abs/2602.01497", "authors": ["Josef Musil"], "title": "Third-Order Geometric-Volume Conservation in Cahn--Hilliard Models", "comment": "23 pages, 10 figures. Appendices A-C included (16 pages)", "summary": "Degenerate Cahn-Hilliard phase-field models provide a robust approximation of surface-diffusion-driven interface motion without explicit front tracking. In computations, however, the geometric volume enclosed by the interface -- the region where the order parameter $φ$ is positive -- may drift at finite interface thickness, producing artificial shrinkage or growth even when the sharp-interface limit conserves volume. We revisit and extend the improved-conservation framework of Zhou et al., where one replaces classical mass conservation by the exact conservation of a designed monotone mapping $Q(φ)$ that more accurately approximates a step function. Building on this framework, we (i) carry out the matched-asymptotic analysis in the unscaled physical time formulation, (ii) derive a simplified representation of the first-order inner correction to the interface profile, and (iii) identify an integral-moment cancellation condition that controls the leading geometric-volume defect. This mechanism becomes a practical design rule: we select regularization kernels within parameterized families -- including exponential and Pade-type -- to reach effective higher-order behavior and satisfy the cancellation condition at moderate parameter values. As a result, the proposed kernels achieve formal third-order accuracy in geometric-volume conservation with respect to interface thickness. Finally, we describe an unconditional energy-dissipative numerical discretization that exactly preserves the discrete conserved quantity. Numerical benchmarks on multi-scale droplet coarsening and shape relaxation demonstrate that the moment-balanced kernels virtually eliminate artificial drift and prevent premature extinction of small droplets."}
{"id": "2602.01360", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01360", "abs": "https://arxiv.org/abs/2602.01360", "authors": ["Miroslav Rada", "Milan Hladík", "Elif Radová Garajová", "Francesco Carrabs", "Raffaele Cerulli", "Ciriaco D'Ambrosio"], "title": "Minimum cost network flow with interval capacities: The worst-case scenario", "comment": "30 pages, 6 figures", "summary": "We study the problem of determining the worst optimal value and characterizing the corresponding worst-case scenarios in minimum cost network flow problems with interval uncertainty in arc capacities. In this setting, each capacity can take any value within its specified lower and upper bounds. We prove that computing the worst optimal value is a strongly NP-hard problem and remains NP-hard even when restricted to series-parallel graphs. Further, we propose a mixed-integer linear programming formulation that computes the exact worst optimal value, as well as a pseudopolynomial-time algorithm designed for the special case of series-parallel graphs. We also examine the structural properties of the most extremal worst-case scenarios and show that the arcs whose capacities are not fixed at their interval bounds form a forest. This result establishes an upper bound on the number of such arcs, which we show to be tight by constructing a class of instances in which the bound is attained. Finally, we investigate the more-for-less paradox in minimum cost network flow problems with interval capacities, which occurs in instances where increasing the required flow leads to a decrease in the worst-case optimal cost. We provide a general characterization of this phenomenon using augmenting paths and establish a stronger characterization for complete graphs. In addition, we discuss the properties of the cost matrices immune against the paradox and prove that deciding whether a given cost matrix has this property is a strongly co-NP-hard problem."}
{"id": "2602.01498", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01498", "abs": "https://arxiv.org/abs/2602.01498", "authors": ["Mingyu Han", "Daniel Zhengyu Huang", "Yuhan Wang", "Yanshu Zhang", "Jiayi Zhou"], "title": "Geometric Generalization of Neural Operators from Kernel Integral Perspective", "comment": "33 pages, 4 figures", "summary": "Neural operators are neural network-based surrogate models for approximating solution operators of parametric partial differential equations, enabling efficient many-query computations in science and engineering. Many applications, including engineering design, involve variable and often nonparametric geometries, for which generalization to unseen geometries remains a central practical challenge. In this work, we adopt a kernel integral perspective motivated by classical boundary integral formulations and recast operator learning on variable geometries as the approximation of geometry-dependent kernel operators, potentially with singularities. This perspective clarifies a mechanism for geometric generalization and reveals a direct connection between operator learning and fast kernel summation methods. Leveraging this connection, we propose a multiscale neural operator inspired by Ewald summation for learning and efficiently evaluating unknown kernel integrals, and we provide theoretical accuracy guarantees for the resulting approximation. Numerical experiments demonstrate robust generalization across diverse geometries for several commonly used kernels and for a large-scale three-dimensional fluid dynamics example."}
{"id": "2602.01372", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.01372", "abs": "https://arxiv.org/abs/2602.01372", "authors": ["Gabriel Peyré"], "title": "Robust Sublinear Convergence Rates for Iterative Bregman Projections", "comment": null, "summary": "Entropic regularization provides a simple way to approximate linear programs whose constraints split into two (or more) tractable blocks. The resulting objectives are amenable to cyclic Kullback-Leibler (KL) Bregman projections, with the classical Sinkhorn algorithm for optimal transport (balanced, unbalanced, gradient flows, barycenters, \\dots) as the canonical example. Assuming uniformly bounded primal mass and dual radius, we prove that the dual objective of these KL projections decreases at an $O(1/k)$ rate with a constant that scales only linearly in $1/γ$, where $γ$ is the entropic regularization parameter. This extends the guarantees known for entropic optimal transport to any such linearly constrained problem. Following the terminology introduced in [Chizat et al 2025], we call such rates \"robust\", because this mild dependence on $γ$ underpins favorable complexity bounds for approximating the unregularized problem via alternating KL projections. The crucial aspect of the analysis is that the dual radius should be measured according to a block-quotient dual seminorm, which depends on the structure of the split of the constraint into blocks. As an application, we derive the flow-Sinkhorn algorithm for the Wasserstein-1 distance on graphs. It achieves $ε$-additive accuracy on the transshipment cost in $O(p/ε^{4})$ arithmetic operations, where $p$ is the number of edges."}
{"id": "2602.01529", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01529", "abs": "https://arxiv.org/abs/2602.01529", "authors": ["Weimin Han", "Jianguo Huang", "Yuan Yao"], "title": "Well-posedness and Numerical Analysis of Mixed Variational-hemivariational Inequalities", "comment": "29 pages, 4 tables, 16 figures", "summary": "The paper is devoted to well-posedness analysis and the numerical solution of a family of general elliptic mixed variational-hemivariational inequalities. Various mixed variational equations, mixed variational inequalities and mixed hemivariational inequalities found in the literature are special cases of the mixed variational-hemivariational inequalities. Well-posedness of the mixed variational-hemivariational inequalities and their numerical approximations are studied via the projection iteration technique. Error analysis of the numerical methods is presented. The results are applied to the study of a variational-hemivariational inequality of the Stokes equations for incompressible fluid flows subject to slip conditions of frictional type, both monotone and non-monotone. Optimal order error estimates are derived for the use of some stable finite element space pairs under certain solution regularity assumptions. Numerical results are reported demonstrating the theoretical prediction of convergence orders."}
{"id": "2602.01392", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01392", "abs": "https://arxiv.org/abs/2602.01392", "authors": ["Andrea Altamura", "Fabrizio Lacalandra", "Antonio Frangioni", "Massimo La Scala"], "title": "Evaluation of Electricity Market Clearing Mechanisms via Reinforcement Learning: Prices, Remuneration and Competitive Dynamics", "comment": null, "summary": "The Pay-as-Clear (PaC) mechanism currently used in the European electricity market can generate significant submarginal profits for renewable sources when the clearing price is determined by the marginal offers of gas-fired generation units and the cost of natural gas exceeds certain levels. This exposes consumers to high price volatility related to the cost of natural gas. This report analyzes the recently proposed Segmented Pay-as-Clear (SPaC) mechanism as a market alternative, evaluating its system cost-effectiveness through simulations based on Reinforcement Learning (Q-Learning) to model the strategic behavior of operators. Three market models are compared, the two classic Pay-as-Clear (PaC) and Pay-as-Bid (PaB) along with SPaC, under two scenarios: a simplified one based on the 2030 NECP objectives and one built on the portfolios of ten operators obtained from the GME's 2024 public offers. The results show that the SPaC market clearing mechanism reduces intramarginal profits and price volatility compared to PaC, while maintaining fair participation incentives for all operators, and is more robust than PaB to the exercise of market power in oligopolistic contexts. The developed framework can serve as a support tool for regulators and policymakers in the evaluation of proposals for market design reforms."}
{"id": "2602.01636", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01636", "abs": "https://arxiv.org/abs/2602.01636", "authors": ["Hiroki Ishizaka"], "title": "Equilibrated-flux residual certification for verified existence and outputs", "comment": null, "summary": "We present a post-processing certification workflow for nonlinear elliptic boundary value problems that upgrades a standard finite element computation to a rigorous existence and output certificate. For a given approximate discrete state, we verify existence and local uniqueness of a weak solution in a computable neighbourhood via a Newton--Kantorovich argument based on three certified ingredients: a guaranteed dual-norm residual bound, a computable lower bound for the stability constant of the linearised operator, and a Lipschitz bound for the derivative on the verification ball. The residual bound is obtained by an equilibrated-flux reconstruction exploiting an explicit relation between nonconforming and mixed formulations, yielding $H(\\mathrm{div})$-conforming fluxes without local mixed solves. The stability ingredient follows from a computable coercivity lower bound for the linearisation. An admissible verification radius is selected by a simple bracketing--bisection search, justified for an affine Lipschitz model. Once the verification ball is certified, we derive guaranteed enclosures for quantities of interest using computable variation bounds; an adjoint-based correction, in the spirit of goal-oriented error estimation, tightens these intervals while retaining full rigour. Numerical experiments for semilinear diffusion--reaction models show that the certificates are informative and that the adjoint enhancement substantially reduces enclosure widths."}
{"id": "2602.01420", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.01420", "abs": "https://arxiv.org/abs/2602.01420", "authors": ["Jietian Liu", "Peter Seiler"], "title": "Regret of $H_\\infty$ Preview Controllers", "comment": null, "summary": "This paper studies preview control in both the $H_\\infty$ and regret-optimal settings. The plant is modeled as a discrete-time, linear time-invariant system subject to external disturbances. The performance baseline is the optimal non-causal controller that has full knowledge of the disturbance sequence. We first review the construction of the $H_\\infty$ preview controller with $p$-steps of disturbance preview. We then show that the closed-loop $H_\\infty$ performance of this preview controller converges as $p\\to \\infty$ to the performance of the optimal non-causal controller. Furthermore, we prove that the optimal regret of the preview controller converges to zero. These results demonstrate that increasing preview length allows controllers to asymptotically achieve non-causal performance in both the $H_\\infty$ and regret frameworks. A numerical example illustrates the theoretical results."}
{"id": "2602.01656", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.01656", "abs": "https://arxiv.org/abs/2602.01656", "authors": ["Sahat Pandapotan Nainggolan", "Julius Fergy Tiongson Rabago", "Hirofumi Notsu"], "title": "Numerical methods for diffusion coefficient recovery", "comment": "47 pages", "summary": "We revisit the inverse problem of reconstructing a spatially varying diffusion coefficient in stationary elliptic equations from boundary Cauchy data. From a theoretical perspective, we introduce a gradient-weighted modification of the coupled complex-boundary method (CCBM) incorporating an \\(H^1\\)-type term, and formulate the reconstruction as a regularized optimization problem over bounded admissible coefficients. We establish continuity and differentiability of the forward map, Lipschitz continuity of the modified cost functional, existence of minimizers, stability with respect to noisy data, and convergence under vanishing noise. From a numerical perspective, reconstructions are computed using a Sobolev-gradient descent scheme and evaluated through extensive numerical experiments across a range of noise levels, boundary inputs, and coefficient structures. In the reported tests, for sufficiently large but not excessive $H^1$-weights, the modified CCBM is observed to yield more stable reconstructions and to reduce certain high-frequency artifacts. Across the numerical scenarios considered in this study, the method often demonstrates favorable stability and robustness properties relative to several classical boundary-based formulations, although performance remains problem- and parameter-dependent. A projection-based extension further supports stable recovery of piecewise-constant diffusion coefficients in multi-subregion test cases. Our results indicate that, as long as all subdomains share a portion of the boundary, the proposed CCBM-based Tikhonov regularization approach with a pick-a-point strategy enables stable and reliable reconstruction of diffusion parameters."}
{"id": "2602.01457", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.01457", "abs": "https://arxiv.org/abs/2602.01457", "authors": ["Rollen S. D'Souza"], "title": "The Dynamic Search for the Minimal Dynamic Extension", "comment": "8 pages. Submitted to the 27th International Symposium on Mathematical Theory of Networks and Systems (MTNS)", "summary": "Identifying the dynamic precompensator that renders a nonlinear control system feedback linearizable is a challenging problem. Researchers have explored the problem -- dynamic feedback linearization -- and produced existence conditions and constructive procedures for the dynamic precompensator. These remain, in general, either computationally expensive or restrictive. Treating the challenge as intrinsic, this article views the problem as a search problem over a category. Dynamic programming applies and, upon restriction to a finite category, classic search algorithms find the minimal dynamic extension. Alternatively, a heuristic aiming towards feedback linearizable systems can be employed to select amongst the infinitely-many extensions. This framing provides a distinctive, birds-eye view of the search for the dynamic precompensator."}
{"id": "2602.01707", "categories": ["math.NA", "math.MG"], "pdf": "https://arxiv.org/pdf/2602.01707", "abs": "https://arxiv.org/abs/2602.01707", "authors": ["K R Tyada"], "title": "Curvature Preserving Fractal Interpolation Functions: A Hybrid Geometric Approach", "comment": null, "summary": "Fractal interpolation functions (FIFs) generated using iterated function systems (IFS) provide a powerful framework for modeling self-similar and irregular data, yet traditional constructions often neglect geometric fidelity such as curvature. In this paper, we introduce a curvature-preserving variant of FIFs built upon a classical cubic spline interpolant. We define a curvature-aware iterated function system (IFS) with parameters optimized via a penalty-based approach to minimize deviation from the curvature of the classical spline. Theoretical conditions for interpolation and curvature approximation are derived. We compare the curvature of the proposed FIF with that of the classical cubic spline and discrete data curvature across multiple examples. Our method achieves both data interpolation and shape fidelity, preserving curvature more accurately than standard splines. The approach has potential applications in geometric modeling, computer graphics, and scientific data interpolation."}
{"id": "2602.01460", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.01460", "abs": "https://arxiv.org/abs/2602.01460", "authors": ["Haoyu Han", "Heng Yang"], "title": "Non-Uniform Noise-to-Signal Ratio in the REINFORCE Policy-Gradient Estimator", "comment": null, "summary": "Policy-gradient methods are widely used in reinforcement learning, yet training often becomes unstable or slows down as learning progresses. We study this phenomenon through the noise-to-signal ratio (NSR) of a policy-gradient estimator, defined as the estimator variance (noise) normalized by the squared norm of the true gradient (signal). Our main result is that, for (i) finite-horizon linear systems with Gaussian policies and linear state-feedback, and (ii) finite-horizon polynomial systems with Gaussian policies and polynomial feedback, the NSR of the REINFORCE estimator can be characterized exactly-either in closed form or via numerical moment-evaluation algorithms-without approximation. For general nonlinear dynamics and expressive policies (including neural policies), we further derive a general upper bound on the variance. These characterizations enable a direct examination of how NSR varies across policy parameters and how it evolves along optimization trajectories (e.g. SGD and Adam). Across a range of examples, we find that the NSR landscape is highly non-uniform and typically increases as the policy approaches an optimum; in some regimes it blows up, which can trigger training instability and policy collapse."}
{"id": "2602.01721", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01721", "abs": "https://arxiv.org/abs/2602.01721", "authors": ["Vladimir R. Kostic", "Dragana Lj. Cvetkovic", "Ljiljana Cvetkovic"], "title": "Scalable Pseudospectral Analysis via Low-Rank Approximations of Dynamical Systems", "comment": "19 pages, 4 figures", "summary": "Pseudospectral analysis is fundamental for quantifying the sensitivity and transient behavior of nonnormal matrices, yet its computational cost scales cubically with dimension, rendering it prohibitive for large-scale systems. While existing research on scalable pseudospectral computation has focused on exploiting sparsity structures, common in discretizations of differential operators, these approaches are ill-suited for machine learning and data-driven dynamical systems, where operators are typically dense but approximately low-rank. In this paper, we develop a comprehensive low-rank framework that dramatically reduces this computational burden. Our core theoretical contribution is an exact characterization of the pseudospectrum of arbitrary low-rank matrices, reducing the evaluation of resolvent norms to eigenvalue problems of dimension proportional to the rank. Building on this foundation, we derive rigorous inclusion sets for the pseudospectra of general matrices via truncated and randomized low-rank approximations, with explicit perturbation bounds. These results enable efficient estimators for key stability quantities, including distance to instability and Kreiss constants, at a cost that scales with the effective rank rather than the ambient dimension. We further demonstrate how our framework naturally extends to data-driven settings, providing pseudospectral analysis of transfer operators learned from nonlinear and stochastic dynamical systems. Numerical experiments confirm orders-of-magnitude speedups while preserving accuracy, opening pseudospectral analysis to previously intractable high-dimensional problems in computational PDEs, control theory, and data-driven dynamics."}
{"id": "2602.01476", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01476", "abs": "https://arxiv.org/abs/2602.01476", "authors": ["Stefan Clarke", "Bartolomeo Stellato"], "title": "Conformal Prediction for Early Stopping in Mixed Integer Optimization", "comment": null, "summary": "Mixed-integer optimization solvers often find optimal solutions early in the search, yet spend the majority of computation time proving optimality. We exploit this by learning when to terminate solvers early on distributions of similar problem instances. Our method trains a neural network to estimate the true optimality gap from the solver state, then uses conformal prediction to calibrate a stopping threshold with rigorous probabilistic guarantees on solution quality. On five problem families from the distributional MIPLIB library, our method reduces solve time by over 60% while guaranteeing 0.1%- optimal solutions with 95% probability"}
{"id": "2602.01876", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01876", "abs": "https://arxiv.org/abs/2602.01876", "authors": ["Zijuan Xin", "Chenyao Wang", "Feng Shi", "Yizhong Sun"], "title": "PINN-Based Kolmogorov-Arnold Networks with RAR-D Adaptive Sampling for Solving Elliptic Interface Problems", "comment": null, "summary": "Physics-Informed Neural Networks (PINNs) have become a popular and powerful framework for solving partial differential equations (PDEs), leveraging neural networks to approximate solutions while embedding PDE constraints, boundary conditions, and interface jump conditions directly into the loss function. However, most existing PINN approaches are based on multilayer perceptrons (MLPs), which may require large network sizes and extensive training to achieve high accuracy, especially for complex interface problems. In this work, we propose a novel PINN architecture based on Kolmogorov-Arnold Networks (KANs), which offer greater flexibility in choosing activation functions and can represent functions with fewer parameters. Specifically, we introduce a dual KANs structure that couples two KANs across subdomains and explicitly enforces interface conditions. To further boost training efficiency and convergence, we integrate the RAR-D adaptive sampling strategy to dynamically refine training points. Numerical experiments on the elliptic interface problems yield more uniform error distributions across the computational domain, which demonstrates that our PINN-based KANs achieve superior accuracy with significantly smaller network sizes and faster convergence compared to standard PINNs."}
{"id": "2602.01627", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01627", "abs": "https://arxiv.org/abs/2602.01627", "authors": ["Haishan Ye", "Luo Luo"], "title": "Why Does Adaptive Zeroth-Order Optimization Work?", "comment": null, "summary": "Zeroth-order (ZO) optimization is popular in real-world applications that accessing the gradient information is expensive or unavailable.\n  Recently, adaptive ZO methods that normalize gradient estimators by the empirical standard deviation of function values have achieved strong practical performance, particularly in fine-tuning the large language model.\n  However, the theoretical understanding of such strategy remains limited.\n  In this work, we show that the empirical standard deviation is, with high probability, closely proportional to the norm of the (stochastic) gradient.\n  Based on this insight, we analyze adaptive ZO methods under the generalized $(L_0,L_1)$-smoothness condition with respect to the matrix norm.\n  We establish explicit convergence rates and query complexity bounds for both deterministic and stochastic settings, demonstrating that adaptive ZO methods achieve the faster convergence and the improved query efficiency compared to the vanilla ZO methods with fixed-step."}
{"id": "2602.01883", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.01883", "abs": "https://arxiv.org/abs/2602.01883", "authors": ["Tao Luo", "Jianyuan Yin", "Lei Zhang", "Shixue Zhang"], "title": "Convergence of high-index saddle dynamics for degenerate saddle points on critical manifolds", "comment": null, "summary": "The high-index saddle dynamics (HiSD) method provides a powerful framework for finding saddle points and constructing solution landscapes. While originally derived for nondegenerate critical points, HiSD has demonstrated empirical success in degenerate cases, where the Hessian matrix exhibits zero eigenvalues. However, the mathematical and numerical analysis of HiSD for degenerate saddle points remains unexplored. In this paper, utilizing Morse-Bott functions, we present a rigorous analysis of HiSD for computing degenerate saddle points on a critical manifold. We prove the local convergence of the continuous HiSD and establish the linear convergence rate of the discrete HiSD algorithm. Furthermore, we provide a theoretical explanation for the gradient alignment tendency, revealing that the gradient direction asymptotically aligns with a specific Hessian eigenvector. Our analysis also elucidates the flexibility in selecting the index for HiSD in the context of degenerate saddle points. We validate our analytical results through numerical experiments on neural-network loss landscapes and demonstrate that momentum-accelerated variants of HiSD achieve rapid convergence to degenerate saddle points."}
{"id": "2602.01968", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.01968", "abs": "https://arxiv.org/abs/2602.01968", "authors": ["Daniel Hernández-Hernńdez", "Harold A. Moreno-Franco", "José-Luis Pérez"], "title": "Optimal Liquidation in a Defaultable Market", "comment": null, "summary": "In this paper we address the problem of optimal liquidation of a large portfolio composed by securities exposed to default risk. The default time is described in terms of a Brownian motion representing the evolution of the value of the firm, whose assets are available in the market for investors. Considering that selling a large number of assets has a significant impact in the price, and hence in the portfolio's value, the control problem involved to describe the optimal strategy to liquidate a large position is analyzed. Under suitable assumptions in the model, an explicit solution is given to the value function and a precise description of the optimal strategy is obtained."}
{"id": "2602.01888", "categories": ["math.NA", "physics.comp-ph", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2602.01888", "abs": "https://arxiv.org/abs/2602.01888", "authors": ["Deepak Gautam", "Bhooshan Paradkar"], "title": "Multigrid Poisson Solver for Complex Geometries Using Finite Difference Method", "comment": null, "summary": "We present an efficient numerical method, inspired by transformation optics, for solving the Poisson equation in complex and arbitrarily shaped geometries. The approach operates by mapping the physical domain to a uniform computational domain through coordinate transformations, which can be applied either to the entire domain or selectively to specific boundaries inside the domain. This flexibility allows both homogeneous (Laplace equation) and inhomogeneous (Poisson equation) problems to be solved efficiently using iterative or fast direct solvers, with only the material parameters and source terms modified according to the transformation. The method is formulated within a finite difference framework, where the modified material properties are computed from the coordinate transformation equations, either analytically or numerically. This enables accurate treatment of arbitrary geometric shapes while retaining the simplicity of a uniform grid solver. Numerical experiments confirm that the method achieves second-order accuracy , and offers a straightforward pathway to integrate fast solvers such as multigrid methods on the uniform computational grid."}
{"id": "2602.02022", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.02022", "abs": "https://arxiv.org/abs/2602.02022", "authors": ["Guillaume Lauga", "Samuel Vaiter"], "title": "Characterizations of inexact proximal operators", "comment": null, "summary": "Proximal operators are now ubiquitous in non-smooth optimization. Since their introduction in the seminal work of Moreau, many papers have shown their effectiveness on a wide variety of problems, culminating in their use to construct convergent deep learning methods. The characterization of these operators for non-convex penalties was completed recently in [Gribonval et al, A characterization of proximity operators, 2020]. In this paper, we propose to follow this line of work by characterizing inexact proximal operators, thus providing an answer to what constitutes a good approximation of these operators. We propose several definitions of approximations and discuss their regularity, approximation power, and their fixed points. Equipped with these characterizations, we investigate the convergence of proximal algorithms in the presence of errors that may be non-summable and/or non-vanishing. In particular, we look at the proximal point algorithm, and at the forward-backward, Peaceman-Rachford and Douglas-Rachford algorithms when we minimize the sum of a weakly convex function (whose proximal operator is approximated) and a strongly convex function."}
{"id": "2602.01938", "categories": ["math.NA", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.01938", "abs": "https://arxiv.org/abs/2602.01938", "authors": ["Hiroaki Nishikawa"], "title": "A Flux-Correction Form of the Third-Order Edge-Based Scheme for a General Numerical Flux Function", "comment": null, "summary": "In this short note, we present a flux-correction form of the third-order edge-based scheme for the Euler equations that enables the direct use of a general flux function. The core idea is to replace, without loss of accuracy, the arithmetic average of the flux extrapolations by a general numerical flux evaluated at the edge midpoint, together with a correction term. We show that the proposed flux-correction form preserves third-order accuracy, provided that the general numerical flux is evaluated with the left and right states that are computed exactly for a quadratic function, which can be achieved effectively by the U-MUSCL scheme with κ = 1/2. Numerical results are presented to verify third-order accuracy with the HLLC and LDFSS flux functions on irregular tetrahedral grids."}
{"id": "2602.02250", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.02250", "abs": "https://arxiv.org/abs/2602.02250", "authors": ["Viktor Stein", "Adwait Datar", "Nihat Ay"], "title": "Well-Posed KL-Regularized Control via Wasserstein and Kalman-Wasserstein KL Divergences", "comment": "37 pages, 9 figures, comments welcome", "summary": "Kullback-Leibler divergence (KL) regularization is widely used in reinforcement learning, but it becomes infinite under support mismatch and can degenerate in low-noise limits. Utilizing a unified information-geometric framework, we introduce (Kalman)-Wasserstein-based KL analogues by replacing the Fisher-Rao geometry in the dynamical formulation of the KL with transport-based geometries, and we derive closed-form values for common distribution families. These divergences remain finite under support mismatch and yield a geometric interpretation of regularization heuristics used in Kalman ensemble methods. We demonstrate the utility of these divergences in KL-regularized optimal control. In the fully tractable setting of linear time-invariant systems with Gaussian process noise, the classical KL reduces to a quadratic control penalty that becomes singular as process noise vanishes. Our variants remove this singularity, yielding well-posed problems. On a double integrator and a cart-pole example, the resulting controls outperform KL-based regularization."}
{"id": "2602.02003", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.02003", "abs": "https://arxiv.org/abs/2602.02003", "authors": ["Lingyue Shen", "Qi Xin", "Yan Chen", "Jiarui Han", "Yumiao Zhang", "Jinchao Xu", "Shihua Gong"], "title": "A monolithic localized high-order ALE finite element method for multi-scale fluid-structure interaction problems", "comment": null, "summary": "This paper presents MLH-ALE, a monolithic localized high-order arbitrary Lagrangian-Eulerian finite element method for multi-scale fluid-structure interaction (FSI). The framework employs isoparametric $\\mathcal{P}_2$ elements for geometric fidelity and an implicit-explicit partitioned Runge-Kutta (IMEX-PRK) scheme for temporal discretization. To address scale disparity, a localized updating strategy is integrated to focus computational resolution on the moving structure. Numerical benchmarks confirm the optimal high-order convergence of the underlying ALE scheme. Furthermore, simulations of particle focusing in spiral microchannels demonstrate that the MLH-ALE approach provides reliable numerical results in good agreement with experimental observations, confirming its feasibility for complex multi-scale applications."}
{"id": "2602.02291", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.02291", "abs": "https://arxiv.org/abs/2602.02291", "authors": ["Raghupati Vyas", "Khushboo Agarwal", "Konstantin Avrachenkov", "Veeraruna Kavitha"], "title": "Games with Rational and Herding Players", "comment": null, "summary": "Classical game theory is a powerful framework to analyze the strategic interactions among rational players. However, in many real-life scenarios, players choose actions based on their inherent natural tendencies rather than deliberate reasoning. In this paper, we develop an analytical framework to study large population games with an alpha-fraction of rational and (1-alpha)-fraction of herding players. We introduce a new notion of equilibrium called alpha-Rational Nash Equilibrium (in short, alpha-RNE) and discuss its interpretations. Some classical equilibria may disappear, and some new ones may emerge, but only for smaller alpha >0. Interestingly, rational players benefit from the presence of herding and may even achieve utility exceeding the socially optimum. Even more strikingly, in some cases, the herding players also benefit, attaining utility close to the social optimum.\n  We further study the effect of the herding fraction on system performance using measures such as the Price of Anarchy (PoA). In transportation networks, a well-known paradox first studied by Pigou and later by Braess typically arises from rational decision-making: adding an extra link can reduce overall efficiency. Our analysis leads to a different conclusion. When a substantial fraction of users exhibit herding behavior, introducing a new link can increase efficiency, provided herding choices can be suitably influenced. The gains are larger when the herding fraction is higher and/or congestion is lower. By contrast, when herding decisions cannot be influenced, the added link may become detrimental. We also study a bandwidth sharing game in which herding tendencies improve system efficiency. Finally, we discuss the mechanism or influence design in the presence of herding, highlighting both opportunities and risks."}
{"id": "2602.02052", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.02052", "abs": "https://arxiv.org/abs/2602.02052", "authors": ["Roland Griesmaier", "Bastian Harrach", "Jianli Xiang"], "title": "Monotonicity-based regularization of inverse medium scattering for shape reconstruction", "comment": null, "summary": "We consider the scattering of time-harmonic plane waves by a compactly supported inhomogeneous scattering obstacle governed by the Helmholtz equation. Given far field observations of the scattered fields corresponding to plane wave incident fields for all possible incident and observation directions we study the inverse problem to recover the support of the scatterer. We propose a qualitative monotonicity-based regularization scheme which combines monotonicity-based shape reconstruction with one-step linearization to reconstruct a discrete approximation of the shape of the scatterer from noisy far field data. The purpose of the one-step linearization is to stabilize the monotonicity approach to shape reconstruction. We show that the monotonicity-based regularization scheme recovers the correct shape of the scatterer for noise-free data. Furthermore, we establish that the solution of the monotonicity-based regularization converges to the exact solution as the noise level tends to zero. We present numerical examples to illustrate our theoretical findings."}
{"id": "2602.02333", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.02333", "abs": "https://arxiv.org/abs/2602.02333", "authors": ["Hamid Najafzad", "Moddassir Khan Nayeem", "Fuhad Ahmed Opu", "Omar Abbaas", "Gabriel Nicolosi"], "title": "A Two-Stage Stochastic Optimization Model for the Equitable Deployment of Fixed and Mobile Electric Vehicle Charging Stations", "comment": null, "summary": "A major barrier to wide adoption of Electric Vehicles (EVs) is the absence of reliable and equitable charging infrastructure. Poorly located charging stations create coverage gaps and slow down EV adoption, especially in underserved communities. This paper proposes a two-stage stochastic mixed-integer programming model for the optimal deployment of Fixed and Mobile Charging Stations (FCSs and MCSs) across multiple zones and periods. Initially, a finite dominating set of candidate locations is identified using the Edge Scanning Algorithm for a Single Refueling Station (ESS), an exact continuous-location method. We modify the ESS algorithm to incorporate existing public charging stations, thereby avoiding redundant coverage. In the first stage of our model, FCSs are allocated based on long-term traffic patterns, budgetary constraints, and socioeconomic factors to ensure stable baseline coverage. The second stage dynamically assigns MCSs in response to short-term demand fluctuations and uncertainties, aiming to minimize relocation costs while maximizing coverage. We use a scenario-based framework to capture demand variability. Numerical experiments on realistic networks demonstrate the model's capacity to enhance system resilience and reduce unmet demand. These findings offer practical insights for planners and policymakers seeking to develop accessible and demand-responsive EV charging infrastructure."}
{"id": "2602.02066", "categories": ["math.NA", "cs.IT"], "pdf": "https://arxiv.org/pdf/2602.02066", "abs": "https://arxiv.org/abs/2602.02066", "authors": ["David Krieg", "Mario Ullrich"], "title": "Approximation of Functions: Optimal Sampling and Complexity", "comment": "This is a preliminary version of an article to appear in Acta Numerica", "summary": "We consider approximation or recovery of functions based on a finite number of function evaluations. This is a well-studied problem in optimal recovery, machine learning, and numerical analysis in general, but many fundamental insights were obtained only recently. We discuss different aspects of the information-theoretic limit that appears because of the limited amount of data available, as well as algorithms and sampling strategies that come as close to it as possible.\n  We also discuss (optimal) sampling in a broader sense, allowing other types of measurements that may be nonlinear, adaptive and random, and present several relations between the different settings in the spirit of information-based complexity. We hope that this article provides both, a basic introduction to the subject and a contemporary summary of the current state of research."}
{"id": "2602.02394", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.02394", "abs": "https://arxiv.org/abs/2602.02394", "authors": ["Jan Olucak", "Torbjørn Cunis"], "title": "Sequential Quadratic Sum-of-squares Programming for Nonlinear Control Systems", "comment": "This work has been submitted to the IEEE Transactions on Control Systems Technology for possible publication", "summary": "Many problems in nonlinear systems analysis and control design, such as local region-of-attraction estimation, inner-approximations of reachable sets or control design under state and control constraints can be formulated as nonconvex sum-of-squares programs. Yet tractable and efficient solution methods are still lacking, limiting their application in control engineering. To address this gap, we propose a filter line-search algorithm that solves a sequence of quadratic subproblems. Numerical benchmarks demonstrate that the algorithm can significantly reduce the number of iterations, resulting in a substantial decrease in computation time compared to established methods for nonconvex sum-of-squares programs. An open-source implementation of the algorithm along with the numerical benchmarks is provided"}
{"id": "2602.02068", "categories": ["math.NA", "math-ph", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.02068", "abs": "https://arxiv.org/abs/2602.02068", "authors": ["Jemal Rogava", "Zurab Vashakidze"], "title": "On the Numerical Treatment of an Abstract Nonlinear System of Coupled Hyperbolic Equations Associated with the Timoshenko Model", "comment": "45 pages and 27 figures in total", "summary": "The present work addresses the Cauchy problem for an abstract nonlinear system of coupled hyperbolic equations associated with the Timoshenko model in a real Hilbert space. Our purpose is to develop and delve into a temporal discretization scheme for approximating a solution to this problem. To this end, we propose a symmetric three-layer semi-discrete time-stepping scheme in which the nonlinear term is evaluated at the temporal midpoint. As a result, at each time step, this approach reduces the original nonlinear problem to a linear one and enables parallel computation of its solution. Convergence is proved, and second-order accuracy with respect to the time-step size is established on a local temporal interval. The proposed scheme is then applied to a spatially one-dimensional nonlinear dynamic Timoshenko beam system, and the results obtained for the abstract nonlinear system are extended to this setting. A Legendre-Galerkin spectral approximation is employed for the spatial discretization. By taking differences of Legendre polynomials within the Galerkin framework, the resulting linear system is sparse and can be efficiently decoupled. The convergence of the method is also investigated. Finally, several numerical experiments on carefully chosen benchmark problems are conducted to validate the proposed approach and to confirm the theoretical findings."}
{"id": "2602.00517", "categories": ["math.NA", "math.FA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.00517", "abs": "https://arxiv.org/abs/2602.00517", "authors": ["Jiechang Fan", "Weiping Shen", "Yusong Luo", "Enping Lou"], "title": "A Cayley-free Two-Step Algorithm for Inverse Singular Value Problems", "comment": null, "summary": "In this paper, we investigate numerical solutions for inverse singular value problems (for short, ISVPs) arising in various applications. Inspired by the methodologies employed for inverse eigenvalue problems, we propose a Cayley-free two-step algorithm for solving the ISVP. Compared to the existing two-step algorithms for the ISVP, our algorithm eliminates the need for Cayley transformations and consequently avoids solving $2(m+n)$ linear systems during the computation of approximate singular vectors at each outer iteration. Under the assumption that the Jacobian matrix at a solution is nonsingular, we present a convergence analysis for the proposed algorithm and prove a cubic root-convergence rate. Numerical experiments are conducted to validate the effectiveness of our algorithm."}
{"id": "2602.02095", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.02095", "abs": "https://arxiv.org/abs/2602.02095", "authors": ["Dmitri Kuzmin"], "title": "Convex limiting for finite elements and its relationship to residual distribution", "comment": null, "summary": "We review some recent advances in the field of element-based algebraic stabilization for continuous finite element discretizations of nonlinear hyperbolic problems. The main focus is on multidimensional convex limiting techniques designed to constrain antidiffusive element contributions rather than fluxes. We show that the resulting schemes can be interpreted as residual distribution methods. Two kinds of convex limiting can be used to enforce the validity of generalized discrete maximum principles in this context. The first approach has the structure of a localized flux-corrected transport (FCT) algorithm, in which the computation of a low-order predictor is followed by an antidiffusive correction stage. The second option is the use of a monolithic convex limiting (MCL) procedure at the level of spatial semi-discretization. In both cases, inequality constraints are imposed on scalar functions of intermediate states that are required to stay in convex invariant sets."}
{"id": "2602.01315", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.01315", "abs": "https://arxiv.org/abs/2602.01315", "authors": ["Shishu Pal Singh", "Sudeep Kundu"], "title": "Finite element theta schemes for the viscous Burgers' equation with nonlinear Neumann boundary feedback control", "comment": null, "summary": "In this article, we develop a fully discrete numerical scheme for the one-dimensional (1D) and two-dimensional (2D) viscous Burgers equations with nonlinear Neumann boundary feedback control. The temporal discretization employs a $θ$-scheme, while a conforming finite element method is used for the spatial approximation. The existence and uniqueness of the fully discrete solution are established. We further prove that the scheme is unconditionally exponentially stable for $θ\\in [1/2, 1]$, thereby ensuring that the stabilization property of the continuous model is retained at the discrete level. In addition, optimal error estimates are obtained for both the state variable and the boundary control inputs in 1D and 2D frameworks. Finally, several numerical experiments are presented to validate our theoretical findings and to demonstrate the effectiveness of the proposed stabilization strategy under varying model parameters."}
{"id": "2602.02118", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.02118", "abs": "https://arxiv.org/abs/2602.02118", "authors": ["Anna Peruso", "Massimo Sorella"], "title": "Convergence of a least-squares splitting method for the Monge-Ampère equation", "comment": "16 pages, 6 figures", "summary": "We study the theoretical convergence of the nonlinear least-squares splitting method for the Monge-Ampère equation in which each iteration decouples the pointwise nonlinearity from the differential operator and consists of a local nonlinear update followed by the solution of two sequential Poisson-type elliptic problems. While the method performs well in computations, a rigorous convergence theory has remained unavailable. We observe that the iteration admits a reformulation as an alternating-projection scheme on Sobolev spaces $H^m$, $m\\ge 0$. At a solution, the Gâteaux differentials of the projection maps are the linear projections onto the corresponding tangent spaces. We prove that these tangent spaces are transverse, and hence the linearization of the alternating-projection map is a contraction by classical Hilbert-space theory for alternating projections. Building on this geometric characterization, we prove linear convergence in $H^2$ of the splitting method on the two-dimensional torus $\\mathbb{T}^2$ for initial data sufficiently close to a solution $u\\in H^4$. To the best of our knowledge, this yields the first rigorous convergence result for this splitting method in the periodic setting and provides a functional-analytic explanation for its observed numerical robustness."}
{"id": "2602.01397", "categories": ["math.NA", "cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.01397", "abs": "https://arxiv.org/abs/2602.01397", "authors": ["Jan S. Hesthaven", "Benjamin Peherstorfer", "Benjamin Unger"], "title": "Nonlinear model reduction for transport-dominated problems", "comment": null, "summary": "This article surveys nonlinear model reduction methods that remain effective in regimes where linear reduced-space approximations are intrinsically inefficient, such as transport-dominated problems with wave-like phenomena and moving coherent structures, which are commonly associated with the Kolmogorov barrier. The article organizes nonlinear model reduction techniques around three key elements -- nonlinear parametrizations, reduced dynamics, and online solvers -- and categorizes existing approaches into transformation-based methods, online adaptive techniques, and formulations that combine generic nonlinear parametrizations with instantaneous residual minimization."}
{"id": "2602.02169", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.02169", "abs": "https://arxiv.org/abs/2602.02169", "authors": ["Łukasz Płociniczak", "Marek A. Teuerle", "Hubert Woszczek"], "title": "Asymmetric Lévy walks driven by convex combination of fractional material derivatives", "comment": null, "summary": "We analyze a class of linear partial differential equations that arise as deterministic descriptions of the scaling limits of Lévy walks, in which transport is driven by a convex combination of fractional material derivatives and a source term. Using techniques of Fourier-Laplace transforms, we first prove the existence of mild solutions for continuous initial data. Using a recently obtained pointwise representation of the fractional material derivative, we then identify a necessary and sufficient condition on the source term that guaranties the solution to remain a probability density for all times (non-negativity and unit mass). Motivated by the need to preserve these probabilistic properties in computations, we construct a finite-volume discretization that is probability conservative by construction. We establish discrete stability and a convergence result for the continuous weak solution as space and time steps tend to zero. Extensive numerical experiments validate the scheme: total mass is conserved, non-negativity is maintained, and the computed solutions reproduce the known analytic representations of the probability density functions associated with the Lévy walk process. The combined theoretical and numerical framework provides a reliable tool for studying anomalous transport governed by fractional dynamics."}
{"id": "2602.01656", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.01656", "abs": "https://arxiv.org/abs/2602.01656", "authors": ["Sahat Pandapotan Nainggolan", "Julius Fergy Tiongson Rabago", "Hirofumi Notsu"], "title": "Numerical methods for diffusion coefficient recovery", "comment": "47 pages", "summary": "We revisit the inverse problem of reconstructing a spatially varying diffusion coefficient in stationary elliptic equations from boundary Cauchy data. From a theoretical perspective, we introduce a gradient-weighted modification of the coupled complex-boundary method (CCBM) incorporating an \\(H^1\\)-type term, and formulate the reconstruction as a regularized optimization problem over bounded admissible coefficients. We establish continuity and differentiability of the forward map, Lipschitz continuity of the modified cost functional, existence of minimizers, stability with respect to noisy data, and convergence under vanishing noise. From a numerical perspective, reconstructions are computed using a Sobolev-gradient descent scheme and evaluated through extensive numerical experiments across a range of noise levels, boundary inputs, and coefficient structures. In the reported tests, for sufficiently large but not excessive $H^1$-weights, the modified CCBM is observed to yield more stable reconstructions and to reduce certain high-frequency artifacts. Across the numerical scenarios considered in this study, the method often demonstrates favorable stability and robustness properties relative to several classical boundary-based formulations, although performance remains problem- and parameter-dependent. A projection-based extension further supports stable recovery of piecewise-constant diffusion coefficients in multi-subregion test cases. Our results indicate that, as long as all subdomains share a portion of the boundary, the proposed CCBM-based Tikhonov regularization approach with a pick-a-point strategy enables stable and reliable reconstruction of diffusion parameters."}
{"id": "2602.02247", "categories": ["math.NA", "math.AP", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2602.02247", "abs": "https://arxiv.org/abs/2602.02247", "authors": ["Julian Koellermeier"], "title": "A new Energy Equation Derivation for the Shallow Water Linearized Moment Equations", "comment": null, "summary": "Shallow Water Moment Equations (SWME) are extensions to the well-known Shallow Water Equations (SWE) for the efficient modeling and numerical simulation of free-surface flows. While the SWE typically assume a depth-averaged vertical velocity profile, the SWME allow for vertical variations of the velocity profile. The SWME therefore assume a polynomial profile and then derive additional evolution equations for the polynomial coefficients via higher order depth integration. In this work, we perform a new systematic derivation of the energy equation for a specific variant of the SWME, called the Shallow Water Linearized Moment Equations (SWLME). The derivation is based on the standard SWE energy equation derivation and includes the skew-symmetric formulation of the model. The new systematic derivation is beneficial for the extension to other SWME variants and their numerical solution."}
{"id": "2602.02353", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.02353", "abs": "https://arxiv.org/abs/2602.02353", "authors": ["Hakop Hakopian"], "title": "A formula for Hermite multivariate interpolation problem and partial fraction decomposition", "comment": "12 pages", "summary": "We present a new formula for the Hermite multivariate interpolation corresponding to the Chung-Yao interpolation. With the help of the respective univariate interpolation formula we give a direct and explicit solution to the problem of partial fraction decomposition of rational functions."}
{"id": "2602.00921", "categories": ["math.OC", "cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.00921", "abs": "https://arxiv.org/abs/2602.00921", "authors": ["Eric Gelphman", "Deepanshu Verma", "Nicole Tianjiao Yang", "Stanley Osher", "Samy Wu Fung"], "title": "On the Convergence of Jacobian-Free Backpropagation for Optimal Control Problems with Implicit Hamiltonians", "comment": "19 Pages, 6 figures, 1 table. Submitted to ICML and is pending review", "summary": "Optimal feedback control with implicit Hamiltonians poses a fundamental challenge for learning-based value function methods due to the absence of closed-form optimal control laws. Recent work~\\cite{gelphman2025end} introduced an implicit deep learning approach using Jacobian-Free Backpropagation (JFB) to address this setting, but only established sample-wise descent guarantees. In this paper, we establish convergence guarantees for JFB in the stochastic minibatch setting, showing that the resulting updates converge to stationary points of the expected optimal control objective. We further demonstrate scalability on substantially higher-dimensional problems, including multi-agent optimal consumption and swarm-based quadrotor and bicycle control. Together, our results provide both theoretical justification and empirical evidence for using JFB in high-dimensional optimal control with implicit Hamiltonians."}
{"id": "2602.01321", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.01321", "abs": "https://arxiv.org/abs/2602.01321", "authors": ["Shishu Pal Singh", "Sudeep Kundu"], "title": "Global stabilization and finite element analysis of the viscous Burgers' equation with memory subject to Neumann boundary feedback control", "comment": null, "summary": "This paper presents a global stabilization result of the viscous Burgers' equation with the memory term by applying Neumann boundary feedback control laws. We construct suitable feedback control inputs using the control Lyapunov functional and establish stabilization in the \\(L^{2}, H^{1},\\) and \\(H^{2}\\)-norms. The existence and uniqueness of the solution are established through the Faedo-Galerkin method. Moreover, we show the global stabilization where the diffusion coefficient $ν$ is unknown. Then, we apply a \\(C^{0}\\)-conforming finite element method to the spatial variable while keeping the time variable continuous. Furthermore, we obtain global stabilization of the semi-discrete scheme and optimal error estimates for the state variable in the \\(L^{\\infty}\\), \\(L^{2}\\), and \\(H^{1}\\)-norms, using the Ritz-Volterra projection. Additionally, error estimates for the feedback control laws are established. Lastly, we present some numerical simulations to demonstrate the theoretical findings."}
