{"id": "2602.03999", "categories": ["math.PR", "cs.DS", "cs.LG", "math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.03999", "abs": "https://arxiv.org/abs/2602.03999", "authors": ["Anming Gu", "Bobby Shi", "Kevin Tian"], "title": "Functional Stochastic Localization", "comment": "Comments welcome!", "summary": "Eldan's stochastic localization is a probabilistic construction that has proved instrumental to modern breakthroughs in high-dimensional geometry and the design of sampling algorithms. Motivated by sampling under non-Euclidean geometries and the mirror descent algorithm in optimization, we develop a functional generalization of Eldan's process that replaces Gaussian regularization with regularization by any positive integer multiple of a log-Laplace transform. We further give a mixing time bound on the Markov chain induced by our localization process, which holds if our target distribution satisfies a functional Poincaré inequality. Finally, we apply our framework to differentially private convex optimization in $\\ell_p$ norms for $p \\in [1, 2)$, where we improve state-of-the-art query complexities in a zeroth-order model."}
{"id": "2602.04024", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.04024", "abs": "https://arxiv.org/abs/2602.04024", "authors": ["Krzysztof Dȩbicki", "Nikolai Kriukov", "Michel Mandjes"], "title": "Lévy-driven queuing networks in multi-scale light and heavy traffic", "comment": null, "summary": "We study a queueing network with a strictly upper-triangular routing matrix, where each column contains at most one non-negative entry, and the root node receives input from a spectrally positive Lévy process. Our aim is to characterize the distribution of the multivariate stationary workload under a specific scaling of the service rates. Under mild conditions on the Laplace exponent of the driving Lévy process, we identify the limiting law of an appropriately scaled joint stationary workload in both light-traffic and heavy-traffic regimes. In particular, we establish conditions under which certain queueing workloads within the network asymptotically decouple, becoming independent in the limiting regime."}
{"id": "2602.04250", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.04250", "abs": "https://arxiv.org/abs/2602.04250", "authors": ["Florian Heinrichs"], "title": "A Note on Physical Dependence and Mixing Conditions for Triangular Arrays", "comment": "Keywords: Weak Dependence, Strong Mixing, $β$-Mixing, Physical Dependence, Triangular Arrays, Local Stationarity", "summary": "Under mild structural assumptions and regularity conditions on the marginal and conditional densities, an explicit bound on the $β$-mixing coefficients in terms of the physical dependence measure is provided. Consequently, weak physical dependence implies $β$-mixing and strong mixing for triangular arrays, complementing Hill (2025), who proved the converse implication under moment assumptions."}
{"id": "2602.04282", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.04282", "abs": "https://arxiv.org/abs/2602.04282", "authors": ["Jiaming Chen"], "title": "Scaling limit of the step-reinforced and stochastic Levy--Lorentz model on weakly entangled integer lattice", "comment": "To appear on Annales de la Faculte des Sciences de Toulouse", "summary": "This paper describes the stochastic Levy--Lorentz gas driven by general long-range reference random walk on correlated and entangled random medium. Further consideration has been laid on the stochastic reinforcement of the underlying random walk, where it now possesses memory. Central limit theorems are obtained in both cases."}
{"id": "2602.04086", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04086", "abs": "https://arxiv.org/abs/2602.04086", "authors": ["Songchen Tan", "Oscar Smith", "Christopher Rackauckas"], "title": "Efficient Explicit Taylor ODE Integrators with Symbolic-Numeric Computing", "comment": null, "summary": "Taylor series methods show a newfound promise for the solution of non-stiff ordinary differential equations (ODEs) given the rise of new compiler-enhanced techniques for calculating high order derivatives. In this paper we detail a new Julia-based implementation that\n  has two important techniques: (1) a general purpose higher-order automatic differentiation engine for derivative evaluation with low overhead; (2) a combined symbolic-numeric approach to generate code for recursively computing the Taylor polynomial of the ODE solution. We demonstrate that the resulting software's compiler-based tooling is transparent to the user, requiring no changes from interfaces required to use standard explicit Runge-Kutta methods, while achieving better run time performance. In addition, we also developed a comprehensive adaptive time and order algorithm that uses different step size and polynomial degree across the integration period, which makes this implementation more efficient and versatile in a broad range of dynamics. We show that for codes compatible with compiler transformations, these integrators are more efficient and robust than the traditionally used explicit Runge-Kutta methods."}
{"id": "2602.04146", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.04146", "abs": "https://arxiv.org/abs/2602.04146", "authors": ["Nick Polson", "Vadim Sokolov", "Daniel Zantedeschi"], "title": "Bayes, E-values and Testing", "comment": null, "summary": "This paper studies relationships between Kolmogorov complexity, Shannon entropy, Bayes factors, E-values, and exchangeability testing. The focus is on negative log marginal or predictive probabilities -- what I.J.~Good termed the ``weight of evidence'' -- as a common evidence statistic linking coding, prediction, and sequential testing. The paper reviews the relevant information-theoretic and martingale tools, and discusses exchangeability testing via conformal e-prediction."}
{"id": "2602.03977", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.03977", "abs": "https://arxiv.org/abs/2602.03977", "authors": ["Shaked Regev", "Eve Tsybina", "Slaven Peles"], "title": "A Fast Relax-and-Round Approach to Unit Commitment with Sub Hourly Mechanical and Ramp Constraints", "comment": "8 pages, 4 figures", "summary": "We propose a novel computational method for unit commitment (UC), which does not require linearized approximation and provides several orders of magnitude performance improvement over current state-of-the-art. The performance improvement is achieved by introducing a heuristic tailored for UC problems. The method can be implemented using existing continuous optimization solvers and adapted for different applications. We demonstrate value of the new method in examples of advanced UC analyses at the scale where use of current state-of-the-art tools is infeasible. We expect that the capability demonstrated in this paper will be critical to address emerging power systems challenges with more volatile large loads, such as data centers, and generation that is composed of larger number of smaller units, including significant behind-the-meter generation."}
{"id": "2602.04303", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.04303", "abs": "https://arxiv.org/abs/2602.04303", "authors": ["Jiazhen Gu", "Qian Yu"], "title": "Strong solutions to SDEs with singular drifts driven by fractional Brownian motions", "comment": "45 pages", "summary": "In this paper, we establish the strong well-posedness of SDEs with merely integrable time-dependent drifts driven by fractional Brownian motions with Hurst parameter H<1/2. Our result holds over the entire subcritical regime and can be regarded as an extension of (Krylov and Rockner, Probab. Theory Relat. Fields, 131(2): 154-196 (2005)) to the fractional case. Furthermore, we prove the existence of stochastic flows of Sobolev diffeomorphisms for this class of SDEs, which generalizes a result in (Mohammed et al., Ann. Probab. 43, 1535-1576 (2015)). The approach adopted in our work is based on a compactness criterion for random fields in Wiener spaces."}
{"id": "2602.04207", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04207", "abs": "https://arxiv.org/abs/2602.04207", "authors": ["Guanqiu Ma", "Hongxia Guo", "Guanghui Hu"], "title": "A frequency-domain method to inverse moving source problem with unknown radiating moment", "comment": null, "summary": "This paper introduces a multi-frequency factorization method for imaging a time-dependent source, specifically to recover its spatial support and the associated excitation instants. Using far-field data from two opposite directions, we establish a computational criterion that characterizes both the unknown pulse moments and the narrowest strip (perpendicular to the direction) enclosing the source support. Central to our inversion scheme is the construction of indicator functions, defined pointwise over the spatial and temporal sampling variables. The proposed inversion scheme permits the recovery of the $Θ$-convex support domain from far-field data at sparse observation directions. Uniqueness in determining the convex hull of the support and the excitation instants-using all observation directions-is also established as a direct consequence of the factorization method. The effectiveness and feasibility of the approach are examined through comprehensive numerical simulations in two and three dimensions."}
{"id": "2602.04302", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.04302", "abs": "https://arxiv.org/abs/2602.04302", "authors": ["Rui Wang", "Guangming Pan", "Dandan Jiang"], "title": "Phase Transition of Spectral Fluctuations in Large Gram Matrices with a Variance Profile: A Unified Framework for Sparse CLTs", "comment": "25 pages, 4 figures", "summary": "We study the asymptotic spectral behavior of high-dimensional random Gram matrices with sparsity and a given variance profile, motivated by applications in wireless communication. Specifically, we consider the Gram matrices $\\mathbf S_n=\\mathbf Y_n\\mathbf Y_n^*$, where the entries of $\\mathbf Y_n$ are independent, centered, heteroscedastic, and sparse through Bernoulli masking. The sparsity level is parameterized as $s=q^2/n$, with $q$ ranging from polynomial order to order $n^{1/2}$.\n  We investigate two asymptotic regimes in a high-dimensional framework: a moderate-sparsity regime with fixed $s\\in(0,1]$, and a high-sparsity regime where $s\\to0$. In both regimes, we establish the convergence of the empirical spectral distribution of $\\mathbf S_n$ to a deterministic limit, and further derive central limit theorems for linear spectral statistics using resolvent techniques and martingale difference arguments. Our analysis reveals a phase transition in the fluctuation behavior across the two regimes. In the high-sparsity regime, the asymptotic fluctuations are governed by fourth-moment effects, with sparsity-scaled contributions being suppressed. Moreover, a mismatch between the scaling of the mean and variance, of different orders in $q$, necessitates an explicit correction in the centering of the linear spectral statistic. The theory applies to both Gaussian and non-Gaussian entries, and its statistical utility is illustrated through applications to hypothesis testing and outage probability analysis in large-scale MIMO systems."}
{"id": "2602.04048", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04048", "abs": "https://arxiv.org/abs/2602.04048", "authors": ["Juan Pablo Vielma", "Ross Anderson", "Joey Huchette"], "title": "Convex duality contracts for production-grade mathematical optimization", "comment": null, "summary": "Deploying mathematical optimization in autonomous production systems requires precise contracts for objects returned by an optimization solver. Unfortunately, conventions on dual solution and infeasibility certificates (rays) vary widely across solvers and classes of problems. This paper presents the theoretical framework used by MathOpt (a domain-specific language developed and used at Google) to unify these notions. We propose an abstract primal-dual pair based on a simplified Fenchel duality scheme that allows for the mechanical derivation of dual problems and associated contracts for all classes of problems currently supported by MathOpt (including those with linear and quadratic objectives plus linear, conic, quadratic, and two-sided linear constraints). We also show how these contracts can improve clarity of complementary-slackness based optimality conditions for certain classes of problems."}
{"id": "2602.04383", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.04383", "abs": "https://arxiv.org/abs/2602.04383", "authors": ["Jean-Christophe Mourrat", "Adrien Schertzer"], "title": "On the local nature of the de Almeida-Thouless line for mixed \\(p\\)-spin glasses", "comment": "9 pages", "summary": "Jagannath and Tobasco~\\cite{JagTob} proposed a generalized de Almeida-Thouless (AT) criterion aimed at characterizing the replica symmetric (RS) regime for a broad class of mixed \\(p\\)-spin glass models with Ising spins. In this paper, we show that this generalized AT condition does not characterize the RS regime in general. Using the Hopf-Lax representation of the Parisi formula, we construct explicit counterexamples within the class of mixed \\(p\\)-spin models. In particular, we exhibit a model in which the classical AT perturbation is performed around the unique minimizer of the RS free energy, and prove that even in this setting, the AT criterion fails to characterize the RS phase. By contrast, the validity of the classical AT condition for the Sherrington-Kirkpatrick model remains open."}
{"id": "2602.04235", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04235", "abs": "https://arxiv.org/abs/2602.04235", "authors": ["Xihao Zhang", "Hengguang Li", "Nianyu Yi", "Peimeng Yin"], "title": "Towards $C^0$ finite element methods for fourth-order elliptic equation. Part I: general boundary conditions", "comment": "23 pages, 13 figures", "summary": "This paper is part of a series developing $C^0$ finite element methods for fourth-order elliptic equations on polygonal domains. Here, we investigate how boundary conditions influence the design of effective $C^0$ schemes, specifically focusing on equations without lower-order terms, namely the biharmonic equation. We propose a modified mixed formulation that decomposes the problem into a system of Poisson equations, where the number of equations depends on both the largest interior angle and the boundary conditions on its two adjacent sides. In contrast to the naive mixed formulation, which involves only two Poisson problems, the proposed approach guarantees convergence to the true solution for arbitrary polygonal domains and general boundary conditions, including Navier, Neumann, and mixed boundary conditions. $C^0$ finite element algorithms are developed, rigorous error estimates are established, and numerical experiments are presented to demonstrate the well-posedness and effectiveness of the proposed method."}
{"id": "2602.04472", "categories": ["math.ST", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.04472", "abs": "https://arxiv.org/abs/2602.04472", "authors": ["Yanjin Xiang", "Zhihua Zhang"], "title": "Universality of General Spiked Tensor Models", "comment": "102pages", "summary": "We study the rank-one spiked tensor model in the high-dimensional regime, where the noise entries are independent and identically distributed with zero mean, unit variance, and finite fourth moment.This setting extends the classical Gaussian framework to a substantially broader class of noise distributions.Focusing on asymmetric tensors of order $d$ ($\\ge 3$), we analyze the maximum likelihood estimator of the best rank-one approximation.Under a mild assumption isolating informative critical points of the associated optimization landscape, we show that the empirical spectral distribution of a suitably defined block-wise tensor contraction converges almost surely to a deterministic limit that coincides with the Gaussian case.As a consequence, the asymptotic singular value and the alignments between the estimated and true spike directions admit explicit characterizations identical to those obtained under Gaussian noise. These results establish a universality principle for spiked tensor models, demonstrating that their high-dimensional spectral behavior and statistical limits are robust to non-Gaussian noise.\n  Our analysis relies on resolvent methods from random matrix theory, cumulant expansions valid under finite moment assumptions, and variance bounds based on Efron-Stein-type arguments. A key challenge in the proof is how to handle the statistical dependence between the signal term and the noise term."}
{"id": "2602.04122", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04122", "abs": "https://arxiv.org/abs/2602.04122", "authors": ["Zhou Wei", "He-Yi Liu", "Bo Zeng"], "title": "New Outer Approximation Algorithms for Nonsmooth Convex MINLP Problems", "comment": null, "summary": "This paper presents a novel outer approximation algorithm for nonsmooth mixed-integer nonlinear programming (MINLP) problems. The method proceeds by fixing the integer variables and solving the resulting nonlinear convex subproblem. When the subproblem is feasible, valid linear cuts are derived by computing suitable subgradients of the objective and constraint functions at the optimal solution, utilizing KKT optimality conditions. A new parameter, defined through the nonlinear constraint functions, is introduced to facilitate the generation of these cuts. For infeasible subproblems, a feasibility problem is solved, and valid linear cuts are generated via KKT-based subgradients to exclude the infeasible integer assignment.\n  By integrating both types of cuts, a mixed-integer linear programming (MILP) master problem is formulated and proven equivalent to the original MINLP. This equivalence underpins a new outer approximation algorithm, which is guaranteed to terminate after a finite number of iterations.\n  Numerical experiments on smooth convex MINLP problems demonstrate that the proposed algorithm produces tighter MILP relaxations than the classical outer approximation method. Furthermore, the approach offers an alternative mechanism for generating linear cuts, extending beyond reliance solely on first-order Taylor expansions and shows that the efficiency of outer approximation algorithm is strongly dependent on the inherent structure of the MINLP problem."}
{"id": "2602.04429", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.04429", "abs": "https://arxiv.org/abs/2602.04429", "authors": ["Gaspard Gomez"], "title": "Disordered systems and (subcritical) polynomial chaos with heavy-tail disorder", "comment": null, "summary": "We study discrete statistical mechanics systems perturbed by a random environment without a finite second moment. Specifically, we consider a random environment whose tail distribution satisfies $P[ω> x] \\sim x^{-γ}$ as $x \\to +\\infty$ for some $γ\\in (1,2)$. Inspired by the seminal work of Caravenna, Sun and Zygouras \\cite{csz_2016}, we adopt a general framework that encompasses as key examples both the disordered pinning model and the long-range directed polymer model. We provide some subcriticality condition under which we prove that the discrete disordered system possesses a non-trivial scaling limit. We also interpret the subcriticality condition in terms of a generalized Harris criterion without second moment, which gives a prediction for disorder relevance depending on the parameters of the system. Our analysis relies on the study of multilinear polynomials of independent heavy-tailed random variables known as polynomial chaos and their continuous analogue, given by multiple integrals with respect to a $γ$-stable Lévy white noise. We develop precise and flexible moments estimates adapted to the heavy-tailed setting."}
{"id": "2602.04348", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04348", "abs": "https://arxiv.org/abs/2602.04348", "authors": ["Erin Claire Carson"], "title": "Balancing Inexactness in Mixed Precision Matrix Computations", "comment": "12 pages", "summary": "Support for arithmetic in multiple precisions and number formats is becoming increasingly common in emerging high-performance architectures. From a computational scientist's perspective, our goal is to determine how and where we can safely exploit mixed precision computation in our codes to improve performance. One case where the use of low precision is natural, common in computational science, is when there are already other significant sources of ``inexactness'' present, e.g., discretization error, measurement error, or algorithmic approximation error. In such instances, analyzing the interaction of these different sources of inexactness can give insight into how the precisions of various computations should be chosen in order to ``balance'' the errors, potentially improving performance without a noticeable decrease in accuracy. We present a few recent examples of this approach which demonstrate the potential for the use of mixed precision in numerical linear algebra and matrix computations."}
{"id": "2602.04668", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.04668", "abs": "https://arxiv.org/abs/2602.04668", "authors": ["Oleksandr Mokliachuk"], "title": "Estimation of reliability and accuracy of models of $\\varphi$-sub-Gaussian process using generating functions of polynomial expansions", "comment": null, "summary": "Stochastic processes are often represented through orthonormal series expansions, a framework originating in the classical works of Loève and Karhunen and widely used for simulation and numerical approximation. While truncation error in such expansions has been extensively studied, practical models frequently involve an additional source of error arising from the approximation of coefficient functions when closed-form expressions are unavailable. The combined effect of these two errors remains insufficiently addressed in the literature. Building on the author's earlier work on reliability and accuracy estimates for $\\varphi$-sub-Gaussian processes, this paper extends the methodology to orthonormal polynomial systems that do not possess normalized generating functions in analytical form, including the Legendre, generalized Laguerre, and Gegenbauer families. New bounds are derived for models in $L_p(T)$ and $C([0,T])$ that simultaneously account for truncation and coefficient approximation. The resulting criteria provide practical guidance for selecting the number of series terms required to achieve prescribed levels of reliability and accuracy across a broader class of polynomial-based stochastic process models."}
{"id": "2602.04123", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04123", "abs": "https://arxiv.org/abs/2602.04123", "authors": ["Junhao Wu", "Shaoze Li", "Cheng Lu", "Zhibin Deng", "Shu-Cherng Fang"], "title": "Variable Aggregation-based Perspective Reformulation for Mixed-Integer Convex Optimization with Symmetry", "comment": null, "summary": "This paper addresses the challenging issue of symmetry in mixed-integer convex optimization problems, which frequently arise in real-world applications such as the unit commitment problem. Although variable aggregation techniques have been employed to mitigate symmetry, their impact on tightening the corresponding continuous relaxation has not been thoroughly investigated. In this work, we propose a new formulation that integrates the perspective reformulation method into the variable aggregation framework, yielding a tighter continuous relaxation for mixed-integer convex optimization problems with symmetric structures. We prove that, in the presence of symmetry, the convex hull of the feasible region associated with each set of aggregated variables can be exactly characterized. These results demonstrate the effectiveness of the proposed reformulation and establish new theoretical foundations for achieving tightness in variable aggregation-based mixed-integer programming formulations."}
{"id": "2602.04437", "categories": ["math.PR", "math.DS", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2602.04437", "abs": "https://arxiv.org/abs/2602.04437", "authors": ["Alison Etheridge", "João Luiz de Oliveira Madeira"], "title": "How seed banks evolve in plants: a stochastic dynamical system subject to a strong drift", "comment": "79 pages, 5 figures", "summary": "We study how changes in population size and fluctuating environmental conditions influence the establishment of seed banks in plants. Our model is a modification of the Wright-Fisher model with seed bank, introduced by Kaj, Krone and Lascoux. We distinguish between wild type individuals, producing only nondormant seeds, and mutants, producing seeds with dormancy. To understand how changing population size shapes the establishment of seed banks, we analyse the process under a diffusive scaling. The results support the biological insight that seed banks are favoured in a declining population, and disfavoured if population size is constant or increasing. The surprise is that this is true even when population sizes are changing very slowly -- over evolutionary timescales. We also investigate the influence of short-term fluctuations, such as annual variations in rainfall or temperature. Mathematically, our analysis reduces to a stochastic dynamical system forced onto a manifold by a large drift, which converges under scaling to a diffusion on the manifold. Inspired by the Lyapunov--Schmidt reduction, we derive an explicit formula for the limiting diffusion coefficients by projecting the system onto its linear counterpart. This provides a general framework for deriving diffusion approximations in models with strong drift and nonlinear constraints."}
{"id": "2602.04359", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.04359", "abs": "https://arxiv.org/abs/2602.04359", "authors": ["Ahsan Kaleem", "Cristian Gebhardt", "Ignacio Romero"], "title": "On the pure traction problem of linear elasticity: a regularized formulation and its robust approximation", "comment": "43 pages, 18 figures", "summary": "The pure traction problem of elasticity appears frequently in engineering applications, and its complexity stems from the fact that its solution is unique only up to (infinitesimal) rigid body motions. When finite elements are employed to approximate this problem, one solution is typically singled out by applying carefully selected boundary conditions on the discrete model or by imposing global constraints on the deformation. However, neither of these strategies is both simple and computationally efficient. In this work, we propose a new approach to solving the pure traction problem that overcomes existing limitations. Our method builds on a regularized form of the problem whose solution is shown to be unique, converges to the original solution of minimal norm, and can be approximated with finite elements in a straightforward way, without additional degrees of freedom. Additionally, we analyze the situation in which the approximation of the solution domain renders the loading of the discretized problem non-equilibrated, making the problem ill-posed. In this case, we propose a regularized predictor--corrector finite element formulation that handles the incompatibilities of the loading, providing a solution that converges to that of the original Neumann problem as the mesh size and the regularizing parameter tend to zero. Numerical examples illustrate the effectiveness of the proposed approach for representative problems in mechanics where pure traction boundary conditions appear."}
{"id": "2602.04708", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.04708", "abs": "https://arxiv.org/abs/2602.04708", "authors": ["Anton Tiepner", "Mathias Trabs", "Eric Ziebell"], "title": "Statistical inference for the stochastic wave equation based on discrete observations", "comment": "44 pages, 6 figures", "summary": "The wave speed of a stochastic wave equation driven by Riesz noise on the unbounded multidimensional spatial domain is estimated based on discrete measurements. Central limit theorems for second-order variations of the observations in space, time, and space-time are established. Under general assumptions on the spatial and temporal sampling frequencies, the resulting method-of-moments estimators are asymptotically normally distributed. The covariance structure of the discrete increments admits a closed-form representation involving two different Fejér-type kernels, enabling a precise analysis of the interplay between spatial and temporal contributions."}
{"id": "2602.04143", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04143", "abs": "https://arxiv.org/abs/2602.04143", "authors": ["Zeying Gao", "Xiangkai Sun", "Liang He"], "title": "Inertial dynamical systems and accelerated algorithms with implicit Hessian-driven damping for nonconvex optimization", "comment": null, "summary": "This paper is devoted to the investigation of inertial dynamical systems with implicit Hessian-driven damping for strongly quasiconvex optimization which is a specific class of nonconvex optimization problems. We first establish exponential convergence rate properties for this system without requiring Lipschitz continuity of the gradient on the function. Then, we obtain an inertial accelerated algorithm for minimizing strongly quasiconvex functions through natural explicit time discretization to the dynamical system. Meanwhile, we consider an exogenous additive perturbation term to this dynamical system and obtain the corresponding algorithm. By utilizing the Lyapunov method, we establish convergence rates of iterative sequences and their function values. Furthermore, we conduct numerical experiments to illustrate the theoretical results."}
{"id": "2602.04614", "categories": ["math.PR", "math.OA"], "pdf": "https://arxiv.org/pdf/2602.04614", "abs": "https://arxiv.org/abs/2602.04614", "authors": ["Benoît Collins", "Manasa Nagatsu"], "title": "Smooth Multi-Trace Statistics of Classical Ensembles: Large $N$ Expansions, Cumulants, and Matrix Integrals", "comment": "34 pages", "summary": "We consider expectations of the form $E [tr h_1(X_1^N)... tr h_r(X_r^N)]$, where $X_i^N$ are self-adjoint polynomials in various independent classical random matrices and $h_i$ are smooth test function and obtain a large $N$ expansion of these quantities, building on the framework of polynomial approximation and Bernstein-type inequalities recently developed by Chen, Garza-Vargas, Tropp, and van Handel. As applications of the above, we prove the higher-order asymptotic vanishing of cumulants for smooth linear statistics, establish a Central Limit Theorem, and demonstrate the existence of formal asymptotic expansions for the free energy and observables of matrix integrals with smooth potentials."}
{"id": "2602.04368", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04368", "abs": "https://arxiv.org/abs/2602.04368", "authors": ["P. A. Gazca-Orozco", "A. Kaltenbach"], "title": "A Priori and A Posteriori Error Identities for Vectorial Problems via Convex Duality", "comment": null, "summary": "Convex duality has been leveraged in recent years to derive a posteriori error estimates and identities for a wide range of non-linear and non-smooth scalar problems. By employing remarkable compatibility properties of the Crouzeix-Raviart and Raviart-Thomas elements, optimal convergence of non-conforming discretisations and flux reconstruction formulas have also been established. This paper aims to extend these results to the vectorial setting, focusing on the archetypical problems of incompressible Stokes and Navier-Lamé. Moreover, unlike most previous results, we consider inhomogeneous mixed boundary conditions and loads in the topological dual of the energy space. At the discrete level, we derive error identities and estimates that enable to prove quasi-optimal error estimates for a Crouzeix-Raviart discretisation with minimal regularity assumptions and no data oscillation terms."}
{"id": "2602.04823", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.04823", "abs": "https://arxiv.org/abs/2602.04823", "authors": ["Claudio Durastanti"], "title": "Adaptive estimation of Sobolev-type energy functionals on the sphere", "comment": "26 pages, 3 figures", "summary": "We study the estimation of quadratic Sobolev-type integral functionals of an unknown density on the unit sphere. The functional is defined through fractional powers of the Laplace--Beltrami operator and provides a global measure of smoothness and spectral energy. Our approach relies on spherical needlet frames, which yield a localized multiscale decomposition while preserving tight frame properties in the natural square-integrable function space on the sphere.\n  We construct unbiased estimators of suitably truncated versions of the functional and derive sharp oracle risk bounds through an explicit bias--variance analysis. When the smoothness of the density is unknown, we propose a Lepski-type data-driven selection of the resolution level. The resulting adaptive estimator achieves minimax-optimal rates over Sobolev classes, without resorting to nonlinear or sparsity-based methods."}
{"id": "2602.04161", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04161", "abs": "https://arxiv.org/abs/2602.04161", "authors": ["Xinming Wu", "Zi Xu", "Huiling Zhang"], "title": "Restart-Free (Accelerated) Gradient Sliding Methods for Strongly Convex Composite Optimization", "comment": null, "summary": "In this paper, we study a class of composite optimization problems whose objective function is given by the summation of a general smooth and nonsmooth component, together with a relatively simple nonsmooth term. While restart strategies are commonly employed in first-order methods to achieve optimal convergence under strong convexity, they introduce structural complexity and practical overhead, making algorithm design and nesting cumbersome. To address this, we propose a \\emph{restart-free} stochastic gradient sliding algorithm that eliminates the need for explicit restart phases when the simple nonsmooth component is strongly convex. Through a novel and carefully designed parameter selection strategy, we prove that the proposed algorithm achieves an $ε$-solution with only $\\mathcal{O}(\\log(\\frac{1}ε))$ gradient evaluations for the smooth component and $\\mathcal{O}(\\frac{1}ε)$ stochastic subgradient evaluations for the nonsmooth component, matching the optimal complexity of existing multi-phase (restart-based) methods. Moreover, for the case where the nonsmooth component is structured, allowing the overall problem to be reformulated as a bilinear saddle-point problem, we develop a restart-free accelerated stochastic gradient sliding algorithm. We show that the resulting method requires only $\\mathcal{O}(\\log(\\frac{1}ε))$ gradient computations for the smooth component while preserving an overall iteration complexity of $\\mathcal{O}(\\frac{1}{\\sqrtε})$ for solving the corresponding saddle-point problems. Our work thus provides simpler, restart-f"}
{"id": "2602.04673", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.04673", "abs": "https://arxiv.org/abs/2602.04673", "authors": ["Nathanaël Berestycki", "Isao Sauzedde"], "title": "Brownian paths as loop-decorated SLEs", "comment": "41 pages", "summary": "We construct an application, which takes as input a simple path and a possibly infinite collection of loops, and outputs a continuous path by adding the loops chronologically to the simple path as the simple path encounters them. By studying the regularity properties of this application and using lattice discretisations, we prove that chronologically adding the loops from a Brownian loop soup encountered by an independent radial SLE$_2$ path produces a continuous path which has the law of a planar Brownian motion. This resolves a conjecture of Lawler and Werner.\n  This construction produces a coupling between SLE$_2$ and Brownian motion, and we further show that this joint law is the scaling limit of the loop-erased random walk and the random walk itself. The arguments are robust and can be applied for instance in the off-critical setup, where the scaling limit of loop-erased random walk is Makarov and Smirnov's massive SLE$_2$."}
{"id": "2602.04490", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04490", "abs": "https://arxiv.org/abs/2602.04490", "authors": ["Johannes Storn"], "title": "Randomized Projection Operators onto Piecewise Polynomial Spaces", "comment": null, "summary": "We introduce computable projection operators onto piecewise polynomial spaces, defined via sampling and discrete least-squares polynomial approximations. The resulting mappings exhibit (almost) optimal approximation properties in $L^2$ and $H^{-1}$. As smoothers for incomplete or rough data, they yield computable finite element discretizations with optimal convergence rates."}
{"id": "2602.03999", "categories": ["math.PR", "cs.DS", "cs.LG", "math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.03999", "abs": "https://arxiv.org/abs/2602.03999", "authors": ["Anming Gu", "Bobby Shi", "Kevin Tian"], "title": "Functional Stochastic Localization", "comment": "Comments welcome!", "summary": "Eldan's stochastic localization is a probabilistic construction that has proved instrumental to modern breakthroughs in high-dimensional geometry and the design of sampling algorithms. Motivated by sampling under non-Euclidean geometries and the mirror descent algorithm in optimization, we develop a functional generalization of Eldan's process that replaces Gaussian regularization with regularization by any positive integer multiple of a log-Laplace transform. We further give a mixing time bound on the Markov chain induced by our localization process, which holds if our target distribution satisfies a functional Poincaré inequality. Finally, we apply our framework to differentially private convex optimization in $\\ell_p$ norms for $p \\in [1, 2)$, where we improve state-of-the-art query complexities in a zeroth-order model."}
{"id": "2602.04219", "categories": ["math.OC", "eess.SY", "q-fin.PM"], "pdf": "https://arxiv.org/pdf/2602.04219", "abs": "https://arxiv.org/abs/2602.04219", "authors": ["Chung-Han Hsieh"], "title": "Sampled-Data Wasserstein Distributionally Robust Control of Multiplicative Systems: A Convex Relaxation with Performance Guarantees", "comment": "Submitted for possible publication", "summary": "This paper investigates the robust optimal control of sampled-data stochastic systems with multiplicative noise and distributional ambiguity. We consider a class of discrete-time optimal control problems where the controller \\emph{jointly} selects a feedback policy and a sampling period to maximize the worst-case expected concave utility of the inter-sample growth factor. Modeling uncertainty via a Wasserstein ambiguity set, we confront the structural obstacle of~``concave-max'' geometry arising from maximizing a concave utility against an adversarial distribution. Unlike standard convex loss minimization, the dual reformulation here requires a minimax interchange within the semi-infinite constraints, where the utility's concavity precludes exact strong duality. To address this, we utilize a general minimax inequality to derive a tractable convex relaxation. Our approach yields a rigorous lower bound that functions as a probabilistic performance guarantee. We establish an explicit, non-asymptotic bound on the resulting duality gap, proving that the approximation error is uniformly controlled by the Lipschitz-smoothness of the stage reward and the diameter of the disturbance support. Furthermore, we introduce necessary and sufficient conditions for \\emph{robust viability}, ensuring state positivity invariance across the entire ambiguity set. Finally, we bridge the gap between static optimization and dynamic performance, proving that the optimal value of the relaxation serves as a rigorous deterministic floor for the asymptotic average utility rate almost surely. The framework is illustrated on a log-optimal portfolio control problem, which serves as a canonical instance of multiplicative stochastic control."}
{"id": "2602.04472", "categories": ["math.ST", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.04472", "abs": "https://arxiv.org/abs/2602.04472", "authors": ["Yanjin Xiang", "Zhihua Zhang"], "title": "Universality of General Spiked Tensor Models", "comment": "102pages", "summary": "We study the rank-one spiked tensor model in the high-dimensional regime, where the noise entries are independent and identically distributed with zero mean, unit variance, and finite fourth moment.This setting extends the classical Gaussian framework to a substantially broader class of noise distributions.Focusing on asymmetric tensors of order $d$ ($\\ge 3$), we analyze the maximum likelihood estimator of the best rank-one approximation.Under a mild assumption isolating informative critical points of the associated optimization landscape, we show that the empirical spectral distribution of a suitably defined block-wise tensor contraction converges almost surely to a deterministic limit that coincides with the Gaussian case.As a consequence, the asymptotic singular value and the alignments between the estimated and true spike directions admit explicit characterizations identical to those obtained under Gaussian noise. These results establish a universality principle for spiked tensor models, demonstrating that their high-dimensional spectral behavior and statistical limits are robust to non-Gaussian noise.\n  Our analysis relies on resolvent methods from random matrix theory, cumulant expansions valid under finite moment assumptions, and variance bounds based on Efron-Stein-type arguments. A key challenge in the proof is how to handle the statistical dependence between the signal term and the noise term."}
{"id": "2602.04603", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04603", "abs": "https://arxiv.org/abs/2602.04603", "authors": ["Abdessadek Rifqui", "Ahmed Ratnani", "Stefano Serra-Capizzano"], "title": "Domain decomposition methods and preconditioning strategies using generalized locally Toepltiz tools: proposals, analysis, and numerical validation", "comment": null, "summary": "In the current work we present a spectral analysis of the additive and multiplicative Schwarz methods within the framework of domain decomposition techniques, by investigating the spectral properties of these classical Schwarz preconditioning matrix-sequences, with emphasis on their convergence behavior and on the effect of transmission operators. In particular, after a general presentation of various options, we focus on restricted variants of the Schwarz methods aimed at improving parallel efficiency, while preserving their convergence features. In order to rigorously describe and analyze the convergence behavior, we employ the theory of generalized locally Toeplitz (GLT) sequences, which provides a robust framework for studying the asymptotic spectral distribution of the discretized operators arising from Schwarz iterations. By associating each operator sequence with the appropriate GLT symbol, we derive explicit expressions for the GLT symbols of the convergence factors, for both additive and multiplicative Schwarz methods. The GLT-based spectral approach offers a unified and systematic understanding of how the spectrum evolves with mesh refinement and overlap size (in the algebraic case). Our analysis not only deepens the theoretical understanding of classical Schwarz methods, but also establishes a foundation for examining future restricted or hybrid Schwarz variants using symbolic spectral tools. These results enable the prediction of the remarkable efficiency of block Jacobi/Gauss--Seidel and block additive/multiplicative Schwarz preconditioners for GLT sequences, as further illustrated through a wide choice of numerical experiments."}
{"id": "2602.04250", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.04250", "abs": "https://arxiv.org/abs/2602.04250", "authors": ["Florian Heinrichs"], "title": "A Note on Physical Dependence and Mixing Conditions for Triangular Arrays", "comment": "Keywords: Weak Dependence, Strong Mixing, $β$-Mixing, Physical Dependence, Triangular Arrays, Local Stationarity", "summary": "Under mild structural assumptions and regularity conditions on the marginal and conditional densities, an explicit bound on the $β$-mixing coefficients in terms of the physical dependence measure is provided. Consequently, weak physical dependence implies $β$-mixing and strong mixing for triangular arrays, complementing Hill (2025), who proved the converse implication under moment assumptions."}
{"id": "2602.04237", "categories": ["math.OC", "cs.CV"], "pdf": "https://arxiv.org/pdf/2602.04237", "abs": "https://arxiv.org/abs/2602.04237", "authors": ["ZeYu Li", "Te Qi", "TieYong Zeng"], "title": "An Improved Boosted DC Algorithm for Nonsmooth Functions with Applications in Image Recovery", "comment": null, "summary": "We propose a new approach to perform the boosted difference of convex functions algorithm (BDCA) on non-smooth and non-convex problems involving the difference of convex (DC) functions. The recently proposed BDCA uses an extrapolation step from the point computed by the classical DC algorithm (DCA) via a line search procedure in a descent direction to get an additional decrease of the objective function and accelerate the convergence of DCA. However, when the first function in DC decomposition is non-smooth, the direction computed by BDCA can be ascent and a monotone line search cannot be performed. In this work, we proposed a monotone improved boosted difference of convex functions algorithm (IBDCA) for certain types of non-smooth DC programs, namely those that can be formulated as the difference of a possibly non-smooth function and a smooth one. We show that any cluster point of the sequence generated by IBDCA is a critical point of the problem under consideration and that the corresponding objective value is monotonically decreasing and convergent. We also present the global convergence and the convergent rate under the Kurdyka-Lojasiewicz property. The applications of IBDCA in image recovery show the effectiveness of our proposed method. The corresponding numerical experiments demonstrate that our IBDCA outperforms DCA and other state-of-the-art DC methods in both computational time and number of iterations."}
{"id": "2602.04310", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.04310", "abs": "https://arxiv.org/abs/2602.04310", "authors": ["Léa Ninite", "Adrien Banse", "Guillaume O. Berger", "Raphaël M. Jungers"], "title": "A Path-Complete Approach for Optimal Control of Switched Systems", "comment": null, "summary": "We study the problem of estimating the value function of discrete-time switched systems under arbitrary switching. Unlike the switched LQR problem, where both inputs and mode sequences are optimized, we consider the case where switching is exogenous. For such systems, the number of possible mode sequences grows exponentially with time, making the exact computation of the value function intractable. This motivates the development of tractable bounds that approximate it. We propose a novel framework, based on path-complete graphs, for constructing computable upper bounds on the value function. In this framework, multiple quadratic functions are combined through a directed graph that encodes dynamic programming inequalities, yielding convex and sound formulations. For example, for switched linear systems with quadratic cost, we derive tractable LMI-based formulations and provide computational complexity bounds. We further establish approximation guarantees for the upper bounds and show asymptotic non-conservativeness using concepts from graph theory. Finally, we extend the approach to controller synthesis for systems with affine control inputs and demonstrate its effectiveness on numerical examples."}
{"id": "2602.04378", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04378", "abs": "https://arxiv.org/abs/2602.04378", "authors": ["Jannis Halbey", "Daniel Deza", "Max Zimmer", "Christophe Roux", "Bartolomeo Stellato", "Sebastian Pokutta"], "title": "Lower Bounds for Frank-Wolfe on Strongly Convex Sets", "comment": null, "summary": "We present a constructive lower bound of $Ω(1/\\sqrt{\\varepsilon})$ for Frank-Wolfe (FW) when both the objective and the constraint set are smooth and strongly convex, showing that the known uniform $\\mathcal{O}(1/\\sqrt{\\varepsilon})$ guarantees in this regime are tight. It is known that under additional assumptions on the position of the optimizer, FW can converge linearly. However, it remained unclear whether strong convexity of the set can yield rates uniformly faster than $\\mathcal{O}(1/\\sqrt{\\varepsilon})$, i.e., irrespective of the position of the optimizer. To investigate this question, we focus on a simple yet representative problem class: minimizing a strongly convex quadratic over the Euclidean unit ball, with the optimizer on the boundary. We analyze the dynamics of FW for this problem in detail and develop a novel computational approach to construct worst-case FW trajectories, which is of independent interest. Guided by these constructions, we develop an analytical proof establishing the lower bound."}
{"id": "2602.04479", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04479", "abs": "https://arxiv.org/abs/2602.04479", "authors": ["Demyan Yarmoshik", "Nhat Trung Nguyen", "Alexander Rogozin", "Alexander Gasnikov"], "title": "Decentralized Optimization with Mixed Affine Constraints", "comment": null, "summary": "This paper considers decentralized optimization of convex functions with mixed affine equality constraints involving both local and global variables. Constraints on global variables may vary across different nodes in the network, while local variables are subject to coupled and node-specific constraints. Such problem formulations arise in machine learning applications, including federated learning and multi-task learning, as well as in resource allocation and distributed control. We analyze this problem under smooth and non-smooth assumptions, considering both strongly convex and general convex objective functions. Our main contribution is an optimal algorithm for the smooth, strongly convex regime, whose convergence rate matches established lower complexity bounds. We further provide near-optimal methods for the remaining cases."}
{"id": "2602.04551", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04551", "abs": "https://arxiv.org/abs/2602.04551", "authors": ["Xiang Meng", "Ryan Lucas", "Rahul Mazumder"], "title": "A GPU-accelerated Nonlinear Branch-and-Bound Framework for Sparse Linear Models", "comment": null, "summary": "We study exact sparse linear regression with an $\\ell_0-\\ell_2$ penalty and develop a branch-and-bound (BnB) algorithm explicitly designed for GPU execution. Starting from a perspective reformulation, we derive an interval relaxation that can be solved by ADMM with closed-form, coordinate-wise updates. We structure these updates so that the main work at each BnB node reduces to batched matrix-vector operations with a shared data matrix, enabling fine-grained parallelism across coordinates and coarse-grained parallelism across many BnB nodes on a single GPU. Feasible solutions (upper bounds) are generated by a projected gradient method on the active support, implemented in a batched fashion so that many candidate supports are updated in parallel on the GPU. We discuss practical design choices such as memory layout, batching strategies, and load balancing across nodes that are crucial for obtaining good utilization on modern GPUs. On synthetic and real high-dimensional datasets, our GPU-based approach achieves clear runtime improvements over a CPU implementation of our method, an existing specialized BnB method, and commercial MIP solvers."}
