{"id": "2602.04988", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.04988", "abs": "https://arxiv.org/abs/2602.04988", "authors": ["Weizhu Bao", "Caoyi Liu"], "title": "A uniformly accurate multiscale time integrator for the nonlinear Klein-Gordon equation in the nonrelativistic regime via simplified transmission conditions", "comment": "31 pages, 5 figures. Submitted to IMA Journal of Numerical Analysis", "summary": "We propose a new and simplified multiscale time integrator Fourier pseudospectral (MTI-FP) method for the nonlinear Klein-Gordon equation (NKGE) with a dimensionless parameter epsilon in (0,1] inversely proportional to the speed of light, and establish its uniform first-order accuracy in time in the nonrelativistic regime, i.e. 0 < epsilon << 1. In this regime, the solution of the NKGE is highly oscillatory in time with O(epsilon^2)-wavelength, which brings significant difficulties in designing uniformly accurate numerical methods. The MTI-FP is based on (i) a multiscale decomposition by frequency of the NKGE in each time interval with simplified transmission conditions, and (ii) an exponential wave integrator for temporal discretization and a Fourier pseudospectral method for spatial discretization. By adapting the energy method and the mathematical induction, we obtain two error bounds in H1-norm at O(h^{m0}+tau^2/epsilon^2) and O(h^{m0}+tau+epsilon^2) with mesh size h, time step tau and m0 an integer dependent on the regularity of the solution, which immediately implies a uniformly accurate error bound O(h^{m0}+tau) with respect to epsilon in (0,1]. In addition, by adopting a linear interpolation of the micro variables with the multiscale decomposition in each time interval, we obtain a uniformly accurate numerical solution for any time t larger than zero. Thus the proposed MTI-FP method has a super resolution property in time in terms of the Shannon sampling theory, i.e. accurate numerical solutions can be obtained even when the time step is much bigger than the O(epsilon^2)-wavelength. Extensive numerical results are reported to confirm our error bounds and demonstrate their super resolution in time. Finally the proposed MTI-FP method is applied to study numerically convergence rates of the NKGE to its different limiting models in the nonrelativistic regime."}
{"id": "2602.05005", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05005", "abs": "https://arxiv.org/abs/2602.05005", "authors": ["Joshua Bannister", "David P. Hewett", "Andrew Gibbs"], "title": "Acoustic scattering by fractal inhomogeneities via geometry-conforming Galerkin methods for the Lippmann-Schwinger equation", "comment": null, "summary": "We propose and analyse a numerical method for time-harmonic acoustic scattering in $\\mathbb{R}^n$, $n=2,3$, by a class of inhomogeneities (penetrable scatterers) with fractal boundary. Our method is based on a Galerkin discretisation of the Lippmann-Schwinger volume integral equation, using a discontinuous piecewise-polynomial approximation space on a geometry-conforming mesh comprising elements which themselves have fractal boundary. We first provide a semi-discrete well-posedness and error analysis for both the $h$- and $p$-versions of our method for completely arbitrary inhomogeneities (without any regularity assumption on the boundary of the inhomogeneity or of the mesh elements). We prove convergence estimates for the integral equation solution and superconvergence estimates for linear functionals such as scattered field and far-field pattern evaluations, and elucidate how the regularity of the inhomogeneity boundary and the regularity of the refractive index affect the rates of convergence predicted. We then specialise to the case where the inhomogeneity is an ``$n$-attractor'', i.e.\\ the fractal attractor of an iterated function system satisfying the open set condition with non-empty interior, showing how in this case the self-similarity of the inhomogeneity can be used to generate geometry-conforming meshes. For the $h$-version with piecewise constant approximation we also present singular quadrature rules, supported by a fully discrete error analysis, permitting practical implementation of our method. We present numerical results for two-dimensional examples, which validate our theoretical results and show that our method is significantly more accurate than a comparable method involving replacement of the fractal inhomogeneity by a smoother prefractal approximation."}
{"id": "2602.05124", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05124", "abs": "https://arxiv.org/abs/2602.05124", "authors": ["Yesom Park", "Stanley Osher"], "title": "Scalable Fixed-Point Framework for High-Dimensional Hamilton-Jacobi Equations", "comment": null, "summary": "We propose a novel, mesh-free, and gradient-free fixed-point approach for computing viscosity solutions of high-dimensional Hamilton-Jacobi (HJ) equations. By leveraging the Hopf-Lax formula, our approach iteratively solves the associated variational problem via a Picard iteration, enabling efficient evaluation of both the solution and its corresponding control without relying on grids, characteristics, or differentiation. We demonstrate the practical efficacy and scalability of the approach through numerical experiments in up to 100 dimensions, including control problems and non-smooth solutions. Our results show that the proposed scheme achieves high accuracy, is highly efficient, and exhibits computational times that are largely independent of dimensionality, highlighting its suitability for high-dimensional problems."}
{"id": "2602.05341", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05341", "abs": "https://arxiv.org/abs/2602.05341", "authors": ["Kyoungjin Jung", "Jae Yong Lee", "Dongwook Shin"], "title": "Numerically Informed Convolutional Operator Network with Subproblem Decomposition for Poisson Equations", "comment": null, "summary": "Neural operators have shown remarkable performance in approximating solutions of partial differential equations. However, their convergence behavior under grid refinement is still not well understood from the viewpoint of numerical analysis. In this work, we propose a numerically informed convolutional operator network, called NICON, that explicitly couples classical finite difference and finite element methods with operator learning through residual-based training loss functions. We introduce two types of networks, FD-CON and FE-CON, which use residual-based loss functions derived from the corresponding numerical methods. We derive error estimates for FD-CON and FE-CON using finite difference and finite element analysis. These estimates show a direct relation between the convergence behavior and the decay rate of the training loss. From these analyses, we establish training strategies that guarantee optimal convergence rates under grid refinement. Several numerical experiments are presented to validate the theoretical results and show performance on fine grids."}
{"id": "2602.05317", "categories": ["math.PR", "math-ph", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.05317", "abs": "https://arxiv.org/abs/2602.05317", "authors": ["Le Chen", "Cheuk Yin Lee", "Panqiu Xia"], "title": "Strong local nondeterminism for stochastic time-fractional slow and fast diffusion equations", "comment": "125 pages, 6 figures, 1 table", "summary": "We study a class of stochastic time-fractional equations on $\\mathbb{R}^d$ driven by a centered Gaussian noise, involving a Caputo time derivative of order $β>0$, a fractional (power) Laplacian of order $α>0$, and a Riemann-Liouville time integral of order $γ\\ge0$ acting on the noise. The noise is fractional in time (index $H$) and Riesz-type in space (index $\\ell$). We derive sharp Dalang-type necessary and sufficient conditions for the existence of a random field solution across almost full parameter range $(α,β,γ;H,\\ell)$. Under the Dalang-type conditions, we prove sharp variance bounds for temporal and spatial increments, as well as strong local nondeterminism in time in several regimes (two-sided version for $β=1$ and for parts of the case $β=2$; one-sided version for $0<β<2$) and strong local nondeterminism in space for the whole range of parameters. As applications, we derive exact uniform and local moduli of continuity, Chung-type laws of the iterated logarithm, and quantitative bounds on small ball probabilities. Along the way, we obtain sharp asymptotics for the fundamental solution kernels at $0$ and $\\infty$, which may be of independent interest."}
{"id": "2602.04984", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.04984", "abs": "https://arxiv.org/abs/2602.04984", "authors": ["Fabio Ciccarelli", "Fabio Furini", "Christopher Hojny", "Marco Lübbecke"], "title": "Branch-and-price strikes back for the k-vertex cut problem", "comment": null, "summary": "Given an undirected graph, the k-vertex cut problem (k-VCP) asks for a minimum-cost set of vertices whose removal yields at least k connected components in the resulting graph. The k-VCP is an important problem in network optimization, with applications in infrastructure protection and epidemic containment. We present a new extended integer linear programming (ILP) formulation that unifies and strengthens existing models and serves as the foundation for a new branch-and-price algorithm for the k-VCP. An in-depth theoretical study enables us to devise algorithmic components such as tailored branching rules that preserve the structure of the pricing problems, as well as valid inequalities and symmetry-handling techniques. We also show that our new model dominates all previous ILP formulations of the k-VCP in terms of their linear relaxations, which theoretically justifies the computational effectiveness of our approach. Extensive computational experiments against state-of-the-art methods demonstrate substantially improved performance, both in terms of instances solved to proven optimality and running times. On the full benchmark of 608 instances, our algorithm consistently outperforms all competitors and is able to solve 73 previously unsolved instances within the time limit of one hour."}
{"id": "2602.05225", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05225", "abs": "https://arxiv.org/abs/2602.05225", "authors": ["László Györfi", "Pierre Humbert", "Batiste Le Bars"], "title": "Metric space valued Fréchet regression", "comment": null, "summary": "We consider the problem of estimating the Fréchet and conditional Fréchet mean from data taking values in separable metric spaces. Unlike Euclidean spaces, where well-established methods are available, there is no practical estimator that works universally for all metric spaces. Therefore, we introduce a computable estimator for the Fréchet mean based on random quantization techniques and establish its universal consistency across any separable metric spaces. Additionally, we propose another estimator for the conditional Fréchet mean, leveraging data-driven partitioning and quantization, and demonstrate its universal consistency when the output space is any Banach space."}
{"id": "2602.05394", "categories": ["math.NA", "cs.DS"], "pdf": "https://arxiv.org/pdf/2602.05394", "abs": "https://arxiv.org/abs/2602.05394", "authors": ["Noah Amsel", "Yves Baumann", "Paul Beckman", "Peter Bürgisser", "Chris Camaño", "Tyler Chen", "Edmond Chow", "Anil Damle", "Michal Derezinski", "Mark Embree", "Ethan N. Epperly", "Robert Falgout", "Mark Fornace", "Anne Greenbaum", "Chen Greif", "Diana Halikias", "Zhen Huang", "Elias Jarlebring", "Yiannis Koutis", "Daniel Kressner", "Rasmus Kyng", "Jörg Liesen", "Jackie Lok", "Raphael A. Meyer", "Yuji Nakatsukasa", "Kate Pearce", "Richard Peng", "David Persson", "Eliza Rebrova", "Ryan Schneider", "Rikhav Shah", "Edgar Solomonik", "Nikhil Srivastava", "Alex Townsend", "Robert J. Webber", "Jess Williams"], "title": "Linear Systems and Eigenvalue Problems: Open Questions from a Simons Workshop", "comment": null, "summary": "This document presents a series of open questions arising in matrix computations, i.e., the numerical solution of linear algebra problems. It is a result of working groups at the workshop \\emph{Linear Systems and Eigenvalue Problems}, which was organized at the Simons Institute for the Theory of Computing program on \\emph{Complexity and Linear Algebra} in Fall 2025. The complexity and numerical solution of linear algebra problems %in matrix computations and related fields is a crosscutting area between theoretical computer science and numerical analysis. The value of the particular problem formulations here is that they were produced via discussions between researchers from both groups.\n  The open questions are organized in five categories: iterative solvers for linear systems, eigenvalue computation, low-rank approximation, randomized sketching, and other areas including tensors, quantum systems, and matrix functions."}
{"id": "2602.05336", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.05336", "abs": "https://arxiv.org/abs/2602.05336", "authors": ["Jiguang Yu", "Louis Shuo Wang", "Yuansheng Gao", "Ye Liang"], "title": "Full-Covariance Chemical Langevin Predator--Prey Diffusion with Absorbing Boundaries", "comment": null, "summary": "Many stochastic Rosenzweig--MacArthur predator--prey models inject ad hoc independent (diagonal) noise and therefore cannot encode the event-level coupling created by predation and biomass conversion. We derive an absorbed, fully mechanistic diffusion approximation and its extinction structure from a continuous-time Markov chain on $\\mathbb N_0^2$ with four reaction channels: prey birth, prey competition death, predator death, and a coupled predation--conversion event. Absorbing coordinate axes are imposed to represent the irreversibility of demographic extinction. Under Kurtz density-dependent scaling, the law-of-large-numbers limit recovers the classical RM ODE, while central-limit scaling yields a chemical-Langevin diffusion with explicit drift and full state-dependent covariance. A distinctive signature is the strictly negative cross-covariance $Σ_{12}(N,P)=-mNP/(1+N)$ induced solely by the predation--conversion increment $(-1,1)$. We define the absorbed Itô SDE by freezing trajectories at the first boundary hit and prove strong well-posedness, non-explosion, and moment bounds up to absorption. Extinction has positive probability from every interior state, and predator extinction is almost sure when $m\\le c$."}
{"id": "2602.05011", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.05011", "abs": "https://arxiv.org/abs/2602.05011", "authors": ["Xuting Gao", "Guillem Pascual", "Scott Brown", "Sonia Martínez"], "title": "Banach Control Barrier Functions for Large-Scale Swarm Control", "comment": "Accepted by IEEE ACC 2026", "summary": "This paper studies the safe control of very large multi-agent systems via a generalized framework that employs so-called Banach Control Barrier Functions (B-CBFs). Modeling a large swarm as probability distribution over a spatial domain, we show how B-CBFs can be used to appropriately capture a variety of macroscopic constraints that can integrate with large-scale swarm objectives. Leveraging this framework, we define stable and filtered gradient flows for large swarms, paying special attention to optimal transport algorithms. Further, we show how to derive agent-level, microscopical algorithms that are consistent with macroscopic counterparts in the large-scale limit. We then identify conditions for which a group of agents can compute a distributed solution that only requires local information from other agents within a communication range. Finally, we showcase the theoretical results over swarm systems in the simulations section."}
{"id": "2602.05259", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05259", "abs": "https://arxiv.org/abs/2602.05259", "authors": ["Ashwin Ram", "Aaditya Ramdas"], "title": "An Asymptotic Law of the Iterated Logarithm for $\\mathrm{KL}_{\\inf}$", "comment": "Preprint", "summary": "The population $\\mathrm{KL}_{\\inf}$ is a fundamental quantity that appears in lower bounds for (asymptotically) optimal regret of pure-exploration stochastic bandit algorithms, and optimal stopping time of sequential tests. Motivated by this, an empirical $\\mathrm{KL}_{\\inf}$ statistic is frequently used in the design of (asymptotically) optimal bandit algorithms and sequential tests. While nonasymptotic concentration bounds for the empirical $\\mathrm{KL}_{\\inf}$ have been developed, their optimality in terms of constants and rates is questionable, and their generality is limited (usually to bounded observations). The fundamental limits of nonasymptotic concentration are often described by the asymptotic fluctuations of the statistics. With that motivation, this paper presents a tight (upper and lower) law of the iterated logarithm for empirical $\\mathrm{KL}_{\\inf}$ applying to extremely general (unbounded) data."}
{"id": "2602.05589", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.05589", "abs": "https://arxiv.org/abs/2602.05589", "authors": ["Sachin Saini"], "title": "Taylor-Accelerated Neural Network Interpolation Operators on Irregular Grids with Higher Order Approximation", "comment": "16 pages, 4 figures", "summary": "In this paper, a new class of \\emph{Taylor-accelerated neural network interpolation operators} is introduced on quasi-uniform irregular grids. These operators improve existing neural network interpolation operators by incorporating Taylor polynomials at the sampling nodes, thereby exploiting the higher smoothness of the target function. The proposed operators are shown to be well defined, uniformly bounded, and to satisfy an exact interpolation property at the grid points. In addition, polynomial reproduction up to a prescribed degree is established. Direct approximation estimates are derived in terms of higher-order moduli of smoothness, yielding enhanced convergence rates for sufficiently smooth functions. Numerical experiments are presented to support the theoretical analysis and to demonstrate the significant accuracy improvement achieved through the Taylor-accelerated construction. In particular, higher-order convergence on irregular grids is obtained, and the proposed approach outperforms existing neural network interpolation operators on irregular partitions, including Lagrange-based schemes."}
{"id": "2602.05477", "categories": ["math.PR", "math.AP", "math.FA", "math.MG"], "pdf": "https://arxiv.org/pdf/2602.05477", "abs": "https://arxiv.org/abs/2602.05477", "authors": ["Sylvester Eriksson-Bique"], "title": "On the Resistance Conjecture", "comment": "Comments are welcome, 30 pages. I am especially happy if people point out missing references", "summary": "We give an affirmative answer to the resistance conjecture on characterization of parabolic Harnack inequalities in terms of volume doubling, upper capacity bounds and a Poincaré inequalities. The key step is to show that these three assumptions imply the so called cutoff Sobolev inequality, an important inequality in the study of anomalous diffusions, Dirichlet forms and re-scaled energies in fractals. This implication is shown in the general setting of $p$-Dirichlet Spaces introduced by the author and Murugan, and thus a unified treatment becomes possible to proving Harnack inequalities and stability phenomena in both analysis on metric spaces and fractals and for graphs and manifolds for all exponents $p\\in (1,\\infty)$. As an application, we also show that a Dirichlet space satisfying volume doubling, Poincaré and upper capacity bounds has finite martingale dimension and admits a type of differential structure similar to the work of Cheeger. In the course of the proof, we establish methods of extension and characterizations of Sobolev functions by Poincaré-inequalities, and extend the methods of Jones and Koskela to the general setting of $p$-Dirichlet spaces."}
{"id": "2602.05020", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.05020", "abs": "https://arxiv.org/abs/2602.05020", "authors": ["Lars Grüne", "Mario Sperl"], "title": "Decaying Sensitivity of the Zero Solution for a Class of Nonlinear Optimal Control Problems", "comment": null, "summary": "We study spatial decay properties of sensitivities in a nonlinear optimal control problem with a graph--structured interaction topology. For a problem with nonlinear decoupled dynamics and quadratic cost, we show that a localized perturbation of the zero reference leads to an optimal trajectory that decays exponentially with the graph distance. The analysis, based on a nonlinear controllability condition, provides a first step toward extending known spatial decay results from linear--quadratic to nonlinear systems. A numerical example illustrates the theoretical findings."}
{"id": "2602.05272", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05272", "abs": "https://arxiv.org/abs/2602.05272", "authors": ["Ashwin Ram", "Aaditya Ramdas"], "title": "Asymptotically optimal sequential change detection for bounded means", "comment": "Preprint", "summary": "We consider the problem of quickest changepoint detection under the Average Run Length (ARL) constraint where the pre-change and post-change laws lie in composite families $\\mathscr{P}$ and $\\mathscr{Q}$ respectively. In such a problem, a massive challenge is characterizing the best possible detection delay when the \"hardest\" pre-change law in $\\mathscr{P}$ depends on the unknown post-change law $Q\\in\\mathscr{Q}$. And typical simple-hypothesis likelihood-ratio arguments for Page-CUSUM and Shiryaev-Roberts do not at all apply here. To that end, we derive a universal sharp lower bound in full generality for any ARL-calibrated changepoint detector in the low type-I error ($γ\\to\\infty$ regime) of the order $\\log(γ)/\\mathrm{KL}_{\\mathrm{inf}}(Q,\\mathscr{P})$. We show achievability of this universal lower bound by proving a tight matching upper bound (with the same sharp $\\logγ$ constant) in the important bounded mean detection setting. In addition, for separated mean shifts, we also we derive a uniform minimax guarantee of this achievability over the alternatives."}
{"id": "2602.05632", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.05632", "abs": "https://arxiv.org/abs/2602.05632", "authors": ["José A. Carrillo", "Yurij Salmaniw", "Antonio León Villares"], "title": "Numerical stationary states for nonlocal Fokker-Planck equations via fixed points of consistency maps", "comment": null, "summary": "We propose a fixed-point-based numerical framework for computing stationary states of nonlocal Fokker-Planck-type equations. Instead of discretising the differential operators directly, we reformulate the stationary problem as a nonlinear fixed-point map built from the original PDE and its nonlocal interaction terms, and solve the resulting finite-dimensional problem with a matrix-free Newton-Krylov method. We compare implementations using the analytic Frechet derivative of this map with a simple central-difference approximation. Because the method does not rely on time evolution, it is agnostic to dynamical stability and can detect both stable and unstable stationary states. Its accuracy is determined mainly by the numerical treatment of convolutions and quadrature, rather than by differentiation stencils. We apply the approach to three model problems with linear diffusion, use existing analytical results to verify the outputs, and reproduce known bifurcation diagrams, as well as new bifurcation behaviour not previously observed in this kind of problem."}
{"id": "2602.05585", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.05585", "abs": "https://arxiv.org/abs/2602.05585", "authors": ["Alexander Clay", "Evgeni Dimitrov", "Rundong Ding", "Alex Fu"], "title": "Long-time asymptotics for Airy wanderer line ensembles", "comment": "54 pages, 2 figures", "summary": "We investigate the long-time behavior of the Airy wanderer line ensembles, an infinite-parameter family of Brownian Gibbsian line ensembles arising as edge-scaling limits of inhomogeneous models in the Kardar--Parisi--Zhang universality class. These ensembles are governed by sequences of nonnegative parameters that encode the asymptotic slopes of the curves at positive and negative infinity. Our main results characterize the fluctuations around this leading-order behavior and establish functional limit theorems for the ensembles near both ends of the spatial axis.\n  We show that, at a macroscopic level, an Airy wanderer line ensemble organizes into groups of finitely many curves sharing a common asymptotic slope. After appropriate centering and scaling, each such group converges to a Dyson Brownian motion whose dimension equals the size of the group. In the case where only finitely many slope parameters are positive, we further prove a curve separation phenomenon: the upper curves follow deterministic parabolic trajectories, while the remaining lower curves remain globally flat and converge to the classical Airy line ensemble."}
{"id": "2602.05025", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.05025", "abs": "https://arxiv.org/abs/2602.05025", "authors": ["Isabel Agostino", "Thibaut Mastrolia"], "title": "Approximation of Singular-Stopping Control Driven by Hawkes Processes via Rescaled MDPs", "comment": null, "summary": "We investigate a singular-optimal stopping stochastic control problem driven by self-exciting dynamics governed by a Hawkes process. In the continuous-time setting, we show that the optimization problem reduces to solving a variational partial differential equation with gradient constraints. We then introduce its discrete-time counterpart, modeled as a Markov Decision Process. We prove that, under an appropriate rescaling procedure, the value function of the discrete-time problem converges to its continuous-time equivalent, implying that the discrete-time optimizers are asymptotically optimal for the continuous-time problem. Finally, we apply these results to an Ornstein-Uhlenbeck stochastic differential equation driven by a Hawkes process with singular control, motivated by optimal power plant investment under cyber threat and we illustrate the theoretical findings through numerical simulations."}
{"id": "2602.05460", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.05460", "abs": "https://arxiv.org/abs/2602.05460", "authors": ["Antoine Godichon-Baggioni", "Bruno Portier", "Guillaume Sallé"], "title": "Complexity reduction in online stochastic Newton methods with potential O(N d) total cost", "comment": null, "summary": "Optimizing smooth convex functions in stochastic settings, where only noisy estimates of gradients and Hessians are available, is a fundamental problem in optimization. While first-order methods possess a low per-iteration cost, their convergence is slow for ill-conditioned problems. Stochastic Newton methods utilize second-order information to correct for local curvature, but the O(d 3 ) per-iteration cost of computing and inverting a full Hessian, where d is the problem dimension, is prohibitive in high dimensions. This paper introduces an online mini-batch stochastic Newton algorithm. The method employs a random masking strategy that selects a subset of Hessian columns at each iteration, substantially reducing the per-step computational cost. This approach allows the algorithm, in the mini-batch setting, to achieve a total computational cost for a single pass over N data points of O(N d), which is comparable to first-order methods while retaining the advantages of second-order information. We establish the almost sure convergence and asymptotic efficiency of the resulting estimator. This property is obtained without requiring iterate averaging, which distinguishes this work from prior analyses."}
{"id": "2602.05698", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05698", "abs": "https://arxiv.org/abs/2602.05698", "authors": ["Raphaël Bulle", "Michel Duprez", "Vanessa Lleras", "Killian Vuillemot"], "title": "A penalized φ-FEM scheme for the Poisson Dirichlet problem", "comment": null, "summary": "In this work, we analyze a penalized variant of the φ-FEM scheme for the Poisson equation with Dirichlet boundary conditions. The φ-FEM is a recently introduced unfitted finite element method based on a level-set description of the geometry, which avoids the need for boundary-fitted meshes. Unlike the original φ-FEM formulation, the method proposed here enforces boundary conditions through a penalization term. This approach has the advantage that the level-set function is required only on the cells adjacent to the boundary in the variational formulation. The scheme is stabilized using a ghost penalty technique. We derive a priori error estimates, showing optimal convergence in the H1 semi-norm and quasi-optimal convergence in the L2 norm under suitable regularity assumptions. Numerical experiments are presented to validate the theoretical results and to compare the proposed method with both the original φ-FEM and the standard fitted finite element method."}
{"id": "2602.05634", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.05634", "abs": "https://arxiv.org/abs/2602.05634", "authors": ["Feng-Yu Wang", "Qiumiao Wen", "Fen-Fen Yang"], "title": "Regularity Estimates for Singular Density Dependent SDEs", "comment": "28pages", "summary": "Consider the density dependent (i.e. Nemytskii-type) SDEs on $\\mathbb R^d$, where the drift $b_t(x,ρ(x),ρ)$ is locally integrable in $(t,x)\\in [0,\\infty)\\times \\mathbb R^d$ and may be singular in the distribution density function $ρ$. The relative/Renyi entropies between two time-marginal distributions are estimated by using the Wasserstein distance of initial distributions. When $d=1$ and $b_t$ decays at $t=0$ with rate $t^{\\frac 1 2+}$, our the relative entropy estimate coincides with the classical entropy-cost inequality for elliptic diffusion processes. To estimate the Renyi entropy, a refined Khasminskii estimate is presented for singular SDEs which may be interesting by itself."}
{"id": "2602.05046", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05046", "abs": "https://arxiv.org/abs/2602.05046", "authors": ["Abhijeet", "Suman Chakravorty"], "title": "Safe Optimal Control using Log Barrier Constrained iLQR", "comment": null, "summary": "This paper presents a constrained iterative Linear Quadratic Regulator (iLQR) framework for nonlinear optimal control problems with box constraints on both states and control inputs. We incorporate logarithmic barrier functions into the stage cost to enforce box constraints (upper and lower bounds on variables), yielding a smooth interior-point formulation that integrates seamlessly with the standard iLQR backward-forward pass. The Hessian contributions from the log barriers are positive definite, preserving and enhancing the positive definiteness of the quadratic approximations in iLQR and providing an intrinsic regularization effect that improves numerical stability and convergence. Moreover, since the negative logarithm is convex, the addition of log barrier terms preserves convexity if the cost is already convex. We further analyze how the barrier-augmented iLQR naturally adapts feedback gains near constraint boundaries. In particular, at convergence, the feedback terms associated with saturated control channels go to zero, recovering a purely feedforward behavior whenever control is saturated. Numerical examples on constrained nonlinear control problems demonstrate that the proposed method reliably respects box constraints and maintains favorable convergence properties."}
{"id": "2602.05592", "categories": ["math.ST", "econ.EM"], "pdf": "https://arxiv.org/pdf/2602.05592", "abs": "https://arxiv.org/abs/2602.05592", "authors": ["Angelo Garate", "Felipe Osorio", "Federico Crudu"], "title": "An invariant modification of the bilinear form test", "comment": "7 pages", "summary": "The invariance properties of certain likelihood-based asymptotic tests as well as their extensions for M-estimation, estimating functions and the generalized method of moments have been well studied. The simulation study reported in Crudu and Osorio [Econ. Lett. 187: 108885, 2020] shows that the bilinear form test is not invariant to one-to-one transformations of the parameter space. This paper provides a set of suitable conditions to establish the invariance property under reparametrization of the bilinear form test for linear or nonlinear hypotheses that arise in extremum estimation which leads to a simple modification of the test statistic. Evidence from a Monte Carlo simulation experiment suggests good performance of the proposed methodology."}
{"id": "2602.05701", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05701", "abs": "https://arxiv.org/abs/2602.05701", "authors": ["Lander Besabe", "Hyesuk Lee"], "title": "Finite element approximation for a reformulation of a 3D fluid-2D plate interaction system", "comment": "39 pages, 4 figures", "summary": "We study a finite element approximation of a coupled fluid-structure interaction consisting of a three-dimensional incompressible viscous fluid governed by the unsteady Stokes equations and a two-dimensional elastic plate. To avoid the use of $H^2-$conforming or nonconforming $\\mathbb{P}_2$-Morley plate elements, the fourth-order plate equation is reformulated into a system of coupled second-order equations using an auxiliary variable. The coupling condition is enforced using a Lagrange multiplier representing the trace of the mean-zero fluid pressure on the interface.\n  We establish well-posedness and stability results for the time-discrete and fully-discrete problems, and derive a priori error estimates. A partitioned domain decomposition algorithm based on a fixed-point iteration is employed for the numerical solution. Numerical experiments verify the theoretical rates of convergence in space and time using manufactured solutions, and demonstrate the applicability of the method to a physical problem."}
{"id": "2602.05886", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.05886", "abs": "https://arxiv.org/abs/2602.05886", "authors": ["Tomás Alcalde López", "Lorca Heeney", "Marcin Lis"], "title": "The Ising magnetisation field and the Gaussian free field", "comment": "76 pages, 8 figures", "summary": "We construct a natural coupling between the continuum Gaussian free field (GFF) and the critical Ising magnetisation field (IMF) in a planar domain. In fact, we show that two independent IMFs with $+$ boundary conditions and two independent IMFs with free boundary conditions are a deterministic function of a single instance of the GFF together with a sequence of independent coin flips. This construction should be seen as an extension of the bosonisation phenomenon, and to the best of our knowledge its existence has not been predicted before.\n  We arrive at our main result in the continuum by studying novel discrete structures. Our starting point is a coupling resembling the Edwards-Sokal coupling between the Ising model and the Fortuin-Kasteleyn random cluster model, though with role of the latter played by a different percolation model obtained from the double random current model. By taking a scaling limit of the coupling at criticality, we obtain a continuum Edwards-Sokal-like representation of the IMFs in terms of certain two-valued sets of the GFF introduced by Aru, Sepúlveda and Werner."}
{"id": "2602.05054", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05054", "abs": "https://arxiv.org/abs/2602.05054", "authors": ["Oğuz Han Altıntaş", "Hamdullah Yücel"], "title": "An Adaptive Framework for Robust Structural Shape Optimization under Uncertainty", "comment": null, "summary": "This work proposes an adaptive framework to solve a robust structural shape optimization problem governed by linear elasticity models that account for uncertainties in the loading and material inputs. A posteriori error estimators are constructed to adjust the sample size, mesh size, and step length. The size of the sample set in the stochastic gradient approximation is dynamically determined depending on the variance of the shape derivative. When constructing the a posteriori error estimator in the physical domain, errors arising from the discretization of the deformation bilinear form, which provides a descent direction, are considered, in addition to errors from the discretization of the linear elasticity system. The step length in gradient-based optimization is also adaptively adjusted by estimating the Lipschitz constant of the stochastic shape derivative. Moreover, an analysis of the existence and distributed-form derivation of the stochastic shape derivative is provided. Finally, the proposed estimation-based adaptive stochastic optimization framework is validated on leg-like structural components, demonstrating its effectiveness in minimizing touchdown compliance under uncertain contact forces."}
{"id": "2602.05727", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05727", "abs": "https://arxiv.org/abs/2602.05727", "authors": ["Ken Mattsson", "David Niemelä", "Andrew R. Winters"], "title": "Optimal boundary closures for diagonal-norm upwind SBP operators", "comment": null, "summary": "By employing non-equispaced grid points near boundaries, boundary-optimized upwind finite-difference operators of orders up to nine are developed. The boundary closures are constructed within a diagonal-norm summation-by-parts (SBP) framework, ensuring linear stability on piecewise curvilinear multiblock grids. Boundary and interface conditions are imposed using either weak enforcement through simultaneous approximation terms (SAT) or strong enforcement via the projection method.\n  The proposed operators yield significantly improved accuracy and computational efficiency compared with SBP operators constructed on equidistant grids. The resulting SBP--SAT and SBP--projection discretizations produce fully explicit systems of ordinary differential equations. The accuracy and stability properties of the proposed operators are demonstrated through numerical experiments for linear hyperbolic problems in one spatial dimension and for the compressible Euler equations in two spatial dimensions."}
{"id": "2602.05898", "categories": ["math.PR", "cs.LG", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2602.05898", "abs": "https://arxiv.org/abs/2602.05898", "authors": ["Mihriban Ceylan", "Anna P. Kwossek", "David J. Prömel"], "title": "Universal approximation with signatures of non-geometric rough paths", "comment": null, "summary": "We establish a universal approximation theorem for signatures of rough paths that are not necessarily weakly geometric. By extending the path with time and its rough path bracket terms, we prove that linear functionals of the signature of the resulting rough paths approximate continuous functionals on rough path spaces uniformly on compact sets. Moreover, we construct the signature of a path extended by its pathwise quadratic variation terms based on general pathwise stochastic integration à la Föllmer, in particular, allowing for pathwise Itô, Stratonovich, and backward Itô integration. In a probabilistic setting, we obtain a universal approximation result for linear functionals of the signature of continuous semimartingales extended by the quadratic variation terms, defined via stochastic Itô integration. Numerical examples illustrate the use of signatures when the path is extended by time and quadratic variation in the context of model calibration and option pricing in mathematical finance."}
{"id": "2602.05155", "categories": ["math.OC", "math.PR", "q-fin.RM"], "pdf": "https://arxiv.org/pdf/2602.05155", "abs": "https://arxiv.org/abs/2602.05155", "authors": ["Heather N. Fogarty", "Sooie-Hoe Loke", "Nicholas F. Marshall", "Enrique A. Thomann"], "title": "Optimal Risk-Sharing Rules in Network-based Decentralized Insurance", "comment": "21 pages, 2 figures", "summary": "This paper studies decentralized risk-sharing on networks. In particular, we consider a model where agents are nodes in a given network structure. Agents directly connected by edges in the network are referred to as friends. We study actuarially fair risk-sharing under the assumption that only friends can share risk, and we characterize the optimal signed linear risk-sharing rule in this network setting. Subsequently, we consider a special case of this model where all the friends of an agent take on an equal share of the agent's risk, and establish a connection to the graph Laplacian. Our results are illustrated with several examples."}
{"id": "2602.05800", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05800", "abs": "https://arxiv.org/abs/2602.05800", "authors": ["Siyuan Lang", "Zhiyue Zhang"], "title": "A Perturbation-Correction Method Based on Local Randomized Neural Networks for Quasi-Linear Interface Problems", "comment": null, "summary": "For quasi-linear interface problems with discontinuous diffusion coefficients, the nonconvex objective functional often leads to optimization stagnation in randomized neural network approximations. This paper Proposes a perturbation-correction framework based on Loacal Randomized Neural Networks(LRaNNs) to overcome this limitation. In the initialization step, a satisisfactory based approximation is obtained by minimizing the original nonconvex residual, typically stagnating at a moderate accuracy level. Subsequently, in the correction step, a correction term is determined by solving a subproblem governed by a perturbation expansion around the base approximation. This reformulation yields a convex optimization problem for the output coefficients, which guarantees rapic convergence. We rigorously derive an a posteriori error estitmate, demonstrating that the total generalization error is governed by the discrete residual norm, quadrature error, and a controllable truncation error. Numerical experiments on nonlinear diffusion problems with irregular moving interfaces, gradient-dependent diffusivities, and high-contrast media demonstrate that the proposed method effectively overcomes the optimization plateau. The correction step yields a significant improvement of 4-6 order of magnitude in L^2 accuracy."}
{"id": "2602.06011", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.06011", "abs": "https://arxiv.org/abs/2602.06011", "authors": ["Tomás Alcalde López", "Avelio Sepúlveda"], "title": "Excursion decomposition of the XOR-Ising model", "comment": "52 pages, 7 figures", "summary": "We study the excursion decomposition of the two-dimensional critical XOR-Ising model with either $+$ or free boundary conditions. In the first part, we construct the decomposition directly in the continuum. This construction relies on the identification of the XOR-Ising field with the cosine or sine of a Gaussian free field (GFF) $φ$ multiplied by $α= 1/\\sqrt{2}$, and is obtained by an appropriate exploration of two-valued level sets of the GFF. More generally, the same construction applies to the fields $:\\! \\cos(αφ) \\!:$ and $:\\! \\sin(αφ) \\!:$ for any $α\\in (0,1)$.\n  In the second part, we show that the continuum excursion decomposition arises as the scaling limit of the double random current decomposition of the critical XOR-Ising model on the square lattice. To this end, we exploit the rich Markovian structure of the discrete decomposition and strengthen the convergence of the double random current height function to the continuum GFF by establishing joint convergence with its cosine and sine. We conjecture that for $α\\in [1/2,\\sqrt{3}/2)$ the continuum excursion decompositions arise as the scaling limit of those of the Ashkin-Teller polarisation field along its critical line."}
{"id": "2602.05179", "categories": ["math.OC", "cs.DC"], "pdf": "https://arxiv.org/pdf/2602.05179", "abs": "https://arxiv.org/abs/2602.05179", "authors": ["Jingyi Zhao", "Linxin Yang", "Haohua Zhang", "Tian Ding"], "title": "From Sequential to Parallel: Reformulating Dynamic Programming as GPU Kernels for Large-Scale Stochastic Combinatorial Optimization", "comment": null, "summary": "A major bottleneck in scenario-based Sample Average Approximation (SAA) for stochastic programming (SP) is the cost of solving an exact second-stage problem for every scenario, especially when each scenario contains an NP-hard combinatorial structure. This has led much of the SP literature to restrict the second stage to linear or simplified models. We develop a GPU-based framework that makes full-fidelity integer second-stage models tractable at scale. The key innovation is a set of hardware-aware, scenario-batched GPU kernels that expose parallelism across scenarios, dynamic-programming (DP) layers, and route or action options, enabling Bellman updates to be executed in a single pass over more than 1,000,000 realizations. We evaluate the approach in two representative SP settings: a vectorized split operator for stochastic vehicle routing and a DP for inventory reinsertion. Implementation scales nearly linearly in the number of scenarios and achieves a one-two to four-five orders of magnitude speedup, allowing far larger scenario sets and reliably stronger first-stage decisions. The computational leverage directly improves decision quality: much larger scenario sets and many more first-stage candidates can be evaluated within fixed time budgets, consistently yielding stronger SAA solutions. Our results show that full-fidelity integer second-stage models are tractable at scales previously considered impossible, providing a practical path to large-scale, realistic stochastic discrete optimization."}
{"id": "2602.05952", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.05952", "abs": "https://arxiv.org/abs/2602.05952", "authors": ["Marco Pilotto", "Luca Bergamaschi", "Angeles Martinez"], "title": "Spectral Analysis of Block Diagonally Preconditioned Multiple Saddle-Point Matrices with Inexact Schur Complements", "comment": null, "summary": "We derive eigenvalue bounds for symmetric block-tridiagonal multiple saddle-point systems preconditioned with block-diagonal Schur complement matrices. This analysis applies to an arbitrary number of blocks and accounts for the case where the Schur complements are approximated, generalizing the findings in [Bergamaschi et al., Linear Algebra and its Applications, 2026]. Numerical experiments are carried out to validate the proposed estimates."}
{"id": "2602.05025", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.05025", "abs": "https://arxiv.org/abs/2602.05025", "authors": ["Isabel Agostino", "Thibaut Mastrolia"], "title": "Approximation of Singular-Stopping Control Driven by Hawkes Processes via Rescaled MDPs", "comment": null, "summary": "We investigate a singular-optimal stopping stochastic control problem driven by self-exciting dynamics governed by a Hawkes process. In the continuous-time setting, we show that the optimization problem reduces to solving a variational partial differential equation with gradient constraints. We then introduce its discrete-time counterpart, modeled as a Markov Decision Process. We prove that, under an appropriate rescaling procedure, the value function of the discrete-time problem converges to its continuous-time equivalent, implying that the discrete-time optimizers are asymptotically optimal for the continuous-time problem. Finally, we apply these results to an Ornstein-Uhlenbeck stochastic differential equation driven by a Hawkes process with singular control, motivated by optimal power plant investment under cyber threat and we illustrate the theoretical findings through numerical simulations."}
{"id": "2602.05306", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05306", "abs": "https://arxiv.org/abs/2602.05306", "authors": ["Macarena Navarro", "Willem-Jan van Hoeve", "Karan Singh"], "title": "Inverse Optimization Without Inverse Optimization: Direct Solution Prediction with Transformer Models", "comment": null, "summary": "We present an end-to-end framework for generating solutions to combinatorial optimization problems with unknown components using transformer-based sequence-to-sequence neural networks. Our framework learns directly from past solutions and incorporates the known components, such as hard constraints, via a constraint reasoning module, yielding a constrained learning scheme. The trained model generates new solutions that are structurally similar to past solutions and are guaranteed to respect the known constraints. We apply our approach to three combinatorial optimization problems with unknown components: the knapsack problem with an unknown reward function, the bipartite matching problem with an unknown objective function, and the single-machine scheduling problem with release times and unknown precedence constraints, with the objective of minimizing average completion time. We demonstrate that transformer models have remarkably strong performance and often produce near-optimal solutions in a fraction of a second. They can be particularly effective in the presence of more complex underlying objective functions and unknown implicit constraints compared to an LSTM-based alternative and inverse optimization."}
{"id": "2602.05155", "categories": ["math.OC", "math.PR", "q-fin.RM"], "pdf": "https://arxiv.org/pdf/2602.05155", "abs": "https://arxiv.org/abs/2602.05155", "authors": ["Heather N. Fogarty", "Sooie-Hoe Loke", "Nicholas F. Marshall", "Enrique A. Thomann"], "title": "Optimal Risk-Sharing Rules in Network-based Decentralized Insurance", "comment": "21 pages, 2 figures", "summary": "This paper studies decentralized risk-sharing on networks. In particular, we consider a model where agents are nodes in a given network structure. Agents directly connected by edges in the network are referred to as friends. We study actuarially fair risk-sharing under the assumption that only friends can share risk, and we characterize the optimal signed linear risk-sharing rule in this network setting. Subsequently, we consider a special case of this model where all the friends of an agent take on an equal share of the agent's risk, and establish a connection to the graph Laplacian. Our results are illustrated with several examples."}
{"id": "2602.05357", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05357", "abs": "https://arxiv.org/abs/2602.05357", "authors": ["Chao Ding", "Ebrahim Sarabi", "Shiwei Wang"], "title": "Twice Epi-Differentiability of Spectral Functions and its applications", "comment": "28 pages", "summary": "Second-order variational properties have been shown to play important theoretical and numerical roles for different classes of optimization problems. Among such properties, twice epi-differentiability has a special place because of its ubiquitous presence in various classes of extended-real-valued functions that are important for optimization problems. We provide a useful characterization of this property for spectral functions by demonstrating that it can be characterized via the same property of the symmetric part of the spectral representation of an eigenvalue function. Our approach allows us to bypass the rather restrictive convexity assumption, used in many recent works that targeted second-order variational properties of spectral functions. By this theoretical tool, several applications on the proto-differentiability of subgradient mappings, the directional differentiability of the proximal mapping of spectral functions are achieved. We finally use our established theory to study twice epi-differentiability of leading eigenvalue functions and practical regularization terms that have important applications in statistics and the robust PCA."}
{"id": "2602.05272", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05272", "abs": "https://arxiv.org/abs/2602.05272", "authors": ["Ashwin Ram", "Aaditya Ramdas"], "title": "Asymptotically optimal sequential change detection for bounded means", "comment": "Preprint", "summary": "We consider the problem of quickest changepoint detection under the Average Run Length (ARL) constraint where the pre-change and post-change laws lie in composite families $\\mathscr{P}$ and $\\mathscr{Q}$ respectively. In such a problem, a massive challenge is characterizing the best possible detection delay when the \"hardest\" pre-change law in $\\mathscr{P}$ depends on the unknown post-change law $Q\\in\\mathscr{Q}$. And typical simple-hypothesis likelihood-ratio arguments for Page-CUSUM and Shiryaev-Roberts do not at all apply here. To that end, we derive a universal sharp lower bound in full generality for any ARL-calibrated changepoint detector in the low type-I error ($γ\\to\\infty$ regime) of the order $\\log(γ)/\\mathrm{KL}_{\\mathrm{inf}}(Q,\\mathscr{P})$. We show achievability of this universal lower bound by proving a tight matching upper bound (with the same sharp $\\logγ$ constant) in the important bounded mean detection setting. In addition, for separated mean shifts, we also we derive a uniform minimax guarantee of this achievability over the alternatives."}
{"id": "2602.05361", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05361", "abs": "https://arxiv.org/abs/2602.05361", "authors": ["Huanqing Dong", "Jingtao Shi"], "title": "Relationship between MP and DPP for Risk-Sensitive Stochastic Optimal Control Problems: Viscosity Solution Framework", "comment": "32 pages", "summary": "In this paper, we study the relationship between general maximum principle and dynamic programming principle for risk-sensitive stochastic optimal control problems, where the control domain is not necessarily convex. The original problem is equivalent to a stochastic recursive optimal control problem of a forward-backward system with quadratic generators. Relations among the adjoint processes, the generalized Hamiltonian function and the value function are proved under the framework of viscosity solutions. Some examples are given to illustrate the theoretical results."}
{"id": "2602.05976", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.05976", "abs": "https://arxiv.org/abs/2602.05976", "authors": ["Matt Jacobs", "Bohan Zhou"], "title": "The Signed Wasserstein Barycenter Problem", "comment": null, "summary": "Barycenter problems encode important geometric information about a metric space. While these problems are typically studied with positive weight coefficients associated to each distance term, more general signed Wasserstein barycenter problems have recently drawn a great deal of interest. These mixed sign problems have appeared in statistical inference setting as a way to generalize least squares regression to measure valued outputs and have appeared in numerical methods to improve the accuracy of Wasserstein gradient flow solvers. Unfortunately, the presence of negatively weighted distance terms destroys the Euclidean convexity of the unsigned problem, resulting in a much more challenging optimization task. The main focus of this work is to study properties of the signed barycenter problem for a general transport cost with a focus on establishing uniqueness of solutions. In particular, when there is only one positive weight, we extend the uniqueness result of Tornabene et al. (2025) to any cost satisfying a certain convexity property. In the case of arbitrary weights, we introduce the dual problem in terms of Kantorovich potentials and provide a sufficient condition for a stationary solution of the dual problem to induce an optimal signed barycenter."}
{"id": "2602.05364", "categories": ["math.OC", "quant-ph"], "pdf": "https://arxiv.org/pdf/2602.05364", "abs": "https://arxiv.org/abs/2602.05364", "authors": ["Raoul Heese", "Timothée Leleu", "Sam Reifenstein", "Christian Nietner", "Yoshihisa Yamamoto"], "title": "Hybrid Quantum-Classical Optimization for Multi-Objective Supply Chain Logistics", "comment": "27 pages, 16 figures", "summary": "A multi-objective logistics optimization problem from a real-world supply chain is formulated as a Quadratic Unconstrained Binary Optimization Problem (QUBO) that minimizes cost, emissions, and delivery time, while maintaining target distributions of supplier workshare. The model incorporates realistic constraints, including part dependencies, double sourcing, and multimodal transport. Two hybrid quantum-classical solvers are proposed: a structure-aware informed tree search (IQTS) and a modular bilevel framework (HBS), combining quantum subroutines with classical heuristics. Experimental results on IonQ's Aria-1 hardware demonstrate a methodology to map real-world logistics problems onto emerging combinatorial optimization-specialized hardware, yielding high-quality, Pareto-optimal solutions."}
{"id": "2602.05376", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.05376", "abs": "https://arxiv.org/abs/2602.05376", "authors": ["Hongyi Li", "Jun Xu", "Jinfeng Liu"], "title": "Distributed Model Predictive Control for Energy and Comfort Optimization in Large Buildings Using Piecewise Affine Approximation", "comment": null, "summary": "The control of large buildings encounters challenges in computational efficiency due to their size and nonlinear components. To address these issues, this paper proposes a Piecewise Affine (PWA)-based distributed scheme for Model Predictive Control (MPC) that optimizes energy and comfort through PWA-based quadratic programming. We utilize the Alternating Direction Method of Multipliers (ADMM) for effective decomposition and apply the PWA technique to handle the nonlinear components. To solve the resulting large-scale nonconvex problems, the paper introduces a convex ADMM algorithm that transforms the nonconvex problem into a series of smaller convex problems, significantly enhancing computational efficiency. Furthermore, we demonstrate that the convex ADMM algorithm converges to a local optimum of the original problem. A case study involving 36 zones validates the effectiveness of the proposed method. Our proposed method reduces execution time by 86\\% compared to the centralized version."}
{"id": "2602.05417", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05417", "abs": "https://arxiv.org/abs/2602.05417", "authors": ["Mattia Solla", "Johannes O. Royset"], "title": "Optimistic Bilevel Optimization with Composite Lower-Level Problem", "comment": "37 pages. Submitted to Mathematics of Operations Research", "summary": "This paper introduces a novel double regularization scheme for bilevel optimization problems whose lower-level problem is composite and convex, but not necessarily strongly convex, in the lower-level variable. The analysis focuses on the primal-dual solution mapping of the regularized lower-level problem and exploits its properties to derive an almost-everywhere formula for the gradient of the regularized hyper-objective under mild assumptions. The paper then establishes conditions under which the hyper-objective of the actual problem is well defined and shows that its gradient can be approximated by the gradient of the regularized hyper-objective. Building on these results, a gradient sampling-based algorithm computes approximately stationary points of the regularized hyper-objective, and we prove its convergence to stationary points of the actual problem. Two numerical examples from machine learning demonstrate the proposed approach."}
{"id": "2602.05457", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.05457", "abs": "https://arxiv.org/abs/2602.05457", "authors": ["Rafael Correa", "Abderrahim Hantoute", "Marco A. López"], "title": "Relaxation in infinite convex programming under Slater-type regularity conditions", "comment": null, "summary": "The main purpose of this paper is to close the gap between the optimal values of an infinite convex program and that of its biconjugate relaxation. It is shown that Slater and continuity-type conditions guarantee such a zero-duality gap. The approach uses calculus rules for the conjugation and biconjugation of the sum and pointwise supremum operations. A second important objective of this work is to exploit these results on relaxation by applying them in the context of duality theory."}
{"id": "2602.05489", "categories": ["math.OC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05489", "abs": "https://arxiv.org/abs/2602.05489", "authors": ["Kevin Kurian Thomas Vaidyan", "Michael P. Friedlander", "Ahmet Alacaoglu"], "title": "Convergence Rate of the Last Iterate of Stochastic Proximal Algorithms", "comment": null, "summary": "We analyze two classical algorithms for solving additively composite convex optimization problems where the objective is the sum of a smooth term and a nonsmooth regularizer: proximal stochastic gradient method for a single regularizer; and the randomized incremental proximal method, which uses the proximal operator of a randomly selected function when the regularizer is given as the sum of many nonsmooth functions. We focus on relaxing the bounded variance assumption that is common, yet stringent, for getting last iterate convergence rates. We prove the $\\widetilde{O}(1/\\sqrt{T})$ rate of convergence for the last iterate of both algorithms under componentwise convexity and smoothness, which is optimal up to log terms. Our results apply directly to graph-guided regularizers that arise in multi-task and federated learning, where the regularizer decomposes as a sum over edges of a collaboration graph."}
{"id": "2602.05504", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05504", "abs": "https://arxiv.org/abs/2602.05504", "authors": ["Julien Hermant", "Jean-François Aujol", "Charles Dossal", "Lorick Huang", "Aude Rondepierre"], "title": "Continuized Nesterov Momentum Achieves the $O(\\varepsilon^{-7/4})$ Complexity without Additional Mechanisms", "comment": null, "summary": "For first-order optimization of non-convex functions with Lipschitz continuous gradient and Hessian, the best known complexity for reaching an $\\varepsilon$-approximation of a stationary point is $O(\\varepsilon^{-7/4})$. Existing algorithms achieving this bound are based on momentum, but are always complemented with safeguard mechanisms, such as restarts or negative-curvature exploitation steps. Whether such mechanisms are fundamentally necessary has remained an open question. Leveraging the continuized method, we show that a Nesterov momentum algorithm with stochastic parameters alone achieves the same complexity in expectation. This result holds up to a multiplicative stochastic factor with unit expectation and a restriction to a subset of the realizations, both of which are independent of the objective function. We empirically verify that these constitute mild limitations."}
{"id": "2602.05531", "categories": ["math.OC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05531", "abs": "https://arxiv.org/abs/2602.05531", "authors": ["Ahmet Alacaoglu", "Jun-Hyun Kim"], "title": "Solving Stochastic Variational Inequalities without the Bounded Variance Assumption", "comment": null, "summary": "We analyze algorithms for solving stochastic variational inequalities (VI) without the bounded variance or bounded domain assumptions, where our main focus is min-max optimization with possibly unbounded constraint sets. We focus on two classes of problems: monotone VIs; and structured nonmonotone VIs that admit a solution to the weak Minty VI. The latter assumption allows us to solve structured nonconvex-nonconcave min-max problems. For both classes of VIs, to make the expected residual norm less than $\\varepsilon$, we show an oracle complexity of $\\widetilde{O}(\\varepsilon^{-4})$, which is the best-known for constrained VIs. In our setting, this complexity had been obtained with the bounded variance assumption in the literature, which is not even satisfied for bilinear min-max problems with an unbounded domain. We obtain this complexity for stochastic oracles whose variance can grow as fast as the squared norm of the optimization variable."}
{"id": "2602.05591", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.05591", "abs": "https://arxiv.org/abs/2602.05591", "authors": ["Chin Pang Ho", "Marek Petrik", "Wolfram Wiesemann"], "title": "Efficient Algorithms for Robust Markov Decision Processes with $s$-Rectangular Ambiguity Sets", "comment": null, "summary": "Robust Markov decision processes (MDPs) have attracted significant interest due to their ability to protect MDPs from poor out-of-sample performance in the presence of ambiguity. In contrast to classical MDPs, which account for stochasticity by modeling the dynamics through a stochastic process with a known transition kernel, a robust MDP additionally accounts for ambiguity by optimizing against the most adverse transition kernel from an ambiguity set constructed via historical data. In this paper, we develop a unified solution framework for a broad class of robust MDPs with $s$-rectangular ambiguity sets, where the most adverse transition probabilities are considered independently for each state. Using our algorithms, we show that $s$-rectangular robust MDPs with $1$- and $2$-norm as well as $φ$-divergence ambiguity sets can be solved several orders of magnitude faster than with state-of-the-art commercial solvers, and often only a logarithmic factor slower than classical MDPs. We demonstrate the favorable scaling properties of our algorithms on a range of synthetically generated as well as standard benchmark instances."}
{"id": "2602.05622", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05622", "abs": "https://arxiv.org/abs/2602.05622", "authors": ["Taha El Bakkali", "El Mahdi Chayti", "Omar Saadi"], "title": "Nonsmooth Optimization with Zeroth Order Comparison Feedback", "comment": null, "summary": "We study unconstrained optimization problems of nonsmooth, nonconvex Lipschitz functions, using only noisy pairwise comparisons governed by a known link function. Our goal is to compute a $(δ,\\varepsilon)$-Goldstein stationary point. We combine randomized smoothing with a novel unbiased reduction from comparisons to local value differences. By leveraging a Russian-roulette truncation on the Bernoulli-product expansion of the inverse link, we construct an exactly unbiased estimator for directional differences. This estimator has finite expected cost and variance scaling quadratically with the function gap, $\\mathcal{O}(B^2)$, under mild conditions. Plugging this into the smoothed gradient identity enables a standard nonconvex SGD analysis, yielding explicit comparison-complexity bounds for common symmetric links such as logistic, probit, and cauchit."}
{"id": "2602.05631", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05631", "abs": "https://arxiv.org/abs/2602.05631", "authors": ["Linshuo Jiang", "Nachuan Xiao", "Xin Liu"], "title": "A Smooth Locally Exact Penalty Method for Optimization Problems over Generalized Stiefel Manifolds", "comment": "23 pages, 2 figures", "summary": "In this paper, we consider a class of optimization problems constrained to the generalized Stiefel manifold. Such problems are fundamental to a wide range of real-world applications, including generalized canonical correlation analysis, linear discriminant analysis, and electronic structure calculations. Existing works mainly focuses on cases where the generalized orthogonality constraint is induced by a symmetric positive definite matrix M, a setting where the geometry essentially reduces to that of the standard Stiefel manifold. However, many practical scenarios involve a singular M, which introduces significant analytical and computational challenges. Therefore, we propose a Smooth Locally Exact Penalty model (SLEP) and establish its equivalence to the original problem in the aspect of stationary points under a finitly large penalty parameter. This penalty model admits the direct application of various unconstrained optimization techniques, with convergence guarantees inherited from established results. Compared to Riemannian optimization approaches, our proposed penalty mode eliminates the need for retractions and vector transports, hence significantly reducing per-iteration computational costs. Extensive numerical experiments validate our theoretical results and demonstrate the effectiveness and practical potential of the proposed penalty model SLEP."}
{"id": "2602.05684", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05684", "abs": "https://arxiv.org/abs/2602.05684", "authors": ["Helmut Gfrerer", "Jiri V. Outrata"], "title": "Characterizations of the Aubin property of the KKT-mapping in composite optimization by SC derivatives and quadratic bundles", "comment": null, "summary": "For general set-valued mappings, the Aubin property is ultimately tied to limiting coderivatives by the Mordukhovich criterion. Likewise, the existence of single-valued Lipschitzian localizations is related to strict graphical derivatives. In this paper we will show that for the special case of the KKT-mapping from composite optimization, the Aubin property and the existence of single-valued Lipschitzian localizations can be characterized by SC derivatives and quadratic bundles, respectively, which are easier accessible than limiting coderivatives and strict graphical derivatives."}
{"id": "2602.05699", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05699", "abs": "https://arxiv.org/abs/2602.05699", "authors": ["Daniel Dadush", "Stefan Kober", "Zhuan Khye Koh"], "title": "On Circuit Diameter and Straight Line Complexity", "comment": null, "summary": "The circuit diameter of a polyhedron is the maximum length (number of steps) of a shortest circuit walk between any two vertices of the polyhedron. Introduced by Borgwardt, Finhold and Hemmecke (SIDMA 2015), it is a relaxation of the combinatorial diameter of a polyhedron. These two notions of diameter lower bound the number of iterations taken by circuit augmentation algorithms and the simplex method respectively for solving linear programs.\n  Recently, an analogous lower bound for path-following interior point methods was introduced by Allamigeon, Dadush, Loho, Natura and Végh (SICOMP 2025). Termed straight line complexity, it refers to the minimum number of pieces of any piecewise linear curve that traverses a specified neighborhood of the central path.\n  In this paper, we study the relationship between circuit diameter and straight line complexity. For a polyhedron $P:=\\{x\\in \\mathbb{R}^n: Ax = b, x\\geq \\mathbf{0}\\}$, we show that its circuit diameter is up to a $\\mathrm{poly}(n)$ factor upper bounded by the straight line complexity of linear programs defined over $P$. This yields a strongly polynomial circuit diameter bound for polyhedra with at most 2 variables per inequality. We also give a circuit augmentation algorithm with matching iteration complexity."}
{"id": "2602.05799", "categories": ["math.OC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.05799", "abs": "https://arxiv.org/abs/2602.05799", "authors": ["Nele H. Amiri", "Sean R. Sinclair", "Maximiliano Udenio"], "title": "Non-Stationary Inventory Control with Lead Times", "comment": null, "summary": "We study non-stationary single-item, periodic-review inventory control problems in which the demand distribution is unknown and may change over time. We analyze how demand non-stationarity affects learning performance across inventory models, including systems with demand backlogging or lost-sales, both with and without lead times. For each setting, we propose an adaptive online algorithm that optimizes over the class of base-stock policies and establish performance guarantees in terms of dynamic regret relative to the optimal base-stock policy at each time step. Our results reveal a sharp separation across inventory models. In backlogging systems and lost-sales models with zero lead time, we show that it is possible to adapt to demand changes without incurring additional performance loss in stationary environments, even without prior knowledge of the demand distributions or the number of demand shifts. In contrast, for lost-sales systems with positive lead times, we establish weaker guarantees that reflect fundamental limitations imposed by delayed replenishment in combination with censored feedback. Our algorithms leverage the convexity and one-sided feedback structure of inventory costs to enable counterfactual policy evaluation despite demand censoring. We complement the theoretical analysis with simulation results showing that our methods significantly outperform existing benchmarks."}
{"id": "2602.05893", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.05893", "abs": "https://arxiv.org/abs/2602.05893", "authors": ["Marianna De Santis", "Gabriele Eichfelder", "Margherita Porcelli"], "title": "Objective-Function Free Multi-Objective Optimization: Rate of Convergence and Performance of an Adagrad-like algorithm", "comment": null, "summary": "We propose an Adagrad-like algorithm for multi-objective unconstrained optimization that relies on the computation of a common descent direction only. Unlike classical local algorithms for multi-objective optimization, our approach does not rely on the dominance property to accept new iterates, which allows for a flexible and function-free optimization framework. New points are obtained using an adaptive stepsize that does not require neither knowledge of Lipschitz constants nor the use of line search procedures. The rate of convergence is analyzed and is shown to be $\\mathcal{O}(1 / \\sqrt{ k+1})$ with respect to the norm of the common descent direction. The method is extensively validated on a broad class of unconstrained multi-objective problems and simple multi-task learning instances, and compared against a first-order line search algorithm. Additionally, we present a preliminary study of the behavior under noisy multi-objective settings, highlighting the robustness of the method."}
{"id": "2602.05974", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.05974", "abs": "https://arxiv.org/abs/2602.05974", "authors": ["Akul Bansal", "Simge Küçükyavuz"], "title": "Normalization of ReLU Dual for Cut Generation in Stochastic Mixed-Integer Programs", "comment": null, "summary": "We study the Rectified Linear Unit (ReLU) dual, an existing dual formulation for stochastic programs that reformulates non-anticipativity constraints using ReLU functions to generate tight, non-convex, and mixed-integer representable cuts. While this dual reformulation guarantees convergence with mixed-integer state variables, it admits multiple optimal solutions that can yield weak cuts. To address this issue, we propose normalizing the dual in the extended space to identify solutions that yield stronger cuts. We prove that the resulting normalized cuts are tight and Pareto-optimal in the original state space. We further compare normalization with existing regularization-based approaches for handling dual degeneracy and explain why normalization offers key advantages. In particular, we show that normalization can recover any cut obtained via regularization, whereas the converse does not hold. Computational experiments demonstrate that the proposed approach outperforms existing methods by consistently yielding stronger cuts and reducing solution times on harder instances."}
{"id": "2602.05976", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.05976", "abs": "https://arxiv.org/abs/2602.05976", "authors": ["Matt Jacobs", "Bohan Zhou"], "title": "The Signed Wasserstein Barycenter Problem", "comment": null, "summary": "Barycenter problems encode important geometric information about a metric space. While these problems are typically studied with positive weight coefficients associated to each distance term, more general signed Wasserstein barycenter problems have recently drawn a great deal of interest. These mixed sign problems have appeared in statistical inference setting as a way to generalize least squares regression to measure valued outputs and have appeared in numerical methods to improve the accuracy of Wasserstein gradient flow solvers. Unfortunately, the presence of negatively weighted distance terms destroys the Euclidean convexity of the unsigned problem, resulting in a much more challenging optimization task. The main focus of this work is to study properties of the signed barycenter problem for a general transport cost with a focus on establishing uniqueness of solutions. In particular, when there is only one positive weight, we extend the uniqueness result of Tornabene et al. (2025) to any cost satisfying a certain convexity property. In the case of arbitrary weights, we introduce the dual problem in terms of Kantorovich potentials and provide a sufficient condition for a stationary solution of the dual problem to induce an optimal signed barycenter."}
