{"id": "2602.06152", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.06152", "abs": "https://arxiv.org/abs/2602.06152", "authors": ["Jörg Nick"], "title": "The modulated Fourier expansion for waves propagating through time-modulated media", "comment": "28 pages, 7 figures", "summary": "Controlling waves by actively changing the material parameters of a medium enables the development of new acoustic and electrical devices. Modulating the material breaks classical properties like reciprocity and the conservation of energy, which complicates the mathematical analysis. Without a limiting amplitude principle, time-harmonic formulations are generally inapplicable. The present manuscript develops an alternative tool for the time-modulated acoustic wave equation, that is based on a modulated Fourier expansion (MFE). The solution is characterized by multiple smoothly varying coefficient functions, which solve a coupled system of evolutionary partial differential equations with temporally constant coefficients. For small-amplitude fast-time modulations, this system of evolutionary partial differential equations is shown to possess a smoothly varying solution, which characterizes the exact solution up to a small defect.\n  Discretization of the derived coupled system yields integrators that are stable and accurate when larger time steps are used, compared to those schemes that are applied to the time-modulated acoustic wave equation directly. Numerical experiments illustrate the theoretical results and the use of the approach."}
{"id": "2602.06284", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.06284", "abs": "https://arxiv.org/abs/2602.06284", "authors": ["Patrick Guidotti"], "title": "Geometric Kernel Interpolation and Regression", "comment": "21 pages, 8 figures, 6 tables", "summary": "Exploiting the variational interpretation of kernel interpolation we exhibit a direct connection between interpolation and regression, where interpolation appears as a limiting case of regression. By applying this framework to point clouds or samples of smooth manifolds (hypersurfaces, in particular), we show how fundamental geometric quantities such as tangent plane and principal curvatures can be computed numerically using a kernel based (approximate) level set function (often a defining function) for smooth hypersurfaces. In the case of point clouds, the approach generates an interpolated hypersurface, which is an approximation of the underlying manifold when the cloud is a sample of it. It is shown how the geometric quantities obtained can be used in the numerical approximation/computation of geometric operators like the surface gradient or the Laplace-Beltrami operator in the spirit of kernel based meshfree methods. Kernel based interpolation can be extremely ill-posed, especially when using smooth kernels, and the regression approximation offers a natural regularization that proves also quite useful when dealing with geometric or functional data that are affected by errors or noise."}
{"id": "2602.06491", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.06491", "abs": "https://arxiv.org/abs/2602.06491", "authors": ["Xueqi Wen", "Guozhen Li", "Yuanping Cui", "Xiaoyue Li"], "title": "Strong convergence rate of the explicit adaptive time-stepping methods for stochastic diffusion systems with locally Lipschitz coefficients", "comment": "40 pages, 8 figures, 1 table", "summary": "This paper proposes an adaptive time-stepping mothods for stochastic diffusion systems whose drift and diffusion coefficients are locally Lipschitz continuous and may exhibit polynomial growth. By controlling the growth of both the drift and diffusion coefficients, we give the choice of the state-dependent adaptive timestep and establish strong convergence of the proposed scheme with the optimal order $1/2$. The performance of the adaptive time-stepping scheme is compared with several widely used explicit and implicit schemes, including tamed EM, truncated EM, and backward EM schemes. Numerical experiments on stiff, non-stiff and high-dimensional stochastic diffusion systems verify the improved computational efficiency of the proposed scheme and validate the theoretical results."}
{"id": "2602.06513", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.06513", "abs": "https://arxiv.org/abs/2602.06513", "authors": ["Julio Careaga", "Patrick Ersing", "Julian Koellermeier", "Andrew R. Winters"], "title": "Entropy analysis and entropy stable DG methods for the shallow water moment equations", "comment": null, "summary": "We demonstrate that the shallow water moment equations satisfy an auxiliary entropy conservation law, where the entropy function corresponds to the total energy. Additionally, we show that the classical Newtonian slip friction and Manning friction terms are entropy dissipative with respect to the developed entropy variables. The results from the continuous entropy analysis are used to construct an entropy stable and well-balanced nodal discontinuous Galerkin spectral element method for the spatial approximation. Key to ensure the entropy stability of the scheme is the derivation of entropy conservative numerical fluxes that satisfy a discrete version of the entropy flux compatibility condition. Finally, numerical examples demonstrate the performance of the scheme and validate the theoretical results."}
{"id": "2602.06175", "categories": ["math.ST", "cs.AI", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.06175", "abs": "https://arxiv.org/abs/2602.06175", "authors": ["Kaushik Sinha", "Christopher Tosh"], "title": "Optimal rates for density and mode estimation with expand-and-sparsify representations", "comment": "Accepted at AISTATS 2026", "summary": "Expand-and-sparsify representations are a class of theoretical models that capture sparse representation phenomena observed in the sensory systems of many animals. At a high level, these representations map an input $x \\in \\mathbb{R}^d$ to a much higher dimension $m \\gg d$ via random linear projections before zeroing out all but the $k \\ll m$ largest entries. The result is a $k$-sparse vector in $\\{0,1\\}^m$. We study the suitability of this representation for two fundamental statistical problems: density estimation and mode estimation. For density estimation, we show that a simple linear function of the expand-and-sparsify representation produces an estimator with minimax-optimal $\\ell_{\\infty}$ convergence rates. In mode estimation, we provide simple algorithms on top of our density estimator that recover single or multiple modes at optimal rates up to logarithmic factors under mild conditions."}
{"id": "2602.06234", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.06234", "abs": "https://arxiv.org/abs/2602.06234", "authors": ["Roman Vershynin"], "title": "A friendly proof of the Berry-Esseen theorem", "comment": "9 pages", "summary": "A gem of classical probability, the Berry-Esseen theorem provides a non-asymptotic form of the central limit theorem. This note gives a friendly and intuitive exposition of the classical Fourier-analytic proof of Esseen's smoothing inequality and, as a consequence, a general Berry-Esseen theorem for non-i.i.d random variables. The exposition is suitable for use in a basic graduate course in probability."}
{"id": "2602.06178", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06178", "abs": "https://arxiv.org/abs/2602.06178", "authors": ["Rocio Balderrama", "Ignacio Ceresa Dussel", "Constanza Sanchez de la Vega"], "title": "Optimal Control Strategies for Epidemic Dynamics: Integrating SIR-SI and Lotka--Volterra Models", "comment": "3 figures, 15 pages", "summary": "In this work we present a mathematical model that integrates the epidemiological dynamics of a vector-borne disease (SIR-SI) with Lotka Volterra predator prey ecological interactions. The study analyzes how the presence of natural predators acts as a biological control mechanism to regulate the vector population and, consequently, disease transmission in host. \nWe introduce the concept of the ecological reproduction number, a threshold that links the amplitude of predator prey cycles to disease persistence, showing that natural control depends critically on the ratio between the maximum vector density and the minimum predator density. In scenarios where natural control is insufficient, we formulate an optimal control problem based on the release of predators. Using the Pontryagin Maximum Principle, we characterize the optimal strategy that minimizes the cumulative number of infected individuals and intervention costs, while simultaneously maximizing the susceptible host population at the end of the time horizon. Numerical simulations validate the effectiveness of the model, showing that external intervention mitigates the epidemic peak and stabilizes the system against the natural oscillations of biological populations."}
{"id": "2602.06614", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.06614", "abs": "https://arxiv.org/abs/2602.06614", "authors": ["Fabio Nobile", "Sébastien Riffaud", "Thomas Trigo Trindade"], "title": "Dynamical Low-Rank Ensemble Kalman filter for State/Parameter estimation", "comment": "26 pages, 14 figures, 6 tables", "summary": "We propose a Dynamical Low-Rank Ensemble Kalman Filter (DLR-ENKF) for efficient joint state-parameter estimation in high-dimensional dynamical systems. The method extends the DLR-ENKF formulation of arXiv:2509.11210 to the augmented state-parameter framework, tracking the filtering density within a dynamically evolving low-dimensional subspace. Key developments include a time-integration strategy that combines the Basis Update & Galerkin scheme with forecast/analysis discretisation, and a DEIM-based hyper-reduction technique for efficient evaluation of nonlinear terms. We demonstrate the effectiveness, robustness, and computational advantages of the proposed approach on benchmark problems. The results highlight the potential of dynamically evolving reduced bases to achieve accurate filtering and parameter estimation at reduced computational cost."}
{"id": "2602.06360", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.06360", "abs": "https://arxiv.org/abs/2602.06360", "authors": ["Jeongho Lee", "Junmo Song"], "title": "Robust Bayesian estimation in conditionally heteroscedastic time series models", "comment": "31 pages, 5 figures", "summary": "Outliers can seriously distort statistical inference by inducing excessive sensitivity in the likelihood function, thereby compromising the reliability of Bayesian estimation. To address this issue, we develop a robust Bayesian estimation method for conditionally heteroscedastic time series models by extending the density power divergence (DPD) framework to the Bayesian setting. The resulting DPD-based posterior distribution, controlled by a tuning parameter, achieves a smooth balance between efficiency and robustness. We establish the asymptotic properties of the proposed estimator; specifically, the DPD-based posterior is shown to satisfy a Bernstein-von Mises type theorem, converging to a normal distribution centered at the minimum DPD estimator (MDPDE). Furthermore, the corresponding Bayes estimator, defined as the posterior mean under the DPD-based posterior (EDPE), is asymptotically equivalent to the MDPDE. Monte Carlo simulations based on GARCH(1,1) models confirm that the proposed EDPE performs well under both uncontaminated and contaminated data, maintaining robustness where the ordinary Bayes estimator becomes severely biased. An empirical application to BTC-USD returns further demonstrates the practical advantages of the proposed robust Bayesian framework for financial time series analysis."}
{"id": "2602.06388", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.06388", "abs": "https://arxiv.org/abs/2602.06388", "authors": ["Mathav Murugan"], "title": "A simplified characterization of stable-like heat kernel estimates", "comment": "30 pages; comments are welcome", "summary": "We study heat kernel estimates for symmetric pure jump processes on general metric measure spaces. Building on recent progress in the local setting due to S.~Eriksson-Bique, we develop a non-local version of the Whitney blending technique and use it to relate stable-like heat kernel estimates to capacity upper bounds. Under two-sided stable-like bounds on the jump kernel, we show that a capacity upper bound across annuli implies a cutoff Sobolev inequality, and we obtain a characterization of stable-like heat kernel estimates in terms of these conditions. As a consequence, we give an affirmative answer to a conjecture of A. Grigor'yan, E. Hu, and J. Hu."}
{"id": "2602.06186", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.06186", "abs": "https://arxiv.org/abs/2602.06186", "authors": ["Fernando García-Castaño", "Miguel Ángel Melguizo-Padial"], "title": "Process-Based Lagrange Multipliers for Nonconvex Set-Valued Optimization", "comment": null, "summary": "We develop a Lagrange multiplier theory for nonconvex set-valued optimization problems under Lipschitz-type regularity conditions. Instead of classical continuous linear functionals, we introduce closed convex processes -- set-valued mappings whose graphs are closed convex cones -- as generalized Lagrange multipliers. This geometric framework extends separation principles beyond convexity and differentiability. We establish the existence of multiplier processes under verifiable assumptions, including Lipschitz regularity at a reference point, the existence of a bounded base of the ordering cone, and a nondegeneracy condition ensuring proper isolation of optimal values. These processes preserve global optimality: nondominated (respectively, minimal) solutions of the primal problem remain nondominated (respectively, minimal) in the penalized problem. In the scalar case, we obtain a one-to-one correspondence between multiplier processes and lower semicontinuous sublinear functions, yielding exact penalty formulations without additional constraint qualifications. An infinite-dimensional example shows that interiority conditions on the ordering cone, while sufficient, are not necessary. Applications to set-valued vector equilibrium problems are also discussed."}
{"id": "2602.06677", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.06677", "abs": "https://arxiv.org/abs/2602.06677", "authors": ["Ralf Hielscher", "Erik Wuensche"], "title": "On the Role of the Double Fourier Sphere Method in Fast Algorithms on SO(3)", "comment": "22 pages, 2 figures", "summary": "We analyze the Double Fourier Sphere (DFS) method on the rotation group $\\mathcal{SO}(3)$ in the frequency domain and demonstrate its central role in fast algorithms. Fast Fourier algorithms on $\\mathcal{SO}(3)$ are commonly formulated as a Wigner transform - mapping harmonic to Fourier coefficients - followed by a Fourier transform. We revisit this formulation and interpret the Wigner transform as an explicit realization of the DFS method, lifting functions from $\\mathcal{SO}(3)$ to $\\mathbb{T}^3$. In this context, we analyze the Sobolev regularity loss induced by this lifting. Furthermore, we compare different Wigner transform implementations, examine additional symmetry enhancements, and observe that the direct method is often faster and more stable than the fast polynomial transform approaches."}
{"id": "2602.06568", "categories": ["math.ST", "math.PR", "stat.CO"], "pdf": "https://arxiv.org/pdf/2602.06568", "abs": "https://arxiv.org/abs/2602.06568", "authors": ["Alexandre Chotard"], "title": "Ergodicity of an Adaptive MCMC Sampler under a Probability Bound", "comment": null, "summary": "This paper provides sufficient conditions over the sequence of samples and parameters of an adaptive Markov Chain Monte Carlo (MCMC) algorithm to converge to the target distribution. These conditions aim to make more easily usable classical conditions formulated over the transition kernels, without needing, as was done in other works, to assume the compactness of both sample and parameter spaces. The condition of compactness is replaced here with a probability bound over the sequence of both samples and parameters."}
{"id": "2602.06646", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.06646", "abs": "https://arxiv.org/abs/2602.06646", "authors": ["Peter K. Friz", "Helena Kremp", "Vaios Laschos", "Matthias Liero", "Benjamin A. Robinson"], "title": "Talagrand-type transport inequalities for path spaces over Carnot groups", "comment": "40 pages", "summary": "We consider Talagrand-type transportation inequalities for the law of Brownian motion on Carnot groups. An important example is the lift of standard Brownian motion to the Brownian rough path. We present a direct proof on enhanced path space, which also yields equality when restricting to adapted couplings in the transport problem. Moreover, we prove a Talagrand inequality for the heat kernel measure on Carnot groups and deduce the inequality for the law of Brownian motion on Carnot groups via a bottom-up argument. Our study of this enhanced Wiener measure contributes to a longstanding programme to extend key properties of Wiener measure to the non-commutative setting of the enhanced Wiener measure, which is of central importance in Lyons' rough path theory. With a non-commutative sub-Riemannian state space, we observe phenomena that differ from the Euclidean case. In particular, while a top-down projection argument recovers Talagrand's inequality on Euclidean space from the corresponding inequality on the path space, such a projection argument breaks down in the Carnot group setting. We further study a Riemannian approximation of the Heisenberg group, in which case the failure of the top-down projection can be partially overcome. Finally, we show that the cost function used in the Talagrand inequality is a natural choice, in that it arises as a limit of discretised costs in the sense of $Γ$-convergence."}
{"id": "2602.06277", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06277", "abs": "https://arxiv.org/abs/2602.06277", "authors": ["Satish Vedula", "Olugbenga Anubi"], "title": "Predictive Energy Management for Hybrid Powertrains", "comment": "To be submitted to IFAC MECC 2026 - ASME Letters in Dynamic Systems and Control Joint Submission", "summary": "Hybrid power trains (HPT) run on multiple energy sources, often involving energy storage systems/batteries (ESS). As a result, the risk of battery degradation and the reliability of energy storage elements pose a major challenge in designing an energy-efficient hybrid power train. This paper presents an energy management strategy that adaptively splits power demand between the engine and the battery pack in a hybrid power train taking into account the battery degradation. Incorporating the battery degradation model directly into the underlying optimization problem is challenging on multiple fronts: 1) Any reasonable degradation model will, due to its complexity, result in a complicated optimization problem that is impractical for real-time implementation 2) the models contain a lot of time-varying parameters that can only be determined through destructive experimental procedures. As a result, it is essential to devise heuristics that reasonably capture the degradation per usage of the batteries. One such heuristic considered in this paper is the absolute power extracted from the battery. A distributed model predictive strategy is then developed to coordinate the power split to maximize efficiency while mitigating the failure risk due to battery degradation. The designed EM strategy is demonstrated through a realistic simulation of three different hybrid power trains: hybrid road vehicles (for example: a hybrid electric vehicle (HEV)), hybrid surface vehicles (for example: dynamically positioned hybrid ships (DPS)), and hybrid aerial vehicles (for example: hybrid electric aircraft (HEA)). The results show the effectiveness of the energy management strategy in managing battery degradation."}
{"id": "2602.06685", "categories": ["math.NA", "math.CA"], "pdf": "https://arxiv.org/pdf/2602.06685", "abs": "https://arxiv.org/abs/2602.06685", "authors": ["Cleonice F. Bracciali", "Miguel A. Piñar"], "title": "Laguerre-Sobolev orthogonal Polynomials and Boundary Value Problems on a semi-infinite domain", "comment": null, "summary": "We study a family of Laguerre--Sobolev orthogonal polynomials associated with a Sobolev inner product arising from second--order boundary value problems on the semi--infinite interval $(0,+\\infty)$. These polynomials generate an orthogonal basis of test functions vanishing at the endpoints and are especially well suited for the spectral approximation of Schrödinger--type problems with singular potentials. Explicit connection formulas with classical Laguerre polynomials are obtained, together with recurrence relations and asymptotic properties of the corresponding coefficients. A generating function involving Bessel functions is also derived. As an application, we develop a fully diagonalized Laguerre--Sobolev spectral method for Dirichlet problems with singular potentials. The method avoids the solution of linear systems and can be implemented recursively. Numerical experiments for a Schrödinger--type equation with inverse--distance potential confirm spectral accuracy and exponential convergence."}
{"id": "2602.06764", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.06764", "abs": "https://arxiv.org/abs/2602.06764", "authors": ["Emil S. Jørgensen", "Michael Sørensen"], "title": "Prediction-based inference for integrated diffusions with high-frequency data", "comment": null, "summary": "We consider parametric inference for an ergodic and stationary diffusion process, when the data are high-frequency observations of the integral of the diffusion process. Such data are obtained via certain measurement devices, or if positions are recorded and speed is modelled by a diffusion. In finance, realized volatility or variations thereof can be used to construct observations of the latent integrated volatility process. Specifically, we assume that the integrated process is observed at equidistant, deterministic time points and consider the high-frequency/infinite horizon asymptotic scenario, where the number of observations, the sampling frequency and the time of the last observation all go to infinity. Subject to mild standard regularity conditions on the diffusion model, we prove the asymptotic existence and uniqueness of a consistent estimator for useful and tractable classes of prediction-based estimating functions. Asymptotic normality of the estimator is obtained under an additional assumption on the rates. The proofs are based on the useful Euler-Ito expansions of transformations of diffusions and integrated diffusions, which we study in some detail."}
{"id": "2602.06649", "categories": ["math.PR", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2602.06649", "abs": "https://arxiv.org/abs/2602.06649", "authors": ["Joan Amaya", "Valdivino V. Junior", "Fábio P. Machado", "Alejandro Roldán-Correa"], "title": "Growth Models Under Uniform Catastrophes", "comment": "17 pages, 2 figures", "summary": "We consider stochastic growth models for populations organized in colonies and subject to uniform catastrophes. To assess population viability, we analyze scenarios in which individuals adopt dispersion strategies after catastrophic events. For these models, we derive explicit expressions for the survival probability and the mean time to extinction, both with and without spatial constraints. In addition, we complement this analysis by comparing uniform catastrophes with binomial and geometric catastrophes in models with dispersion and no spatial restrictions. Here, the terms uniform, binomial and geometric refer to the probability distributions governing the number of individuals that survive immediately after a catastrophe. This comparison allows us to quantify the impact of different types of catastrophic events on population persistence."}
{"id": "2602.06398", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06398", "abs": "https://arxiv.org/abs/2602.06398", "authors": ["Jiayi Zhu", "Hong Wang", "Ling Liang", "Lei Yang"], "title": "D-ripALM: A Tuning-friendly Decentralized Relative-Type Inexact Proximal Augmented Lagrangian Method", "comment": null, "summary": "This paper proposes D-ripALM, a Decentralized relative-type inexact proximal Augmented Lagrangian Method for consensus convex optimization over multi-agent networks. D-ripALM adopts a double-loop distributed optimization framework that accommodates a wide range of inner solvers, enabling efficient treatment of both smooth and nonsmooth objectives. In contrast to existing double-loop distributed augmented Lagrangian methods, D-ripALM employs a relative-type error criterion to regulate the switching between inner and outer iterations, resulting in a more practical and tuning-friendly algorithmic framework with enhanced numerical robustness. Moreover, we establish rigorous convergence guarantees for D-ripALM under general convexity assumptions, without requiring smoothness or strong convexity conditions commonly imposed in the distributed optimization literature. Numerical experiments further demonstrate the tuning-friendly nature of D-ripALM and its efficiency in attaining high-precision solutions with fewer communication rounds."}
{"id": "2602.06808", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.06808", "abs": "https://arxiv.org/abs/2602.06808", "authors": ["Liu Liu", "Limin Xu", "Zhenyi Zhu"], "title": "Dynamical low-rank approximation for the semiclassical Schrodinger equation with uncertainties", "comment": null, "summary": "In this paper, we propose a dynamical low-rank (DLR) approximation framework for solving the semiclassical Schrodinger equation with uncertainties. The primary numerical challenges arise from the dual nature of the oscillations: the spatial oscillations inherent in the semiclassical limit and the high-frequency oscillations in the random space induced by uncertainties. We extend two robust integrators -- the projector-splitting integrator and the unconventional integrator -- to the semiclassical regime to evolve the solution on a low-rank manifold. Through extensive numerical experiments, we demonstrate that the DLR method is significantly more computationally efficient than the standard stochastic Galerkin method, as it captures the essential quantum dynamics using a much smaller number of basis functions. Our findings reveal that despite the complex oscillatory patterns of the wave function, its evolution remains concentrated in a low-rank subspace for the cases investigated. Specifically, we observe that the DLR method achieves high fidelity with a remarkably small numerical rank, which remains robust even as the semiclassical parameter $\\varepsilon$ decreases. Within our problem settings, the results further suggest that the rank growth is primarily driven by the randomness and regularity of the potential. These results provide practical insights into the low-rank structure of uncertain quantum systems and offer an efficient approach for high-dimensional uncertainty quantification in the semiclassical regime."}
{"id": "2602.06832", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.06832", "abs": "https://arxiv.org/abs/2602.06832", "authors": ["Nicolas Fraiman", "Michael Nisenzon"], "title": "Exact recovery for seeded graph matching", "comment": "27 pages, 1 figure", "summary": "We study graph matching between two correlated networks in the almost fully seeded regime, where all but a vanishing fraction of vertex correspondences are revealed. Concretely, we consider the correlated stochastic block model and assume that $n^{1-α}$ vertices remain unrevealed for some $α\\in (0,1)$, while the remaining $n - n^{1-α}$ vertices are provided as seed correspondences. Our goal is to determine when the true permutation can be recovered efficiently as the proportion of unrevealed vertices vanishes.\n  We prove that exact recovery of the remaining correspondences is achievable in polynomial time whenever $λs^{2} > 1 - α$, where $λ= (a+b)/2$ is the SBM density parameter and $s$ denotes the edge retention parameter. This condition smoothly interpolates between the fully seeded setting and the classical unseeded threshold $λs^{2} > 1$ for matching in correlated Erdős-Rényi graphs. Our analysis applies to both a simple neighborhood-overlap rule and a bistochastic relaxation followed by projection, establishing matching achievability in the almost fully seeded regime without requiring spectral methods or message passing.\n  On the converse side, we show that below the same threshold, exact recovery is information-theoretically impossible with high probability. Thus, to our knowledge, we obtain the first tight statistical and computational characterization of graph matching when only a vanishing fraction of vertices remain unrevealed. Our results complement recent progress in semi-supervised community detection by demonstrating that revealing all but $n^{1-α}$ correspondences similarly lowers the information threshold for graph matching."}
{"id": "2602.06701", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.06701", "abs": "https://arxiv.org/abs/2602.06701", "authors": ["Zhuoqi Liu", "Qian Guo", "Shuaibin Gao", "Chenggui Yuan"], "title": "McKean-Vlasov stochastic differential equations with super-linear measure arguments: well-posedness and propagation of chaos", "comment": null, "summary": "This paper studies McKean-Vlasov stochastic differential equations (MVSDEs) whose drift coefficients grow super-linearly in both state variables and measure arguments, and whose diffusion coefficients exhibit super-linear growth in the state variables. By constructing an Euler-like sequence, we establish the strong well-posedness of such MVSDEs under a locally monotone condition. Furthermore, the propagation of chaos is studied on both finite and infinite horizons, demonstrating convergence of the interacting particle system to the corresponding non-interacting system. To illustrate the rationality of the theoretical results, we provide examples whose drifts contain the high powers and multiple integrals of distributions, with numerical simulations presented in Section 6."}
{"id": "2602.06447", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06447", "abs": "https://arxiv.org/abs/2602.06447", "authors": ["Sheetal Dharmatti", "Greeshma K"], "title": "Pointwise Tracking Optimal Control Problem for Cahn Hilliard Navier Stokes system", "comment": null, "summary": "We study a pointwise tracking optimal control problem for the two-dimensional local Cahn Hilliard Navier Stokes system, which models the evolution of two immiscible, incompressible fluids. The source term in the Cahn Hilliard equation acts as a control, and the cost functional measures the deviation of the phase variable from desired values at a finite set of spatial points over time. This setting reflects realistic applications where only a limited number of sensors are available. We also study a variant of the above pointwise tracking control problem where the cost is incorporated with a terminal time pointwise tracking term. The main mathematical difficulty arises from the low regularity of the cost functional due to the pointwise evaluation of the state variables. We prove the existence of strong solutions, establish the existence of an optimal control, and the differentiability of the control to state mapping. We define the adjoint system using a transposition method to characterise optimal control. Moreover, a first-order necessary optimality condition is derived in terms of the adjoint for both problems. Furthermore, we prove that our analysis can be extended to the case of singular potentials."}
{"id": "2602.06842", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.06842", "abs": "https://arxiv.org/abs/2602.06842", "authors": ["Yuhan Wu", "Jan Willem van Beek", "Victorita Dolean", "Alexander Heinlein"], "title": "Are Deep Learning Based Hybrid PDE Solvers Reliable? Why Training Paradigms and Update Strategies Matter", "comment": null, "summary": "Deep learning-based hybrid iterative methods (DL-HIMs) integrate classical numerical solvers with neural operators, utilizing their complementary spectral biases to accelerate convergence. Despite this promise, many DL-HIMs stagnate at false fixed points where neural updates vanish while the physical residual remains large, raising questions about reliability in scientific computing. In this paper, we provide evidence that performance is highly sensitive to training paradigms and update strategies, even when the neural architecture is fixed. Through a detailed study of a DeepONet-based hybrid iterative numerical transferable solver (HINTS) and an FFT-based Fourier neural solver (FNS), we show that significant physical residuals can persist when training objectives are not aligned with solver dynamics and problem physics. We further examine Anderson acceleration (AA) and demonstrate that its classical form is ill-suited for nonlinear neural operators. To overcome this, we introduce physics-aware Anderson acceleration (PA-AA), which minimizes the physical residual rather than the fixed-point update. Numerical experiments confirm that PA-AA restores reliable convergence in substantially fewer iterations. These findings provide a concrete answer to ongoing controversies surrounding AI-based PDE solvers: reliability hinges not only on architectures but on physically informed training and iteration design."}
{"id": "2602.06918", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.06918", "abs": "https://arxiv.org/abs/2602.06918", "authors": ["Enrique de Amo", "Juan Fernández-Sánchez", "David García-Fernández", "Manuel Úbeda-Flores"], "title": "Convex lineability in copula and quasi-copula sets", "comment": "4 figures", "summary": "In this paper, we investigate several subsets of $n$-copulas and $n$-quasi-copulas from the perspective of convex-lineability and the recently introduced concept of convex-spaceability. Our purpose is to determine when such families contain extremely large algebraic structures, namely linearly independent sets of cardinality of the continuum whose convex hull, and in some cases a closed convex linearly independent subset, remain entirely inside the class under study. These include the families of asymmetric copulas, copulas with maximal asymmetric measure, and proper $n$-quasi-copulas, among others. In contrast, for several other natural classes of copulas we show that (maximal) convex lineability holds while convex spaceability remains an open problem."}
{"id": "2602.06758", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.06758", "abs": "https://arxiv.org/abs/2602.06758", "authors": ["Rong-Sheng Hu", "Ze-Chun Hu", "Zhen Huang", "Mu-Xuan Li"], "title": "The infimum values of three probability functions for the Laplace distribution and the student's $t$ distribution", "comment": "28 pages", "summary": "Let $\\{X_α\\}$ be a family of random variables satisfying some distribution with a parameter $α$, $E(X_α)$ be the expectation, and $Var(X_α)$ be the variance. In this paper, we study the infimum values of three probability functions: $P(X_α\\leq y E(X_α))$, $P\\left(|X_α-E(X_α)|\\leq y\\sqrt{Var(X_α)}\\right)$ and $P\\left(|X_α-E(X_α)|\\geq y\\sqrt{Var(X_α)}\\right), \\forall y>0$, with respect to the parameter $α$ for the Laplace distribution and the student's $t$ distribution. Our motivation comes from three former conjectures: Chvátal's conjecture, Tomaszewski's conjecture and Hitczenko-Kwapień's conjecture."}
{"id": "2602.06472", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06472", "abs": "https://arxiv.org/abs/2602.06472", "authors": ["Chao Zhai"], "title": "Distributed Circumferential Coverage Control in Non-Convex Annulus Environments", "comment": null, "summary": "It has long been a prominent challenge in multi-agent systems to achieve distributed coverage of non-convex annulus environments while ensuring workload equalization among agents. To address this challenge, a distributed circumferential coverage control formulation is developed in this note by constructing a Riemannian metric for the navigation in the non-convex subregion while avoiding collisions with the region boundary. In addition, a distributed partition law is designed to balance the workload on the entire coverage region by endowing each agent with a virtual partition bar that slides along the inner boundary of coverage region. Theoretical analysis is conducted to ensure the exponential convergence of workload partition and asymptotic convergence of each agent towards the local optimum in its subregion. Finally, a case study is presented to demonstrate the effectiveness of the proposed coverage control approach."}
{"id": "2602.06872", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.06872", "abs": "https://arxiv.org/abs/2602.06872", "authors": ["Zhaonan Dong", "Alexandre Ern", "Tanvi Wadhawan"], "title": "$hp$-a posteriori error estimates for hybrid high-order methods applied to biharmonic problems", "comment": null, "summary": "We derive a residual-based $hp$-a posteriori error estimator for hybrid high-order (HHO) methods on simplicial meshes applied to the biharmonic problem posed on two- and three-dimensional polytopal Lipschitz domains. The a posteriori error estimator hinges on an error decomposition into conforming and nonconforming components. To bound the nonconforming error, we use a $C^1$-partition of unity constructed via Alfeld splittings, combined with local Helmholtz decompositions on vertex stars. For the conforming error, we design two residual-based estimators, each associated with a specific interpolation operator. In the first setting, the upper bound for the conforming error involves only the stabilization term and the data oscillation. In the second setting, the bound additionally incorporates bulk residuals, normal flux jumps, and tangential jumps. Numerical experiments confirm the theoretical findings and demonstrate the efficiency of the proposed estimators."}
{"id": "2602.06931", "categories": ["math.ST", "stat.CO"], "pdf": "https://arxiv.org/pdf/2602.06931", "abs": "https://arxiv.org/abs/2602.06931", "authors": ["Sanket Agrawal", "Sebastiano Grazzi", "Gareth O. Roberts"], "title": "On micromodes in Bayesian posterior distributions and their implications for MCMC", "comment": "37 pages, 4 figures", "summary": "We investigate the existence and severity of local modes in posterior distributions from Bayesian analyses. These are known to occur in posterior tails resulting from heavy-tailed error models such as those used in robust regression. To understand this phenomenon clearly, we consider in detail location models with Student-$t$ errors in dimension $d$ with sample size $n$. For sufficiently heavy-tailed data-generating distributions, extreme observations become increasingly isolated as $n \\to \\infty$. We show that each such observation induces a unique local posterior mode with probability tending to $1$. We refer to such a local mode as a micromode. These micromodes are typically small in height but their domains of attraction are large and grow polynomially with $n$. We then connect this posterior geometry to computation. We establish an Arrhenius law for the time taken by one-dimensional piecewise deterministic Monte Carlo algorithms to exit these micromodes. Our analysis identifies a phase transition where a misspecified and overly underdispersed model causes exit times to increase sharply, leading to a pronounced deterioration in sampling performance."}
{"id": "2602.06804", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.06804", "abs": "https://arxiv.org/abs/2602.06804", "authors": ["Iosif Pinelis"], "title": "One-sided concentration near the mean of log-concave distributions", "comment": "11 pages", "summary": "A lower bound on the probability $P(0<X<δ)$ for all real $δ>0$ and all random variables $X$ with log-concave p.d.f.'s such that $EX=0$ and $EX^2=1$ is obtained."}
{"id": "2602.06480", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06480", "abs": "https://arxiv.org/abs/2602.06480", "authors": ["Krishnendu Chatterjee", "David Lurie", "Raimundo Saona", "Bruno Ziliotto"], "title": "Approximating the Uniform Value in Hidden Stochastic Games with Doeblin Conditions", "comment": null, "summary": "In \\emph{zero-sum two-player hidden stochastic games}, players observe partial information about the state. We address: $(i)$ the existence of the \\emph{uniform value}, i.e., a limiting average payoff that both players can guarantee for sufficiently long durations, and $(ii)$ the existence of an algorithm to approximate it. Previous work shows that, in the general case, the uniform value may fail to exist, and, even when it does, there need not exist an algorithm to compute or approximate it. Therefore, we consider the \\emph{Doeblin condition} in hidden stochastic games, requiring that, after a sufficiently long time, the posterior beliefs have a uniformly positive probability of resetting to one of finitely many neighborhoods in the belief space. We prove the existence of the uniform value and provide an algorithm to approximate it. We identify sufficient conditions, namely \\emph{ergodicity} in the blind setting (when the signal is uninformative) and \\emph{primitivity} in the hidden setting (when there are multiple signals). Moreover, we show that, in the hidden setting, ergodicity does not guarantee the Doeblin condition. Our results are new even for the one-player setting, i.e., partially observable Markov decision processes."}
{"id": "2602.06701", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.06701", "abs": "https://arxiv.org/abs/2602.06701", "authors": ["Zhuoqi Liu", "Qian Guo", "Shuaibin Gao", "Chenggui Yuan"], "title": "McKean-Vlasov stochastic differential equations with super-linear measure arguments: well-posedness and propagation of chaos", "comment": null, "summary": "This paper studies McKean-Vlasov stochastic differential equations (MVSDEs) whose drift coefficients grow super-linearly in both state variables and measure arguments, and whose diffusion coefficients exhibit super-linear growth in the state variables. By constructing an Euler-like sequence, we establish the strong well-posedness of such MVSDEs under a locally monotone condition. Furthermore, the propagation of chaos is studied on both finite and infinite horizons, demonstrating convergence of the interacting particle system to the corresponding non-interacting system. To illustrate the rationality of the theoretical results, we provide examples whose drifts contain the high powers and multiple integrals of distributions, with numerical simulations presented in Section 6."}
{"id": "2602.06829", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.06829", "abs": "https://arxiv.org/abs/2602.06829", "authors": ["Michel Benaïm", "Mario Bravo", "Mathieu Faure"], "title": "On the occupation measure of evolution models with vanishing mutations", "comment": "30 pages", "summary": "We study the almost sure convergence of the occupation measure of evolution models where mutation rates decrease over time. We show that if the mutation parameter vanishes at a controlled rate, then the empirical occupation measure converges almost surely to a specific invariant distribution of a limiting Markov chain. Our results are obtained through the analysis of a larger class of time-inhomogeneous Markov chains with finite state space, where the control on the mutation parameter is explained by the energy barrier of the limit process. Additionally, we derive an explicit $L^1$ convergence rate, explained through the tree-optimality gap, that may be of independent interest."}
{"id": "2602.06567", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06567", "abs": "https://arxiv.org/abs/2602.06567", "authors": ["Nicole Bäuerle", "Athanasios Vasileiadis"], "title": "Markov Decision Processes of the Third Kind: Learning Distributions by Policy Gradient Descent", "comment": null, "summary": "The goal of this paper is to analyze distributional Markov Decision Processes as a class of control problems in which the objective is to learn policies that steer the distribution of a cumulative reward toward a prescribed target law, rather than optimizing an expected value or a risk functional. To solve the resulting distributional control problem in a model-free setting, we propose a policy-gradient algorithm based on neural-network parameterizations of randomized Markov policies, defined on an augmented state space and a sample-based evaluation of the characteristic-function loss. Under mild regularity and growth assumptions, we prove convergence of the algorithm to stationary points using stochastic approximation techniques. Several numerical experiments illustrate the ability of the method to match complex target distributions, recover classical optimal policies when they exist, and reveal intrinsic non-uniqueness phenomena specific to distributional control."}
{"id": "2602.06876", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.06876", "abs": "https://arxiv.org/abs/2602.06876", "authors": ["Duncan Dauvergne", "Fardin Syed"], "title": "Bulk heights of the KPZ line ensemble", "comment": "28 pages", "summary": "For $t > 0$, let $\\{\\mathcal{H}^{(t)}_n, n \\in \\mathbb{N}\\}$ be the KPZ line ensemble with parameter $t$, satisfying the homogeneous $\\mathbf{H}$-Brownian Gibbs property with $\\mathbf{H}(x) =e^x$. We prove quantitative concentration estimates for the $n$th line $\\mathcal{H}^{(t)}_n$ which yield the asymptotics $\\mathcal{H}^{(t)}_n = n \\log n + o(n^{3/4 + ε})$ as $n \\to \\infty$. A key step in the proof is a general integration by parts formula for $\\mathbf{H}$-Brownian Gibbs line ensembles which yields the identity $\\mathbb{E} \\exp(\\mathcal{H}^{(t)}_{n + 1}(x) - \\mathcal{H}^{(t)}_n (x)) = n t^{-1}$ for any $n, t, x$."}
{"id": "2602.06637", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06637", "abs": "https://arxiv.org/abs/2602.06637", "authors": ["Benjamin Dubois-Taine", "Laurent Pfeiffer", "Nadia Oudjane", "Adrien Seguret", "Francis Bach"], "title": "Two-stage stochastic algorithm for solving large-scale (non)-convex separable optimization problems under affine constraints", "comment": null, "summary": "We consider nonsmooth optimization problems under affine constraints, where the objective consists of the average of the component functions of a large number $N$ of agents, and we only assume access to the Fenchel conjugate of the component functions. The algorithm of choice for solving such problems is the dual subgradient method, also known as dual decomposition, which requires $O(\\frac{1}{ε^2})$ iterations to reach $ε$-optimality in the convex case. However, each iteration requires computing the Fenchel conjugate of each of the $N$ agents, leading to a complexity $O(\\frac{N}{ε^2})$ which might be prohibitive in practical applications. To overcome this, we propose a two-stage algorithm, combining a stochastic subgradient algorithm on the dual problem, followed by a block-coordinate Frank-Wolfe algorithm to obtain primal solutions. The resulting algorithm requires only $O(\\frac{1}{ε^2} + \\frac{N}{ε^{2/3}})$ calls to Fenchel conjugates to obtain an $ε$-optimal primal solution in expectation in the convex case. We extend our results to nonconvex component functions and show that our method still applies and gets (almost) the same convergence rate, this time only to an approximate primal solution recovering the classical duality gap bounds usually obtained using the Shapley-Folkman theorem."}
{"id": "2602.06906", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.06906", "abs": "https://arxiv.org/abs/2602.06906", "authors": ["Anna Gusakova", "Mathias in Wolde-Lübke"], "title": "Limits of Poisson-Laguerre tessellations", "comment": null, "summary": "For sequences of Poisson-Laguerre tessellations and their duals in $\\mathbb{R}^d$, generated by Poisson point processes $(η_n)_{n\\in\\mathbb{N}}$ in $\\mathbb{R}^d \\times \\mathbb{R}$, we prove limit theorems as $n\\to \\infty$. The intensity measure of $η_n$ has density of the form $(v,h)\\mapsto f_n(h)$ with respect to the Lebesgue measure, where $v\\in \\mathbb{R}^d$ and $h\\in \\mathbb{R}$. Identifying a tessellation with its skeleton (the union of the boundaries of all its cells) we provide verifiable conditions on $(f_n)_{n\\in\\mathbb{N}}$ that ensure convergence either to the classical Poisson-Voronoi/Poisson-Delaunay tessellation or to another Poisson-Laguerre tessellation. We also discuss convergence of the corresponding typical cells. As a corollary, we show that the Poisson-Voronoi and the Poisson-Delaunay tessellations arise as limits of the $β$-Voronoi and the $β$-Delaunay tessellations, respectively, as $β\\to -1$."}
{"id": "2602.06670", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06670", "abs": "https://arxiv.org/abs/2602.06670", "authors": ["Hannes Gernandt", "Till Preuster", "Manuel Schaller"], "title": "Optimization-based control by interconnection of nonlinear port-Hamiltonian systems", "comment": null, "summary": "In this paper, we formulate an optimization-based control-by-interconnection approach to the stabilization problem of nonlinear port-Hamiltonian systems. Motivated by model predictive control, the feedback is defined as an initial part of a suboptimal solution of a finite horizon optimal control problem. To this end, we write the optimization method given by a primal-dual gradient dynamics arising from a possibly control-constrained optimal control problem as a port-Hamiltonian system. Then, using the port-Hamiltonian structure of the plant, we show that the MPC-type feedback law is indeed a structure-preserving interconnection of two port-Hamiltonian systems. We prove that, under an observability assumption, the interconnected system asymptotically stabilizes the plant dynamics. We illustrate the theoretical results by means of a numerical example."}
{"id": "2602.06568", "categories": ["math.ST", "math.PR", "stat.CO"], "pdf": "https://arxiv.org/pdf/2602.06568", "abs": "https://arxiv.org/abs/2602.06568", "authors": ["Alexandre Chotard"], "title": "Ergodicity of an Adaptive MCMC Sampler under a Probability Bound", "comment": null, "summary": "This paper provides sufficient conditions over the sequence of samples and parameters of an adaptive Markov Chain Monte Carlo (MCMC) algorithm to converge to the target distribution. These conditions aim to make more easily usable classical conditions formulated over the transition kernels, without needing, as was done in other works, to assume the compactness of both sample and parameter spaces. The condition of compactness is replaced here with a probability bound over the sequence of both samples and parameters."}
{"id": "2602.06730", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06730", "abs": "https://arxiv.org/abs/2602.06730", "authors": ["Siyi Wang", "Zifan Wang", "Karl H. Johansson"], "title": "Wasserstein Distributionally Robust Performative Prediction", "comment": null, "summary": "Performativity means that the deployment of a predictive model incentivizes agents to strategically adapt their behavior, thereby inducing a model-dependent distribution shift. Practitioners often repeatedly retrain the model on data samples to adapt to evolving distributions. In this paper, we develop a Wasserstein distributionally robust optimization framework for performative prediction, where the prediction model is optimized over the worst-case distribution within a Wasserstein ambiguity set. We allow the ambiguity radius to depend on the prediction model, which subsumes the constant-radius formulation as a special case. By leveraging strong duality, the intractable robust objective is reformulated as a computationally tractable minimization problem. Based on this formulation, we develop distributionally robust repeated risk minimization (DR-RRM) and repeated gradient descent (DR-RGD), to iteratively find an equilibrium between distributional shifts and model retraining. Theoretical analyses demonstrate that, under standard regularity conditions, both algorithms converge to a unique robust performative stable point. Our analysis explicitly accounts for inner-loop approximation errors and shows convergence to a neighborhood of the stable point in inexact settings. Additionally, we establish theoretical bounds on the suboptimality gap between the stable point and the global performative optimum. Finally, numerical simulations of a dynamic credit scoring problem demonstrate the efficacy of the method."}
{"id": "2602.06750", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06750", "abs": "https://arxiv.org/abs/2602.06750", "authors": ["Diego Morales", "Pedro Pérez-Aros", "Emilio Vilches"], "title": "Convergence Rates for Stochastic Proximal and Projection Estimators", "comment": null, "summary": "In this paper, we establish explicit, non-asymptotic convergence rates for the stochastic smooth approximations of infimal convolutions introduced and developed in \\cite{MR4581306,MR4923371}. In particular, we quantify the convergence of the associated barycentric estimators toward proximal mappings and metric projections. We prove a dimension-explicit $\\sqrtδ$ bound in the $ρ$-weakly convex (possibly nonsmooth) setting and show, by examples, that this order is sharp. Under additional regularity, namely $C^{2}$ smoothness with globally Lipschitz Hessian, we derive an improved linear $O(δ)$ rate with explicit constants, and we obtain refined projection estimates for convex sets with local $C^{2,1}$ boundary."}
{"id": "2602.06824", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.06824", "abs": "https://arxiv.org/abs/2602.06824", "authors": ["El Mahdi Chayti"], "title": "RanSOM: Second-Order Momentum with Randomized Scaling for Constrained and Unconstrained Optimization", "comment": null, "summary": "Momentum methods, such as Polyak's Heavy Ball, are the standard for training deep networks but suffer from curvature-induced bias in stochastic settings, limiting convergence to suboptimal $\\mathcal{O}(ε^{-4})$ rates. Existing corrections typically require expensive auxiliary sampling or restrictive smoothness assumptions. We propose \\textbf{RanSOM}, a unified framework that eliminates this bias by replacing deterministic step sizes with randomized steps drawn from distributions with mean $η_t$. This modification allows us to leverage Stein-type identities to compute an exact, unbiased estimate of the momentum bias using a single Hessian-vector product computed jointly with the gradient, avoiding auxiliary queries. We instantiate this framework in two algorithms: \\textbf{RanSOM-E} for unconstrained optimization (using exponentially distributed steps) and \\textbf{RanSOM-B} for constrained optimization (using beta-distributed steps to strictly preserve feasibility). Theoretical analysis confirms that RanSOM recovers the optimal $\\mathcal{O}(ε^{-3})$ convergence rate under standard bounded noise, and achieves optimal rates for heavy-tailed noise settings ($p \\in (1, 2]$) without requiring gradient clipping."}
{"id": "2602.06840", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.06840", "abs": "https://arxiv.org/abs/2602.06840", "authors": ["Ahmed Najjar", "Hajar El Hassani", "Marco Di Renzo", "Kezhi Wang", "Merouane Debbah"], "title": "A Mode-Matching Approach to the Design of RIS-Aided Communications", "comment": "Asilomar 2025", "summary": "Reconfigurable intelligent surface (RIS) is an emerging technology for application to wireless communications. In this paper, we consider the problem of anomalous reflection and model the RIS as a periodic surface impedance boundary. We utilize the mode matching method and Floquets expansion representation to compute the field reflected from a spatially periodic RIS, and evaluate the performance versus implementation complexity tradeoffs of RIS aided communications based on the global design criterion. This allows us to maximize the power reflected towards the intended direction of propagation, while minimizing the power reradiated towards undesired directions of propagation. In addition, we discuss the advantages of the proposed electromagnetically consistent approach to the design of RIS aided wireless systems."}
{"id": "2602.06958", "categories": ["math.OC", "cs.DS"], "pdf": "https://arxiv.org/pdf/2602.06958", "abs": "https://arxiv.org/abs/2602.06958", "authors": ["Bento Natura"], "title": "Circuit Diameter of Polyhedra is Strongly Polynomial", "comment": null, "summary": "We prove a strongly polynomial bound on the circuit diameter of polyhedra, resolving the circuit analogue of the polynomial Hirsch conjecture. Specifically, we show that the circuit diameter of a polyhedron $P = \\{x\\in \\mathbb{R}^n:\\, A x = b, \\, x \\ge 0\\}$ with $A\\in\\mathbb{R}^{m\\times n}$ is $O(m^2 \\log m)$. Our construction yields monotone circuit walks, giving the same bound for the monotone circuit diameter.\n  The circuit diameter, introduced by Borgwardt, Finhold, and Hemmecke (SIDMA 2015), is a natural relaxation of the combinatorial diameter that allows steps along circuit directions rather than only along edges. All prior upper bounds on the circuit diameter were only weakly polynomial. Finding a circuit augmentation algorithm that matches this bound would yield a strongly polynomial time algorithm for linear programming, resolving Smale's 9th problem."}
