{"id": "2601.07967", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07967", "abs": "https://arxiv.org/abs/2601.07967", "authors": ["Ludovico Bruni Bruno", "Giacomo Cappellazzo", "Wolfgang Erb", "Mohammad Karimnejad Esfahani"], "title": "Scattered Data Histopolation in Averaging Kernel Hilbert Spaces", "comment": "27 pages, 8 figures, 1 table", "summary": "Kernel-based methods offer a powerful and flexible mathematical framework for addressing histopolation problems. In histopolation, the available input data does not consist of pointwise function samples but of averages taken over intervals or higher-dimensional regions, and these mean values serve as a basis for reconstructing or approximating the target function. While classical interpolation requires continuity of the underlying function, histopolation can be performed in larger function spaces. In the framework of kernel methods, we will introduce and study the so-called averaging kernel Hilbert spaces (AKHS's) for this purpose. Within this setting, we develop systematic construction principles for averaging kernels and provide characterizations based on the Fourier-Plancherel transform. In addition, we analyze several representative histopolation scenarios in order to highlight properties of this approximation method, including conditions for unisolvence and possible error estimates. Finally, we present numerical experiments that shed some light on the convergence behavior of the presented approach and demonstrate its practical effectiveness."}
{"id": "2601.08001", "categories": ["math.NA", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.08001", "abs": "https://arxiv.org/abs/2601.08001", "authors": ["Qinying Chen", "Arnab Roy", "Tobin A. Driscoll"], "title": "Operator learning for models of tear film breakup", "comment": null, "summary": "Tear film (TF) breakup is a key driver of understanding dry eye disease, yet estimating TF thickness and osmolarity from fluorescence (FL) imaging typically requires solving computationally expensive inverse problems. We propose an operator learning framework that replaces traditional inverse solvers with neural operators trained on simulated TF dynamics. This approach offers a scalable path toward rapid, data-driven analysis of tear film dynamics."}
{"id": "2601.08006", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.08006", "abs": "https://arxiv.org/abs/2601.08006", "authors": ["Hamad El Kahza", "Luis Chacón", "William Taitano", "Jingmei Qiu", "Jingwei Hu"], "title": "A Structure-Preserving Penalization Method for the Single-species Rosenbluth-Fokker-Planck Equation", "comment": null, "summary": "The Rosenbluth-Fokker-Planck (RFP) equation describes Coulomb collisional dynamics within and across species in plasmas. It belongs to the broader class of anisotropic-diffusion-advection equations, whose numerical approximation is highly-nontrivial due to its nonlinearity, stiffness, and structural properties such as conservation and entropy dissipation (hence with the Maxwellian distribution as the equilibrium state). In this paper, we propose a structure-preserving penalization scheme for the stiff, single-species RFP equation. The scheme features three novel components: 1) a novel generalization of the well-known Chang-Cooper discretization for the RFP equation that is equilibrium-preserving and enables positivity while preserving mass, momentum, and energy; 2) an easy-to-invert isotropic variable-coefficient penalization operator to deal with the temporal stiffness without resorting to a fully implicit scheme, borrowing ideas from explicit-implicit-null (EIN) methods, and 3) an adaptive timestepping strategy that preserves the positivity of the full penalized scheme. The resulting scheme conserves mass, momentum, and energy strictly, is unconditionally stable, and robustly positivity preserving. The scheme is demonstrated with linear and nonlinear anisotropic diffusion examples of increasing complexity, including several single-species RFP examples."}
{"id": "2601.08051", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08051", "abs": "https://arxiv.org/abs/2601.08051", "authors": ["Jay Gopalakrishnan", "Gabriel Pinochet-Soto"], "title": "Reliable eigenspace error estimation using source error estimators", "comment": "30 pages", "summary": "We introduce a framework for repurposing error estimators for source problems to compute an estimator for the gap between eigenspaces and their discretizations. Of interest are eigenspaces of finite clusters of eigenvalues of unbounded nonselfadjoint linear operators with compact resolvent. Eigenspaces and eigenvalues of rational functions of such operators are studied as a first step. Under an assumption of convergence of resolvent approximations in the operator norm and an assumption on global reliability of source problem error estimators, we show that the gap in eigenspace approximations can be bounded by a globally reliable and computable error estimator. Also included are applications of the theoretical framework to first-order system least squares (FOSLS) discretizations and discontinuous Petrov-Galerkin (DPG) discretizations, both yielding new estimators for the error gap. Numerical experiments with a selfadjoint model problem and with a leaky nonselfadjoint waveguide eigenproblem show that adaptive algorithms using the new estimators give refinement patterns that target the cluster as a whole instead of individual eigenfunctions."}
{"id": "2601.07837", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.07837", "abs": "https://arxiv.org/abs/2601.07837", "authors": ["Elvin Rada"], "title": "Convergence of a Multi-Inertial-Iteration Scheme in Cone b, p-Normed Banach Spaces", "comment": null, "summary": "We propose and analyze a multi-inertial-iteration scheme in cone b, p-normed Banach spaces. This framework extends the classical Krasnoselskii-Mann and two-step inertial iterations by incorporating three independent inertial parameters and multiple error-control sequences. Under mild assumptions such as quasi-nonexpansiveness, weak contraction, and compatibility of mappings, we establish convergence theorems guaranteeing the existence and uniqueness of fixed points. Illustrative numerical examples demonstrate accelerated convergence compared with the classical Krasnoselskii-Mann method."}
{"id": "2601.08041", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08041", "abs": "https://arxiv.org/abs/2601.08041", "authors": ["Lucas Benigni", "Ziyad Zaklani"], "title": "Hadamard product of independent random sample covariance matrices with correlation structure", "comment": "10 pages, 4 figures", "summary": "We compute the asymptotic empirical eigenvalue distribution of the matrix $M = \\bigodot_{i=1}^k \\frac{1}{d_i}X^{(i)}{X^{(i)}}^\\top$ where $X^{(i)}\\in\\mathbb{R}^{n\\times d_i}$ are independent matrices with independent rows but general correlation within each row under the dimension scaling $\\frac{n}{d_1\\dots d_k}\\to γ$."}
{"id": "2601.07993", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.07993", "abs": "https://arxiv.org/abs/2601.07993", "authors": ["Damjana Kokol Bukovšek", "Petra Lazić", "Blaž Mojškerc", "Nik Stopar"], "title": "The exact region determined by Spearman's footrule, Gini's gamma and Kendall's tau", "comment": "24 pages, 5 figures", "summary": "Concordance measures are used to express the degree of association between random variables. Practitioners may use several distinct concordance measures to narrow the space of possible dependence structures. Consequently, the relations between different (weak) concordance measures have been extensively studied in recent years. The goal of this paper is to study the relation between Kendall's tau, Gini's gamma and Spearman's footrule. In particular, we describe the exact region determined by these three measures, using shuffles of $M$ and ordinal sums of copulas. We also provide the formulas for five main (weak) concordance measures and Chatterjee's xi of ordinal sums of copulas."}
{"id": "2601.08188", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08188", "abs": "https://arxiv.org/abs/2601.08188", "authors": ["Lei Zhang", "Xiangcheng Zheng", "Shangqin Zhu"], "title": "Numerical analysis of spatiotemporal high-index saddle dynamics for finding multiple solutions of semilinear elliptic problems", "comment": null, "summary": "This paper presents a rigorous numerical framework for computing multiple solutions of semilinear elliptic problems by spatiotemporal high-index saddle dynamics (HiSD), which extends the traditional HiSD to the continuous-in-space setting, explicitly incorporating spatial differential operators. To enforce the Stiefel manifold constraint without introducing the analytical complications of retraction-based updates, we design a fully discrete retraction-free orthonormality-preserving scheme for spatiotemporal HiSD. This scheme exhibits favorable structural properties that substantially reduce the difficulties arising from coupling and gradient nonlinearities in spatiotemporal HiSD. Exploiting these properties, we establish gradient stability and error estimates, which consequently ensure the preservation of the Morse index for the computed saddle points. The framework is further extended to the semilinear advection-reaction-diffusion equation. Numerical experiments demonstrate the efficiency of the proposed method in finding multiple solutions and constructing the solution landscape of semilinear elliptic problems. To the best of our knowledge, this work presents the first rigorous full space--time accuracy analysis of the HiSD system. It reveals intrinsic connections between saddle-search algorithms and numerical methods for PDEs, enhancing their mutual compatibility for a broad range of problems."}
{"id": "2601.08153", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.08153", "abs": "https://arxiv.org/abs/2601.08153", "authors": ["Nguyen Duy Cuong"], "title": "Dual characterizations of norm minimization problems", "comment": "26 pages", "summary": "The paper studies a general norm minimization problem on a product of normed vector spaces. We establish dual necessary and sufficient optimality conditions and derive explicit formulas for the corresponding solution sets. These formulas are obtained under the assumption that one optimal solution together with its associated dual vectors arising from the optimality conditions is known. Three important cases of product norms, namely the sum norm, maximum norm and $p$-norm, are also studied. Several examples in finite and infinite dimensional spaces equipped with various types of norms are presented to illustrate the established results."}
{"id": "2601.08069", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08069", "abs": "https://arxiv.org/abs/2601.08069", "authors": ["Luke Meredith", "Arpan Mukhopadhyay"], "title": "Robustness of the 2-Choices Dynamics to Node Failures", "comment": "Accepted to appear in POMACS 2026 (SIGMETRICS 2026 Issue)", "summary": "In many applications, it becomes necessary for a set of distributed network nodes to agree on a common value or opinion as quickly as possible and with minimal communication overhead. The classical 2-choices rule is a well-known distributed algorithm designed to achieve this goal. Under this rule, each node in a network updates its opinion at random instants by sampling two neighbours uniformly at random and then adopting the common opinion held by these neighbours if they agree. For a sufficiently well-connected network of $n$ nodes and two initial opinions, this simple rule results in the network being absorbed in a consensus state in $O(\\log n)$ time (with high probability) and the consensus is obtained on the opinion held by the majority of nodes initially.\n  In this paper, we study the robustness of this algorithm to node failures. In particular, we assume that with a constant probability $α$, a node may fail to update according to the 2-choices rule and erroneously adopt any one of the two opinions uniformly at random. This is a strong form of failure under which the network can no longer be absorbed in a consensus state. However, we show that as long as the error probability $α$ is less than a threshold value, the network is able to retain the majority support of the initially prevailing opinion for an exponentially long time ($Ω(\\poly(\\exp(n)))$). In contrast, when the error probability is above a threshold value, we show that any opinion quickly ($O(\\log n)$ time) loses its majority support and the network reaches a state where (nearly) an equal proportion of nodes support each opinion. We establish the above phase transition in the dynamics for both complete graphs and expander graphs with sufficiently large spectral gaps and sufficiently homogeneous degrees. Our analysis combines spectral graph theory with Markov chain mixing and hitting time analyses."}
{"id": "2601.08353", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.08353", "abs": "https://arxiv.org/abs/2601.08353", "authors": ["Markus Reiß", "Lars Winkelmann"], "title": "Rank tests for time-varying covariance matrices observed under noise", "comment": null, "summary": "We consider a $d$-dimensional continuous martingale $X(t)$ with quadratic variation matrix $\\langle X\\rangle_t=\\int_0^t Σ(s)\\,ds$ and develop tests for the rank of its spot covariance matrix $Σ(t)$, $t\\in[0,1]$. The process $X$ is observed under observational noise, as is standard for microstructure noise models in high-frequency finance. We test the null hypothesis ${\\mathcal H}_0:rank(Σ(t))\\le r$ against local alternatives ${\\mathcal H}_{1,n}:λ_{r+1}(Σ(t))\\ge v_n$, where $λ_{r+1}$ denotes the $(r+1)$st eigenvalue and $v_n\\downarrow 0$ as the sample size $n\\to\\infty$. We construct test statistics based on eigenvalues of carefully calibrated localized spectral covariance matrix estimates. Critical values are provided non-asymptotically as well as asymptotically via maximal eigenvalues of Gaussian orthogonal ensembles. The power analysis establishes asymptotic consistency for a separation rate $v_n\\thicksim (\\underlineλ_r^{-1/(β+1)}n^{-β/(β+1)})\\wedge n^{-β/(β+2)}$, depending on the Hölder-regularity $β$ of $Σ$ and a possible spectral gap $\\underlineλ_r\\ge 0$ under ${\\mathcal H}_0$. A lower bound shows the optimality of this rate. We discuss why the rate is much faster than conventional estimation rates. The theory is illustrated by simulations and a real data example with German government bonds of varying maturity."}
{"id": "2601.08228", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08228", "abs": "https://arxiv.org/abs/2601.08228", "authors": ["Aneesh Panchal", "Ratikanta Behera"], "title": "Second-Generation Wavelet-inspired Tensor Product with Applications in Hyperspectral Imaging", "comment": null, "summary": "This paper introduces the $w$-product, a novel wavelet-based tensor multiplication scheme leveraging second-generation wavelet transforms to achieve linear transformation complexity while preserving essential algebraic properties. The $w$-product outperforms existing tensor multiplication approaches by enabling fast and numerically stable tensor decompositions by proposing ``$w$-svd'' and its sparse variant ``sp-$w$-svd'', for efficient low-rank approximations with significantly reduced computational costs. Experiments on low-rank hyperspectral image reconstruction demonstrate up to a $92.21$ times speedup compared to state-of-the-art ``$t$-svd'', with comparable PSNR and SSIM metrics. We discuss the Moore-Penrose inverse of tensors based on the $w$-product and examine its essential properties. Numerical examples are provided to support the theoretical results. Then, hyperspectral image deblurring experiments demonstrate up to $27.88$ times speedup with improved image quality. In particular, the $w$-product and the sp-$w$-product exhibit exponentially increasing acceleration with the decomposition level compared to the traditional approach of the $t$-product. This work provides a scalable framework for multidimensional data analysis, with future research directions including adaptive wavelet designs, higher-order tensor extensions, and real-time implementations."}
{"id": "2601.08362", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08362", "abs": "https://arxiv.org/abs/2601.08362", "authors": ["Chenglong Bao", "Chao Ding", "Fuxiaoyue Feng", "Jingyu Li"], "title": "Stratification for Nonlinear Semidefinite Programming", "comment": "48 pages, 2 figures", "summary": "This paper introduces a stratification framework for nonlinear semidefinite programming (NLSDP) that reveals and utilizes the geometry behind the nonsmooth KKT system. Based on the \\emph{index stratification} of $\\mathbb{S}^n$ and its lift to the primal--dual space, a stratified variational analysis is developed. Specifically, we define the stratum-restricted regularity property, characterize it by the verifiable weak second order condition (W-SOC) and weak strict Robinson constraint qualification (W-SRCQ), and interpret the W-SRCQ geometrically via transversality, which provides its genericity over ambient space and stability along strata. The interactions of these properties across neighboring strata are further examined, leading to the conclusion that classical strong-form regularity conditions correspond to the local uniform validity of stratum-restricted counterparts. On the algorithmic side, a stratified Gauss--Newton method with normal steps and a correction mechanism is proposed for globally solving the KKT equation through a least-squares merit function. We demonstrate that the algorithm converges globally to directional stationary points. Moreover, under the W-SOC and the strict Robinson constraint qualification (SRCQ), it achieves local quadratic convergence to KKT pairs and eventually identifies the active stratum."}
{"id": "2601.08184", "categories": ["math.PR", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.08184", "abs": "https://arxiv.org/abs/2601.08184", "authors": ["Yixuan Zhang", "Qiaomin Xie"], "title": "Wasserstein-p Central Limit Theorem Rates: From Local Dependence to Markov Chains", "comment": "51 pages, 1 figure", "summary": "Finite-time central limit theorem (CLT) rates play a central role in modern machine learning (ML). In this paper, we study CLT rates for multivariate dependent data in Wasserstein-$p$ ($\\mathcal W_p$) distance, for general $p\\ge 1$. We focus on two fundamental dependence structures that commonly arise in ML: locally dependent sequences and geometrically ergodic Markov chains. In both settings, we establish the \\textit{first optimal} $\\mathcal O(n^{-1/2})$ rate in $\\mathcal W_1$, as well as the first $\\mathcal W_p$ ($p\\ge 2$) CLT rates under mild moment assumptions, substantially improving the best previously known bounds in these dependent-data regimes. As an application of our optimal $\\mathcal W_1$ rate for locally dependent sequences, we further obtain the first optimal $\\mathcal W_1$--CLT rate for multivariate $U$-statistics.\n  On the technical side, we derive a tractable auxiliary bound for $\\mathcal W_1$ Gaussian approximation errors that is well suited to studying dependent data. For Markov chains, we further prove that the regeneration time of the split chain associated with a geometrically ergodic chain has a geometric tail without assuming strong aperiodicity or other restrictive conditions. These tools may be of independent interests and enable our optimal $\\mathcal W_1$ rates and underpin our $\\mathcal W_p$ ($p\\ge 2$) results."}
{"id": "2601.08775", "categories": ["math.ST", "stat.AP"], "pdf": "https://arxiv.org/pdf/2601.08775", "abs": "https://arxiv.org/abs/2601.08775", "authors": ["Tameem Adel", "Abhishek Agarwal", "Stéphane Chrétien", "Estelle Massart", "Danila Mokeev", "Ivan Rungger", "Andrew Thompson"], "title": "A Langevin sampler for quantum tomography", "comment": null, "summary": "Quantum tomography involves obtaining a full classical description of a prepared quantum state from experimental results. We propose a Langevin sampler for quantum tomography, that relies on a new formulation of Bayesian quantum tomography exploiting the Burer-Monteiro factorization of Hermitian positive-semidefinite matrices. If the rank of the target density matrix is known, this formulation allows us to define a posterior distribution that is only supported on matrices whose rank is upper-bounded by the rank of the target density matrix. Conversely, if the target rank is unknown, any upper bound on the rank can be used by our algorithm, and the rank of the resulting posterior mean estimator is further reduced by the use of a low-rank promoting prior density. This prior density is a complex extension of the one proposed in (Annales de l'Institut Henri Poincare Probability and Statistics, 56(2):1465-1483, 2020). We derive a PAC-Bayesian bound on our proposed estimator that matches the best bounds available in the literature, and we show numerically that it leads to strong scalability improvements compared to existing techniques when the rank of the density matrix is known to be small."}
{"id": "2601.08299", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.08299", "abs": "https://arxiv.org/abs/2601.08299", "authors": ["Mingzhe Li", "Yang Kuang", "Zhicheng Hu"], "title": "A multi-mesh adaptive finite element method for solving the Gross-Pitaevskii equation", "comment": null, "summary": "It is found that the wave functions of the Gross-Pitaevskii equation (GPE) often vary significantly in different spatial regions, with some components exhibiting sharp variations while others remain smooth. Solving the GPE on a single mesh, even with adaptive refinement, can lead to excessive computational costs due to the need to accommodate the most oscillatory solution. To address this issue, we present a multi-mesh adaptive finite element method for solving the GPE. To this end, we first convert it into a time-dependent equation through the imaginary time propagation method. Then the equation is discretized by the backward Euler method temporally and the multi-mesh adaptive finite element method spatially. The proposed method is compared with the single-mesh adaptive method through a series of numerical experiments, which demonstrate that the multi-mesh adaptive method can achieve the same numerical accuracy with less computational consumption."}
{"id": "2601.08396", "categories": ["math.OC", "cs.DS", "math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.08396", "abs": "https://arxiv.org/abs/2601.08396", "authors": ["Jérémie Bigot", "Luis Fredes"], "title": "Kantorovich Distance via Spanning Trees: Properties and Algorithms", "comment": "37 pages, 43 figures", "summary": "We study optimal transport between probability measures supported on the same finite metric space, where the ground cost is a distance induced by a weighted connected graph. Building on recent work showing that the resulting Kantorovich distance can be expressed as a minimization problem over the set of spanning trees of this underlying graph, we investigate the implications of this reformulation on the construction of an optimal transport plan and a dual potential based on the solution of such an optimization problem. In this setting, we derive an explicit formula for the Kantorovich potential in terms of the imbalanced cumulative mass (a generalization of the cumulative distribution in R) along an optimal spanning tree solving such a minimization problem, under a weak non-degeneracy condition on the pair of measures that guarantees the uniqueness of a dual potential. Our second contribution establishes the existence of an optimal transport plan that can be computed efficiently by a dynamic programming procedure once an optimal spanning tree is known. Finally, we propose a stochastic algorithm based on simulated annealing on the space of spanning trees to compute such an optimal spanning tree. Numerical experiments illustrate the theoretical results and demonstrate the practical relevance of the proposed approach for optimal transport on finite metric spaces."}
{"id": "2601.08294", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08294", "abs": "https://arxiv.org/abs/2601.08294", "authors": ["Kyo Yamazaki"], "title": "A norm equivalence result for stochastic differential equations with locally Lipschitz coefficients", "comment": "38 pages", "summary": "We establish two-sided weighted integrability estimates, often referred to as a norm equivalence result, for stochastic differential equations (SDEs) with locally Lipschitz coefficients. As a key ingredient in our approach, we also derive an SDE satisfied by the inverse stochastic flow under reduced regularity assumptions in the globally Lipschitz setting."}
{"id": "2601.08396", "categories": ["math.OC", "cs.DS", "math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.08396", "abs": "https://arxiv.org/abs/2601.08396", "authors": ["Jérémie Bigot", "Luis Fredes"], "title": "Kantorovich Distance via Spanning Trees: Properties and Algorithms", "comment": "37 pages, 43 figures", "summary": "We study optimal transport between probability measures supported on the same finite metric space, where the ground cost is a distance induced by a weighted connected graph. Building on recent work showing that the resulting Kantorovich distance can be expressed as a minimization problem over the set of spanning trees of this underlying graph, we investigate the implications of this reformulation on the construction of an optimal transport plan and a dual potential based on the solution of such an optimization problem. In this setting, we derive an explicit formula for the Kantorovich potential in terms of the imbalanced cumulative mass (a generalization of the cumulative distribution in R) along an optimal spanning tree solving such a minimization problem, under a weak non-degeneracy condition on the pair of measures that guarantees the uniqueness of a dual potential. Our second contribution establishes the existence of an optimal transport plan that can be computed efficiently by a dynamic programming procedure once an optimal spanning tree is known. Finally, we propose a stochastic algorithm based on simulated annealing on the space of spanning trees to compute such an optimal spanning tree. Numerical experiments illustrate the theoretical results and demonstrate the practical relevance of the proposed approach for optimal transport on finite metric spaces."}
{"id": "2601.08478", "categories": ["math.NA", "q-bio.NC"], "pdf": "https://arxiv.org/pdf/2601.08478", "abs": "https://arxiv.org/abs/2601.08478", "authors": ["Mattia Corti", "Andrew Ahern", "Alain Goriely", "Ellen Kuhl", "Paola F. Antonietti"], "title": "A whole-brain model of amyloid beta accumulation and cerebral hypoperfusion in Alzheimer's disease", "comment": null, "summary": "Accumulation of amyloid beta proteins is a defining feature of Alzheimer's disease, and is usually accompanied by cerebrovascular pathology. Evidence suggests that amyloid beta and cerebrovascular pathology are mutually reinforcing; in particular, amyloid beta suppresses perfusion by constricting capillaries, and hypoperfusion promotes the production of amyloid beta. Here, we propose a whole-brain model coupling amyloid beta and blood vessel through a hybrid model consisting of a reaction-diffusion system for the protein dynamics and porous-medium model of blood flow within and between vascular networks: arterial, capillary and venous. We discretize the resulting parabolic--elliptic system of PDEs by means of a high-order discontinuous Galerkin method in space and an implicit Euler scheme in time. Simulations in realistic brain geometries demonstrate the emergence of multistability, implying that a sufficiently large pathogenic protein seeds is necessary to trigger disease outbreak. Motivated by the \"two-hit vascular hypothesis\" of Alzheimer's disease that hypoperfusive vascular damage triggers amyloid beta pathology, we also demonstrate that localized hypoperfusion, in response to injury, can destabilize the healthy steady state and trigger brain-wide disease outbreak."}
{"id": "2601.08426", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08426", "abs": "https://arxiv.org/abs/2601.08426", "authors": ["Odysseas Kanavetas", "Ekaterina Kosarevskaia"], "title": "Two-Product Make-to-Stock System: Strategic Joining and Optimal Inventory Levels", "comment": null, "summary": "This paper analyzes a two-product make-to-stock queueing system where a single production facility serves two customer classes with independent Poisson arrivals. Customers make strategic join-or-balk decisions without observing current inventory levels. The analysis establishes the existence and uniqueness of Nash equilibria in customer joining strategies for various inventory scenarios. Optimal base-stock levels are characterized from both profit-maximizing and welfare-maximizing perspectives, with closed-form expressions for key performance measures."}
{"id": "2601.08330", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08330", "abs": "https://arxiv.org/abs/2601.08330", "authors": ["Wenjing Cao", "Zhenjie Ren", "Xiaolu Tan"], "title": "Quantitative weak propagation of chaos for McKean--Vlasov branching diffusion processes", "comment": "35 pages", "summary": "We study in this paper the weak propagation of chaos for McKean--Vlasov diffusions with branching, whose induced marginal measures are nonnegative finite measures but not necessary probability measures. The flow of marginal measures satisfies a non-linear Fokker--Planck equation, along which we provide a functional Itô's formula. We then consider a functional of the terminal marginal measure of the branching process, whose conditional value is solution to a Kolmogorov backward master equation. By using Itô's formula and based on the estimates of second-order linear and intrinsic functional derivatives of the value function, we finally derive a quantitative weak convergence rate for the empirical measures of the branching diffusion processes with finite population."}
{"id": "2601.08453", "categories": ["math.PR", "math.CO", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.08453", "abs": "https://arxiv.org/abs/2601.08453", "authors": ["Jakub Gismatullin", "Patrick Tardivel"], "title": "Beta distribution and associated Stirling numbers of the second kind", "comment": null, "summary": "This article gives a formula for associated Stirling numbers of the second kind based on the moment of a sum of independent random variables having a beta distribution. From this formula we deduce, using probabilistic approaches, lower and upper bounds for these numbers."}
{"id": "2601.08498", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08498", "abs": "https://arxiv.org/abs/2601.08498", "authors": ["Jan Giesselmann", "Philipp Öffner", "Robert Sauerborn"], "title": "A Structure Preserving Finite Volume Scheme for the Navier-Stokes-Korteweg Equations", "comment": null, "summary": "We present a semi-discrete finite volume scheme for the local NavierStokes-Korteweg and Euler-Korteweg systems. Our scheme is applicable for equidistant Cartesian meshes in one and two space dimensions. In contrast to other works, which employ, for example, hyperbolic approximations of the equations or auxiliary-variable approaches leading to extended systems, our scheme operates directly on the original system. We prove that it conserves mass and momentum and is energy stable. Numerical experiments complement our theoretical findings, showing that the scheme is convergent of order one if employed with explicit or implicit time discretisation."}
{"id": "2601.08431", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08431", "abs": "https://arxiv.org/abs/2601.08431", "authors": ["Ralf Möller"], "title": "Exploring an Alternative Line-Search Method for Lagrange-Newton Optimization", "comment": null, "summary": "In the Lagrange-Newton method, where Newton's method is applied to a Lagrangian function that includes equality constraints, all stationary points are saddle points. It is therefore not possible to use a line-search method based on the value of the objective function; instead, the line search can operate on merit functions. In this report, we explore an alternative line-search method which is applicable to this case; it particulary addresses the damping of the step length in tight valleys. We propose a line-search criterion based on the divergence of the field of Newton step vectors. The visualization of the criterion for two-dimensional test functions reveals a network of ravines with flat bottom at the zero points of the criterion. The ravines are typically connected to stationary points. To traverse this ravine network in order to approach a stationary point, a zigzag strategy is devised. Numerical experiments demonstrate that the novel line-search strategy succeeds from most starting points in all test functions, but only exhibits the desired damping of the step length in some situations. At the present stage it is therefore difficult to appraise the utility of this contribution."}
{"id": "2601.08453", "categories": ["math.PR", "math.CO", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.08453", "abs": "https://arxiv.org/abs/2601.08453", "authors": ["Jakub Gismatullin", "Patrick Tardivel"], "title": "Beta distribution and associated Stirling numbers of the second kind", "comment": null, "summary": "This article gives a formula for associated Stirling numbers of the second kind based on the moment of a sum of independent random variables having a beta distribution. From this formula we deduce, using probabilistic approaches, lower and upper bounds for these numbers."}
{"id": "2601.08527", "categories": ["math.NA", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.08527", "abs": "https://arxiv.org/abs/2601.08527", "authors": ["Chenguang Duan", "Yuling Jiao", "Gabriele Steidl", "Christian Wald", "Jerry Zhijian Yang", "Ruizhe Zhang"], "title": "Sampling via Stochastic Interpolants by Langevin-based Velocity and Initialization Estimation in Flow ODEs", "comment": null, "summary": "We propose a novel method for sampling from unnormalized Boltzmann densities based on a probability-flow ordinary differential equation (ODE) derived from linear stochastic interpolants. The key innovation of our approach is the use of a sequence of Langevin samplers to enable efficient simulation of the flow. Specifically, these Langevin samplers are employed (i) to generate samples from the interpolant distribution at intermediate times and (ii) to construct, starting from these intermediate times, a robust estimator of the velocity field governing the flow ODE. For both applications of the Langevin diffusions, we establish convergence guarantees. Extensive numerical experiments demonstrate the efficiency of the proposed method on challenging multimodal distributions across a range of dimensions, as well as its effectiveness in Bayesian inference tasks."}
{"id": "2601.08460", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08460", "abs": "https://arxiv.org/abs/2601.08460", "authors": ["Topias Terho", "Fabricio Oliveira", "Ahti Salo", "Pedro Munari"], "title": "An efficient mixed-integer linear programming formulation for solving influence diagrams", "comment": null, "summary": "Influence diagrams represent decision-making problems with interdependencies between random events, decisions, and consequences. Traditionally, they have been solved using algorithms that determine the expected utility-maximizing decision strategy. In contrast, state-of-the-art solution approaches convert influence diagrams into a mixed-integer linear programming (MILP) model, which can be solved with powerful off-the-shelf MILP solvers. From a computational standpoint, the existing MILP formulations can be efficiently solved when applied to influence diagrams that represent periodic (or sequential) decision processes, which can be cast as partially observable Markov Decision Processes. However, they are inefficient in problems that lack a periodic structure or if the nodes in the influence diagram have large state spaces, thus limiting their practical use. In this paper, we present an efficient MILP formulation that is specifically designed for influence diagrams that are challenging for the earlier MILP formulation-based methods. Additionally, we present how the proposed formulation can be adapted to maximize conditional value-at-risk and how chance and logical constraints can be incorporated into the formulation, thus retaining the modeling flexibility of the MILP-based methods. Finally, we perform computational experiments addressing problems from the literature and compare the computational efficiency of the proposed formulation against the available MILP formulations for the reported influence diagrams. We find that the MILP models based on the proposed formulations can be solved significantly more efficiently compared to the state-of-the-art when solving influence diagrams that cannot be cast as partially observable Markov decision processes."}
{"id": "2601.08599", "categories": ["math.PR", "math-ph", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.08599", "abs": "https://arxiv.org/abs/2601.08599", "authors": ["Taegyun Kim"], "title": "A Sharp Universality Dichotomy for the Free Energy of Spherical Spin Glasses", "comment": "18 pages", "summary": "We study the free energy for pure and mixed spherical $p$-spin models with i.i.d.\\ disorder. In the mixed case, each $p$-interaction layer is assumed either to have regularly varying tails with exponent $α_p$ or to satisfy a finite $2p$-th moment condition.\n  For the pure spherical $p$-spin model with regularly varying disorder of tail index $α$, we introduce a tail-adapted normalization that interpolates between the classical Gaussian scaling and the extreme-value scale, and we prove a sharp universality dichotomy for the quenched free energy. In the subcritical regime $α<2p$, the thermodynamics is driven by finitely many extremal couplings and the free energy converges to a non-degenerate random limit described by the NIM (non-intersecting monomial) model, depending only on extreme-order statistics. At the critical exponent $α=2p$, we obtain a random one-dimensional TAP-type variational formula capturing the coexistence of an extremal spike and a universal Gaussian bulk on spherical slices. In the supercritical regime $α>2p$ (more generally, under a finite $2p$-th moment assumption), the free energy is universal and agrees with the deterministic Crisanti--Sommers/Parisi value of the corresponding Gaussian model, as established in [Sawhney-Sellke'24].\n  We then extend the subcritical and critical results to mixed spherical models in which each $p$-layer is either heavy-tailed with $α_p\\le 2p$ or has finite $2p$-th moment. In particular, we derive a TAP-type variational representation for the mixed model, yielding a unified universality classification of the quenched free energy across tail exponents and mixtures."}
{"id": "2601.08553", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08553", "abs": "https://arxiv.org/abs/2601.08553", "authors": ["Mahvish Samar", "Abdual Shahkoor"], "title": "A note on condition numbers for generalized inverse C^‡_A and their statistical estimation", "comment": null, "summary": "In this paper, we consider the condition number for the generalized inverse C^‡_A. We first present the explicit expression of normwise mixed and componentwise condition numbers. Then, we derive the explicit expression of normwise condition number without Kronecker product using the classical method for condition numbers. With the intermediate result, i.e., the derivative of C^‡_A, we can recover the explicit expressions of condition numbers for solution of Indefinite least squares problem with equality constraint. To estimate these condition numbers with high reliability, we choose the probabilistic spectral norm estimator and the small-sample statistical condition estimation method and devise three algorithms. Numerical experiments are provided to illustrate the obtained results"}
{"id": "2601.08494", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08494", "abs": "https://arxiv.org/abs/2601.08494", "authors": ["Michael Cummins", "Eric Kerrigan"], "title": "A New Duality-Free Framework for Convex Optimisation with Superlinear Convergence and Effective Warm-Starting", "comment": null, "summary": "Modern second order solvers for convex optimisation, such as interior point methods, rely on primal dual information and are difficult to warm start, limiting their applicability in real time control. We propose the PVM, a duality free framework that reformulates the constrained problem as the unconstrained minimisation of a value function. The resulting problem always has a solution, yields a certificate of infeasibility and is amenable to warm starting. We develop a second order algorithm for Quadratic Programming based on the PPA and semismooth Newton methods, and establish sufficient conditions for superlinear convergence to an arbitrarily small neighbourhood of the solution. Numerical experiments on a MPC problem demonstrate competitive performance with state of the art solvers from a cold start and up to 70\\% reduction in Newton iterations when warm starting."}
{"id": "2601.08667", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08667", "abs": "https://arxiv.org/abs/2601.08667", "authors": ["Tom Garcia-Sanchez"], "title": "The Radial Spanning Tree is straight in all dimensions", "comment": "30 pages, 9 figures", "summary": "The Radial Spanning Tree (RST) in dimension $d\\geq2$ is a random geometric graph constructed on a homogeneous Poisson point process $\\mathcal N$ in $\\mathbb R^d$ augmented by the origin, with edges connecting each $x\\in\\mathcal N$ to the nearest point $y\\in\\mathcal N\\cup\\{0\\}$ that lies closer to $0$ than $x$, with respect to the Euclidean distance. By construction, it forms almost surely a tree rooted at $0$. The RST was introduced in 2007 by Baccelli and Bordenave, who investigated straightness, a deterministic property introduced by Howard and Newman in 2001, to derive information about the asymptotic directions of infinite branches. They proved that the RST is almost surely straight in dimension $2$, which directly implies that all infinite branches are asymptotically directed, every possibility is attained, and directions reached by multiple infinite branches form a dense subset. However, their approach relies crucially on planarity, preventing any straightforward extension to higher dimensions. In this paper, we close this gap by proving that the RST is almost surely \\emph{straight} in any dimension, thereby obtaining the same consequences for the behavior of infinite branches. Our approach resolves the key barriers in the study of the RST, notably those posed by the complex dependency structure combined with the radial nature of the model, and especially beyond the planar setting. It relies on tools developed for the analysis of the Directed Spanning Forest, a closely related model, including recent progress by the author in 2025. Specifically, a key contribution of this work is the construction of a suitable renewal-type decomposition of RST paths. Leveraging this decomposition together with classical concentration inequalities, we show that RST paths cannot deviate far from straight lines and derive straightness."}
{"id": "2601.08561", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.08561", "abs": "https://arxiv.org/abs/2601.08561", "authors": ["V. Temlyakov"], "title": "Sampling recovery on classes defined by integral operators and sparse approximation with adaptive dictionaries", "comment": null, "summary": "In this paper we continue to develop the following general approach. We study asymptotic behavior of the errors of sampling recovery not for an individual smoothness class, how it is usually done, but for the collection of classes, which are defined by integral operators with kernels coming from a given class of functions. Earlier, such approach was realized for the Kolmogorov widths and very recently for the entropy numbers. It turns out that the above problem is closely related to the sparse approximation problem with respect to different redundant dictionaries. Specifically, the problem of sampling recovery is connected with sparse nonlinear approximation with respect to adaptive dictionaries, which means that the dictionary depends on the function under approximation."}
{"id": "2601.08547", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.08547", "abs": "https://arxiv.org/abs/2601.08547", "authors": ["Jona-Maria Diederen", "Holger Rauhut", "Ulrich Terstiege"], "title": "Convergence of gradient flow for learning convolutional neural networks", "comment": "17 pages", "summary": "Convolutional neural networks are widely used in imaging and image recognition. Learning such networks from training data leads to the minimization of a non-convex function. This makes the analysis of standard optimization methods such as variants of (stochastic) gradient descent challenging. In this article we study the simplified setting of linear convolutional networks. We show that the gradient flow (to be interpreted as an abstraction of gradient descent) applied to the empirical risk defined via certain loss functions including the square loss always converges to a critical point, under a mild condition on the training data."}
{"id": "2601.08730", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08730", "abs": "https://arxiv.org/abs/2601.08730", "authors": ["John Armstrong", "Purba Das"], "title": "Gamma Hedging without Rough Paths", "comment": null, "summary": "We show how the robustness of gamma hedging can be understood without using rough-path theory. Instead, we use the concepts of $p^{th}$ variation along a partition sequence and Taylor's theorem directly, rather than defining an integral and proving a version of Itô's lemma. The same approach allows classical results on delta-hedging to be proved without defining an integral and without the need to define the concept of self-financing in continuous time. We show that the approach can also be applied to barrier options and Asian options"}
{"id": "2601.08594", "categories": ["math.NA", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.08594", "abs": "https://arxiv.org/abs/2601.08594", "authors": ["Rishi Leburu", "Levon Nurbekyan", "Lars Ruthotto"], "title": "Differentiating through Stochastic Differential Equations: A Primer", "comment": "20 pages, 3 figures", "summary": "Dynamical systems are essential to model various phenomena in physics, finance, economics, and are also of current interest in machine learning. A central modeling task is investigating parameter sensitivity, whether tuning atmospheric coefficients, computing financial Greeks, or optimizing neural networks. These sensitivities are mathematically expressed as derivatives of an objective function with respect to parameters of interest and are rarely available analytically, necessitating numerical methods for approximating them. While the literature for differentiation of deterministic systems is well-covered, the treatment of stochastic systems, such as stochastic differential equations (SDEs), in most curricula is less comprehensive than the subtleties arising from the interplay of noise and discretization require.\n  This paper provides a primer on numerical differentiation of SDEs organized as a two-tale narrative. Tale 1 demonstrates differentiating through discretized SDEs, known the discretize-optimize approach, is reliable for both Itô and Stratonovich calculus. Tale 2 examines the optimize-discretize approach, investigating the continuous limit of backward equations from Tale 1 corresponding to the desired gradients. Our aim is to equip readers with a clear guide on the numerical differentiation of SDEs: computing gradients correctly in both Itô and Stratonovich settings, understanding when discretize-optimize and optimize-discretize agree or diverge, and developing intuition for reasoning about stochastic differentiation beyond the cases explicitly covered."}
{"id": "2601.08551", "categories": ["math.OC", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.08551", "abs": "https://arxiv.org/abs/2601.08551", "authors": ["Guangyu Wu", "Anders Lindquist"], "title": "Truncated Multidimensional Trigonometric Moment Problem: A Choice of Bases and the Unique Solution", "comment": "16 pages, 3 figures", "summary": "In this prelinimary version of paper, we propose to give a complete solution to the Truncated Multidimensional Trigonometric Moment Problem (TMTMP) from a system and signal processing perspective. In mathematical TMTMPs, people care about whether a solution exists for a given sequence of multidimensional trigonometric moments. The solution can have the form of an atomic measure. However, for the TMTMPs in system and signal processing, a solution as an analytic rational function, of which the numerator and the denominator are positive polynomials, is desired for the ARMA modelling of a stochastic process, which is the so-called Multidimensional Rational Covariance Extension problem (RCEP) . In the literature, the feasible domain of the TMTMPs, where the spectral density is positive, is difficult to obtain given a specific choice of basis functions, which causes severe problems in the Multidimensional RCEP. In this paper, we propose a choice of basis functions, and a corresponding estimation scheme by convex optimization, for the TMTMPs, with which the trigonometric moments of the spectral estimate are exactly the sample moments. We propose an explicit condition for the convex optimization problem for guaranteeing the positiveness of the spectral estimation. The map from the parameters of the estimate to the trigonometric moments is proved to be a diffeomorphism, which ensures the existence and uniqueness of solution. The statistical properties of the proposed spectral density estimation scheme are comprehensively proved, including the consistency, (asymptotical) unbiasedness, convergence rate and efficiency under a mild assumption. This well-posed treatment is then applied to a system identification task, and the simulation results validate our proposed treatment for the TMTMP in system and signal processing."}
{"id": "2601.08766", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.08766", "abs": "https://arxiv.org/abs/2601.08766", "authors": ["Louis Chataignier", "Lianghui Luo"], "title": "Upper moderate deviation probabilities for the maximum of a branching random walk", "comment": "37 pages, 0 figure", "summary": "Consider $M_n$ the maximal position at generation $n$ of a supercritical branching random walk. Aïdékon (2013) obtained and described the convergence in law, as time $n$ goes to infinity, of $M_n-m_n$, where $m_n$ is an explicit function. Equivalently, he identified the limit of $\\mathbb{P}(M_n > m_n + x)$, for any $x \\in \\mathbb{R}$. More recently, Luo (2025) gave an asymptotic equivalent for the upper large deviation probability, that is $\\mathbb{P}(M_n > m_n + xn)$, for $x > 0$. In this work, we study an intermediate regime, called upper moderate deviation. We obtain, under close-to-optimal integrability conditions, an asymptotic equivalent for $\\mathbb{P}(M_n > m_n + x_n)$, where $x_n$ is such that $x_n \\to \\infty$ and $x_n = O(\\sqrt{n})$. Our proof is based on a strategy due to Bramson, Ding, and Zeitouni (2016). As a byproduct, we obtain information about the typical behavior of particles contributing to such deviations. Finally, we apply our main result to show the convergence in law of the centered maximum of a two-speed branching random walk in the mean regime and describe its limit."}
{"id": "2601.08709", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.08709", "abs": "https://arxiv.org/abs/2601.08709", "authors": ["Marc Salvadó-Benasco", "Aymane Kssim", "Alexander Heinlein", "Rolf Krause", "Serge Gratton", "Alena Kopaničáková"], "title": "Multi-Preconditioned LBFGS for Training Finite-Basis PINNs", "comment": "13 pages", "summary": "A multi-preconditioned LBFGS (MP-LBFGS) algorithm is introduced for training finite-basis physics-informed neural networks (FBPINNs). The algorithm is motivated by the nonlinear additive Schwarz method and exploits the domain-decomposition-inspired additive architecture of FBPINNs, in which local neural networks are defined on subdomains, thereby localizing the network representation. Parallel, subdomain-local quasi-Newton corrections are then constructed on the corresponding local parts of the architecture. A key feature is a novel nonlinear multi-preconditioning mechanism, in which subdomain corrections are optimally combined through the solution of a low-dimensional subspace minimization problem. Numerical experiments indicate that MP-LBFGS can improve convergence speed, as well as model accuracy over standard LBFGS while incurring lower communication overhead."}
{"id": "2601.08614", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.08614", "abs": "https://arxiv.org/abs/2601.08614", "authors": ["Dmitry Bylinkin", "Sergey Skorik", "Dmitriy Bystrov", "Leonid Berezin", "Aram Avetisyan", "Aleksandr Beznosikov"], "title": "Accelerated Methods with Complexity Separation Under Data Similarity for Federated Learning Problems", "comment": "30 pages, 4 theorems, 2 figures", "summary": "Heterogeneity within data distribution poses a challenge in many modern federated learning tasks. We formalize it as an optimization problem involving a computationally heavy composite under data similarity. By employing different sets of assumptions, we present several approaches to develop communication-efficient methods. An optimal algorithm is proposed for the convex case. The constructed theory is validated through a series of experiments across various problems."}
{"id": "2601.08786", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.08786", "abs": "https://arxiv.org/abs/2601.08786", "authors": ["Guido Lagos", "Jorge Navarro", "Hector Olivero"], "title": "Simple repair policies and decompositions for semi-coherent systems with simultaneous failures", "comment": null, "summary": "We consider semi-coherent binary systems that are subject to simultaneous failures of its components. These are systems whose components can be either working or failed; the system can also be working or failed depending on the state of the components; and repairing a component cannot cause the system to fail. We consider that one or more components can fail simultaneously, allowing us to model external shocks and disasters. For this, we use the Lévy-frailty Marshall-Olkin (LFMO) multivariate distribution to model the failure times of the components. We aim to answer in which states of the system we should repair the components. This is a challenging question, as the number of repair policies grows super-exponentially in the number of components. To tackle this, we propose a simple family of repair policies, which we call $r$-out-of-$n$:R repair policies, where one repairs all failed components when the system fails or when there are $r$ or more failed components. Our main contribution is that we derive exact and simple expressions for key performance-evaluation quantities of the system operating under our proposed repair policies. That is, we give explicit expressions for the mean time-to-failure of the system, mean time-to-repair, probability of system-failure before repair, and component- and system-repair rate. We also give expressions for the expected cost and long-term average cost, when there are components' and system repair cost. The only relevant parameters involved in the derived expressions are the structural signature of the system, and the Laplace exponent associated to the LFMO distribution."}
{"id": "2601.08759", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.08759", "abs": "https://arxiv.org/abs/2601.08759", "authors": ["Eligio Colmenares", "Ricardo Ruiz-Baier", "Dalidet Sanhueza"], "title": "Convergence analysis and adaptive computation of a Banach-space mixed finite element method for generalized bioconvective flows", "comment": null, "summary": "We develop and analyse an adaptive fully mixed finite element method for stationary generalized bioconvective flows, where the Navier--Stokes equations with concentration-dependent viscosity are coupled with a conservation law for swimming microorganisms. The formulation introduces auxiliary variables including the trace-free velocity gradient, a symmetric pseudo-stress tensor, the concentration gradient, and a semi-advective microorganism flux, which also allows for a consistent treatment of Robin-type boundary condition. The variational problem is posed within a Banach space framework and reformulated as a fixed-point operator. Existence of solutions follows from Schauder's theorem, while uniqueness is obtained under suitable data assumptions. The discrete problem is constructed using Raviart--Thomas finite element spaces together with piecewise polynomial approximations on macroelement-structured meshes, and existence of discrete solutions is established via Brouwer's theorem. An a priori error analysis yields optimal convergence rates. We further derive a residual-based a posteriori error estimator and prove its reliability using global inf-sup conditions, Helmholtz decompositions, and suitable projection operators, while efficiency is ensured through localization techniques and bubble functions. Numerical experiments in two and three dimensions confirm the theoretical results, demonstrate the effectiveness of adaptive refinement for singular solutions and complex geometries with inclusions, and illustrate the robustness of the method for a bioconvective benchmark with plume formation governed by an Einstein--Batchelor-type viscosity law."}
{"id": "2601.08630", "categories": ["math.OC", "math.AP", "math.CA"], "pdf": "https://arxiv.org/pdf/2601.08630", "abs": "https://arxiv.org/abs/2601.08630", "authors": ["Grégoire Nadin", "David Nahmani", "Nicolas Vauchelet"], "title": "Optimal Dirac controls for time-periodic bistable ODEs, application to population replacement", "comment": null, "summary": "This work addresses an optimal control problem on a dynamics governed by a nonlinear differential equation with a bistable time-periodic nonlinearity. This problem, relevant in population dynamics, models the strategy of replacing a population of A-type individuals by a population of B-type individuals in a time-varying environment, focusing on the evolution of the proportion of B-type individuals among the whole population. The control term accounts for the instant release of B-type individuals. Our main goal, after noting some interesting properties on the differential equation, is to determine the optimal time at which this release should be operated to ensure population replacement while minimizing the release effort. The results establish that the optimal release time appears to be the minimizer of a function involving the carrying capacity of the environment and the threshold periodic solution of the dynamics; they also describe the convergence of the whole optimal release strategy. An application to the biocontrol of mosquito populations using Wolbachia-infected individuals illustrates the relevance of the theoretical results. Wolbachia is a bacterium that helps preventing the transmission of some viruses from mosquitoes to humans, making the optimization of Wolbachia propagation in a mosquito population a crucial issue."}
{"id": "2601.08396", "categories": ["math.OC", "cs.DS", "math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.08396", "abs": "https://arxiv.org/abs/2601.08396", "authors": ["Jérémie Bigot", "Luis Fredes"], "title": "Kantorovich Distance via Spanning Trees: Properties and Algorithms", "comment": "37 pages, 43 figures", "summary": "We study optimal transport between probability measures supported on the same finite metric space, where the ground cost is a distance induced by a weighted connected graph. Building on recent work showing that the resulting Kantorovich distance can be expressed as a minimization problem over the set of spanning trees of this underlying graph, we investigate the implications of this reformulation on the construction of an optimal transport plan and a dual potential based on the solution of such an optimization problem. In this setting, we derive an explicit formula for the Kantorovich potential in terms of the imbalanced cumulative mass (a generalization of the cumulative distribution in R) along an optimal spanning tree solving such a minimization problem, under a weak non-degeneracy condition on the pair of measures that guarantees the uniqueness of a dual potential. Our second contribution establishes the existence of an optimal transport plan that can be computed efficiently by a dynamic programming procedure once an optimal spanning tree is known. Finally, we propose a stochastic algorithm based on simulated annealing on the space of spanning trees to compute such an optimal spanning tree. Numerical experiments illustrate the theoretical results and demonstrate the practical relevance of the proposed approach for optimal transport on finite metric spaces."}
{"id": "2601.08787", "categories": ["math.NA", "math.CA", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.08787", "abs": "https://arxiv.org/abs/2601.08787", "authors": ["F. Dai", "V. Temlyakov"], "title": "A survey on sampling recovery", "comment": "68 pages", "summary": "The reconstruction of unknown functions from a finite number of samples is a fundamental challenge in pure and applied mathematics. This survey provides a comprehensive overview of recent developments in sampling recovery, focusing on the accuracy of various algorithms and the relationship between optimal recovery errors, nonlinear approximation, and the Kolmogorov widths of function classes. A central theme is the synergy between the theory of universal sampling discretization and Lebesgue-type inequalities for greedy algorithms. We discuss three primary algorithmic frameworks: weighted least squares and $\\ell_p$ minimization, sparse approximation methods, and greedy algorithms such as the Weak Orthogonal Matching Pursuit (WOMP) in Hilbert spaces and the Weak Tchebychev Greedy Algorithm (WCGA) in Banach spaces. These methods are applied to function classes defined by structural conditions, like the $A_β^r$ and Wiener-type classes, as well as classical Sobolev-type classes with dominated mixed derivatives. Notably, we highlight recent findings showing that nonlinear sampling recovery can provide superior error guarantees compared to linear methods for certain multivariate function classes."}
{"id": "2601.08672", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08672", "abs": "https://arxiv.org/abs/2601.08672", "authors": ["Jiacheng Wu", "Qi Zhang"], "title": "The Ergodic Linear-Quadratic Optimal Control Problems with Random Periodic Coefficients", "comment": null, "summary": "In this paper, we concern with the ergodic linear-quadratic closed-loop optimal control problems with random periodic coefficients. We put forward the random periodic mean-square exponentially stable condition, and prove the random periodicity of solutions to state equation based on it. Then we prove the existence and uniqueness of random periodic solutions to two types of backward stochastic differential equations which serve as stochastic Riccati equations in the procedure of completing the square. With the random periodicity of state equation and stochastic Riccati equations, the ergodic cost functional on infinite horizon is simplified to an equivalent cost functional over a single periodic interval without limit. Finally, the closed-loop optimal controls are explicitly given based on random periodic solutions to state equation and stochastic Riccati equations."}
{"id": "2601.08527", "categories": ["math.NA", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.08527", "abs": "https://arxiv.org/abs/2601.08527", "authors": ["Chenguang Duan", "Yuling Jiao", "Gabriele Steidl", "Christian Wald", "Jerry Zhijian Yang", "Ruizhe Zhang"], "title": "Sampling via Stochastic Interpolants by Langevin-based Velocity and Initialization Estimation in Flow ODEs", "comment": null, "summary": "We propose a novel method for sampling from unnormalized Boltzmann densities based on a probability-flow ordinary differential equation (ODE) derived from linear stochastic interpolants. The key innovation of our approach is the use of a sequence of Langevin samplers to enable efficient simulation of the flow. Specifically, these Langevin samplers are employed (i) to generate samples from the interpolant distribution at intermediate times and (ii) to construct, starting from these intermediate times, a robust estimator of the velocity field governing the flow ODE. For both applications of the Langevin diffusions, we establish convergence guarantees. Extensive numerical experiments demonstrate the efficiency of the proposed method on challenging multimodal distributions across a range of dimensions, as well as its effectiveness in Bayesian inference tasks."}
{"id": "2601.08700", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08700", "abs": "https://arxiv.org/abs/2601.08700", "authors": ["Nam Van Tran"], "title": "Novel Dynamical Systems with Finite-Time and Fixed-Time Stability for Generalized Inverse Mixed Variational Inequality Problems", "comment": null, "summary": "This paper investigates a class of generalized inverse mixed variational inequality problems (GIMVIPs), which consist in finding a vector $\\overline{w}\\in \\R^d$ such that \\[ F(\\bar w)\\in Ω\\quad \\text{and} \\quad \\langle h(\\bar w), v-F(\\bar w) \\rangle + g(v)-g(F(\\bar w)) \\ge 0, \\quad \\forall v\\in Ω, \\] where \\(h,F:\\R^d\\to\\R^d\\) are single-valued operators, \\(g:Ω\\to\\R\\cup\\{+\\infty\\}\\) is a proper function, and \\(Ω\\) is a closed convex set.\n  Two novel continuous-time dynamical systems are proposed to analyze the finite-time and fixed-time stability of solutions to GIMVIPs in finite-dimensional Hilbert spaces. Under suitable assumptions on the operators and model parameters, Lyapunov-based techniques are employed to establish finite-time and fixed-time convergence of the generated trajectories.\n  While both systems exhibit accelerated convergence, the settling time of the finite-time stable system depends on the initial condition, whereas the fixed-time stable system admits a uniform upper bound on the convergence time that is independent of the initial state. Moreover, an explicit forward Euler discretization of the continuous-time dynamics leads to a proximal point-type algorithm that preserves the fixed-time convergence property. Rigorous convergence analysis of the resulting iterative scheme is provided. A numerical experiment is presented to demonstrate the effectiveness of the proposed methods."}
{"id": "2601.08594", "categories": ["math.NA", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.08594", "abs": "https://arxiv.org/abs/2601.08594", "authors": ["Rishi Leburu", "Levon Nurbekyan", "Lars Ruthotto"], "title": "Differentiating through Stochastic Differential Equations: A Primer", "comment": "20 pages, 3 figures", "summary": "Dynamical systems are essential to model various phenomena in physics, finance, economics, and are also of current interest in machine learning. A central modeling task is investigating parameter sensitivity, whether tuning atmospheric coefficients, computing financial Greeks, or optimizing neural networks. These sensitivities are mathematically expressed as derivatives of an objective function with respect to parameters of interest and are rarely available analytically, necessitating numerical methods for approximating them. While the literature for differentiation of deterministic systems is well-covered, the treatment of stochastic systems, such as stochastic differential equations (SDEs), in most curricula is less comprehensive than the subtleties arising from the interplay of noise and discretization require.\n  This paper provides a primer on numerical differentiation of SDEs organized as a two-tale narrative. Tale 1 demonstrates differentiating through discretized SDEs, known the discretize-optimize approach, is reliable for both Itô and Stratonovich calculus. Tale 2 examines the optimize-discretize approach, investigating the continuous limit of backward equations from Tale 1 corresponding to the desired gradients. Our aim is to equip readers with a clear guide on the numerical differentiation of SDEs: computing gradients correctly in both Itô and Stratonovich settings, understanding when discretize-optimize and optimize-discretize agree or diverge, and developing intuition for reasoning about stochastic differentiation beyond the cases explicitly covered."}
{"id": "2601.08717", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08717", "abs": "https://arxiv.org/abs/2601.08717", "authors": ["Isabel Barros Garcia", "Jérémie Messud"], "title": "Portfolio Optimization with 'Physical' Decision Variables and Non-Linear Performance Metrics: Diversification Challenge and Proposals", "comment": null, "summary": "Portfolio optimization (PO) is a core tool in financial and operational decision-making, typically balancing expected profit and risk. In real-world applications, particularly in the energy sector, decision variables can be expressed as physical quantities (e.g., production volumes), and nonlinear performance metrics such as Return on Investment (ROI) may be requested. These modeling choices introduce challenges, including the non-additivity of the objective function. This often results in highly concentrated optimized portfolios and thus limited diversification, which can be problematic for decision-makers seeking balanced investment strategies. This paper proposes two strategies to enhance diversification in ROI-based PO models, both based on the Herfindahl-Hirschman Index (HHI). The first incorporates an HHI term directly into the objective function, with its corresponding weight allowing control over diversification. The second directly maximizes diversification while controlling expected profit and risk degradation around the optimum portfolio (obtained through conventional PO). Both strategies are evaluated using synthetic data (energy assets) to illustrate their behavior and practical trade-offs. The results highlight how each method can support different decision-making needs and enhance portfolio robustness."}
{"id": "2601.08751", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.08751", "abs": "https://arxiv.org/abs/2601.08751", "authors": ["Timothé Taminiau", "Estelle Massart", "Geovani Nunes Grapiglia"], "title": "Riemannian optimization with finite-difference gradient approximations", "comment": null, "summary": "Derivative-free Riemannian optimization (DFRO) aims to minimize an objective function using only function evaluations, under the constraint that the decision variables lie on a Riemannian manifold. The rapid increase in problem dimensions over the years calls for computationally cheap DFRO algorithms, that is, algorithms requiring as few function evaluations and retractions as possible. We propose a novel DFRO method based on finite-difference gradient approximations that relies on an adaptive selection of the finite-difference accuracy and stepsize that is novel even in the Euclidean setting. When endowed with an intrinsic finite-difference scheme, that measures variations of the objective in tangent directions using retractions, our proposed method requires $O(dε^{-2})$ function evaluations and retractions to find an $ε$-critical point, where $d$ is the manifold dimension. We then propose a variant of our method when the search space is a Riemannian submanifold of an $n$-dimensional Euclidean space. This variant relies on an extrinsic finite-difference scheme, approximating the Riemannian gradient directly in the embedding space, assuming that the objective function can be evaluated outside of the manifold. This approach leads to worst-case complexity bounds of $O(dε^{-2})$ function evaluations and $O(ε^{-2})$ retractions. We also present numerical results showing that the proposed methods achieve superior performance over existing derivative-free methods on various problems in both Euclidean and Riemannian settings."}
{"id": "2601.08753", "categories": ["math.OC", "cs.AI", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.08753", "abs": "https://arxiv.org/abs/2601.08753", "authors": ["Rishav Sen", "Amutheezan Sivagnanam", "Aron Laszka", "Ayan Mukhopadhyay", "Abhishek Dubey"], "title": "Grid-Aware Charging and Operational Optimization for Mixed-Fleet Public Transit", "comment": "7 pages, 7 figures, 4 algorithms. Published in the Proceedings of the 2024 IEEE 27th International Conference on Intelligent Transportation Systems (ITSC)", "summary": "The rapid growth of urban populations and the increasing need for sustainable transportation solutions have prompted a shift towards electric buses in public transit systems. However, the effective management of mixed fleets consisting of both electric and diesel buses poses significant operational challenges. One major challenge is coping with dynamic electricity pricing, where charging costs vary throughout the day. Transit agencies must optimize charging assignments in response to such dynamism while accounting for secondary considerations such as seating constraints. This paper presents a comprehensive mixed-integer linear programming (MILP) model to address these challenges by jointly optimizing charging schedules and trip assignments for mixed (electric and diesel bus) fleets while considering factors such as dynamic electricity pricing, vehicle capacity, and route constraints. We address the potential computational intractability of the MILP formulation, which can arise even with relatively small fleets, by employing a hierarchical approach tailored to the fleet composition. By using real-world data from the city of Chattanooga, Tennessee, USA, we show that our approach can result in significant savings in the operating costs of the mixed transit fleets."}
{"id": "2601.08594", "categories": ["math.NA", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.08594", "abs": "https://arxiv.org/abs/2601.08594", "authors": ["Rishi Leburu", "Levon Nurbekyan", "Lars Ruthotto"], "title": "Differentiating through Stochastic Differential Equations: A Primer", "comment": "20 pages, 3 figures", "summary": "Dynamical systems are essential to model various phenomena in physics, finance, economics, and are also of current interest in machine learning. A central modeling task is investigating parameter sensitivity, whether tuning atmospheric coefficients, computing financial Greeks, or optimizing neural networks. These sensitivities are mathematically expressed as derivatives of an objective function with respect to parameters of interest and are rarely available analytically, necessitating numerical methods for approximating them. While the literature for differentiation of deterministic systems is well-covered, the treatment of stochastic systems, such as stochastic differential equations (SDEs), in most curricula is less comprehensive than the subtleties arising from the interplay of noise and discretization require.\n  This paper provides a primer on numerical differentiation of SDEs organized as a two-tale narrative. Tale 1 demonstrates differentiating through discretized SDEs, known the discretize-optimize approach, is reliable for both Itô and Stratonovich calculus. Tale 2 examines the optimize-discretize approach, investigating the continuous limit of backward equations from Tale 1 corresponding to the desired gradients. Our aim is to equip readers with a clear guide on the numerical differentiation of SDEs: computing gradients correctly in both Itô and Stratonovich settings, understanding when discretize-optimize and optimize-discretize agree or diverge, and developing intuition for reasoning about stochastic differentiation beyond the cases explicitly covered."}
{"id": "2601.08786", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.08786", "abs": "https://arxiv.org/abs/2601.08786", "authors": ["Guido Lagos", "Jorge Navarro", "Hector Olivero"], "title": "Simple repair policies and decompositions for semi-coherent systems with simultaneous failures", "comment": null, "summary": "We consider semi-coherent binary systems that are subject to simultaneous failures of its components. These are systems whose components can be either working or failed; the system can also be working or failed depending on the state of the components; and repairing a component cannot cause the system to fail. We consider that one or more components can fail simultaneously, allowing us to model external shocks and disasters. For this, we use the Lévy-frailty Marshall-Olkin (LFMO) multivariate distribution to model the failure times of the components. We aim to answer in which states of the system we should repair the components. This is a challenging question, as the number of repair policies grows super-exponentially in the number of components. To tackle this, we propose a simple family of repair policies, which we call $r$-out-of-$n$:R repair policies, where one repairs all failed components when the system fails or when there are $r$ or more failed components. Our main contribution is that we derive exact and simple expressions for key performance-evaluation quantities of the system operating under our proposed repair policies. That is, we give explicit expressions for the mean time-to-failure of the system, mean time-to-repair, probability of system-failure before repair, and component- and system-repair rate. We also give expressions for the expected cost and long-term average cost, when there are components' and system repair cost. The only relevant parameters involved in the derived expressions are the structural signature of the system, and the Laplace exponent associated to the LFMO distribution."}
