{"id": "2602.22283", "categories": ["cond-mat.mes-hall", "cond-mat.mtrl-sci", "cond-mat.str-el"], "pdf": "https://arxiv.org/pdf/2602.22283", "abs": "https://arxiv.org/abs/2602.22283", "authors": ["Junyu Tang", "Hong-hao Song", "Gang v. Chen"], "title": "Phononic enhancement and detection of hidden spin-nematicity and dynamics in quantum magnets", "comment": null, "summary": "The spin nematic phase, characterized by long-range order of spin quadrupole moments in the absence of dipolar magnetism, presents a significant challenge for conventional experimental detection. We propose a novel method to detect this elusive order in quantum magnets with an illustration in the spin-1 triangular lattice Mott insulator. By integrating out the phonon degrees of freedom, we obtain a phase diagram with substantially enlarged regions for the spin-nematic and spin-nematic-supersolid phases. We then demonstrate that through the spin-lattice coupling, the emergence of spin nematic order imprints a distinctive signature onto the phonon spectra, providing a clear spectroscopic signature for the quadrupolar order accessible via Raman or inelastic X-ray scattering. Our formalism offers a direct and powerful method to uncover the hidden spin nematicity, opening a new pathway for diagnosing multipolar orders in quantum magnets."}
{"id": "2602.22301", "categories": ["cond-mat.mes-hall", "cond-mat.mtrl-sci", "quant-ph"], "pdf": "https://arxiv.org/pdf/2602.22301", "abs": "https://arxiv.org/abs/2602.22301", "authors": ["Kwan Ho Au-Yeung", "Wantong Huang", "Johanna Matusche", "Paul Greule", "Jonas Arnold", "Lovis Hardeweg", "Máté Stark", "Luise Renz", "Affan Safeer", "Daniel Jansen", "Thomas Michely", "Jeison Fischer", "Wolfgang Wernsdorfer", "Christoph Sürgers", "Hannu-Pekka Komsa", "Johannes Schwenk", "Wouter Jolie", "Philip Willke"], "title": "Atomic-Scale Quantum Control of Single Spin Defects in a Two-Dimensional Semiconductor", "comment": "30 pages, 4 figures in the main text, 10 supplementary figures", "summary": "Individual spin defects in solids are promising building blocks for quantum technologies, but their deterministic creation, individual addressability, and operation near surfaces remain major challenges. Two-dimensional materials provide an attractive alternative, as their single-layer thickness enables direct atomic-scale access to defect states. Here, we demonstrate single-spin control of solid-state defects in a two-dimensional semiconductor by a combination of scanning tunneling microscopy and electron spin resonance. We create and manipulate individual sulfur vacancies and carbon substitution defects in monolayer molybdenum disulfide and characterize their spin dynamics, including coherent control, at the single-defect level. Using atomic manipulation, we further engineer and probe spin-spin interactions between defect pairs. Our results demonstrate deterministic creation, addressability, coherent manipulation, and controlled coupling of individual spin defects within a single experimental platform. This establishes atomically engineered spin defects in two-dimensional semiconductors as a versatile class of controllable solid-state quantum systems and opens a route towards tailored quantum sensing experiments."}
{"id": "2602.22322", "categories": ["cond-mat.mes-hall"], "pdf": "https://arxiv.org/pdf/2602.22322", "abs": "https://arxiv.org/abs/2602.22322", "authors": ["David F. Mross"], "title": "The Anyon Zeno Effect", "comment": "4 pages, 4 figures", "summary": "Two anyons encircling each other acquire a quantized braiding phase that is independent of their spatial separation. We show that detecting this phase in a fractional quantum Hall interference experiment results in a quantum Zeno effect: a localized anyon is trapped by constant observation from a stream of anyons supplied by the measurement current. Interferometers with an embedded antidot are ideal for accessing the Zeno regime, where the bare tunneling rate of localized anyons is much lower than the measurement rate. The Zeno-suppressed tunneling rate of the trapped anyon depends on the braiding phase and the transmission of the quantum point contacts. Our primary prediction is that the autocorrelation time of the conductance through the interferometer increases with the bias current. This effect may be used to experimentally control the anyon dynamics, in particular to increase the lifetime of localized anyons."}
{"id": "2602.22328", "categories": ["cond-mat.mes-hall"], "pdf": "https://arxiv.org/pdf/2602.22328", "abs": "https://arxiv.org/abs/2602.22328", "authors": ["Nisarga Paul", "Gil Refael"], "title": "Resonant Zener Interferometry in van der Waals Heterostructures", "comment": "6+10 pages", "summary": "We demonstrate the presence of quantum interference effects in van der Waals heterostructures subject to in-plane electric fields. The in-plane field $F$ accelerates carriers through a hybridized band edge, and interlayer Zener tunneling occurs by distinct pathways, resulting in a solid-state quantum interferometer with imprints in transport observables. For parabolic-band bilayers, we identify two characteristic signatures which are observable in lateral conductance: Landau-Zener-Stuckelberg oscillations in the band-overlap regime periodic in $1/F$ at small fields, resembling electric-field induced quantum oscillations, and a pronounced resonance at $F\\propto T_0^{3/2}$ set by the interlayer tunneling $T_0$. These features provide a directly accessible probe of coherent interferometric dynamics in van der Waals heterostructures, and could be harnessed for more precise engineering and characterization."}
{"id": "2602.23144", "categories": ["math-ph", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.23144", "abs": "https://arxiv.org/abs/2602.23144", "authors": ["Emanuele Caputo", "Augusto Gerolin", "Nataliia Monina", "Pavlo Pelikh", "Lorenzo Portinale"], "title": "Quantum thermodynamics and semidefinite programming: regularization and algorithms", "comment": null, "summary": "We investigate variational problems in quantum thermodynamics at positive temperature, in which admissible states are constrained by prescribed outcomes of a finite set of measurements. We solve a problem raised by the recent work \\cite[Section C]{MarkWilde} and develop a general mathematical setup which allows a broad class of possible regularizations. Employing methods inspired by non-commutative optimal transport, we analyze the dual formulation of the problem, study the existence and characterization of maximizers, and investigate the qualitative behavior of the model in the zero-temperature limit. In the second part, we tailor this framework to quantum state tomography and quantum optimal transport. Finally, we address computational aspects, with particular attention to the convergence of algorithms in selected cases."}
{"id": "2602.22631", "categories": ["cs.MS", "cs.LG", "cs.LO", "cs.PL", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.22631", "abs": "https://arxiv.org/abs/2602.22631", "authors": ["Robert Joseph George", "Jennifer Cruden", "Xiangru Zhong", "Huan Zhang", "Anima Anandkumar"], "title": "TorchLean: Formalizing Neural Networks in Lean", "comment": "35 pages, multiple figures and tables", "summary": "Neural networks are increasingly deployed in safety- and mission-critical pipelines, yet many verification and analysis results are produced outside the programming environment that defines and runs the model. This separation creates a semantic gap between the executed network and the analyzed artifact, so guarantees can hinge on implicit conventions such as operator semantics, tensor layouts, preprocessing, and floating-point corner cases. We introduce TorchLean, a framework in the Lean 4 theorem prover that treats learned models as first-class mathematical objects with a single, precise semantics shared by execution and verification. TorchLean unifies (1) a PyTorch-style verified API with eager and compiled modes that lower to a shared op-tagged SSA/DAG computation-graph IR, (2) explicit Float32 semantics via an executable IEEE-754 binary32 kernel and proof-relevant rounding models, and (3) verification via IBP and CROWN/LiRPA-style bound propagation with certificate checking. We validate TorchLean end-to-end on certified robustness, physics-informed residual bounds for PINNs, and Lyapunov-style neural controller verification, alongside mechanized theoretical results including a universal approximation theorem. These results demonstrate a semantics-first infrastructure for fully formal, end-to-end verification of learning-enabled systems."}
{"id": "2602.22789", "categories": ["cond-mat.mes-hall", "cond-mat.mtrl-sci", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.22789", "abs": "https://arxiv.org/abs/2602.22789", "authors": ["Cynthia Ihuoma Osuala", "Tanu Choudhary", "Raju K. Biswas", "Sudin Ganguly", "Santanu K. Maiti"], "title": "First-principles and tight-binding analysis of thermoelectricity in irradiated WSe$_2$", "comment": "13 pages, 10 figures. Comments are welcome", "summary": "Electronic and thermoelectric transport in zigzag monolayer WSe$_2$ nanoribbons are studied under monochromatic irradiation. The electronic structure is described within a six-orbital tight-binding framework constructed from the relevant tungsten and selenium orbitals, with atomic spin-orbit coupling included explicitly. Periodic driving is incorporated via the Peierls substitution, and in the high-frequency limit the system is mapped onto an effective static Floquet Hamiltonian with polarization-dependent renormalized hoppings. Coherent transport is evaluated using wave-function matching within the Landauer-Büttiker formalism. The lattice thermal conductivity is obtained independently from density functional perturbation theory combined with an iterative solution of the phonon Boltzmann transport equation. Light-induced hopping renormalization reshapes the band dispersion and transmission spectrum near the Fermi level, modifying the Landauer transport integrals that determine electrical and thermal conductances and the Seebeck coefficient. Together with spin-orbit-driven band splitting and reduced lattice thermal conductivity from enhanced anharmonic scattering, this leads to a thermoelectric figure of merit $ZT$ exceeding unity over a broad temperature range."}
{"id": "2602.23156", "categories": ["math-ph"], "pdf": "https://arxiv.org/pdf/2602.23156", "abs": "https://arxiv.org/abs/2602.23156", "authors": ["Matthias Keller", "Lorenzo Pettinari", "Christiaan J. F. van de Ven"], "title": "Coupling of the continuum and semiclassical limit. Part I: convergence of eigenvalues", "comment": "33 pages, 1 figure", "summary": "We analyze the semiclassical $d$-dimensional Schrödinger operator in the continuum $ \\frac{1}{2} Δ+ λ_N^2 V$ discretized on a mesh with spacing proportional to $1/N$. The semi-classical parameter $λ_N$ is chosen as $λ_N = N^{1 - γ}$, with $γ\\in (-1,1)$, which ensures that $N$ governs both the semiclassical and continuum limit simultaneously. We prove that all eigenvalues of the discrete operator converge to those of the continuum, as $λ_N\\to\\infty$. Beyond this semi-classical domain, in the case of the harmonic oscillator, we further discuss the spectral asymptotics for $γ\\in \\mathbb{R} \\setminus (-1,1)$, thereby fully characterizing the eigenvalue behavior across all possible values of $γ\\in\\mathbb{R}$."}
{"id": "2602.23099", "categories": ["cond-mat.mes-hall", "quant-ph"], "pdf": "https://arxiv.org/pdf/2602.23099", "abs": "https://arxiv.org/abs/2602.23099", "authors": ["Lukas Litzba", "Gernot Schaller", "Jürgen König", "Nikodem Szpak"], "title": "Coupling-energy driven pumping through quantum dots: the role of coherences", "comment": "20 figures, 20 pages", "summary": "We study the impact of off-resonant tunneling and coherences on the electron pumping through quantum dots. Thereby, we focus on two electron-pump setups where lowest-order tunneling processes are suppressed and the pump is exclusively driven by modulations of the coupling energy. The first setup is driven by switching on and off the couplings between the quantum dot and the leads, while the second setup employs measurements of the dot occupation. We derive exact solutions for arbitrarily strong tunnel couplings in the absence of Coulomb interaction, identify parameter regimes with optimal pumping currents or optimal energy efficiency, and discuss similarities between both pumping mechanisms."}
{"id": "2602.23352", "categories": ["math-ph", "cond-mat.dis-nn"], "pdf": "https://arxiv.org/pdf/2602.23352", "abs": "https://arxiv.org/abs/2602.23352", "authors": ["Wojciech De Roeck", "Amirali Hannani", "Alessio Lerose", "Nathan Vandenbosch"], "title": "Stark localization of interacting particles", "comment": null, "summary": "We consider N interacting quantum particles on a one-dimensional lattice, and subjected to an external linear potential. For N = 1, the corresponding Hamiltonian is explicitly diagonalizable, with superexponentially localized eigenstates. This is called Stark localization. We prove that superexponential spectral localization persists for arbitrary N and every interaction strength."}
{"id": "2602.23208", "categories": ["cond-mat.mes-hall"], "pdf": "https://arxiv.org/pdf/2602.23208", "abs": "https://arxiv.org/abs/2602.23208", "authors": ["Aitor Garcia-Ruiz", "Che-pin Hsu", "Ming-Hao Liu", "Marcin Mucha-Kruczynski"], "title": "Dimensional and doping stability of Peierls charge density waves", "comment": "11 pages, 5 figures", "summary": "The Peierls instability, the spontaneous dimerization of a one-dimensional metallic chain at half filling, is a paradigmatic mechanism for charge-density-wave (CDW) formation. Here we test its robustness under finite doping and interchain hybridization in finite-thickness arrays of identical chains. We find that the stacking geometry plays a decisive role in stabilizing CDW order away from half filling. In particular, parallel-coupled chains exhibit a bistable regime where the normal and dimerized states coexist as local minima of the total energy, while skew-coupled chains display reentrant CDW order upon doping. Our results demonstrate that even minimal models of coupled atomic chains host rich phase diagrams controlled by doping, lattice rigidity, and interchain coupling geometry."}
{"id": "2602.23273", "categories": ["cond-mat.mes-hall"], "pdf": "https://arxiv.org/pdf/2602.23273", "abs": "https://arxiv.org/abs/2602.23273", "authors": ["Sanjay Sarkar", "Sayan Sarkar", "Amit Agarwal"], "title": "Extrinsic Spin Splitter Currents in Altermagnets", "comment": "17 pages, 6 figures", "summary": "Altermagnets exhibit momentum-dependent spin splitting despite having zero net magnetization. This enables a spin-splitter effect in which an external electric field generates transverse spin currents by separating oppositely polarized carriers. Here, we develop a unified semiclassical theory of linear extrinsic spin-splitter currents, incorporating impurity-induced side-jump and skew-scattering contributions, and apply it to the $d$-wave altermagnet \\ch{FeSb2}. We demonstrate that asymmetric impurity scattering provides a dominant channel for spin-splitter currents. Remarkably, the resulting extrinsic spin conductivity is time-reversal even, in contrast to previously studied spin-splitter responses arising from symmetric scattering."}
{"id": "2602.23298", "categories": ["cond-mat.mes-hall", "cond-mat.mtrl-sci", "physics.app-ph"], "pdf": "https://arxiv.org/pdf/2602.23298", "abs": "https://arxiv.org/abs/2602.23298", "authors": ["Zewen Wu", "Min Zhou", "Yanxia Xing", "Xianghua Kong"], "title": "Electromechanical Switching and Momentum-Selective Transport in Geometry-Defined Blue Phosphorus Homojunctions", "comment": null, "summary": "Developing intrinsic homojunctions without chemical heterogeneity remains a key challenge in future two - dimensional devices. Here, we report a geometry - defined metal--semiconductor--metal homojunction in bilayer blue phosphorus (BlueP) created by a localized bubble corrugation, without chemical doping or foreign - material interfaces. First - principles calculations show that enlarging the interlayer separation in the metallic A\\(_1\\)B\\(_1\\) - stacked BlueP bilayer opens a band gap, enabling a semiconducting barrier embedded between metallic segments. First - principles quantum - transport simulations reveal a crossover from ballistic to tunneling transport upon bubble formation. In the tunneling regime, transmission decreases exponentially with bubble width while remaining weakly sensitive to bubble height and bulging direction. The junction acts as an orientation - dependent \\(k\\) - space filter, producing transport anisotropy and momentum selectivity. Orbital - resolved scattering analysis shows that intralayer - bonding channels persist under deformation whereas interlayer - hybridized channels are quenched, and that σ- type bonding yields higher conductance than π- type bonding. These insights motivate two electromechanical device concepts: a mechanically switchable memory element with ON/OFF ratios up to 30 and a nanoscale sliding rheostat with reproducible exponential resistance tuning for Å- scale displacement sensing."}
{"id": "2602.22631", "categories": ["cs.MS", "cs.LG", "cs.LO", "cs.PL", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.22631", "abs": "https://arxiv.org/abs/2602.22631", "authors": ["Robert Joseph George", "Jennifer Cruden", "Xiangru Zhong", "Huan Zhang", "Anima Anandkumar"], "title": "TorchLean: Formalizing Neural Networks in Lean", "comment": "35 pages, multiple figures and tables", "summary": "Neural networks are increasingly deployed in safety- and mission-critical pipelines, yet many verification and analysis results are produced outside the programming environment that defines and runs the model. This separation creates a semantic gap between the executed network and the analyzed artifact, so guarantees can hinge on implicit conventions such as operator semantics, tensor layouts, preprocessing, and floating-point corner cases. We introduce TorchLean, a framework in the Lean 4 theorem prover that treats learned models as first-class mathematical objects with a single, precise semantics shared by execution and verification. TorchLean unifies (1) a PyTorch-style verified API with eager and compiled modes that lower to a shared op-tagged SSA/DAG computation-graph IR, (2) explicit Float32 semantics via an executable IEEE-754 binary32 kernel and proof-relevant rounding models, and (3) verification via IBP and CROWN/LiRPA-style bound propagation with certificate checking. We validate TorchLean end-to-end on certified robustness, physics-informed residual bounds for PINNs, and Lyapunov-style neural controller verification, alongside mechanized theoretical results including a universal approximation theorem. These results demonstrate a semantics-first infrastructure for fully formal, end-to-end verification of learning-enabled systems."}
