{"id": "2602.16142", "categories": ["math.ST", "cs.CG", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.16142", "abs": "https://arxiv.org/abs/2602.16142", "authors": ["Spencer Compton", "Gábor Lugosi", "Jaouad Mourtada", "Jian Qian", "Nikita Zhivotovskiy"], "title": "Ratio Covers of Convex Sets and Optimal Mixture Density Estimation", "comment": "45 pages", "summary": "We study density estimation in Kullback-Leibler divergence: given an i.i.d. sample from an unknown density $p$, the goal is to construct an estimator $\\widehat p$ such that $\\mathrm{KL}(p,\\widehat p)$ is small with high probability. We consider two settings involving a finite dictionary of $M$ densities: (i) model aggregation, where $p$ belongs to the dictionary, and (ii) convex aggregation (mixture density estimation), where $p$ is a mixture of densities from the dictionary. Crucially, we make no assumption on the base densities: their ratios may be unbounded and their supports may differ. For both problems, we identify the best possible high-probability guarantees in terms of the dictionary size, sample size, and confidence level. These optimal rates are higher than those achievable when density ratios are bounded by absolute constants; for mixture density estimation, they match existing lower bounds in the special case of discrete distributions.\n  Our analysis of the mixture case hinges on two new covering results. First, we provide a sharp, distribution-free upper bound on the local Hellinger entropy of the class of mixtures of $M$ distributions. Second, we prove an optimal ratio covering theorem for convex sets: for every convex compact set $K\\subset \\mathbb{R}_+^d$, there exists a subset $A\\subset K$ with at most $2^{8d}$ elements such that each element of $K$ is coordinate-wise dominated by an element of $A$ up to a universal constant factor. This geometric result is of independent interest; notably, it yields new cardinality estimates for $\\varepsilon$-approximate Pareto sets in multi-objective optimization when the attainable set of objective vectors is convex."}
{"id": "2602.16223", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.16223", "abs": "https://arxiv.org/abs/2602.16223", "authors": ["B. L. S. Prakasa Rao"], "title": "Nonparametric estimation of linear multiplier for processes driven by a Hermite process", "comment": null, "summary": "We study the problem of nonparametric estimation of the linear multiplier function $θ(t)$ for processes satisfying stochastic differential equations of the type $$dX_t=θ(t) X_tdt+ εdZ^{q,H}_t, X_0=x_0, 0\\leq t \\leq T$$ where $\\{Z^{q,H}_t, t \\geq 0\\}$ is a Hermite process with known order $q$ and known self-similarity parameter $H \\in (\\frac{1}{2},1).$ We investigate the asymptotic behaviour of the estimator of the unknown function $θ(t)$ as $ε\\rightarrow 0.$"}
{"id": "2602.16259", "categories": ["math.ST", "stat.CO", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.16259", "abs": "https://arxiv.org/abs/2602.16259", "authors": ["Yilong Hou", "Zhengpu Zhao", "Yi Li", "Mark van der Laan"], "title": "HAL-MLE Log-Splines Density Estimation (Part I: Univariate)", "comment": "75 pages", "summary": "We study nonparametric maximum likelihood estimation of probability densities under a total variation (TV) type penalty, sectional variation norm (also named as Hardy-Krause variation). TV regularization has a long history in regression and density estimation, including results on $L^2$ and KL divergence convergence rates. Here, we revisit this task using the Highly Adaptive Lasso (HAL) framework. We formulate a HAL-based maximum likelihood estimator (HAL-MLE) using the log-spline link function from \\citet{kooperberg1992logspline}, and show that in the univariate setting the bounded sectional variation norm assumption underlying HAL coincides with the classical bounded TV assumption. This equivalence directly connects HAL-MLE to existing TV-penalized approaches such as local adaptive splines \\citep{mammen1997locally}. We establish three new theoretical results: (i) the univariate HAL-MLE is asymptotically linear, (ii) it admits pointwise asymptotic normality, and (iii) it achieves uniform convergence at rate $n^{-(k+1)/(2k+3)}$ up to logarithmic factors for the smoothness order $k \\geq 1$. These results extend existing results from \\citet{van2017uniform}, which previously guaranteed only uniform consistency without rates when $k=0$. We will include the uniform convergence for general dimension $d$ in the follow-up work of this paper. The intention of this paper is to provide a unified framework for the TV-penalized density estimation methods, and to connect the HAL-MLE to the existing TV-penalized methods in the univariate case, despite that the general HAL-MLE is defined for multivariate cases."}
{"id": "2602.16283", "categories": ["math.ST", "stat.OT"], "pdf": "https://arxiv.org/pdf/2602.16283", "abs": "https://arxiv.org/abs/2602.16283", "authors": ["Nathan Huet", "Ilaria Prosdocimi"], "title": "Orthogonal parametrisations of Extreme-Value distributions", "comment": null, "summary": "Extreme value distributions are routinely employed to assess risks connected to extreme events in a large number of applications. They typically are two- or three- parameter distributions: the inference can be unstable, which is particularly problematic given the fact that often times these distributions are fitted to small samples. Furthermore, the distribution's parameters are generally not directly interpretable and not the key aim of the estimation. We present several orthogonal reparametrisations of the main extreme-value distributions, key in the modelling of rare events. In particular, we apply the theory developed in Cox and Reid (1987) to the Generalised Extreme-Value, Generalised Pareto, and Gumbel distributions. We illustrate the principal advantage of these reparametrisations in a simulation study."}
{"id": "2602.15994", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.15994", "abs": "https://arxiv.org/abs/2602.15994", "authors": ["Xiangyi Zhu", "Dmitriy Kunisky"], "title": "Generalized noise sensitivity of eigenvectors: All eigenvectors, inhomogeneous variance profiles, and dependent resampling", "comment": "71 pages", "summary": "Chatterjee (2016) proved, as an application of his general framework relating superconcentration and chaos, that after the entries of an $n \\times n$ matrix drawn from the Gaussian unitary ensemble undergo an entrywise Ornstein-Uhlenbeck (OU) process for time greater than $n^{-1/3}$, the top eigenvector of the matrix becomes almost completely decorrelated from its initial position. More recently, Bordenave, Lugosi, and Zhivotovskiy (2020) showed that the same happens under a discrete resampling model, once more than $n^{5/3}$ randomly chosen entries of a Wigner random matrix are resampled. We generalize these results in several directions: (1) we analyze the decorrelation of any eigenvector under continuous and discrete resampling dynamics, (2) we analyze the discrete resampling process for generalized Wigner matrices with inhomogeneous variance profiles, (3) we analyze a combination of continuous and discrete resampling where an OU process is repeatedly run for a certain time on randomly chosen entries, and (4) we analyze a dependent version of resampling where entries grouped into \"blocks\" of arbitrary shapes are resampled together. In each case, we show that a given eigenvector decorrelates provided that enough entries have been resampled or that the associated dynamics have been run for a long enough time. Our proofs take a different approach from prior work, relying more directly on the characterization of eigenvectors as derivatives of eigenvalues and reducing the problem of establishing eigenvector noise sensitivity to variants of standard and robust properties of random matrices such as bounds on eigenvalue spacings and eigenvector delocalization."}
{"id": "2602.15906", "categories": ["math.NA", "quant-ph"], "pdf": "https://arxiv.org/pdf/2602.15906", "abs": "https://arxiv.org/abs/2602.15906", "authors": ["Nahid Binandeh Dehaghani", "Ban Q. Tran", "Rafal Wisniewski", "Susan Mengel", "A. Pedro Aguiar"], "title": "Quantum-Inspired Tensor Networks for Approximating PDE Flow Maps", "comment": "7 pages, 4 figures", "summary": "We investigate quantum-inspired tensor networks (QTNs) for approximating flow maps of hydrodynamic partial differential equations (PDEs). Motivated by the effective low-rank structure that emerges after tensorization of discretized transport and diffusion dynamics, we encode PDE states as matrix product states (MPS) and represent the evolution operator as a structured low-rank matrix product operator (MPO) in tensor-train form (e.g., arising from finite-difference discretizations assembled in MPO form). The MPO is applied directly in MPS form, and rank growth is controlled via canonicalization and SVD-based truncation after each step. We provide theoretical context through standard matrix product properties, including exact MPS representability bounds, local optimality of SVD truncation, and a Lipschitz-type multi-step error propagation estimate. Experiments on one- and two-dimensional linear advection-diffusion and nonlinear viscous Burgers equations demonstrate accurate short-horizon prediction, favorable scaling in smooth diffusive regimes, and error growth in nonlinear multi-step predictions."}
{"id": "2602.15996", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.15996", "abs": "https://arxiv.org/abs/2602.15996", "authors": ["Aleksandr Beznosikov", "Georgiy Kormakov", "Alexander Grigorievskiy", "Mikhail Rudakov", "Ruslan Nazykov", "Alexander Rogozin", "Anton Vakhrushev", "Andrey Savchenko", "Martin Takáč", "Alexander Gasnikov"], "title": "Exploring New Frontiers in Vertical Federated Learning: the Role of Saddle Point Reformulation", "comment": "104 pages, 1 table, 9 figures, 10 theorems, 12 algorithms", "summary": "The objective of Vertical Federated Learning (VFL) is to collectively train a model using features available on different devices while sharing the same users. This paper focuses on the saddle point reformulation of the VFL problem via the classical Lagrangian function. We first demonstrate how this formulation can be solved using deterministic methods. More importantly, we explore various stochastic modifications to adapt to practical scenarios, such as employing compression techniques for efficient information transmission, enabling partial participation for asynchronous communication, and utilizing coordinate selection for faster local computation. We show that the saddle point reformulation plays a key role and opens up possibilities to use mentioned extension that seem to be impossible in the standard minimization formulation. Convergence estimates are provided for each algorithm, demonstrating their effectiveness in addressing the VFL problem. Additionally, alternative reformulations are investigated, and numerical experiments are conducted to validate performance and effectiveness of the proposed approach."}
{"id": "2602.16466", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.16466", "abs": "https://arxiv.org/abs/2602.16466", "authors": ["Jérôme Taupin"], "title": "Estimation of Conformal Metrics", "comment": null, "summary": "We study deformations of the geodesic distances on a domain of R N induced by a function called conformal factor. We show that under a positive reach assumption on the domain (not necessarily a submanifold) and mild assumptions on the conformal factor, geodesics for the conformal metric have good regularity properties in the form of a lower bounded reach. This regularity allows for efficient estimation of the conformal metric from a random point cloud with a relative error proportional to the Hausdorff distance between the point cloud and the original domain. We then establish convergence rates of order n^(-1/d) that are close to sharp when the intrinsic dimension d of the domain is large, for an estimator that can be computed in O(n^2 ) time. Finally, this paper includes a useful equivalence result between ball graphs and nearest-neighbors graphs when assuming Ahlfors regularity of the sampling measure, allowing to transpose results from one setting to another."}
{"id": "2602.16126", "categories": ["math.PR", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.16126", "abs": "https://arxiv.org/abs/2602.16126", "authors": ["Hongyi Chen"], "title": "Martin Boundary and the Nonlinear Multiplicative Heat Equation in Weak disorder", "comment": null, "summary": "We study the nonlinear multiplicative heat equation on Dirichlet spaces with white in time noise under weak disorder. We show that positive invariant random fields with uniformly bounded second moments are in one-to-one correspondence with bounded positive harmonic functions. The proof combines a remote past pullback construction with a uniqueness argument that applies a contraction inspired by chaos expansion. As a consequence, the space of invariant measures inherits geometric structure from the Martin Boundary. We further establish a small-noise Gaussian fluctuation result within each harmonic sector and show that the long-time behavior of solutions is completely determined by the Martin boundary data of the initial condition. These results reveal a direct connection between stochastic PDE dynamics and boundary theory in potential analysis."}
{"id": "2602.16191", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.16191", "abs": "https://arxiv.org/abs/2602.16191", "authors": ["Shashank K. Shukla", "Gobinda Rakshit", "Akshay S. Rane"], "title": "Projection-based approximations for eigenvalue problems of Fredholm integral operators with Green's kernels", "comment": null, "summary": "We consider the eigenvalue problem $K x = λx$. Our analysis focuses on the convergence rates of eigenvalue and spectral subspace approximations for compact linear integral operator $K$ with Green's kernels. By employing orthogonal and interpolatory projections at $2r+1$ collocation points (which are not necessarily Gauss points) onto an approximating space of piecewise even degree polynomials, we establish the superconvergence of eigenfunctions under iteration. The modified projection methods achieve a faster convergence rates compared to classical projection methods. The enhancement in convergence rate is verified by numerical examples."}
{"id": "2602.16021", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16021", "abs": "https://arxiv.org/abs/2602.16021", "authors": ["Víctor Blanco", "Miguel Martínez-Antón", "Justo Puerto"], "title": "Exponential Conic Optimization for Multi-Regime Service System Design under Congestion and Tail-Risk Control", "comment": "37 pages, 20 figures", "summary": "We study the design of single-facility service systems operating under multiple recurring regimes with service-level constraints on response times. Regime-dependent arrival and service rates induce hyperexponential response-time distributions, and the design problem selects regime-specific capacities to balance cost, congestion, fairness, and reliability. We propose a mixed-integer exponential conic optimization framework integrating SLA chance constraints, conflict-graph design restrictions, and CVaR-based tail-risk control. Although NP-hard, the problem admits an efficient decomposition scheme and tractable special cases. Computational experiments and a large-scale urban case study show substantial improvements over the current system, quantifying explicit trade-offs between efficiency, congestion control, fairness, and robustness. The framework provides a practical tool for congestion-aware and tail-control service system design."}
{"id": "2602.16537", "categories": ["math.ST", "cs.IT", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.16537", "abs": "https://arxiv.org/abs/2602.16537", "authors": ["Jiadong Liang", "Zhimei Ren", "Yuxin Chen"], "title": "Optimal training-conditional regret for online conformal prediction", "comment": null, "summary": "We study online conformal prediction for non-stationary data streams subject to unknown distribution drift. While most prior work studied this problem under adversarial settings and/or assessed performance in terms of gaps of time-averaged marginal coverage, we instead evaluate performance through training-conditional cumulative regret. We specifically focus on independently generated data with two types of distribution shift: abrupt change points and smooth drift.\n  When non-conformity score functions are pretrained on an independent dataset, we propose a split-conformal style algorithm that leverages drift detection to adaptively update calibration sets, which provably achieves minimax-optimal regret. When non-conformity scores are instead trained online, we develop a full-conformal style algorithm that again incorporates drift detection to handle non-stationarity; this approach relies on stability - rather than permutation symmetry - of the model-fitting algorithm, which is often better suited to online learning under evolving environments. We establish non-asymptotic regret guarantees for our online full conformal algorithm, which match the minimax lower bound under appropriate restrictions on the prediction sets. Numerical experiments corroborate our theoretical findings."}
{"id": "2602.16342", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.16342", "abs": "https://arxiv.org/abs/2602.16342", "authors": ["Samuel Ayomide Adeosun", "Peter Pfaffelhuber"], "title": "Markov processes forced on a subspace by a large drift, with applications to population genetics", "comment": "17 pages", "summary": "Consider a sequence of Markov processes $X^1, X^2,...$ with state space $E$, where $X^N$ has a strong drift to $D \\subseteq E$, such that $Φ(X^N)$ is slow for some appropriate $Φ: E\\to D$. Using the method of martingale problems, we give a limit result, such that $Φ(X^N) \\xRightarrow{N\\to\\infty} Z$ in the space of càdlàg paths, and $X^N \\xRightarrow{N\\to\\infty} X$ in measure. \\\\ We apply the general limit result to models for copy number variation of genetic elements in a diploid Moran model of size $N$. The population by time $t$ is described by $X^N \\in \\mathcal P(\\mathbb N_0)$, where $X^N_k$ is the frequency of individuals with copy number $k$, and $Φ: \\mathcal P(\\mathbb"}
{"id": "2602.16275", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16275", "abs": "https://arxiv.org/abs/2602.16275", "authors": ["Mingwei Fu", "Bin Shi"], "title": "Numerical Construction of Quasi-Periodic Solutions Beyond Symplectic Integrators", "comment": "47 pages, 12 figures", "summary": "Symplectic integrators are the established standard for long-term simulations of nearly-integrable Hamiltonian systems due to their preservation of geometric structures. However, they suffer from an inherent limitation: secular phase-shift errors. While the qualitative ''shape'' of invariant tori is preserved, the numerical solution gradually drifts along the torus, leading to a phase-lag accumulation that degrades long-term positional accuracy. Inspired by the Craig-Wayne-Bourgain (CWB) scheme, originally developed as an analytical tool for infinite-dimensional systems, we introduce a numerical operator that incorporates frequency updates into a dimension-enlarged Newton iteration to compute quasi-periodic solutions. Unlike conventional time-stepping integrators, our alternating numerical procedure eliminates phase-lag accumulation by directly solving for instantaneous positions and phase angles. Theoretically, provided sufficient computational resources, the phase error can be reduced arbitrarily, remaining independent of the total integration time. Our algorithm translates the Nash-Moser iteration into a practical numerical framework, marking a significant departure from traditional Kolmogorov-Arnold-Moser (KAM) theory. While KAM provides rigorous existence proofs, its requirement for global Diophantine conditions and the total exclusion of resonant sets render it numerically inaccessible. By employing a ''step-by-step'' exclusion process and incrementally enlarging the dimension, our algorithm resolves irrationality conditions locally. This approach demonstrates that the ''numerical irrationality problem'' is not an intrinsic barrier to computation, offering a constructive, executable alternative to the non-executable nature of global KAM-based methods."}
{"id": "2602.16148", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.16148", "abs": "https://arxiv.org/abs/2602.16148", "authors": ["Luyao Guo", "Xinli Shi", "Wenying Xu", "Jinde Cao"], "title": "Local adapt-then-combine algorithms for distributed nonsmooth optimization: Achieving provable communication acceleration", "comment": null, "summary": "This paper is concerned with the distributed composite optimization problem over networks, where agents aim to minimize a sum of local smooth components and a common nonsmooth term. Leveraging the probabilistic local updates mechanism, we propose a communication-efficient Adapt-Then-Combine (ATC) framework, FlexATC, unifying numerous ATC-based distributed algorithms. Under stepsizes independent of the network topology and the number of local updates, we establish sublinear and linear convergence rates for FlexATC in convex and strongly convex settings, respectively. Remarkably, in the strong convex setting, the linear rate is decoupled from the objective functions and network topology, and FlexATC permits communication to be skipped in most iterations without any deterioration of the linear rate. In addition, the proposed unified theory demonstrates for the first time that local updates provably lead to communication acceleration for ATC-based distributed algorithms. Numerical experiments further validate the efficacy of the proposed framework and corroborate the theoretical results."}
{"id": "2602.16568", "categories": ["math.ST", "cs.DS", "cs.LG", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.16568", "abs": "https://arxiv.org/abs/2602.16568", "authors": ["Ziyun Chen", "Jerry Li", "Kevin Tian", "Yusong Zhu"], "title": "Separating Oblivious and Adaptive Models of Variable Selection", "comment": "40 pages", "summary": "Sparse recovery is among the most well-studied problems in learning theory and high-dimensional statistics. In this work, we investigate the statistical and computational landscapes of sparse recovery with $\\ell_\\infty$ error guarantees. This variant of the problem is motivated by \\emph{variable selection} tasks, where the goal is to estimate the support of a $k$-sparse signal in $\\mathbb{R}^d$. Our main contribution is a provable separation between the \\emph{oblivious} (``for each'') and \\emph{adaptive} (``for all'') models of $\\ell_\\infty$ sparse recovery. We show that under an oblivious model, the optimal $\\ell_\\infty$ error is attainable in near-linear time with $\\approx k\\log d$ samples, whereas in an adaptive model, $\\gtrsim k^2$ samples are necessary for any algorithm to achieve this bound. This establishes a surprising contrast with the standard $\\ell_2$ setting, where $\\approx k \\log d$ samples suffice even for adaptive sparse recovery. We conclude with a preliminary examination of a \\emph{partially-adaptive} model, where we show nontrivial variable selection guarantees are possible with $\\approx k\\log d$ measurements."}
{"id": "2602.16440", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.16440", "abs": "https://arxiv.org/abs/2602.16440", "authors": ["Thierry Bodineau", "Pierre Le Bris"], "title": "Linear Landau equation as a limit of a tagged particle in mean field interaction with a free gas", "comment": "75 pages, 6 figures. Comments are welcome!", "summary": "We consider a tagged particle in mean field interaction with a free gas of density N at equilibrium. In dimensions $d\\geq4$, we prove the convergence of its trajectory, as N goes to infinity, to the one of a diffusion process associated with the linear Landau equation. The proof of the convergence of the martingale problem relies on two key ingredients: long time stability results of the microscopic dynamics, and controls on the probability of particle recollisions."}
{"id": "2602.16303", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.16303", "abs": "https://arxiv.org/abs/2602.16303", "authors": ["Alessandra Aimi", "Gabriella Bretti", "Giulia Di Credico", "Francesco Freddi", "Chiara Guardasoni", "Mario Pezzella"], "title": "Finite elements for the space approximation of a differential model for salts crystallization", "comment": null, "summary": "This article investigates a space-time differential model related to the degradation of stone artifacts caused by exposure to air and atmospheric agents, which specifically lead to the accumulation of salt crystals in the material. A numerical method based on finite-element space discretization and implicit-explicit time marching is proposed as an extension of a one-dimensional finite-difference framework introduced in the literature. Within the same one-dimensional setting, a sensitivity analysis is performed, based on the techniques developed therein. They are also used as a comparison tool for the finite-element formulation, here introduced for more realistic simulations in higher space dimensions. Considerations about stability will be provided, together with an experimental convergence analysis highlighting the performance of the proposed approach. Numerical results in two and three space dimensions, obtained by an efficient code implementation, will be presented and discussed."}
{"id": "2602.16150", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16150", "abs": "https://arxiv.org/abs/2602.16150", "authors": ["Jilei Huang", "Peidong Lei", "Yansheng Ma", "Jingxue Yin"], "title": "Null controllability of one-dimensional quasilinear parabolic equations via multiplicative controls", "comment": null, "summary": "This paper is concerned with the null controllability problem for a class of quasilinear parabolic equations under multiplicative control, locally supported in space. For the purpose of proving the existence of a multiplicative control forcing the solution rest at a time $T>0$, we need to establish the decay property of solutions for the system without control first. We have obtained decay estimates for the $L^\\infty$-norm and the $H^1$-norm of solutions to the homogenous quasilinear parabolic equations. Notably, the decay of the $L^\\infty$-norm requires no smallness condition on the initial data, whereas the decay of the $H^1$-norm requires that the $L^\\infty$-norm remains small. Based on the decay estimates and maximum modulus estimate of solutions to quasilinear parabolic equations, together with the local null controllability of quasilinear parabolic equations under additive controls, we prove the null controllability of the quasilinear parabolic equations via multiplicative controls. As a byproduct, we also obtain the global null controllability for large time to the quasilinear parabolic equations via additive controls. Given that the controllability under multiplicative control is achieved over a long time horizon, we finally investigate the existence of time optimal control."}
{"id": "2602.16606", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.16606", "abs": "https://arxiv.org/abs/2602.16606", "authors": ["Chak Fung Choi", "Yin Tang", "Bing Li"], "title": "On Sharpened Convergence Rate of Generalized Sliced Inverse Regression for Nonlinear Sufficient Dimension Reduction", "comment": null, "summary": "Generalized Sliced Inverse Regression (GSIR) is one of the most important methods for nonlinear sufficient dimension reduction. As shown in Li and Song (2017), it enjoys a convergence rate that is independent of the dimension of the predictor, thus avoiding the curse of dimensionality. In this paper we establish an improved convergence rate of GSIR under additional mild eigenvalue decay rate and smoothness conditions. Our convergence rate can be made arbitrarily close to $n^{-1/3}$ under appropriate decay rate and smoothness parameters. As a comparison, the rate of Li and Song (2017) is $n^{-1/4}$ under the best conditions. This improvement is significant because, for example, in a semiparametric estimation problem involving an infinite-dimensional nuisance parameter, the convergence rate of the estimator of the nuisance parameter is often required to be faster than $n^{-1/4}$ to guarantee desired semiparametric properties such as asymptotic efficiency. This can be achieved by the improved convergence rate, but not by the original rate. The sharpened convergence rate can also be established for GSIR in more general settings, such as functional sufficient dimension reduction."}
{"id": "2602.16479", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.16479", "abs": "https://arxiv.org/abs/2602.16479", "authors": ["Bálint Tóth"], "title": "Central limit theorem for random walk in degenerate divergence-free random environment: $\\mathcal H_{-1}$ reloaded with relaxed ellipticity", "comment": "31 pages, no figures", "summary": "This paper enhances the result of the work [G. Kozma, B. Tóth, Ann. Probab. vol. 45 (2017) 4307-4347] . We prove the central limit theorem (in probability w.r.t. the environment) for the displacement of a random walker in divergence-free (or, doubly stochastic) random environment, with substantially relaxed ellipticity assumptions. Integrability of the reciprocal of the symmetric part of the jump rates is only assumed (rather than their boundedness, as in previous works on this type of RWRE). Relaxing ellipticity involves substantial changes in the proof, making it conceptually elementary in the sense that it does not rely on Nash's inequality in any disguise."}
{"id": "2602.16312", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16312", "abs": "https://arxiv.org/abs/2602.16312", "authors": ["Marco Feder", "Pasquale Claudio Africa"], "title": "An agglomeration-based multigrid solver for the discontinuous Galerkin discretization of cardiac electrophysiology", "comment": null, "summary": "This work presents a novel agglomeration-based multilevel preconditioner designed to accelerate the convergence of iterative solvers for linear systems arising from the discontinuous Galerkin discretization of the monodomain model in cardiac electrophysiology. The proposed approach exploits general polytopic grids at coarser levels, obtained through the agglomeration of elements from an initial, potentially fine, mesh. By leveraging a robust and efficient agglomeration strategy, we construct a nested hierarchy of grids suitable for multilevel solver frameworks. The effectiveness and performance of the methodology are assessed through a series of numerical experiments on two- and three-dimensional domains, involving different ionic models and realistic unstructured geometries. The results demonstrate strong solver effectiveness and favorable scalability with respect to both the polynomial degree of the discretization and the number of levels selected in the multigrid preconditioner."}
{"id": "2602.16170", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16170", "abs": "https://arxiv.org/abs/2602.16170", "authors": ["Sergio Salazar", "Abraham Duarte", "Mauricio G. C. Resende", "J. Manuel Colmenar"], "title": "Metaheuristic algorithms for the induced P-median problem with upgrades", "comment": "28 pages, 7 figures, 6 tables", "summary": "Facility location problems (FLPs) are a family of optimisation problems with significant social impact. This class of problems has been the subject of study since the 1960s, with classical approaches including the Weber problem and the p-Median problem. Currently, more complex variations of these problems are being investigated. In particular, the Induced p-Median Problem with Upgrades (IpMU) represents a variation of the classical p-Median problem, where the concepts of transport cost and time are separated as distinct metrics in the input graph of the problem. Furthermore, the problem includes a budget which allows one to relax the graph costs, reducing the cost of the edges, thus improving the associated routes between the designated medians and the customers. In this study, a metaheuristic algorithm, based on the Greedy Randomized Adaptive Search Procedure (GRASP), is proposed. A two-phase resolution scheme is defined, studying the median problem and the upgrading problem independently. In this approach, a larger set of state-of-the-art instances was analysed to ensure a fair comparison with previous proposals. In addition, the characteristics of the instances were studied to assess their complexity. The results obtained are promising when compared to the state-of-the-art, which is based entirely on mathematical programming models. The execution time was improved on average by two orders of magnitude for the harder instances, and the best known result was obtained in more than 99% of the tested instances."}
{"id": "2602.16509", "categories": ["math.PR", "cond-mat.stat-mech"], "pdf": "https://arxiv.org/pdf/2602.16509", "abs": "https://arxiv.org/abs/2602.16509", "authors": ["Roger Tribe", "Oleg Zaboronski"], "title": "Entrance laws for coalescing and annihilating Brownian motions", "comment": null, "summary": "Systems of instantaneously annihilating or coalescing Brownian motions on the line are considered. The extreme points of the set of entrance laws for this process are shown to be Pfaffian point processes at all times and their kernels are identified."}
{"id": "2602.16508", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16508", "abs": "https://arxiv.org/abs/2602.16508", "authors": ["Owen Hearder", "Claude Le Bris", "Ana Djurdjevac"], "title": "A Fully Discrete Nonnegativity-Preserving FEM for a Stochastic Heat Equation", "comment": "22 pages, 4 figures, the code for the numerical experiments is available via a URL link in section 6", "summary": "We consider a stochastic heat equation with nonlinear multiplicative finite-dimensional noise that admits a unique nonnegative solution when given nonnegative initial data. Inspired by existing results for fully discrete finite difference schemes and building on the convergence analysis of semi-discrete mass-lumped finite element approximations, a fully discrete numerical method is introduced that combines mass-lumped finite elements with a Lie-Trotter splitting strategy. This discretization preserves nonnegativity at the discrete level and is shown to be convergent under suitable regularity conditions. A rigorous convergence analysis is provided, highlighting the role of mass lumping in ensuring nonnegativity and of operator splitting in decoupling the deterministic and stochastic dynamics. Numerical experiments are presented to confirm the convergence rates and the preservation of nonnegativity. In addition, we examine several numerical examples outside the scope of the established theory, aiming to explore the range of applicability and potential limitations of the proposed method."}
{"id": "2602.16205", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16205", "abs": "https://arxiv.org/abs/2602.16205", "authors": ["Phil Howlett", "Maria Kapsis", "Peter Pudney"], "title": "Optimal driving strategies for a fleet of trains", "comment": "26 pages, 5 figures, preprint submitted to the ANZIAM Journal", "summary": "In order to manage electricity transmission and distribution it is now common practice for system operators to offer financial incentives that encourage large consumers to reduce energy usage during designated peak demand periods. For train operators on large rail networks it may be profitable -- with selected individual journeys -- to reduce energy usage during peak times and increase energy usage at other times rather than simply minimizing overall energy consumption. We will use classical methods of constrained optimization to find optimal driving strategies for a fleet of trains subject to limits on total energy consumption during specified intermediate time intervals but with no change to individual journey times. The proposed strategies can be used by a large rail organisation to reduce overall operating costs with only minimal disruption to existing schedules and with no changes to important departure and arrival times."}
{"id": "2602.16521", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.16521", "abs": "https://arxiv.org/abs/2602.16521", "authors": ["Giacomo Ascione", "Luigia Caputo"], "title": "Scaling limits for some Mittag-Leffler queues", "comment": null, "summary": "In this paper, we consider five models of heavy-tailed queues involving Mittag-Leffler distributions that generalize the classical $M/M/1$ queues. These models are suitable modifications of previously defined models in such a way that the classical $M/M/1$ queue can be recovered by a suitable selection of parameters. We provide the distribution of inter-arrival and service times of both the original and modified queueing models. We then study the scaling limits of all the proposed models and we argue that the behaviour of the limiting processes can be used to characterise the traffic regime of the queues."}
{"id": "2602.16538", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16538", "abs": "https://arxiv.org/abs/2602.16538", "authors": ["Sudheer Mishra", "Sundararajan Natarajan", "E. Natarajan", "Gianmarco Manzini"], "title": "A higher order pressure-stabilized virtual element formulation for the Stokes-Poisson-Boltzmann equations", "comment": null, "summary": "Electrokinetic phenomena in nanopore sensors and microfluidic devices require accurate simulation of coupled fluid-electrostatic interactions in geometrically complex domains with irregular boundaries and adaptive mesh refinement. We develop an equal-order virtual element method for the Stokes--Poisson--Boltzmann equations that naturally handles general polygonal meshes, including meshes with hanging nodes, without requiring special treatment or remeshing. The key innovation is a residual-based pressure stabilization scheme derived by reformulating the Laplacian drag force in the momentum equation as a weighted advection term involving the nonlinear Poisson--Boltzmann equation, thereby eliminating second-order derivative terms while maintaining theoretical rigor. Well-posedness of the coupled stabilized problem is established using the Banach and Brouwer fixed-point theorems under sufficiently small data assumptions, and optimal a priori error estimates are derived in the energy norm with convergence rates of order $\\mathcal{O}(h^k)$ for approximation degree $k \\geq 1$. Numerical experiments on diverse polygonal meshes -- including distorted elements, non-convex polygons, Voronoi tessellations, and configurations with hanging nodes -- confirm optimal convergence rates, validating theoretical predictions. Applications to electro-osmotic flows in nanopore sensors with complex obstacle geometries illustrate the method's practical utility for engineering simulations. Compared to Taylor--Hood finite element formulations, the equal-order approach simplifies implementation through uniform polynomial treatment of all fields and offers native support for general polygonal elements."}
{"id": "2602.16392", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.16392", "abs": "https://arxiv.org/abs/2602.16392", "authors": ["Fulvia Confortola", "Marco Fuhrman"], "title": "Partially observed controlled Markov chains and optimal control of the Wonham filter", "comment": "26 pages", "summary": "We consider a class of optimal control problems, with finite or infinite horizon, for a continuous-time Markov chain with finite state space. In this case, the control process affects the transition rates. We suppose that the controlled process can not be observed, and at any time the control actions are chosen based on the observation of a related stochastic process perturbed by an exogenous Brownian motion. We describe a construction of the controlled Markov chain, having stochastic transition rates adapted to the observation filtration. By a change of probability measure of Girsanov type, we introduce the so-called separated optimal control problem, where the state is the conditional (unnormalized) distribution of the controlled Markov chain and the observation process becomes a driving Brownian motion, and we prove the equivalence with the original control problem. The controlled equations for the separated problem are an instance of the Wonham filtering equations. Next we present an analysis of the separated problem: we characterize the value function as the unique viscosity solution to the dynamic programming equations (both in the parabolic and the elliptic case) we prove verifications theorems and a version of the stochastic maximum principle in the form of a necessary conditions for optimality."}
{"id": "2602.16595", "categories": ["math.PR", "math.CO", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.16595", "abs": "https://arxiv.org/abs/2602.16595", "authors": ["Simone Costa"], "title": "Anticoncentration of Random Sums in $\\mathbb{Z}_p$", "comment": "This manuscript provides a substantial revision and a significant refocusing of the earlier preprint arXiv:2308.04284. The current version removes the applications to sequenceability to prioritize the development of anticoncentration inequalities in $\\mathbb{Z}_p$ and provides a more detailed comparison with the existing literature", "summary": "In this paper we investigate the probability distribution of the sum $Y$ of $\\ell$ independent identically distributed random variables taking values in $\\mathbb{Z}_p$. Our main focus is the regime of small values of $\\ell$, which is less explored compared to the asymptotic case $\\ell \\to \\infty$.\n  Starting with the case $\\ell=3$, we prove that if the distributions of the $Y_i$ are uniformly bounded by $λ< 1$ and $p > 2/λ$, then there exists a constant $C_{3,λ} < 1$ such that \\[ \\max_{x \\in \\mathbb{Z}_p} \\mathbb{P}[Y = x] \\leq C_{3,λ}λ. \\] Moreover, when the distributions are uniformly separated from $1$, the constant $C_{3,λ}$ can be made explicit. By iterating this argument, we obtain effective anticoncentration bounds for larger values of $\\ell$, yielding nontrivial estimates already in small and moderate regimes where asymptotic results do not apply."}
{"id": "2602.16581", "categories": ["math.NA", "stat.CO"], "pdf": "https://arxiv.org/pdf/2602.16581", "abs": "https://arxiv.org/abs/2602.16581", "authors": ["Hamza Ruzayqat", "Wenyu Lei", "David Bolin", "George Turkiyyah", "Omar Knio"], "title": "Whittle-Matérn Fields with Variable Smoothness", "comment": "24 pages, 5 figures, 2 tables", "summary": "We introduce and analyze a nonlocal generalization of Whittle--Matérn Gaussian fields in which the smoothness parameter varies in space through the fractional order, $s=s(x)\\in[\\underline{s}\\,,\\bar{s}]\\subset(0,1)$. The model is defined via an integral-form operator whose kernel is constructed from the modified Bessel function of the second kind and whose local singularity is governed by the symmetric exponent $β(x,y)=(s(x)+s(y))/2$. This variable-order nonlocal formulation departs from the classical constant-order pseudodifferential setting and raises new analytic and numerical challenges. We develop a novel variational framework adapted to the kernel, prove existence and uniqueness of weak solutions on truncated bounded domains, and derive Sobolev regularity of the Gaussian (spectral) solution controlled by the minimal local order: realizations lie in $H^r(G)$ for every $r<2\\underline{s}-\\tfrac{d}{2}$ (here $H^r(G)$ denotes the Sobolev space on the bounded domain $G$), hence in $L_2(G)$ when $\\underline s>d/4$. We also present a finite-element sampling method for the integral model, derive error estimates, and provide numerical experiments in one dimension that illustrate the impact of spatially varying smoothness on samples covariances. Computational aspects and directions for scalable implementations are discussed."}
{"id": "2602.16402", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16402", "abs": "https://arxiv.org/abs/2602.16402", "authors": ["Huan Zhang", "Xiangkai Sun", "Shengjie Li", "Kok Lay Teo"], "title": "Primal-dual dynamical systems with closed-loop control for convex optimization in continuous and discrete time", "comment": null, "summary": "This paper develops a primal-dual dynamical system where the coefficients are designed in closed-loop way for solving a convex optimization problem with linear equality constraints. We first introduce a ``second-order primal\" + ``first-order dual'' continuous-time dynamical system, in which both the time scaling and Hessian-driven damping are governed by a feedback control of the gradient for the Lagrangian function. This system achieves the fast convergence rates for the primal-dual gap, the feasibility violation, and the objective residual along its trajectory. Subsequently, by time discretization of this system, we develop an accelerated primal-dual algorithm with a gradient-defined adaptive step size. We also obtain convergence rates for the primal-dual gap, the feasibility violation, and the objective residual. Furthermore, we provide numerical results to demonstrate the practical efficacy and superior performance of the proposed algorithm."}
{"id": "2602.16604", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.16604", "abs": "https://arxiv.org/abs/2602.16604", "authors": ["Elena Magnanini"], "title": "ERGMs on block models", "comment": "40 pages, 3 figures", "summary": "We extend the classical edge-triangle Exponential Random Graph Model (ERGM) to an inhomogeneous setting in which vertices carry types determined by an underlying partition. This leads to a block-structured ERGM where interaction parameters depend on vertex types. We establish a large deviation principle for the associated sequence of measures and derive the corresponding variational formula for the limiting free energy. In the ferromagnetic regime, where the parameters governing triangle densities are nonnegative, we reduce the variational problem to a scalar optimization problem, thereby identifying the natural block counterpart of the replica symmetric regime. Under additional restrictions on the parameters, comparable to the classical Dobrushin's uniqueness region, we prove uniqueness of the maximizer and derive a law of large numbers for the edge density."}
{"id": "2602.16588", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16588", "abs": "https://arxiv.org/abs/2602.16588", "authors": ["Nis-Erik Bohne", "Stefan A. Sauter"], "title": "Discrete reliability for high-order Crouzeix--Raviart finite elements", "comment": "32 Pages, 7 Figures", "summary": "In this paper, the adaptive numerical solution of a 2D Poisson model problem by Crouzeix-Raviart elements ($\\operatorname*{CR}_{k}$ $\\operatorname*{FEM}$) of arbitrary odd degree $k\\geq1$ is investigated. The analysis is based on an established, abstract theoretical framework: the \\textit{axioms of adaptivity} imply optimal convergence rates for the adaptive algorithm induced by a residual-type a posteriori error estimator. Here, we introduce the error estimator for the $\\operatorname*{CR}_{k}$ $\\operatorname*{FEM}$ discretization and our main theoretical result is the proof ot Axiom 3: \\textit{discrete reliability}. This generalizes results for adaptive lowest order $\\operatorname*{CR}_{1}$ $\\operatorname*{FEM}$ in the literature. For this analysis, we introduce and analyze new local quasi-interpolation operators for $\\operatorname*{CR}_{k}$ $\\operatorname*{FEM}$ which are key for our proof of discrete reliability. We present the results of numerical experiments for the adaptive version of $\\operatorname*{CR}_{k}$ $\\operatorname*{FEM}$ for some low and higher (odd) degrees $k\\geq1$ which illustrate the optimal convergence rates for all considered values of $k$."}
{"id": "2602.16465", "categories": ["math.OC", "cs.DS"], "pdf": "https://arxiv.org/pdf/2602.16465", "abs": "https://arxiv.org/abs/2602.16465", "authors": ["Marc Goerigk", "Dorothee Henke", "Lasse Wulf"], "title": "The Complexity Landscape of Two-Stage Robust Selection Problems with Budgeted Uncertainty", "comment": null, "summary": "A standard type of uncertainty set in robust optimization is budgeted uncertainty, where an interval of possible values for each parameter is given and the total deviation from their lower bounds is bounded. In the two-stage setting, discrete and continuous budgeted uncertainty have to be distinguished. The complexity of such problems is largely unexplored, in particular if the underlying nominal optimization problem is simple, such as for selection problems. In this paper, we give a comprehensive answer to long-standing open complexity questions for three types of selection problems and three types of budgeted uncertainty sets. In particular, we demonstrate that the two-stage selection problem with continuous budgeted uncertainty is NP-hard, while the corresponding two-stage representative selection problem is solvable in polynomial time. Our hardness result implies that also the two-stage assignment problem with continuous budgeted uncertainty is NP-hard."}
{"id": "2602.16615", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.16615", "abs": "https://arxiv.org/abs/2602.16615", "authors": ["Henri Elad Altman", "Tom Klose", "Nicolas Perkowski"], "title": "A Rough Functional Breuer-Major Theorem", "comment": "92 pages + references, 4 figures", "summary": "We extend the functional Breuer-Major theorem by Nourdin and Nualart (2020) to the space of rough paths. The proof of tightness combines the multiplication formula for iterated Malliavin divergences, due to Furlan and Gubinelli (2019), with Meyer's inequality and a Kolmogorov-type criterion for the r-variation of cadlag rough paths, due to Chevyrev et al. (2022). Since martingale techniques do not apply, we obtain the convergence of the finite-dimensional distributions through a bespoke version of Slutsky's lemma: First, we overcome the lack of hypercontractivity by an iterated integration-by-parts scheme which reduces the remaining analysis to finite Wiener chaos; crucially, this argument relies on Malliavin differentiability of the nonlinearity but not on chaos decay and, as a consequence, encompasses the centred absolute value function. Second, in the spirit of the law of large numbers, we show that the diagonal of the second-order process converges to an explicit symmetric correction term. Finally, we compute all the moments of the remaining process and, through a fine combinatorial analysis, show that they converge to those of the Stratonovich Brownian rough path perturbed by an antisymmetric area correction, as computed by a suitable amendment of Fawcett's theorem. All of these steps benefit from a major combinatorial reduction that is implied by the original argument of Breuer and Major (1983)."}
{"id": "2602.16591", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16591", "abs": "https://arxiv.org/abs/2602.16591", "authors": ["Erik Boström", "Anna-Karin Tornberg", "Ludvig af Klinteberg"], "title": "Fast Ewald Summation using Prolate Spheroidal Wave Functions", "comment": "43 pages, 9 figures", "summary": "Fast Ewald summation efficiently evaluates Coulomb interactions and is widely used in molecular dynamics simulations. It is based on a split into a short-range and a long-range part, where evaluation of the latter is accelerated using the fast Fourier transform (FFT). The accuracy and computational cost depend critically on the mollifier in the Ewald split and the window function used in the spreading and interpolation steps that enable the use of the FFT. The first prolate spheroidal wavefunction (PSWF) has optimal concentration in real and Fourier space simultaneously, and is used when defining both a mollifier and a window function. We provide a complete description of the method and derive rigorous error estimates. In addition, we obtain closed-form approximations of the Fourier truncation and aliasing errors, yielding explicit parameter choices for the achieved error to closely match the prescribed tolerance. Numerical experiments confirm the analysis: PSWF-based Ewald summation achieves a given accuracy with significantly fewer Fourier modes and smaller window supports than Gaussian- and B-spline-based approaches, providing a superior alternative to existing Ewald methods for particle simulations."}
{"id": "2602.16517", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16517", "abs": "https://arxiv.org/abs/2602.16517", "authors": ["Jean-Christophe Mourrat"], "title": "PL conditions do not guarantee convergence of gradient descent-ascent dynamics", "comment": "12 pages", "summary": "We give an example of a function satisfying a two-sided Polyak-Lojasiewicz condition but for which a gradient descent-ascent flow line fails to converge to the saddle point, circling around it instead."}
{"id": "2508.12926", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2508.12926", "abs": "https://arxiv.org/abs/2508.12926", "authors": ["Richard Schwank", "Mathias Drton"], "title": "On the distance between mean and geometric median in high dimensions", "comment": "Background section added and proofs shortened", "summary": "The geometric median, a notion of center for multivariate distributions, has gained recent attention in robust statistics and machine learning. Although conceptually distinct from the mean (i.e., expectation), we demonstrate that both are very close in high dimensions when the dependence between the distribution components is suitably controlled. Concretely, we find an upper bound on the distance that vanishes with the dimension asymptotically, and derive a rate-matching first order expansion of the geometric median components. Simulations illustrate and confirm our results."}
{"id": "2602.16555", "categories": ["math.OC", "cs.LG", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.16555", "abs": "https://arxiv.org/abs/2602.16555", "authors": ["Philipp Plank", "Yufei Zhang"], "title": "Learning Distributed Equilibria in Linear-Quadratic Stochastic Differential Games: An $α$-Potential Approach", "comment": null, "summary": "We analyze independent policy-gradient (PG) learning in $N$-player linear-quadratic (LQ) stochastic differential games. Each player employs a distributed policy that depends only on its own state and updates the policy independently using the gradient of its own objective. We establish global linear convergence of these methods to an equilibrium by showing that the LQ game admits an $α$-potential structure, with $α$ determined by the degree of pairwise interaction asymmetry. For pairwise-symmetric interactions, we construct an affine distributed equilibrium by minimizing the potential function and show that independent PG methods converge globally to this equilibrium, with complexity scaling linearly in the population size and logarithmically in the desired accuracy. For asymmetric interactions, we prove that independent projected PG algorithms converge linearly to an approximate equilibrium, with suboptimality proportional to the degree of asymmetry. Numerical experiments confirm the theoretical results across both symmetric and asymmetric interaction networks."}
{"id": "2602.16223", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.16223", "abs": "https://arxiv.org/abs/2602.16223", "authors": ["B. L. S. Prakasa Rao"], "title": "Nonparametric estimation of linear multiplier for processes driven by a Hermite process", "comment": null, "summary": "We study the problem of nonparametric estimation of the linear multiplier function $θ(t)$ for processes satisfying stochastic differential equations of the type $$dX_t=θ(t) X_tdt+ εdZ^{q,H}_t, X_0=x_0, 0\\leq t \\leq T$$ where $\\{Z^{q,H}_t, t \\geq 0\\}$ is a Hermite process with known order $q$ and known self-similarity parameter $H \\in (\\frac{1}{2},1).$ We investigate the asymptotic behaviour of the estimator of the unknown function $θ(t)$ as $ε\\rightarrow 0.$"}
{"id": "2602.16574", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16574", "abs": "https://arxiv.org/abs/2602.16574", "authors": ["Javier de Frutos", "Julia Novo"], "title": "Optimal bounds for numerical approximations of finite horizon problems based on dynamic programming approach", "comment": null, "summary": "In this paper we provide optimal bounds for fully discrete approximations to finite horizon problems via dynamic programming. We adapt the error analysis in \\cite{nos} for the infinite horizon case to the\n  finite horizon case. We prove an a priori bound of size $O(h+k)$ for the method, $h$ being the time discretization step and $k$ the spatial mesh size. Arguing with piecewise constants controls we are able to obtain first order of convergence in time and space under standard regularity assumptions, avoiding the more restrictive regularity assumptions on the controls required in \\cite{nos}.\n  We show that the loss in the rate of convergence in time of the\n  infinite case (obtained arguing with piece-wise controls)\n  can be avoided in the finite horizon case"}
{"id": "2602.16392", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.16392", "abs": "https://arxiv.org/abs/2602.16392", "authors": ["Fulvia Confortola", "Marco Fuhrman"], "title": "Partially observed controlled Markov chains and optimal control of the Wonham filter", "comment": "26 pages", "summary": "We consider a class of optimal control problems, with finite or infinite horizon, for a continuous-time Markov chain with finite state space. In this case, the control process affects the transition rates. We suppose that the controlled process can not be observed, and at any time the control actions are chosen based on the observation of a related stochastic process perturbed by an exogenous Brownian motion. We describe a construction of the controlled Markov chain, having stochastic transition rates adapted to the observation filtration. By a change of probability measure of Girsanov type, we introduce the so-called separated optimal control problem, where the state is the conditional (unnormalized) distribution of the controlled Markov chain and the observation process becomes a driving Brownian motion, and we prove the equivalence with the original control problem. The controlled equations for the separated problem are an instance of the Wonham filtering equations. Next we present an analysis of the separated problem: we characterize the value function as the unique viscosity solution to the dynamic programming equations (both in the parabolic and the elliptic case) we prove verifications theorems and a version of the stochastic maximum principle in the form of a necessary conditions for optimality."}
{"id": "2602.16586", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.16586", "abs": "https://arxiv.org/abs/2602.16586", "authors": ["Emily Logan", "Ning Qi", "Bolun Xu"], "title": "Nonparametric Kernel Regression for Coordinated Energy Storage Peak Shaving with Stacked Services", "comment": null, "summary": "Developing effective control strategies for behind-the-meter energy storage to coordinate peak shaving and stacked services is essential for reducing electricity costs and extending battery lifetime in commercial buildings. This work proposes an end-to-end, two-stage framework for coordinating peak shaving and energy arbitrage with a theoretical decomposition guarantee. In the first stage, a non-parametric kernel regression model constructs state-of-charge trajectory bounds from historical data that satisfy peak-shaving requirements. The second stage utilizes the remaining capacity for energy arbitrage via a transfer learning method. Case studies using New York City commercial building demand data show that our method achieves a 1.3 times improvement in performance over the state-of-the-art forecast-based method, achieving cost savings and effective peak management without relying on predictions."}
{"id": "2602.16555", "categories": ["math.OC", "cs.LG", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.16555", "abs": "https://arxiv.org/abs/2602.16555", "authors": ["Philipp Plank", "Yufei Zhang"], "title": "Learning Distributed Equilibria in Linear-Quadratic Stochastic Differential Games: An $α$-Potential Approach", "comment": null, "summary": "We analyze independent policy-gradient (PG) learning in $N$-player linear-quadratic (LQ) stochastic differential games. Each player employs a distributed policy that depends only on its own state and updates the policy independently using the gradient of its own objective. We establish global linear convergence of these methods to an equilibrium by showing that the LQ game admits an $α$-potential structure, with $α$ determined by the degree of pairwise interaction asymmetry. For pairwise-symmetric interactions, we construct an affine distributed equilibrium by minimizing the potential function and show that independent PG methods converge globally to this equilibrium, with complexity scaling linearly in the population size and logarithmically in the desired accuracy. For asymmetric interactions, we prove that independent projected PG algorithms converge linearly to an approximate equilibrium, with suboptimality proportional to the degree of asymmetry. Numerical experiments confirm the theoretical results across both symmetric and asymmetric interaction networks."}
{"id": "2602.16592", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.16592", "abs": "https://arxiv.org/abs/2602.16592", "authors": ["Marko Erceg", "Petar Kunštek", "Marko Vrdoljak"], "title": "Hybrid Optimization Techniques for Multi-State Optimal Design Problems", "comment": "29 pages, 3 figures", "summary": "This paper addresses optimal design problems governed by multi-state stationary diffusion equations, aiming at the simultaneous optimization of the domain shape and the distribution of two isotropic materials in prescribed proportions. Existence of generalized solutions is established via a hybrid approach combining homogenization-based relaxation in the interior with suitable restrictions on admissible domains.\n  Based on this framework, we propose a numerical method that integrates homogenization and shape optimization. The domain boundary is evolved using a level set method driven by the shape derivative, while the interior material distribution is updated via an optimality criteria algorithm. The approach is demonstrated on a representative example."}
{"id": "2602.16568", "categories": ["math.ST", "cs.DS", "cs.LG", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.16568", "abs": "https://arxiv.org/abs/2602.16568", "authors": ["Ziyun Chen", "Jerry Li", "Kevin Tian", "Yusong Zhu"], "title": "Separating Oblivious and Adaptive Models of Variable Selection", "comment": "40 pages", "summary": "Sparse recovery is among the most well-studied problems in learning theory and high-dimensional statistics. In this work, we investigate the statistical and computational landscapes of sparse recovery with $\\ell_\\infty$ error guarantees. This variant of the problem is motivated by \\emph{variable selection} tasks, where the goal is to estimate the support of a $k$-sparse signal in $\\mathbb{R}^d$. Our main contribution is a provable separation between the \\emph{oblivious} (``for each'') and \\emph{adaptive} (``for all'') models of $\\ell_\\infty$ sparse recovery. We show that under an oblivious model, the optimal $\\ell_\\infty$ error is attainable in near-linear time with $\\approx k\\log d$ samples, whereas in an adaptive model, $\\gtrsim k^2$ samples are necessary for any algorithm to achieve this bound. This establishes a surprising contrast with the standard $\\ell_2$ setting, where $\\approx k \\log d$ samples suffice even for adaptive sparse recovery. We conclude with a preliminary examination of a \\emph{partially-adaptive} model, where we show nontrivial variable selection guarantees are possible with $\\approx k\\log d$ measurements."}
