{"id": "2601.09880", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09880", "abs": "https://arxiv.org/abs/2601.09880", "authors": ["Jean-Gabriel Attali"], "title": "Asymptotic Stability and Equilibrium Selection in Quasi-Feller Systems with Minimal Moment Conditions", "comment": "25 pages 2 futures", "summary": "We study equilibrium selection for invariant measures of stochastic dynamical systems with constant step size, under persistent noise and minimal moment assumptions, in a general quasi-Feller framework. Such dynamics arise in projection-based algorithms, learning in games, and systems with discontinuous decision rules, where classical Feller assumptions and small-noise or large-deviation techniques are not applicable.\n  Under a global Lyapunov condition, we prove that any weak limit of invariant measures must be supported on the set of fixed points of the associated deterministic dynamics. Beyond localization, we establish a sharp exclusion principle for unstable equilibria: strict local maxima and saddle points of the Lyapunov function are shown to carry zero mass in limiting invariant measures under explicit and verifiable non-degeneracy conditions.\n  Our analysis identifies a local mechanism driven by Lyapunov geometry and persistent variance, showing that equilibrium selection in constant-step dynamics is governed by typical fluctuations rather than rare events. These results provide a probabilistic foundation for stability and equilibrium selection in stochastic systems with persistent noise and weak regularity."}
{"id": "2601.09950", "categories": ["math.PR", "math-ph", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.09950", "abs": "https://arxiv.org/abs/2601.09950", "authors": ["Zhongyang Li"], "title": "Quantitative Supercritical Bounds for Disconnection in Bernoulli Site Percolation", "comment": null, "summary": "For any infinite, connected, locally finite graph $G=(V,E)$, any parameter $p>p^{\\mathrm{site}}_{c}(G)$, and any (finite or infinite) set of vertices $S\\subset V$, we derive explicit exponential-type upper bounds on the disconnection probability $\\mathbb{P}_{p}(S\\nleftrightarrow\\infty)$. The estimates are expressed in terms of a packing profile of $S$, encoded by a $(p,\\varepsilon,c)$--packing number, which counts how many well-separated vertices in $S$ exhibit controlled local-to-global connectivity. The proof combines a local functional characterization of $p^{\\mathrm{site}}_{c}$ from \\cite{ZL24,ZL26} with a packing construction and an amplification-by-independence argument, in the direction of Problem~1.6 in \\cite{DC20}."}
{"id": "2601.09958", "categories": ["math.PR", "math-ph", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.09958", "abs": "https://arxiv.org/abs/2601.09958", "authors": ["Zhongyang Li"], "title": "Planar Site Percolation, End Structure, and the Benjamini-Schramm Conjecture", "comment": null, "summary": "Let $G$ be an infinite, connected, locally finite planar graph and consider i.i.d.\\ Bernoulli$(p)$ site percolation. Write $p_c^{\\mathrm{site}}(G)$ and $p_u^{\\mathrm{site}}(G)$ for the critical and uniqueness thresholds. Using a well--separated Freudenthal embedding $G\\hookrightarrow\\mathbb S^2$, we introduce a cycle--separation equivalence on ends and associated ``directional'' thresholds $p^{\\mathrm{site}}_{c,F}(G)$.\n  When the set of end--equivalence classes is countable, we show that $p_c^{\\mathrm{site}}(G)=\\inf_F p^{\\mathrm{site}}_{c,F}(G)$ and that for every $p\\in\\bigl(\\tfrac12,\\,1-p_c^{\\mathrm{site}}(G)\\bigr)$ there are almost surely infinitely many infinite open clusters. Combined with the $0/\\infty$ theorem of Glazman--Harel--Zelesko for $p\\le \\tfrac12$, this yields non--uniqueness throughout the full coexistence interval $\\bigl(p_c^{\\mathrm{site}}(G),\\,1-p_c^{\\mathrm{site}}(G)\\bigr)$, and hence $p_u^{\\mathrm{site}}(G)\\ge 1-p_c^{\\mathrm{site}}(G)$ in this setting. This resolves the extension problem posed by Glazman--Harel--Zelesko for the upper half of the coexistence regime under a natural countability hypothesis.\n  In contrast, for graphs with uncountably many end--equivalence classes we give criteria guaranteeing infinitely many infinite clusters above criticality, and we construct an explicit locally finite planar graph of minimum degree at least $7$ for which $p_u^{\\mathrm{site}}(G)<1-p_c^{\\mathrm{site}}(G)$. Consequently, the Benjamini--Schramm conjecture (Conjecture 7 in \\cite{bs96}) that planarity together with minimal vertex degree at least 7 forces infinitely many infinite clusters for all $p\\in(p_c,1-p_c)$ does not hold in full generality.\n  Our proofs combine a cutset characterization of $p_c^{\\mathrm{site}}$ with a planar alternating--arm exploration organized by an end--adapted boundary decomposition."}
{"id": "2601.09967", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09967", "abs": "https://arxiv.org/abs/2601.09967", "authors": ["Ramiro Fontes"], "title": "Stochastic Calculus for Rough Fractional Brownian Motion via Operator Factorization", "comment": "19 pages, no figures", "summary": "We develop an operator-theoretic framework for stochastic calculus with respect to rough fractional Brownian motion with Hurst parameter H < 1/2. Building on a covariant derivative defined via kernel factorization, we construct a closed unbounded operator on L2(Omega) adapted to the non-semimartingale setting. This approach yields explicit derivative representations for square-integrable functionals and provides a unified analytical framework compatible with rough path techniques. The results extend classical stochastic calculus beyond the semimartingale regime."}
{"id": "2601.10100", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.10100", "abs": "https://arxiv.org/abs/2601.10100", "authors": ["Guo Liu"], "title": "Admissibility Breakdown in High-Dimensional Sparse Regression with L1 Regularization", "comment": "19 pages", "summary": "The choice of the tuning parameter in the Lasso is central to its statistical performance in high-dimensional linear regression. Classical consistency theory identifies the rate of the Lasso tuning parameter, and numerous studies have established non-asymptotic guarantees. Nevertheless, the question of optimal tuning within a non-asymptotic framework has not yet been fully resolved. We establish tuning criteria above which the Lasso becomes inadmissible under mean squared prediction error. More specifically, we establish thresholds showing that certain classical tuning choices yield Lasso estimators strictly dominated by a simple Lasso-Ridge refinement. We also address how the structure of the design matrix and the noise vector influences the inadmissibility phenomenon."}
{"id": "2601.09826", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.09826", "abs": "https://arxiv.org/abs/2601.09826", "authors": ["Andreas A. Malikopoulos"], "title": "When an Approximate Model Suffices for Optimal Control", "comment": "26 pages, 3 figures", "summary": "In this paper, we develop an optimal control framework for dynamical systems when only an approximate model of the underlying plant is available. We consider a setting in which the control strategy is synthesized using a model-based optimal control problem that includes a penalty term capturing deviation from the plant trajectory, while the same control input is applied to both the model and the actual system. For a general class of optimal control problems, we establish conditions under which the control minimizing the model-based Hamiltonian coincides with the plant-optimal control, despite mismatch between the model and the true dynamics. We further specialize these results to problems with quadratic control effort, where explicit and easily verifiable sufficient conditions guarantee equivalence and uniqueness of the resulting optimal control. These results show that accurate control synthesis does not require an exact model of the underlying system, but rather alignment of the optimality conditions that govern control selection. From a learning perspective, this suggests that data-driven efforts can focus on identifying regimes in which model-based and plant-based Hamiltonian minimizers coincide, thereby providing a theoretical basis for robust model-based decision making and the effective use of digital twins under modeling error. We provide examples to illustrate the theoretical findings and demonstrate equivalence of the resulting control trajectories even in the presence of significant model mismatch."}
{"id": "2601.09811", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09811", "abs": "https://arxiv.org/abs/2601.09811", "authors": ["Maria Vasilyeva", "Zheng Wei", "Kelum Gajamannage", "Hyangim Ji", "Aleksei Krasnikov", "Alexey Sadovski"], "title": "Learning Ecological and Epidemic Processes using Neural ODEs, Kolmogorov-Arnold Network ODEs and SINDy", "comment": null, "summary": "We consider epidemic and ecological models to investigate their coupled dynamics. Starting with the classical Susceptible-Infected-Recovered (SIR) model for basic epidemic behavior and the predator-prey (Lotka-Volterra, LV) system for ecological interactions, we then combine these frameworks into a coupled Lotka-Volterra-Susceptible-Infected-Susceptible (LVSIS) model. The resulting system consists of four differential equations describing the evolution of susceptible and infected prey and predator populations, incorporating ecological interactions, disease transmission, and spatial dispersal. To learn the underlying dynamics directly from data, we employ several data-driven modeling frameworks: Neural Ordinary Differential Equations (Neural ODEs), Kolmogorov-Arnold Network Ordinary Differential Equations (KANODEs), and Sparse Identification of Nonlinear Dynamics (SINDy). Numerical experiments based on synthetic data are conducted to investigate the learning ability of these models in capturing the epidemic and ecological behavior. We further extend our approach to spatio-temporal models, aiming to uncover hidden local couplings."}
{"id": "2601.09976", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.09976", "abs": "https://arxiv.org/abs/2601.09976", "authors": ["Ramiro Fontes"], "title": "Stochastic Calculus as Operator Factorization", "comment": "9 pages", "summary": "We present a unified operator-theoretic formulation of stochastic calculus based on two principles: fluctuations factor through differentiation, predictable projection, and integration, and the appropriate stochastic derivative is the Hilbert adjoint of the stochastic integral on the energy space of the driving process. On an isonormal Gaussian space we recover the identity (Id - E)F = delta Pi D F, where D is the Malliavin derivative, Pi is predictable projection, and delta is the divergence operator. Motivated by this factorization, we define for a square-integrable process X admitting a closed stochastic integral an operator-covariant derivative on L2(Omega) via Riesz representation. This yields a canonical Clark-Ocone representation that unifies Malliavin, Volterra-Malliavin, and functional Ito derivatives and clarifies the operator geometry underlying stochastic calculus."}
{"id": "2601.10133", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.10133", "abs": "https://arxiv.org/abs/2601.10133", "authors": ["Ruowei Li", "Zhigang Yao"], "title": "Curvature-driven manifold fitting under unbounded isotropic noise", "comment": "40 pages, 9 figures", "summary": "Manifold fitting aims to reconstruct a low-dimensional manifold from high-dimensional data, whose framework is established by Fefferman et al. \\cite{fefferman2020reconstruction,fefferman2021reconstruction}. This paper studies the recovery of a compact $C^3$ submanifold $\\mathcal{M} \\subset \\mathbb{R}^D$ with dimension $d<D$ and positive reach $τ$ from observations $Y = X + ξ$, where $X$ is uniformly distributed on $\\mathcal{M}$ and $ξ\\sim \\mathcal{N}(0, σ^2 I_D)$ denotes isotropic Gaussian noise. To project any points $z$ in a tubular neighborhood $Γ$ of $\\mathcal{M}$ onto $\\mathcal{M}$, we construct a sample-based estimator $F:Γ\\to\\mathbb{R}^D$ by a normalized local kernel with the theoretically derived bandwidth $r = c_Dσ$. Under a sample size of $O(σ^{-3d-5})$, we establish with high probability the uniform asymptotic expansion \\[ F(z) = π(z) + \\frac{d}{2} H_{π(z)} σ^2 + O(σ^3), \\qquad z \\in Γ, \\] where $π(z)$ is the projection of $z$ onto $\\mathcal{M}$ and $H_{π(z)}$ is the mean curvature vector of $\\mathcal{M}$ at $π(z)$. The resulting manifold $F(Γ)$ has reach bounded below by $c τ$ for $c>0$ and achieves a state-of-the-art Hausdorff distance of $O(σ^2)$ to $\\mathcal{M}$. Numerical experiments confirm the quadratic decay of the reconstruction error and demonstrate the computational efficiency of the estimator $F$. Our work provides a curvature-driven framework for denoising and reconstructing manifolds with second-order accuracy."}
{"id": "2601.10062", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10062", "abs": "https://arxiv.org/abs/2601.10062", "authors": ["Zesheng Cai", "Lexiao Lai", "Tiansheng Li"], "title": "Global convergence of the subgradient method for robust signal recovery", "comment": "23 pages, 2 figures", "summary": "We study the subgradient method for factorized robust signal recovery problems, including robust PCA, robust phase retrieval, and robust matrix sensing. These objectives are nonsmooth and nonconvex, and may have unbounded sublevel sets, so standard arguments for analyzing first-order optimization algorithms based on descent and coercivity do not apply. For locally Lipschitz semialgebraic objectives, we develop a convergence framework under the assumption that continuous-time subgradient trajectories are bounded: for sufficiently small step sizes of order \\(1/k\\), any subgradient sequence remains bounded and converges to a critical point. We verify this trajectory boundedness assumption for the robust objectives by adapting and extending existing trajectory analyses, requiring only a mild nondegeneracy condition in the matrix sensing case. Finally, for rank-one symmetric robust PCA, we show that the subgradient method avoids spurious critical points for almost every initialization, and therefore converges to a global minimum under the same step-size regime."}
{"id": "2601.09882", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.09882", "abs": "https://arxiv.org/abs/2601.09882", "authors": ["Minglei Yang", "Diego del-Castillo-Negrete", "Guannan Zhang"], "title": "An efficient probabilistic scheme for the exit time probability of $α$-stable Lévy process", "comment": null, "summary": "The α-stable Lévy process, commonly used to describe Lévy flight, is characterized by discontinuous jumps and is widely used to model anomalous transport phenomena. In this study, we investigate the associated exit problem and propose a method to compute the exit time probability, which quantifies the likelihood that a trajectory starting from an initial condition exits a bounded region in phase space within a given time. This estimation plays a key role in understanding anomalous diffusion behavior. The proposed method approximates the α-stable process by combining a Brownian motion with a compound Poisson process. The exit time probability is then modeled using a framework based on partial integro-differential equations (PIDEs). The Feynman-Kac formula provides a probabilistic representation of the solution, involving conditional expectations over stochastic differential equations. These expectations are computed via tailored quadrature rules and interpolation techniques. The proposed method achieves first-order convergence in time and offers significant computational advantages over standard Monte Carlo and deterministic approaches. In particular, it avoids assembling and solving large dense linear systems, resulting in improved efficiency. We demonstrate the method's accuracy and performance through two numerical examples, highlighting its applicability to physical transport problems."}
{"id": "2601.09990", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.09990", "abs": "https://arxiv.org/abs/2601.09990", "authors": ["Hongjie Dong", "Kazuo Yamazaki"], "title": "Remarks on the convex integration technique applied to singular stochastic partial differential equations", "comment": null, "summary": "Singular stochastic partial differential equations informally refer to the partial differential equations with rough random force that leads to the products in the nonlinear terms becoming ill-defined. Besides the theories of regularity structures and paracontrolled distributions, the technique of convex integration has emerged as a possible approach to construct a solution to such singular stochastic partial differential equations. We review recent developments in this area, and also demonstrate that an application of the convex integration technique to prove non-uniqueness seems unlikely for a particular singular stochastic partial differential equation, specifically the $Φ^{4}$ model from quantum field theory."}
{"id": "2601.10326", "categories": ["math.ST", "math.AP", "math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.10326", "abs": "https://arxiv.org/abs/2601.10326", "authors": ["Aurélien Castre", "Richard Nickl"], "title": "On gradient stability in nonlinear PDE models and inference in interacting particle systems", "comment": "36 pages", "summary": "We consider general parameter to solution maps $θ\\mapsto \\mathcal G(θ)$ of non-linear partial differential equations and describe an approach based on a Banach space version of the implicit function theorem to verify the gradient stability condition of Nickl&Wang (JEMS 2024) for the underlying non-linear inverse problem, providing also injectivity estimates and corresponding statistical identifiability results. We illustrate our methods in two examples involving a non-linear reaction diffusion system as well as a McKean--Vlasov interacting particle model, both with periodic boundary conditions. We apply our results to prove the polynomial time convergence of a Langevin-type algorithm sampling the posterior measure of the interaction potential arising from a discrete aggregate measurement of the interacting particle system."}
{"id": "2601.10086", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10086", "abs": "https://arxiv.org/abs/2601.10086", "authors": ["Bohao Ma", "Nachuan Xiao", "Junyu Zhang"], "title": "Line-search and Adaptive Step Sizes for Nonconvex-strongly-concave Minimax Optimization", "comment": "25 pages", "summary": "In this paper, we propose a novel reformulation of the smooth nonconvex-strongly-concave (NC-SC) minimax problems that casts the problem as a joint minimization. We show that our reformulation preserves not only first-order stationarity, but also global and local optimality, second-order stationarity, and the Kurdyka-Łojasiewicz (KL) property, of the original NC-SC problem, which is substantially stronger than its nonsmooth counterpart in the literature. With these enhanced structures, we design a versatile parameter-free and nonmonotone line-search framework that does not require evaluating the inner maximization. Under mild conditions, global convergence rates can be obtained, and, with KL property, full sequence convergence with asymptotic rates is also established. In particular, we show our framework is compatible with the gradient descent-ascent (GDA) algorithm. By equipping GDA with Barzilai-Borwein (BB) step sizes and nonmonotone line-search, our method exhibits superior numerical performance against the compared benchmarks."}
{"id": "2601.09900", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.09900", "abs": "https://arxiv.org/abs/2601.09900", "authors": ["Kiyuob Jung"], "title": "Nonlinear numerical schemes using specular differentiation for initial value problems of first-order ordinary differential equations", "comment": null, "summary": "This paper proposes specular differentiation in one-dimensional Euclidean space and provides its fundamental analysis, including quasi-Fermat's theorem and the quasi-Mean Value Theorem. As an application, this paper develops several numerical schemes for solving initial value problems for first-order ordinary differential equations. Based on numerical simulations, we select one scheme and prove its first-order consistency and second-order local convergence."}
{"id": "2601.10076", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10076", "abs": "https://arxiv.org/abs/2601.10076", "authors": ["Matthew S. Zhang"], "title": "Sharp propagation of chaos in Rényi divergence", "comment": null, "summary": "We establish sharp rates for propagation of chaos in Rényi divergences for interacting diffusion systems at stationarity. Building upon the entropic hierarchy established in Lacker (2023), we show that under strong isoperimetry and weak interaction conditions, one can achieve $\\mathsf R_q(μ^1 \\,\\lVert\\, π) = \\widetilde O(\\frac{d q^2}{N^2})$ bounds on the $q$-Rényi divergence."}
{"id": "2601.10626", "categories": ["math.ST", "cs.CR", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.10626", "abs": "https://arxiv.org/abs/2601.10626", "authors": ["Getoar Sopa", "Marco Avella Medina", "Cynthia Rush"], "title": "Differentially Private Inference for Longitudinal Linear Regression", "comment": "68 pages, 3 figures", "summary": "Differential Privacy (DP) provides a rigorous framework for releasing statistics while protecting individual information present in a dataset. Although substantial progress has been made on differentially private linear regression, existing methods almost exclusively address the item-level DP setting, where each user contributes a single observation. Many scientific and economic applications instead involve longitudinal or panel data, in which each user contributes multiple dependent observations. In these settings, item-level DP offers inadequate protection, and user-level DP - shielding an individual's entire trajectory - is the appropriate privacy notion. We develop a comprehensive framework for estimation and inference in longitudinal linear regression under user-level DP. We propose a user-level private regression estimator based on aggregating local regressions, and we establish finite-sample guarantees and asymptotic normality under short-range dependence. For inference, we develop a privatized, bias-corrected covariance estimator that is automatically heteroskedasticity- and autocorrelation-consistent. These results provide the first unified framework for practical user-level DP estimation and inference in longitudinal linear regression under dependence, with strong theoretical guarantees and promising empirical performance."}
{"id": "2601.10260", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10260", "abs": "https://arxiv.org/abs/2601.10260", "authors": ["Kota Umezu", "Kazuhiro Sato"], "title": "Controllability score for linear time-invariant systems on an infinite time horizon", "comment": null, "summary": "We introduce a scaled controllability Gramian that can be computed reliably even for unstable systems. Using this scaled Gramian, we reformulate the controllability scoring problems into equivalent but numerically stable optimization problems. Their optimal solutions define dynamics-aware network centrality measures, referred to as the volumetric controllability score (VCS) and the average energy controllability score (AECS). We then formulate controllability scoring problems on an infinite time horizon. Under suitable assumptions, we prove that the resulting VCS and AECS are unique and that the finite-horizon scores converge to them. We further show that VCS and AECS can differ markedly in this limit, because VCS enforces controllability of the full system, whereas AECS accounts only for the stable modes. Finally, using Laplacian dynamics as a representative example, we present numerical experiments that illustrate this convergence."}
{"id": "2601.10057", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10057", "abs": "https://arxiv.org/abs/2601.10057", "authors": ["Zhiwei Zhang", "Shuwang Li", "John Lowengrub", "Steven M. Wise"], "title": "An Efficient Constant-Coefficient MSAV Scheme for Computing Vesicle Growth and Shrinkage", "comment": "Submitted to Communications in Computational Physics", "summary": "We present a fast, unconditionally energy-stable numerical scheme for simulating vesicle deformation under osmotic pressure using a phase-field approach. The model couples an Allen-Cahn equation for the biomembrane interface with a variable-mobility Cahn-Hilliard equation governing mass exchange across the membrane. Classical approaches, including nonlinear multigrid and Multiple Scalar Auxiliary Variable (MSAV) methods, require iterative solution of variable-coefficient systems at each time step, resulting in substantial computational cost. We introduce a constant-coefficient MSAV (CC-MSAV) scheme that incorporates stabilization directly into the Cahn-Hilliard evolution equation rather than the chemical potential. This reformulation yields fully decoupled constant-coefficient elliptic problems solvable via fast discrete cosine transform (DCT), eliminating iterative solvers entirely. The method achieves O(N^2 log N) complexity per time step while preserving unconditional energy stability and discrete mass conservation. Numerical experiments verify second-order temporal and spatial accuracy, mass conservation to relative errors below 5 x 10^-11, and close agreement with nonlinear multigrid benchmarks. On grids with N >= 2048, CC-MSAV achieves 6-15x overall speedup compared to classical MSAV with optimized preconditioning, while the dominant Cahn-Hilliard subsystem is accelerated by up to two orders of magnitude. These efficiency gains, achieved without sacrificing accuracy, make CC-MSAV particularly well suited for large-scale simulations of vesicle dynamics."}
{"id": "2601.10204", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10204", "abs": "https://arxiv.org/abs/2601.10204", "authors": ["Bishakh Bhattacharya", "Arijit Chakrabarty", "Rajat Subhra Hazra"], "title": "Outlier eigenvalues and eigenvectors of generalized Wigner matrices with finite-rank perturbations", "comment": "61 pages. Preliminary version, comments are welcomed", "summary": "A generalized Wigner matrix perturbed by a finite-rank deterministic matrix is considered. The fluctuations of the largest eigenvalues, which emerge outside the bulk of the spectrum, and the corresponding eigenvectors, are studied. Under certain assumptions on the perturbation and the matrix structure, we derive the first-order behavior of these eigenvalues and show that they are well separated from the bulk. The fluctuations of these eigenvalues are shown to follow a multivariate Gaussian distribution, and the asymptotic behavior of the associated eigenvectors is also studied. We prove central limit theorems that describe the asymptotic alignment of these eigenvectors with the perturbation's eigenvectors, as well as their Gaussian fluctuations around the origin for non-aligned components. Furthermore, we discuss the convergence of the eigenvector process in a Sobolev space framework."}
{"id": "2601.10370", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10370", "abs": "https://arxiv.org/abs/2601.10370", "authors": ["Jian-Wen Peng", "Jun-Jie Luo", "Abubakar Adamu"], "title": "A two-step inertial method with a new step-size rule for variational inequalities in hilbert spaces", "comment": null, "summary": "In this paper, a two-step inertial Tseng extragradient method involving self-adaptive and Armijo-like step sizes is introduced for solving variational inequalities with a quasimonotone cost function in the setting of a real Hilbert space. Weak convergence of the sequence generated by the proposed algorithm is proved without assuming the Lipschitz condition. An interesting feature of the proposed algorithm is its ability to select the better step size between the self-adaptive and Armijo-like options at each iteration step. Moreover, removing the requirement for the Lipschitz condition on the cost function broadens the applicability of the proposed method. Finally, the algorithm accelerates and complements several existing iterative algorithms for solving variational inequalities in Hilbert spaces."}
{"id": "2601.10149", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.10149", "abs": "https://arxiv.org/abs/2601.10149", "authors": ["Wenbo Wang", "Guangyan Jia"], "title": "New Second-order Convergent Schemes for Solving decoupled FBSDEs", "comment": null, "summary": "This paper proposes a new second-order symmetric algorithm for solving decoupled forward-backward stochastic differential equations. Inspired by the alternating direction implicit splitting method for partial differential equations, we split the generator into the sum of two functions. In the computation of the value process Y, explicit and implicit schemes are alternately applied to these two generators, while the algorithms from \\citep{ZhaoLi2014} are used for the control process Z. We rigorously prove that the two new schemes have second-order convergence rate. The proposed splitting methods show clear advantages for equations whose generator consists of a linear part plus a nonlinear part, as they reduce the number of iterations required for solving implicit schemes, thereby decreasing computational cost while maintaining second-order convergence. Two numerical examples are provided, including the backward stochastic Riccati equation arising in mean-variance hedging. The numerical results verify the theoretical error analysis and demonstrate the advantage of reduced computational cost compared to the algorithm in \\citep{ZhaoLi2014}."}
{"id": "2601.10249", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10249", "abs": "https://arxiv.org/abs/2601.10249", "authors": ["Balázs Ráth", "Márton Szőke"], "title": "Critical time of the almost 2-regular random degree constrained process", "comment": "32 pages", "summary": "We study the phase transition of the random degree constrained process (RDCP), a time-evolving random graph model introduced by Ruciński and Wormald that generalizes the random $d$-process to the non-regular setting: each vertex of the complete graph $K_n$ has its pre-assigned degree constraint (i.e., a number from the set $\\{2,\\dots,Δ\\}$), we attempt to add the edges one-by-one in a uniform random order, but a new edge is added only if it does not violate the degree constraints at its end-vertices. Warnke and Wormald identified the critical time of the RDCP when the giant component emerges as $n \\to \\infty$. Ráth, Szőke and Warnke identified the local weak limit of the RDCP and gave an alternative characterization of the critical time in terms of the principal eigenvalue of the branching operator of the multi-type branching process that arises as the local limit object.\n  In the current paper we use this spectral characterization to study the critical time of the RDCP in the almost 2-regular case, i.e., when the degree constraint of most of the vertices is equal to 2. In this case the giant component emerges quite late, and our main result provides the precise asymptotics of the critical time as the model approaches 2-regularity. Interestingly, our formula asymptotically matches the well-known Molloy-Reed formula, despite the fact that Molloy, Surya and Warnke proved that the final graph of the RDCP is not contiguous to the configuration model with the same degree sequence."}
{"id": "2601.10390", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10390", "abs": "https://arxiv.org/abs/2601.10390", "authors": ["P. D. Khanh", "V. V. H. Khoa", "T. H. Mo"], "title": "Algebraic Farkas Lemma and Strong Duality for Perturbed Conic Linear Programming", "comment": null, "summary": "This paper addresses the study of algebraic versions of Farkas lemma and strong duality results in the very broad setting of infinite-dimensional conic linear programming in dual pairs of vector spaces. To this end, purely algebraic properties of perturbed optimal value functions of both primal and dual problems and their corresponding hypergraph/epigraph are investigated. The newly developed hypergraphical/epigraphical sets, inspired by Kretschmer's closedness conditions \\cite{Kretschmer61}, together with their novel convex separation-type characterizations, give rise to various perturbed Farkas-type lemmas which allow us to derive complete characterizations of ``zero duality gap''. Principally, when certain structures of algebraic or topological duals are imposed, illuminating implications of the developed condition are also explored."}
{"id": "2601.10222", "categories": ["math.NA", "cs.AI", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.10222", "abs": "https://arxiv.org/abs/2601.10222", "authors": ["Alena Kopaničáková", "Elisa Riccietti"], "title": "Introduction to optimization methods for training SciML models", "comment": null, "summary": "Optimization is central to both modern machine learning (ML) and scientific machine learning (SciML), yet the structure of the underlying optimization problems differs substantially across these domains. Classical ML typically relies on stochastic, sample-separable objectives that favor first-order and adaptive gradient methods. In contrast, SciML often involves physics-informed or operator-constrained formulations in which differential operators induce global coupling, stiffness, and strong anisotropy in the loss landscape. As a result, optimization behavior in SciML is governed by the spectral properties of the underlying physical models rather than by data statistics, frequently limiting the effectiveness of standard stochastic methods and motivating deterministic or curvature-aware approaches. This document provides a unified introduction to optimization methods in ML and SciML, emphasizing how problem structure shapes algorithmic choices. We review first- and second-order optimization techniques in both deterministic and stochastic settings, discuss their adaptation to physics-constrained and data-driven SciML models, and illustrate practical strategies through tutorial examples, while highlighting open research directions at the interface of scientific computing and scientific machine learning."}
{"id": "2601.10337", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10337", "abs": "https://arxiv.org/abs/2601.10337", "authors": ["Irene Crimaldi", "Andrea Ghiglietti", "Leen Hatem", "Hosam Mahmoud"], "title": "Triggered urn models for frequently asked questions (FAQ)", "comment": null, "summary": "We investigate a nonclassic urn model with triggers that increase the number of colors. The scheme has emerged as a model for web services that set up frequently asked questions (FAQ). We present a thorough asymptotic analysis of the FAQ urn scheme in generality that covers a large number of special cases, such as Simon urn. For instance, we consider time dependent triggering probabilities. We identify regularity conditions on these probabilities that classify the schemes into those where the number of colors in the urn remains almost surely finite or increases to infinity and conditions that tell us whether all the existing colors are observed infinitely often or not. We determine the rank curve, too. In view of the broad generality of the trigger probabilities, a spectrum of limit distributions appears, from central limit theorems to Poisson approximation, to power-laws, revealing connections to Heap's exponent and Zipf's law. A combinatorial approach to the Simon urn is presented to indicate the possibility of such exact analysis, which is important for short-term predictions. Extensive simulations on real datasets (from Amazon sales) as well as computer-generated data clearly indicate that the asymptotic and exact theory developed agrees with practice."}
{"id": "2601.10475", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10475", "abs": "https://arxiv.org/abs/2601.10475", "authors": ["Xiaoyu Peng", "Xi Ru", "Zhongze Li", "Jianxin Zhang", "Xinghua Chen", "Feng Liu"], "title": "Positive Damping Region: A Graphic Tool for Passivization Analysis with Passivity Index", "comment": "8 pages, 7 figures", "summary": "This paper presents a geometric framework for analyzing output-feedback and input-feedforward passivization of linear time-invariant systems. We reveal that a system is passivizable with a given passivity index when the Nyquist plot for SISO systems or the Rayleigh quotient of the transfer function for MIMO systems lies within a specific, index-dependent region in the complex plane, termed the positive damping region. The criteria enable a convenient graphic tool for analyzing the passivization, the associated frequency bands, the maximum achievable passivity index, and the waterbed effect between them. Additionally, the tool can be encoded into classical tools such as the Nyquist plot, the Nichols plot, and the generalized KYP lemma to aid control design. Finally, we demonstrate its application in passivity-based power system stability analysis and discuss its implications for electrical engineers regarding device controller design trade-offs."}
{"id": "2601.10248", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10248", "abs": "https://arxiv.org/abs/2601.10248", "authors": ["Laura Grigori", "Daniel Kressner", "Nian Shao", "Igor Simunec"], "title": "Restoring similarity in randomized Krylov methods with applications to eigenvalue problems and matrix functions", "comment": null, "summary": "The randomized Arnoldi process has been used in large-scale scientific computing because it produces a well-conditioned basis for the Krylov subspace more quickly than the standard Arnoldi process. However, the resulting Hessenberg matrix is generally not similar to the one produced by the standard Arnoldi process, which can lead to delays or spike-like irregularities in convergence. In this paper, we introduce a modification of the randomized Arnoldi process that restores similarity with the Hessenberg matrix generated by the standard Arnoldi process. This is accomplished by enforcing orthogonality between the last Arnoldi vector and the previously generated subspace, which requires solving only one additional least-squares problem. When applied to eigenvalue problems and matrix function evaluations, the modified randomized Arnoldi process produces approximations that are identical to those obtained with the standard Arnoldi process. Numerical experiments demonstrate that our approach is as fast as the randomized Arnoldi process and as robust as the standard Arnoldi process."}
{"id": "2601.10359", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10359", "abs": "https://arxiv.org/abs/2601.10359", "authors": ["Ramiro Fontes"], "title": "An Itô Formula via Predictable Projection for Non-Semimartingale Processes", "comment": "20 pages", "summary": "We derive an Itô-type change-of-variables formula for a class of adapted stochastic processes that do not necessarily admit semimartingale structure. The formulation is based on an intrinsic Hilbert-space derivative together with a predictable projection operator, allowing stochastic integrals to be expressed without reliance on quadratic variation or anticipative calculus.\n  The resulting formula replaces the classical quadratic variation term with a computable second-order contribution expressed as a norm of the projected derivative. In the semimartingale case, the formula reduces to the classical Itô formula. The approach applies naturally to processes with memory and non-Markovian dependence, providing a unified and intrinsic framework for stochastic calculus beyond the semimartingale setting."}
{"id": "2601.10483", "categories": ["math.OC", "cond-mat.dis-nn", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.10483", "abs": "https://arxiv.org/abs/2601.10483", "authors": ["Simon Martin", "Giulio Biroli", "Francis Bach"], "title": "High-Dimensional Analysis of Gradient Flow for Extensive-Width Quadratic Neural Networks", "comment": null, "summary": "We study the high-dimensional training dynamics of a shallow neural network with quadratic activation in a teacher-student setup. We focus on the extensive-width regime, where the teacher and student network widths scale proportionally with the input dimension, and the sample size grows quadratically. This scaling aims to describe overparameterized neural networks in which feature learning still plays a central role. In the high-dimensional limit, we derive a dynamical characterization of the gradient flow, in the spirit of dynamical mean-field theory (DMFT). Under l2-regularization, we analyze these equations at long times and characterize the performance and spectral properties of the resulting estimator. This result provides a quantitative understanding of the effect of overparameterization on learning and generalization, and reveals a double descent phenomenon in the presence of label noise, where generalization improves beyond interpolation. In the small regularization limit, we obtain an exact expression for the perfect recovery threshold as a function of the network widths, providing a precise characterization of how overparameterization influences recovery."}
{"id": "2601.10322", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10322", "abs": "https://arxiv.org/abs/2601.10322", "authors": ["Ulrich Rüde"], "title": "Conjugate Gradient Methods are Not Efficient: Experimental Study of the Locality Limitation", "comment": "24 pages, 20 figures", "summary": "The convergence of the Conjugate Gradient method is subject to a locality limitation which imposes a lower bound on the number of iterations required before a qualitatively accurate approximation can be obtained. This limitation originates from the restricted transport of information in the graph induced by the sparsity pattern of the system matrix. In each iteration, information from the right-hand side can propagate only across directly connected graph nodes. The diameter of this graph therefore determines a minimum number of iterations that is necessary to achieve an acceptable level of accuracy."}
{"id": "2601.10490", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.10490", "abs": "https://arxiv.org/abs/2601.10490", "authors": ["Dimitrios Dimitriou", "Dimitris Farazakis", "Georgia Karali"], "title": "Malliavin Calculus for the stochastic Cahn-Hilliard equation driven by fractional noise", "comment": "28 pages", "summary": "The stochastic partial differential equation analyzed in this work is the Cahn-Hilliard equation perturbed by an additive fractional white noise (fractional in time and white in space). We work in the case of one spatial dimension and apply Malliavin calculus to investigate the existence of a density for the stochastic solution $u$. In particular, we show that $u$ admits continuous paths almost surely and construct a localizing sequence through which we prove that its Malliavin derivative exists locally, and that its law is absolutely continuous with respect to the Lebesgue measure on $\\bf R$, establishing thus that a density exists. A key contribution of this work is the analysis of the stochastic integral appearing in the mild formulation: we derive sharp estimates for the expectation of the $p$-th power ($p \\geq 2$) of the $L^{\\infty}(D)$-norm of this stochastic integral as well as for the integral involving the $L^{\\infty}(D)$-norm of the operator associated with the kernel appearing in the integral representation of the fractional noise, all of which are essential for this study."}
{"id": "2601.10222", "categories": ["math.NA", "cs.AI", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.10222", "abs": "https://arxiv.org/abs/2601.10222", "authors": ["Alena Kopaničáková", "Elisa Riccietti"], "title": "Introduction to optimization methods for training SciML models", "comment": null, "summary": "Optimization is central to both modern machine learning (ML) and scientific machine learning (SciML), yet the structure of the underlying optimization problems differs substantially across these domains. Classical ML typically relies on stochastic, sample-separable objectives that favor first-order and adaptive gradient methods. In contrast, SciML often involves physics-informed or operator-constrained formulations in which differential operators induce global coupling, stiffness, and strong anisotropy in the loss landscape. As a result, optimization behavior in SciML is governed by the spectral properties of the underlying physical models rather than by data statistics, frequently limiting the effectiveness of standard stochastic methods and motivating deterministic or curvature-aware approaches. This document provides a unified introduction to optimization methods in ML and SciML, emphasizing how problem structure shapes algorithmic choices. We review first- and second-order optimization techniques in both deterministic and stochastic settings, discuss their adaptation to physics-constrained and data-driven SciML models, and illustrate practical strategies through tutorial examples, while highlighting open research directions at the interface of scientific computing and scientific machine learning."}
{"id": "2601.10389", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10389", "abs": "https://arxiv.org/abs/2601.10389", "authors": ["Stefan Kindermann"], "title": "Regularization of linear inverse problems by rational Krylov methods", "comment": null, "summary": "For approximately solving linear ill-posed problems in Hilbert spaces, we investigate the regularization properties of the aggregation method and the RatCG method. These recent algorithms use previously calculated solutions of Tikhonov regularization (respectively, Landweber iterations) to set up a new search space on which the least-squares functional is minimized. We outline how these methods can be understood as rational Krylov space methods, i.e., based on the space of rational functions of the forward operator. The main result is that these methods form an optimal-order regularization schemes when combined with the discrepancy principle as stopping rule and when the underlying regularization parameters are sufficiently large."}
{"id": "2601.10539", "categories": ["math.PR", "math-ph", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.10539", "abs": "https://arxiv.org/abs/2601.10539", "authors": ["Alex Karrila", "Lauri Viitasaari"], "title": "Smoothness of martingale observables and generalized Feynman-Kac formulas", "comment": "30 pages", "summary": "We prove that, under the Hörmander criterion on an Itô process, all its martingale observables are smooth. As a consequence, we also obtain a generalized Feynman-Kac formula providing smooth solutions to certain PDE boundary-value problems, while allowing for degenerate diffusions as well as boundary stopping (under very mild boundary regularity assumptions). We also highlight an application to a question posed on Schramm-Loewner evolutions, by making certain Girsanov transform martingales accessible via Itô calculus."}
{"id": "2601.10399", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10399", "abs": "https://arxiv.org/abs/2601.10399", "authors": ["Michał Wichrowski", "Ajay Ajith"], "title": "A Geometric Multigrid Preconditioner for Shifted Boundary Method", "comment": "arXiv admin note: substantial text overlap with arXiv:2506.12899", "summary": "The Shifted Boundary Method (SBM) trades some part of the burden of body-fitted meshing for increased algebraic complexity. While the resulting linear systems retain the standard $\\mathcal{O}(h^{-2})$ conditioning of second-order operators, the non-symmetry and non-local boundary coupling render them resistant to standard Algebraic Multigrid (AMG) and simple smoothers for high-order discretisations. We present a geometric multigrid preconditioner that effectively tames these systems. At its core lies the \\emph{Full-Residual Shy Patch} smoother: a subspace correction strategy that filters out some patches while capturing the full physics of the shifted boundary. Unlike previous cell-wise approaches that falter at high polynomial degrees, our method delivers convergence with low mesh dependence. We demonstrate performance for Continuous Galerkin approximations, maintaining low and stable iteration counts up to polynomial degree $p=3$ in 3D, proving that SBM can be both geometrically flexible and algebraically efficient."}
{"id": "2601.10545", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10545", "abs": "https://arxiv.org/abs/2601.10545", "authors": ["Arthur Bourdon", "Benjamin Jourdain", "Hervé Andrès"], "title": "Linear independence properties of the signature components of time-augmented stochastic processes", "comment": "38 pages, 10 figures", "summary": "The addition of the running time as a component of a path before computing its signature is a widespread approach to ensure the one-to-one property between them and leads to universal approximation theorems (Cuchiero, Primavera and Svaluto-Ferro, 2023). However, this also leads to the linear dependence of the components of the terminal value of the signature of the time-augmented path. More precisely, for a given natural number $N$, the signature components associated with words of length $N$ have the same linear span as the signature components associated with words of length not greater than $N$. We generalize this result by exhibiting other subfamilies of signature components with the same spanning properties. In particular we recover the result of Dupire and Tissot-Daguette which states that the spanning of the iterated integrals with the last integrator different from the time variable is the same as the spanning of all iterated integrals. We check that this choice leads to the minimal computation time when the terms of the signature are calculated using Chen's relation in a backward way. The same optimal computation time is symmetrically achieved in a forward way for the iterated integrals with the first integrator different from the time variable. Building on these results, we derive several results regarding the linear independence of the signature components of a time-augmented stochastic process. We show that if the stochastic process we consider is solution to some SDE with additive Brownian noise then any subfamily of components proposed previously is linearly independent. We also prove that the linear independence of these subfamilies of components is still true when we consider the discretization of the sample paths of this stochastic process on a grid with a sufficiently small discretization time step."}
{"id": "2601.10474", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10474", "abs": "https://arxiv.org/abs/2601.10474", "authors": ["Adérito Araújo", "Milene Santos"], "title": "Optimal error estimates for a discontinuous Galerkin method on curved boundaries with polygonal meshes", "comment": "42 pages, 6 figures", "summary": "We consider a discontinuous Galerkin method for the numerical solution of boundary value problems in two-dimensional domains with curved boundaries. A key challenge in this setting is the potential loss of convergence order due to approximating the physical domain by a polygonal mesh. Unless boundary conditions can be accurately transferred from the true boundary to the computational one, such geometric approximation errors generally lead to suboptimal convergence. To overcome this limitation, a higher-order strategy based on polynomial reconstruction of boundary data was introduced for classical finite element methods in [28, 29] and in the finite volume context in [7, 11]. More recently, this approach was extended to discontinuous Galerkin methods in [32], leading to the DG-ROD method, which restores optimal convergence rates on polygonal approximations of domains with curved boundaries. In this work, we provide a rigorous theoretical analysis of the DG-ROD method, establishing existence and uniqueness of the discrete solution and deriving error estimates for a two-dimensional linear advection-diffusion-reaction problem with homogeneous Dirichlet boundary conditions on both convex and non-convex domains. Following and extending techniques from classical finite element methods [29], we prove that, under suitable regularity assumptions on the exact solution, the DG-ROD method achieves optimal convergence despite polygonal approximations. Finally, we illustrate and confirm the theoretical results with a numerical benchmark."}
{"id": "2601.10568", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10568", "abs": "https://arxiv.org/abs/2601.10568", "authors": ["Gabriel S. Nahum"], "title": "Hydrodynamic Limit with a Weierstrass-type result", "comment": null, "summary": "We show that any positive, continuous, and bounded function can be realised as the diffusion coefficient of an evolution equation associated with a gradient interacting particle system. The proof relies on the construction of an appropriate model and on the entropy method."}
{"id": "2601.10557", "categories": ["math.NA", "cs.CE", "cs.DC", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.10557", "abs": "https://arxiv.org/abs/2601.10557", "authors": ["Edoardo Di Napoli", "Clément Richefort", "Xinzhe Wu"], "title": "Chebyshev Accelerated Subspsace Eigensolver for Pseudo-hermitian Hamiltonians", "comment": "To be submitted to SISC", "summary": "Studying the optoelectronic structure of materials can require the computation of up to several thousands of the smallest eigenpairs of a pseudo-hermitian Hamiltonian. Iterative eigensolvers may be preferred over direct methods for this task since their complexity is a function of the desired fraction of the spectrum. In addition, they generally rely on highly optimized and scalable kernels such as matrix-vector multiplications that leverage the massive parallelism and the computational power of modern exascale systems. \\textit{Chebyshev Accelerated Subspace iteration Eigensolver} (ChASE) is able to compute several thousands of the most extreme eigenpairs of dense hermitian matrices with proven scalability over massive parallel accelerated clusters. This work presents an extension of ChASE to solve for a portion of the spectrum of pseudo-hermitian Hamiltonians as they appear in the treatment of excitonic materials. The new pseudo-hermitian solver achieves similar convergence and performance as the hermitian one. By exploiting the numerical structure and spectral properties of the Hamiltonian matrix, we propose an oblique variant of Rayleigh-Ritz projection featuring quadratic convergence of the Ritz-values with no explicit construction of the dual basis set. Additionally, we introduce a parallel implementation of the recursive matrix-product operation appearing in the Chebyshev filter with limited amount of global communications. Our development is supported by a full numerical analysis and experimental tests."}
{"id": "2601.10586", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10586", "abs": "https://arxiv.org/abs/2601.10586", "authors": ["Ibrahim Ekren", "Xihao He", "Tianxu Lan", "Xiaolu Tan"], "title": "Comparison of viscosity solutions for a class of non-linear PDEs on the space of finite nonnegative measures", "comment": null, "summary": "We establish a comparison principle for viscosity solutions of a class of nonlinear partial differential equations posed on the space of nonnegative finite measures, thereby extending recent results for PDEs defined on the Wasserstein space of probability measures. As an application, we study a controlled branching McKean-Vlasov diffusion and characterize the associated value function as the unique viscosity solution of the corresponding Hamilton-Jacobi-Bellman equation. This yields a PDE-based approach to the optimal control of branching processes."}
{"id": "2601.10667", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10667", "abs": "https://arxiv.org/abs/2601.10667", "authors": ["Tobin A. Driscoll", "Yuxing Zhou"], "title": "Stable evaluation of derivatives for barycentric and continued fraction representations of rational functions", "comment": "9 pages, 1 figure, 6 tables. Preprint version; software implementation available in https://github.com/complexvariables/RationalFunctionApproximation.jl", "summary": "Fast algorithms for approximation by rational functions exist for both barycentric and Thiele continued fraction (TCF) representations. We present the first numerically stable methods for derivative evaluation in the barycentric representation, including an $O(n)$ algorithm for all derivatives. We also extend an earlier $O(n)$ algorithm for evaluation of the TCF first derivative to higher orders. Numerical experiments confirm the robustness and efficiency of the proposed methods."}
{"id": "2601.10610", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10610", "abs": "https://arxiv.org/abs/2601.10610", "authors": ["Jean Bertoin", "Armand Riera", "Alejandro Rosales-Ortiz"], "title": "Local times and excursions for self-similar Markov trees", "comment": "Comments are welcome", "summary": "This work builds upon the recent monograph [5] on self-similar Markov trees. A self-similar Markov tree is a random real tree equipped with a function from the tree to $[0,\\infty)$ that we call the decoration. Here, we construct local time measures $L(x,dt)$ at every level $x>0$ of the decoration for a large class of self-similar Markov trees. This enables us to mark at random a typical point in the tree at which the decoration is $x$. We identify the law of the decoration along the branch from the root to this tagged point in terms of a remarkable (positive) self-similar Markov process. We also show that after a proper normalization, $L(x,dt)$ converges as $x\\to 0+$ to the harmonic measure $μ$ on the tree. Finally, we point out that using a local time measure instead of the usual length measure $λ$ to compute distances on the tree turn the latter into a continuous branching tree. This is relevant to analyze the excusions of the decoration away from a given level. Many results of the present work shall be compared with the recent ones in [22,23] about local times and excursions of a Markov process indexed by Lévy tree."}
{"id": "2601.10326", "categories": ["math.ST", "math.AP", "math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.10326", "abs": "https://arxiv.org/abs/2601.10326", "authors": ["Aurélien Castre", "Richard Nickl"], "title": "On gradient stability in nonlinear PDE models and inference in interacting particle systems", "comment": "36 pages", "summary": "We consider general parameter to solution maps $θ\\mapsto \\mathcal G(θ)$ of non-linear partial differential equations and describe an approach based on a Banach space version of the implicit function theorem to verify the gradient stability condition of Nickl&Wang (JEMS 2024) for the underlying non-linear inverse problem, providing also injectivity estimates and corresponding statistical identifiability results. We illustrate our methods in two examples involving a non-linear reaction diffusion system as well as a McKean--Vlasov interacting particle model, both with periodic boundary conditions. We apply our results to prove the polynomial time convergence of a Langevin-type algorithm sampling the posterior measure of the interaction potential arising from a discrete aggregate measurement of the interacting particle system."}
{"id": "2601.10624", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.10624", "abs": "https://arxiv.org/abs/2601.10624", "authors": ["Ritesh Goenka", "Peter Keevash", "Tomasz Przybyłowski"], "title": "Source localisation in simple random walks", "comment": "25 pages, 1 figure", "summary": "We consider the problem of locating the source (starting vertex) of a simple random walk, given a snapshot of the set of edges (or vertices) visited in the first $n$ steps. Considering lattices $\\mathbb{Z}^d$, in dimensions $d \\geq 5$, we show that the source can be identified (a) with probability bounded away from $0$ using one guess, and (b) with probability arbitrarily close to $1$ using a constant number of guesses. On the other hand, for dimensions $d \\leq 2$, we show that one cannot locate the source with positive constant probability. Our arguments apply more generally to strongly transient and recurrent simple random walks on vertex-transitive graphs."}
{"id": "2601.10149", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.10149", "abs": "https://arxiv.org/abs/2601.10149", "authors": ["Wenbo Wang", "Guangyan Jia"], "title": "New Second-order Convergent Schemes for Solving decoupled FBSDEs", "comment": null, "summary": "This paper proposes a new second-order symmetric algorithm for solving decoupled forward-backward stochastic differential equations. Inspired by the alternating direction implicit splitting method for partial differential equations, we split the generator into the sum of two functions. In the computation of the value process Y, explicit and implicit schemes are alternately applied to these two generators, while the algorithms from \\citep{ZhaoLi2014} are used for the control process Z. We rigorously prove that the two new schemes have second-order convergence rate. The proposed splitting methods show clear advantages for equations whose generator consists of a linear part plus a nonlinear part, as they reduce the number of iterations required for solving implicit schemes, thereby decreasing computational cost while maintaining second-order convergence. Two numerical examples are provided, including the backward stochastic Riccati equation arising in mean-variance hedging. The numerical results verify the theoretical error analysis and demonstrate the advantage of reduced computational cost compared to the algorithm in \\citep{ZhaoLi2014}."}
{"id": "2601.10326", "categories": ["math.ST", "math.AP", "math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.10326", "abs": "https://arxiv.org/abs/2601.10326", "authors": ["Aurélien Castre", "Richard Nickl"], "title": "On gradient stability in nonlinear PDE models and inference in interacting particle systems", "comment": "36 pages", "summary": "We consider general parameter to solution maps $θ\\mapsto \\mathcal G(θ)$ of non-linear partial differential equations and describe an approach based on a Banach space version of the implicit function theorem to verify the gradient stability condition of Nickl&Wang (JEMS 2024) for the underlying non-linear inverse problem, providing also injectivity estimates and corresponding statistical identifiability results. We illustrate our methods in two examples involving a non-linear reaction diffusion system as well as a McKean--Vlasov interacting particle model, both with periodic boundary conditions. We apply our results to prove the polynomial time convergence of a Langevin-type algorithm sampling the posterior measure of the interaction potential arising from a discrete aggregate measurement of the interacting particle system."}
