{"id": "2601.10828", "categories": ["math.NA", "cs.MS"], "pdf": "https://arxiv.org/pdf/2601.10828", "abs": "https://arxiv.org/abs/2601.10828", "authors": ["Nedialko S. Nedialkov", "John D. Pryce"], "title": "High-Order Lie Derivatives from Taylor Series in the ADTAYL Package", "comment": "16 pages", "summary": "High-order Lie derivatives are essential in nonlinear systems analysis. If done symbolically, their evaluation becomes increasingly expensive as the order increases. We present a compact and efficient numerical approach for computing Lie derivatives of scalar, vector, and covector fields using the MATLAB ADTAYL package. The method exploits a fact noted by Röbenack: that these derivatives coincide, up to factorial scaling, with the Taylor coefficients of expressions built from a Taylor expansion about a trajectory point and, when required, the associated variational matrix. Computational results for a gantry crane model demonstrate orders of magnitude speedups over symbolic evaluation using the MATLAB Symbolic Math Toolbox."}
{"id": "2601.10839", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.10839", "abs": "https://arxiv.org/abs/2601.10839", "authors": ["Rafael Ceja Ayala", "Malena I. Español", "Govanni Granados"], "title": "Qualitative reconstruction methods for imaging interior Robin interfaces in EIT from Robin-to-Dirichlet data", "comment": "28 pages, 5 figures", "summary": "We consider an inverse shape problem arising in electrical impedance tomography (EIT) for nondestructive testing, in which interior defects are modeled through Robin transmission conditions. Unlike classical formulations, we impose Robin boundary conditions on both the exterior measurement surface and the interior interface, and use the Robin-to-Dirichlet (RtD) map as the available data. Within this setting, we develop qualitative (non-iterative) reconstruction methods based on the Linear Sampling Method (LSM) and the Regularized Factorization Method (RFM), and derive new analytical characterizations that enable these methods to identify interior regions. We further propose a numerical implementation that incorporates regularization strategies and demonstrate, through experiments, that the methods reliably reconstruct interior regions of interest."}
{"id": "2601.10887", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10887", "abs": "https://arxiv.org/abs/2601.10887", "authors": ["Boyi Wang", "Saurav Shenoy", "Daniel Fortino", "Long-Qing Chen", "Wenrui Hao"], "title": "A Structure-Preserving Scheme for the Time-Dependent Ginzburg-Landau Model with BCS Gap Coupling", "comment": null, "summary": "We propose a structure-preserving scheme for a hybrid model that couples the time-dependent Ginzburg-Landau (TDGL) equation of superconducting vortex dynamics and the nonlinear Bardeen-Cooper-Schrieffer (BCS) gap equation. This formulation is consistent with the classical TDGL equation in the near-critical temperature, while extending the applicability of the existing TDGL model to regimes beyond the critical temperature. The resulting system poses significant computational challenges due to its nonlinear and coupled structure. To achieve stable and reliable simulations of the vortex dynamics and accompanying morphological transitions, we develop a maximum bound preserving, energy-stable implicit-explicit (IMEX) scheme. The structure-preserving properties of the scheme are rigorously established, ensuring long-time stability and physical consistency. Through two- and three-dimensional simulations, the hybrid model successfully captures the temporal and spatial formation and alignment of vortices and the suppression of superconductivity under increasing magnetic fields, demonstrating both the accuracy and robustness of the proposed computational approach."}
{"id": "2601.10977", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.10977", "abs": "https://arxiv.org/abs/2601.10977", "authors": ["Haoran Xu", "Jie Ren", "Xingye Yue"], "title": "A Non-compact Positivity-Preserving Scheme for Parabolic PDE via Conditional Expectation", "comment": null, "summary": "We propose a novel non-compact, positivity-preserving scheme for linear non-divergence form parabolic equations. Based on the Feynman-Kac formula, the solution is expressed as a conditional expectation of an associated diffusion process. Instead of using compact Markov chain approximations, we employ a wide stencil scheme to approximate the conditional expectation, ensuring consistency and positivity preservation. This method is effective for anisotropic diffusion with mixed derivatives, where classical schemes often fail unless the covariance matrix is diagonally dominated.\n  A key feature of our framework is its robust treatment of boundary conditions, which avoids the accuracy loss commonly encountered in BZ and semi-Lagrangian schemes. For Dirichlet boundaries, we introduce (i) a quad-tree non-uniform stopping time scheme with O($Δt^{1/2}$) accuracy and (ii) a quad-tree uniform stopping time scheme with O($Δt$) accuracy. For Neumann boundaries, we use discrete specular reflection with O($Δt^{1/2}$) convergence, while periodic boundaries are treated using modular wrapping, achieving O($Δt$) accuracy. All analyses are conducted under the practical scaling $Δt \\sim h$.\n  Except for the uniform stopping time scheme, all schemes are explicit. The schemes are unconditionally stable and positive preserving, thanks to the probabilistic structure. To ensure consistency, a non-compact stencil is involved, which leads to the large time step constraint $Δt \\sim h$. Numerical experiments confirm the predicted $L^\\infty$ convergence rates for all types of boundary conditions."}
{"id": "2601.10821", "categories": ["math.PR", "math.AC", "math.CO", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.10821", "abs": "https://arxiv.org/abs/2601.10821", "authors": ["Nikita Lvov"], "title": "Universality results for random matrices over finite local rings", "comment": "42 pages. Comments welcome!", "summary": "Let $R$ be a finite local ring. We prove a quantitative universality statement for the cokernel of random matrices with i.i.d. entries valued in $R$. Rather than use the moment method, we use the Lindeberg replacement technique. This approach also yields a universality result for several invariants that are finer than the cokernel, such as the span and the determinant."}
{"id": "2601.10864", "categories": ["math.ST", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.10864", "abs": "https://arxiv.org/abs/2601.10864", "authors": ["Daniel Irving Bernstein"], "title": "Rigidity theory in statistical inference", "comment": "Expository article written for a Fields Institute volume meant to accompany the Spring 2021 semester program on rigidity theory", "summary": "In this expository article, we summarize what is known about maximum likelihood thresholds of Gaussian models, paying special attention to connections with rigidity theory."}
{"id": "2601.10843", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10843", "abs": "https://arxiv.org/abs/2601.10843", "authors": ["Juan Pablo Vielma"], "title": "Convex analysis for composite functions without K-convexity", "comment": null, "summary": "Composite functions have been studied for over 40 years and appear in a wide range of optimization problems. Convex analysis of these functions focuses on (i) conditions for convexity of the function based on properties of its components, (ii) formulas for the convex conjugate of the function based on those of its components and (iii) chain-rule-like formulas for the sub-differential of the function. To the best of our knowledge all existing results on this matter are based on the notion of K-convexity of functions where K is a closed convex cone. These notions can be considered elementary when K is the non-negative orthant, but otherwise may limit the accessibility of the associated results. In this work we show how standard results on perturbation function based duality can be used to recover and extend existing results without the need for K-convexity. We also provide a detailed comparison with K-convexity based results and show that, while K-convexity is not needed for the convex analysis of composite functions, it certainly aids in verifying the conditions associated with our proposed results. Finally, we provide necessary conditions for the conjugate and sub-differential formulas that are less restrictive than those required by the existing results."}
{"id": "2601.10981", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.10981", "abs": "https://arxiv.org/abs/2601.10981", "authors": ["Xiaoying Dai", "Miao Hu", "Shuwei Shen"], "title": "A model order reduction based adaptive parareal method for time-dependent partial differential equations", "comment": null, "summary": "In this paper, we propose a model order reduction based adaptive parareal method for time-dependent partial differential equations. By using the data obtained by the fine propagator in each iteration of the plain parareal method together with some model order reduction technique, we construct the coarse propagator adaptively in each parareal iteration, and then obtain our adaptive parareal method. We apply this new method to solve some 3D time-dependent advection-diffusion equations with the Kolmogorov flow and the ABC flow. Numerical results show the good performance of our method in simulating long-term evolution problems."}
{"id": "2601.10833", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.10833", "abs": "https://arxiv.org/abs/2601.10833", "authors": ["Pratima Hebbar", "Leonid Koralov"], "title": "Distribution of particles near the front in supercritical branching Brownian motion with compactly supported branching", "comment": "16 pages", "summary": "We investigate the long-time behavior of a $d-$dimensional supercritical branching Brownian motion with a compactly supported branching potential. It is known that, for $\\mathbf{v}\\in \\mathbb{R}^d$, all the moments of the normalized number of particles in a bounded domain centered at $\\mathbf{v} t$ converge, as $t \\rightarrow \\infty$, provided that $\\|\\mathbf{v}\\|$ is strictly less than the asymptotic speed of the front. The limiting distribution does not depend on $\\mathbf{v}$. Using sharp asymptotics for the solutions of parabolic PDEs with compact potential, we prove that the normalized number of particles in a bounded time-dependent domain located near the front converges in distribution and with all the moments. The limit, however, now depends on the asymptotic location of the domain."}
{"id": "2601.11033", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.11033", "abs": "https://arxiv.org/abs/2601.11033", "authors": ["Marc Vidal", "Yves Rosseel"], "title": "Noise-resilient penalty operators based on statistical differentiation schemes", "comment": "10 pages, 2 figures", "summary": "Penalized smoothing is a standard tool in regression analysis. Classical approaches often rely on basis or kernel expansions, which constrain the estimator to a fixed span and impose smoothness assumptions that may be restrictive for discretely observed data. We introduce a class of penalized estimators that operate directly on the data grid, denoising sampled trajectories under minimal smoothness assumptions by penalizing local roughness through statistically calibrated difference operators. Some distributional and asymptotic properties of sample-based contrast statistics associated with the resulting linear smoothers are established under Hellinger differentiability of the model, without requiring Fréchet differentiability in function space. Simulation results confirm that the proposed estimators perform competitively across both smooth and locally irregular settings."}
{"id": "2601.10920", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10920", "abs": "https://arxiv.org/abs/2601.10920", "authors": ["Vladislav Bukshtynov"], "title": "Variational State-Dependent Inverse Problems in PDE-Constrained Optimization: A Survey of Contemporary Computational Methods and Applications", "comment": "89 pages, 2 figures", "summary": "State-dependent parameter identification, where unknown model parameters depend on one or more state variables in partial differential equations (PDEs) or coupled PDE systems, is fundamental to a wide range of problems in physics, engineering, and materials science. This review surveys PDE-constrained optimization approaches for such inverse problems, emphasizing the underlying mathematical theory and key computational advances developed since 2011. We discuss variational formulations, adjoint-based gradient methods, regularization strategies, and modern computational frameworks, and highlight representative applications, with particular emphasis on identifiability, ill-posedness, and structural limits of state-dependent inverse problems. The review concludes with major open challenges and emerging research directions related to nonconvexity, identifiability, regularization, adjoint computation, data limitations, and model-class dependence."}
{"id": "2601.10999", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10999", "abs": "https://arxiv.org/abs/2601.10999", "authors": ["Rishi Mishra", "Smriti", "Balaji Srinivasan", "Sundararajan Natarajan", "Ganapathy Krishnamurthi"], "title": "Exact Constraint Enforcement in Physics-Informed Extreme Learning Machines using Null-Space Projection Framework", "comment": "16 pages,6 Figures", "summary": "Physics-informed extreme learning machines (PIELMs) typically impose boundary and initial conditions through penalty terms, yielding only approximate satisfaction that is sensitive to user-specified weights and can propagate errors into the interior solution. This work introduces Null-Space Projected PIELM (NP-PIELM), achieving exact constraint enforcement through algebraic projection in coefficient space. The method exploits the geometric structure of the admissible coefficient manifold, recognizing that it admits a decomposition through the null space of the boundary operator. By characterizing this manifold via a translation-invariant representation and projecting onto the kernel component, optimization is restricted to constraint-preserving directions, transforming the constrained problem into unconstrained least-squares where boundary conditions are satisfied exactly at discrete collocation points. This eliminates penalty coefficients, dual variables, and problem-specific constructions while preserving single-shot training efficiency. Numerical experiments on elliptic and parabolic problems including complex geometries and mixed boundary conditions validate the framework."}
{"id": "2601.10890", "categories": ["math.PR", "math-ph", "math.CA"], "pdf": "https://arxiv.org/pdf/2601.10890", "abs": "https://arxiv.org/abs/2601.10890", "authors": ["Amílcar Branquinho", "Ana Foulquié-Moreno", "Manuel Mañas"], "title": "Spectral theory for Markov chains with transition matrix admitting a stochastic bidiagonal factorization", "comment": null, "summary": "The recently established spectral Favard theorem for bounded banded matrices admitting a positive bidiagonal factorization is applied to a broader class of Markov chains with bounded banded transition matrices, extending beyond the classical birth-and-death setting, to those that allow a positive stochastic bidiagonal factorization. In the finite case, the Karlin-McGregor spectral representation is derived. The recurrence of the Markov chain is established, and explicit formulas for the stationary distributions are provided in terms of orthogonal polynomials. Analogous results are obtained for the countably infinite case. In this setting, the chain is not necessarily recurrent, and its behavior is characterized in terms of the associated spectral measure. Finally, ergodicity is examined through the presence of a mass at $1$ in the spectral measure, corresponding to the eigenvalue $1$ with both right and left eigenvectors."}
{"id": "2601.11347", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.11347", "abs": "https://arxiv.org/abs/2601.11347", "authors": ["Sebastian Arnold", "Eugenio Clerico"], "title": "Optimal e-values for testing the mean of a bounded random variable against a composite alternative", "comment": null, "summary": "We derive the unique e-values with optimal (relative) growth rate in the worst case for testing the mean of a bounded random variable, hereby contributing with the first application beyond the assumption of mutually absolutely continuous hypotheses of the (RE)GROW quality criteria for e-values originally proposed by Grünwald et al. (2024). For both criteria, we characterise explicitly the alternatives for which it is most difficult to test against, which also admit a meaningful interpretation. We give two important examples of interest where REGROW provides a powerful quality criterion to choose optimal e-variables whereas GROW leads to trivial solutions."}
{"id": "2601.10950", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.10950", "abs": "https://arxiv.org/abs/2601.10950", "authors": ["Kiyuob Jung"], "title": "Specular differentiation in normed vector spaces and its application to nonsmooth convex optimization", "comment": null, "summary": "This paper introduces specular differentiation, which generalizes Gâteaux and Fréchet differentiation in normed vector spaces. Fundamental theoretical properties of specular differentiation are investigated, including the Quasi-Mean Value Theorem and Quasi-Fermat's Theorem. As an application, three numerical methods using specular differentiation are devised to optimize nonsmooth convex functions in higher-dimensional Euclidean spaces. Numerical experiments demonstrate that the proposed methods are capable of minimizing non-differentiable functions that classical methods fail to minimize."}
{"id": "2601.11041", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11041", "abs": "https://arxiv.org/abs/2601.11041", "authors": ["Muhammad Ammad", "Leevan Ling", "Shu Ma"], "title": "B-spline-Based ALE-MFS Framework for Evolving Domains", "comment": null, "summary": "We develop and analyze a B-spline based arbitrary Lagrangian-Eulerian method of fundamental solutions (ALE-MFS) for curvature-driven motion of two-dimensional evolving domains. Boundary points move with the material to track the geometric flow, while interior points move within an ALE framework via a harmonic extension of the boundary velocity, computed by a meshless MFS with sources on a fixed auxiliary circle, thus avoiding volumetric meshing. Boundary normals and curvature are reconstructed by an adaptive local B-spline scheme that remains robust for strongly nonconvex shapes and large deformations. A posteriori error estimates are obtained from a hatmatrix formulation of leave-one-out cross-validation (LOOCV) for both square collocation and zero-padded least-squares systems, and are complemented by maximum principle indicators for harmonic problems. Numerical experiments on circular, star-shaped, and amoeba-like domains show that square collocation suffices for moderately complex geometries, while zero-padded least-squares significantly improves interior velocity regularity and pointwise transport accuracy for strongly nonconvex shapes, without altering the source or collocation sets. The ALE-MFS algorithm also generates high-quality moving meshes for ALE-finite element methods, with larger minimum angles and slower mesh ratio growth than classical FEM mesh-motion strategies, suggesting a practical and easily integrable alternative for challenging moving-interface simulations."}
{"id": "2601.11133", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.11133", "abs": "https://arxiv.org/abs/2601.11133", "authors": ["Jérôme Dedecker", "Aurélie Fischer", "Bertrand Michel"], "title": "Concentration of the empirical measure in Wasserstein distance: bounds involving the covering dimension", "comment": null, "summary": "We give concentration inequalities in Wasserstein distance for the empirical measure of a sequence of independent and identically distributed random variables with values in a Polish space E. These inequalities involve the covering dimension of the support of the distribution of the variables. More precisely, we obtain a complete extension of the concentration inequalities of Fournier and Guillin [2015] in the case where E = R^d , in which the covering dimension replaces the dimension of the ambient space E."}
{"id": "2601.11422", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.11422", "abs": "https://arxiv.org/abs/2601.11422", "authors": ["Robert E. Gaunt", "Frédéric Ouimet", "Donald Richards"], "title": "Stein's method for the matrix normal distribution", "comment": "29 pages, 0 figures", "summary": "This work presents the first systematic development of Stein's method for matrix distributions. We establish the basic essential ingredients of Stein's method for matrix normal approximation: we derive a generator-based Stein identity from a matrix Ornstein--Uhlenbeck diffusion with two-sided scales, provide an explicit semigroup representation for the solution of the Stein equation, and obtain regularity estimates for the solution. The new methodology is illustrated with three statistical applications, these being smooth Wasserstein distance bounds to quantify the matrix central limit theorem, a Wasserstein distance bound for the matrix normal approximation of the centered matrix $T$ distribution, and the derivation of Stein's method-of-moments estimators for scale parameters of the matrix normal distribution."}
{"id": "2601.10952", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10952", "abs": "https://arxiv.org/abs/2601.10952", "authors": ["George Dunn", "Elizabeth Stojanovski", "Bishnu Lamichhane", "Hadi Charkhgard", "Ali Eshragh"], "title": "Modified Dynamic Programming Algorithms for Order Picking in Single-Block and Two-Block Rectangular Warehouses", "comment": null, "summary": "Recent research has shown that optimal picker tours in rectangular warehouses exhibit deterministic travel patterns within each aisle, and that certain previously considered traversals are unnecessary. Using these insights, this paper proposes modifications to dynamic programming algorithms that improve computational efficiency without affecting optimality. For layouts with and without a central cross-aisle, the modifications preserve linear-time complexity in the number of aisles while reducing the number of state-action evaluations per stage. The proposed modifications reduce computational effort by factors up to 1.81, confirmed by numerical experiments. These findings are encouraging and highlight how structural refinements can yield significant improvements in practical performance of algorithms."}
{"id": "2601.11051", "categories": ["math.NA", "math.DG"], "pdf": "https://arxiv.org/pdf/2601.11051", "abs": "https://arxiv.org/abs/2601.11051", "authors": ["Muhammad Ammad", "Leevan Ling"], "title": "An Adaptive Lagrangian B-Spline Framework for Point Cloud Manifold Evolution", "comment": null, "summary": "We extend our recent curve-evolution framework based on localized B-spline interpolation to present an adaptive Lagrangian framework for the geometric evolution of point-cloud data representing smooth, codimension-one surfaces in $\\mathbb{R}^3$. The method constructs overlapping, localized tensor-product B-spline patches, enabling direct, meshless surface evolution from discrete samples. Within each patch, the differentiable B-spline representation yields analytic, high-order estimates of intrinsic geometric invariants, supporting curvature-driven and geometry-coupled flows. The organization of control points facilitates coherent updates of both surface samples and spline coefficients under intrinsic velocity fields. A conditioning-aware formulation of the local interpolation system, combined with a Gauss-Seidel refinement of control points, maintains interpolation quality throughout the evolution. Adaptive knot insertion and point redistribution, guided by geometric error indicators and local sampling density, preserve surface resolution and regularity during deformation. Numerical experiments demonstrate efficient and accurate reproduction of surface evolution phenomena, including mean-curvature flow, anisotropic deformations, and coupled surface-field dynamics, establishing localized B-spline methods as precise and versatile tools for dynamic manifold approximation."}
{"id": "2601.11162", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.11162", "abs": "https://arxiv.org/abs/2601.11162", "authors": ["Laurent Decreusefond", "Antonin Jacquet"], "title": "Rate of convergence of the conditioned random walk towards the Brownian bridge", "comment": null, "summary": "We study the rate of convergence of two discrete processes towards the Brownian bridge: the random walk conditioned to be zero at time 2n and the empirical process which appears in the Glivencko-Cantelli theorem. Combining a functional Stein method with a Radon-Nikodym representation of the bridge, we bound the Fortet-Mourier distance between these conditioned processes and the Brownian bridge."}
{"id": "2601.11465", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.11465", "abs": "https://arxiv.org/abs/2601.11465", "authors": ["XuanLong Nguyen", "Yun Wei"], "title": "Optimal transport based theory for latent structured models", "comment": "27 pages", "summary": "This article is an exposition on some recent theoretical advances in learning latent structured models, with a primary focus on the fundamental roles that optimal transport distances play in the statistical theory. We aim at what may be the most critical and novel ingredient in this theory: the motivation, formulation, derivation and ramification of inverse bounds, a rich collection of structural inequalities for latent structured models which connect the space of distributions of unobserved structures of interest to the space of distributions for observed data. This theory is illustrated on classical mixture models, as well as the more modern hierarchical models that have been developed in Bayesian statistics, machine learning and related fields."}
{"id": "2601.10967", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.10967", "abs": "https://arxiv.org/abs/2601.10967", "authors": ["Kyrho Corum", "Renier Mendoza", "Victoria May P. Mendoza", "Arrianne Crystal Velasco"], "title": "Balancing Economic Cost and Disease Impact: Optimization Models for Wolbachia-Based Dengue Control", "comment": "27 pages, 12 figures, and 5 tables", "summary": "Dengue, which affects millions of people each year, is one of the most common diseases transmitted by infected \\textit{Aedes aegypti} mosquitoes. In the Philippines, the annual economic cost of dengue infections is estimated at around PHP 17 billion. Previous studies have shown that controlling the population of mosquitoes capable of transmitting the dengue virus can effectively reduce dengue infection rates. This study explores the use of Wolbachia as a strategy for dengue control by targeting mosquitoes. Since the release of Wolbachia-infected mosquitoes involves substantial costs, careful planning is necessary to balance disease control with the associated economic burden. To address this, we propose a mathematical model that captures the dynamics of releasing Wolbachia-carrying mosquitoes and the transmission of dengue in a population. We formulate single- and multi-objective optimization frameworks to minimize the economic costs associated with releasing Wolbachia-infected mosquitoes and the hospitalization costs resulting from dengue infections. This study aims to provide insights into the practical application of Wolbachia-based interventions for controlling dengue transmission. While the analysis is grounded in the Philippine context, the approach is general enough to be applicable to other dengue-endemic countries."}
{"id": "2601.11132", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.11132", "abs": "https://arxiv.org/abs/2601.11132", "authors": ["Sebastian Franz", "Sascha Trostorff"], "title": "Numerical Treatment of Non-local Integral Operators in the Framework of Evolutionary Equations", "comment": null, "summary": "Using the theory of evolutionary equations, we consider abstract differential equations including non-local integral operators. After providing a condition for the well-posedness of the addressed equation we consider a numerical method of approximating its solution. We provide convergence proofs under conditions on the kernel of the integral operator and the solution and finish the paper with some simulation results."}
{"id": "2601.11216", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.11216", "abs": "https://arxiv.org/abs/2601.11216", "authors": ["Bernard Bercu", "Stefano Favaro"], "title": "A Gaussian process limit for the self-normalized Ewens-Pitman process", "comment": "27 pages", "summary": "For an integer $n\\geq1$, consider a random partition $Π_{n}$ of $\\{1,\\ldots,n\\}$ into $K_{n}$ partition sets with $K_{r,n}$ partition subsets of size $r=1,\\ldots,n$, and assume $Π_{n}$ distributed according to the Ewens-Pitman model with parameters $α\\in]0,1[$ and $θ>-α$. Although the large-$n$ asymptotic behaviors of $K_{n}$ and $K_{r,n}$ are well understood in terms of almost sure convergence and Gaussian fluctuations, much less is known about the asymptotic behavior of $P_{r,n}=K_{r,n}/K_n$ and of the self-normalized Ewens-Pitman process $(P_{1,n},P_{2,n},\\dots)$. Motivated by the almost sure convergence of $(P_{1,n},P_{2,n},\\dots)$ to the Sibuya distribution $p_α=(p_α(1),p_α(2),\\ldots)$, where $p_α(r)$ is the probability mass at $r=1,2,\\ldots$, we establish the $\\ell^{2}$ distributional convergence \\begin{displaymath} \\sqrt{K_{n}}((P_{1,n},\\,P_{2,n},\\ldots)-p_α)\\underset{n\\rightarrow+\\infty}{\\overset{\\cL}{\\longrightarrow}}\\mathcal{G}(Γ_α), \\end{displaymath} where $\\mathcal{G}(Γ_α)$ stands for a centered Gaussian process with covariance matrix $Γ_α=diag(p_α) - p_α p_α^T$. We apply our result to the estimation of the parameter"}
{"id": "2601.10990", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.10990", "abs": "https://arxiv.org/abs/2601.10990", "authors": ["Xinpo Li", "Jingtao Shi"], "title": "The Optimal Control Problem of Stochastic Differential System with Extended Mixed Delays and Applications", "comment": "45 pages", "summary": "This paper investigates an optimal control problem where the system is described by a stochastic differential equation with extended mixed delays that contain point delay, extended distributed delay, and extended noisy memory. The model is general in that the extended mixed delays of the state variable and control variable are components of all the coefficients, in particular, the diffusion term and the terminal cost. To address the difficulties induced by the extended noisy memory, by stochastic Fubini theorem, we transform the delay variational equation into a Volterra integral equation without delay, and then a kind of backward stochastic Volterra integral equation with Malliavin derivatives is introduced by the developed coefficient decomposition method and the generalized duality principle. Therefore, the stochastic maximum principle and the verification theorem are established. Subsequently, with Clark-Ocone formula, the adjoint equation is expressed as a set of anticipated backward stochastic differential equations. Finally, a nonzero-sum stochastic differential game with extended mixed delays and a linear-quadratic solvable example are discussed, as applications."}
{"id": "2601.11145", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11145", "abs": "https://arxiv.org/abs/2601.11145", "authors": ["Jean-Paul Chehab", "Gaspard Kemlin", "Marcos Raydan", "Yousef Saad"], "title": "Eigenvector-based acceleration strategies for gradient-type methods", "comment": null, "summary": "Several strategies are described and analyzed to speed-up gradient-type methods when applied to the minimization of strictly convex quadratics and strictly convex functions. The proposed techniques focus on relaxing the traditional optimal step length associated with gradient methods, including the steepest descent (SD) and the minimal residual (MR) methods. Such a relaxation avoids the well-known negative zigzag effect and allows the iterates to move in the entire space which in turn implies that every so often the search direction approaches some eigenvector of the underlying Hessian matrix. The proposed speedups then rely on taking advantage of the properties of the Lanczos method once a search direction that approaches an eigenvector has been identified in order to accelerate the convergence towards the global minimizer. After analyzing the proposed strategies, we illustrate them on the global minimization of strictly convex functions."}
{"id": "2601.11445", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.11445", "abs": "https://arxiv.org/abs/2601.11445", "authors": ["Juan Guillermo Garrido", "Nabil Kazi-Tani", "Emilio Vilches"], "title": "Stochastic Perturbation of Sweeping Process for Uniformly Prox-Regular Moving Sets", "comment": null, "summary": "In this paper, we study the existence of solutions to a sweeping process in the presence of stochastic perturbations, where the moving set takes uniformly prox-regular values and varies continuously with respect to the Hausdorff distance, without smoothness assumptions. We consider several geometric assumptions and establish important relationships between them."}
{"id": "2601.11010", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.11010", "abs": "https://arxiv.org/abs/2601.11010", "authors": ["Zhibin Wu", "Songhao Shen", "Yufeng Zhou", "Qin Lei"], "title": "The Dynamic Team Orienteering Problem in Spatial Crowdsourcing: A Scenario Sampling Approach", "comment": null, "summary": "In services such as retail audits and urban infrastructure monitoring, a platform dispatches rewarded, location-based micro-tasks to mobile workers traveling along personal origin-destination (OD) trips under hard time budgets. As requests with time constraints arrive online over a finite horizon, the platform must decide which requests to accept and how to route workers to maximize collected profit. We model this setting as the Dynamic Team Orienteering Problem in Spatial Crowdsourcing (DTOP-SC). To solve this problem, we propose a scenario-sampling rolling-horizon framework that mitigates myopic bias by augmenting each planning epoch with sampled virtual tasks. At each epoch, the augmented task set defines a deterministic static subproblem solved via an adaptive large neighborhood search (ALNS). We also formulate a mixed-integer programming model to provide offline reference solutions. Computational experiments are conducted on synthetic DTOP-SC instances generated from real-world road-map coordinates and on a dynamic team orienteering (DTOP) benchmark. On the map-based instances, the proposed policy exhibits stable gaps with respect to time-limited MIP solutions across the tested scales, while maintaining smooth computational scalability as the problem size increases. On the DTOP benchmark, the policy achieves an average decision time of 0.14s per instance, with 192-198s reported for multiple plan approach as an indicative reference, while maintaining competitive profit."}
{"id": "2601.11152", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.11152", "abs": "https://arxiv.org/abs/2601.11152", "authors": ["Yujun Zhu", "Min Li", "Yulan Ning", "Ju Ming"], "title": "An efficient solver based on low-rank approximation and Neumann matrix series for unsteady diffusion-type partial differential equations with random coefficients", "comment": null, "summary": "In this paper, we develop an efficient numerical solver for unsteady diffusion-type partial differential equations with random coefficients. A major computational challenge in such problems lies in repeatedly handling large-scale linear systems arising from spatial and temporal discretizations under uncertainty. To address this issue, we propose a novel generalized low-rank matrix approximation to represent the stochastic stiffness matrices, and approximate their inverses using the Neumann matrix series expansion. This approach transforms high-dimensional matrix inversion into a sequence of low-dimensional matrix multiplications. Therefore, the solver significantly reduces the computational cost and storage requirements while maintaining high numerical accuracy. The error analysis of the proposed solver is also provided. Finally, we apply the method to two classic uncertainty quantification problems: unsteady stochastic diffusion equations and the associated distributed optimal control problems. Numerical results demonstrate the feasibility and effectiveness of the proposed solver."}
{"id": "2601.11470", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.11470", "abs": "https://arxiv.org/abs/2601.11470", "authors": ["Roope Anttila", "Markus Myllyoja"], "title": "Dvoretzky covering problem for general measures", "comment": "36 pages + 6 page appendix. Comments are welcome!", "summary": "We study the Dvoretzky covering problem for random covering sets driven by general Borel probability measures. As our main result, we solve the problem of covering analytic sets by random covering sets generated by arbitrary Borel probability measures on the real line. Prior to this work, a complete solution was not known for any singular measure. Our solution is potential theoretic and involves a generalisation of a notion of capacity in the work of Kahane, who solved the problem of covering compact sets in the classical setting where the random covering process is driven by the Lebesgue measure on the unit circle. One of our key innovations is a simple but powerful application of the Jankov-von Neumann uniformisation theorem, which we believe to have interest outside of this work.\n  In addition, we determine the critical exponent for the covering problem for polynomially decreasing sequences $(cn^{-t})_n$ for random covering sets driven by Borel probability measures on $\\mathbb{R}^d$. At exactly the critical exponent, the covering property generally depends on the constant $c>0$, and as an application of our main result, we determine the critical constant for random covering sets driven by natural measures on strongly separated self-conformal sets on the line. The critical constant depends on the multifractal structure of the average densities of the measure, and the result is new even for the simplest case of the Hausdorff measure on the Cantor set."}
{"id": "2601.11107", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.11107", "abs": "https://arxiv.org/abs/2601.11107", "authors": ["Xiaoyue Liu", "Walid Klibi", "Benoit Montreuil"], "title": "Modular and Mobile Capacity Planning for Hyperconnected Supply Chain Networks", "comment": null, "summary": "The increased volatility of markets and the pressing need for resource sustainability are driving supply chains towards more agile, distributed, and dynamic designs. Motivated by the Physical Internet initiative, we introduce the Dynamic Stochastic Modular and Mobile Capacity Planning (DSMMCP) problem, which fosters hyperconnectivity through a network-of-networks architecture with modular and mobile capacities. The problem addresses both demand and supply uncertainties by incorporating short-term leasing of modular facilities and dynamic relocation of resources. We formulate DSMMCP as a partially adaptive multi-stage stochastic program that minimizes the expected multi-period costs under uncertainty. To tackle the inherent NP-hardness, we develop an enhanced stochastic dual dynamic integer programming (SDDiP) algorithm, which integrates strengthened cut generation, a tailored alternating cut strategy, and an efficient parallelization framework, and we establish structural dominance and monotonicity properties that formalize the value of the strengthened cuts and partial adaptivity. Numerical experiments inspired by a real case study of a large U.S. construction company demonstrate that the DSMMCP framework achieves approximately 15% cost savings over static planning while improving resilience, reducing outsourcing costs, and supporting sustainability. Complementary experiments on synthetic instances confirm the effectiveness of the proposed SDDiP algorithm in terms of solution quality and runtime, as well as the scalability and robustness of the partially adaptive stochastic modeling framework across different network sizes and uncertainty levels."}
{"id": "2601.11157", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11157", "abs": "https://arxiv.org/abs/2601.11157", "authors": ["Zeyu Dong", "Aqin Xiao", "Guojian Yin", "Junfeng Yin"], "title": "Adaptive Randomized Extended Bregman-Kaczmarz Method for Combined Optimization Problems", "comment": null, "summary": "Combined optimization problems that couple data-fidelity and regularization terms arise naturally in a wide range of inverse problems. In this paper, we study an adaptive randomized averaging block extended Bregman-Kaczmarz (aRABEBK) method for solving such problems. The proposed method incorporates iteration-wise relaxation parameters that are automatically adjusted using residual information, allowing for more aggressive step sizes without additional manual tuning. We establish a convergence theory for the proposed framework and derive expected linear convergence rate guarantees. Numerical experiments on both synthetic and real data sets for sparse and minimum-norm least-squares problems demonstrate that our aRABEBK method achieves faster convergence and improved robustness compared with state-of-the-art extended Kaczmarz and Bregman-Kaczmarz-type algorithms, including its nonadaptive counterpart."}
{"id": "2601.11294", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.11294", "abs": "https://arxiv.org/abs/2601.11294", "authors": ["Antonio Ocello"], "title": "Controlled Interacting Branching Diffusion Processes: A Viscosity Approach", "comment": null, "summary": "We study optimal control problems for interacting branching diffusion processes, a class of measure-valued dynamics capturing both spatial motion and branching mechanisms. From the perspective of the dynamic programming principle, we establish a rigorous connection between the control problem and an infinite system of coupled Hamilton--Jacobi--Bellman (HJB) equations, obtained through a bijection between admissible particle configurations and the disjoint topological union of countable Euclidean spaces. Under natural coercivity conditions on the cost functionals, we show that these growth conditions transfer to the value function and yield a viscosity characterization in the class of functions satisfying the same bounds. We further prove a comparison principle, which allows us to fully characterize the control problem through the associated HJB equation. Finally, we show that the problem simplifies in the mean-field regime, where the model coefficients exhibit symmetry with respect to the indices of the individuals in the population. This permutation invariance allows us to restrict attention to a reduced class of symmetric admissible controls, a reduction established by combining the viscosity characterization of the value function with measurable selection arguments."}
{"id": "2601.11217", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11217", "abs": "https://arxiv.org/abs/2601.11217", "authors": ["Matthieu Meunier", "Huyên Pham", "Christoph Reisinger"], "title": "Model-free policy gradient for discrete-time mean-field control", "comment": "42 pages, 5 figures", "summary": "We study model-free policy learning for discrete-time mean-field control (MFC) problems with finite state space and compact action space. In contrast to the extensive literature on value-based methods for MFC, policy-based approaches remain largely unexplored due to the intrinsic dependence of transition kernels and rewards on the evolving population state distribution, which prevents the direct use of likelihood-ratio estimators of policy gradients from classical single-agent reinforcement learning. We introduce a novel perturbation scheme on the state-distribution flow and prove that the gradient of the resulting perturbed value function converges to the true policy gradient as the perturbation magnitude vanishes. This construction yields a fully model-free estimator based solely on simulated trajectories and an auxiliary estimate of the sensitivity of the state distribution. Building on this framework, we develop MF-REINFORCE, a model-free policy gradient algorithm for MFC, and establish explicit quantitative bounds on its bias and mean-squared error. Numerical experiments on representative mean-field control tasks demonstrate the effectiveness of the proposed approach."}
{"id": "2601.11172", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11172", "abs": "https://arxiv.org/abs/2601.11172", "authors": ["Niklas Kolbe", "Siegfried Müller", "Aleksey Sikstel"], "title": "Discontinuous Galerkin schemes for multi-dimensional coupled hyperbolic systems", "comment": "32 pages, 3 figures", "summary": "A novel class of Runge-Kutta discontinuous Galerkin schemes for coupled systems of conservation laws in multiple space dimensions that are separated by a fixed sharp interface is introduced. The schemes are derived from a relaxation approach and a local projection and do not require expensive solutions of nonlinear half-Riemann problems. The underlying Jin-Xin relaxation involves a problem specific modification of the coupling condition at the interface, for which a simple construction algorithm is presented. The schemes are endowed with higher order time discretization by means of strong stability preserving Runge-Kutta methods. These are derived from an asymptotic preserving implicit-explicit treatment of the coupled relaxation system taken to the discrete relaxation limit. In a case study the application to a multi-dimensional fluid-structure coupling problem employing the compressible Euler equations and a linear elastic model is discussed."}
{"id": "2601.11422", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.11422", "abs": "https://arxiv.org/abs/2601.11422", "authors": ["Robert E. Gaunt", "Frédéric Ouimet", "Donald Richards"], "title": "Stein's method for the matrix normal distribution", "comment": "29 pages, 0 figures", "summary": "This work presents the first systematic development of Stein's method for matrix distributions. We establish the basic essential ingredients of Stein's method for matrix normal approximation: we derive a generator-based Stein identity from a matrix Ornstein--Uhlenbeck diffusion with two-sided scales, provide an explicit semigroup representation for the solution of the Stein equation, and obtain regularity estimates for the solution. The new methodology is illustrated with three statistical applications, these being smooth Wasserstein distance bounds to quantify the matrix central limit theorem, a Wasserstein distance bound for the matrix normal approximation of the centered matrix $T$ distribution, and the derivation of Stein's method-of-moments estimators for scale parameters of the matrix normal distribution."}
{"id": "2601.11294", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.11294", "abs": "https://arxiv.org/abs/2601.11294", "authors": ["Antonio Ocello"], "title": "Controlled Interacting Branching Diffusion Processes: A Viscosity Approach", "comment": null, "summary": "We study optimal control problems for interacting branching diffusion processes, a class of measure-valued dynamics capturing both spatial motion and branching mechanisms. From the perspective of the dynamic programming principle, we establish a rigorous connection between the control problem and an infinite system of coupled Hamilton--Jacobi--Bellman (HJB) equations, obtained through a bijection between admissible particle configurations and the disjoint topological union of countable Euclidean spaces. Under natural coercivity conditions on the cost functionals, we show that these growth conditions transfer to the value function and yield a viscosity characterization in the class of functions satisfying the same bounds. We further prove a comparison principle, which allows us to fully characterize the control problem through the associated HJB equation. Finally, we show that the problem simplifies in the mean-field regime, where the model coefficients exhibit symmetry with respect to the indices of the individuals in the population. This permutation invariance allows us to restrict attention to a reduced class of symmetric admissible controls, a reduction established by combining the viscosity characterization of the value function with measurable selection arguments."}
{"id": "2601.11193", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11193", "abs": "https://arxiv.org/abs/2601.11193", "authors": ["Peter von Schultzendorff", "Tor Harald Sandve", "Birane Kane", "David Landa-Marbán", "Jakub Wiktor Both", "Jan Martin Nordbotten"], "title": "A Machine-Learned Near-Well Model in OPM Flow", "comment": null, "summary": "Recent advances in reservoir simulation increasingly utilize hybrid approaches that couple physics-based simulators with machine-learning (ML) components. ML components offer high fidelity to training data and fast inference, enabling efficient and accurate modeling of complex multi-scale or multi-physics phenomena. Modern reservoir simulators rely on automatic differentiation (AD) to support efficient and flexible strategies for nonlinear solvers, inverse problems, and optimization problems. Efficient hybrid modeling therefore requires tight integration of the ML components with the simulator's AD framework.\n  We present the first integration of neural networks into the high-performance reservoir simulator OPM Flow. Networks are trained in TensorFlow and imported into OPM, where they are accessed as native AD functions. This presents an efficient framework for hybrid modeling and enables seamless integration in existing simulator workflows.\n  As an application, we introduce a novel, data-driven near-well model. Near-well models are essential in reservoir simulation for accurately representing singular pressure gradients around wells. Commonly used are the Peaceman near-well model and its extensions, or local grid refinement around the wells. Peaceman-type models are limited to simplified flow regimes, whereas local grid refinement is computationally expensive. We address these limitations by training a neural network to infer a Peaceman-like well index from fine-scale ensemble simulations of the near-well region. It is then integrated into OPM Flow with the new framework. Tested on relevant examples for CO$_2$ storage, the method offers high fidelity to fine-scale results at low computational cost, demonstrating the potential of the OPM Flow-Neural Network framework for hybrid modeling."}
{"id": "2601.11300", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.11300", "abs": "https://arxiv.org/abs/2601.11300", "authors": ["Pham Viet Hai", "Thanh Quoc Trinh", "Phan Tu Vuong"], "title": "Second order continuous and discrete dynamical systems for solving inverse quasi-variational inequalities", "comment": null, "summary": "In this paper, we investigate the inverse quasi-variational inequality problem in finite-dimensional spaces. First, we introduce a second-order dynamical system whose trajectory converges exponentially to the solution of the inverse quasi-variational inequality, under the assumptions of Lipschitz continuity and strong monotonicity. Next, we discretize the proposed dynamical system to develop an algorithm, and prove that the iterations converge linearly to the unique solution of the inverse quasi-variational inequality. Finally, we present numerical experiments and applications to validate the theoretical results and compare the performance with existing methods."}
{"id": "2601.11308", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11308", "abs": "https://arxiv.org/abs/2601.11308", "authors": ["Ferhat Sindy", "Annalisa Buffa", "Marco Picasso"], "title": "A Recovery-Based Error Indicator for Finite Difference Methods", "comment": null, "summary": "A novel recovery-based error indicator for high-order Finite Difference Methods, based on post-processing of the Finite Difference values is presented. The values obtained on the Finite Difference grid are interpolated into a suitable polynomial Finite Element space. A recovery-based error indicator, with the polynomial-preserving property, is then applied to estimate the gradient error. The performance and accuracy of the proposed error indicator are demonstrated through several numerical experiments, including the two-dimensional Poisson problem solved using second- and fourth-order finite difference schemes. Additional experiments are conducted on elliptic problems with discontinuous coefficients, as well as on the two and three-dimensional wave equation in homogeneous media with second- and fourth-order finite differences, and in heterogeneous media with second-order finite differences."}
{"id": "2601.11348", "categories": ["math.OC", "q-fin.RM"], "pdf": "https://arxiv.org/pdf/2601.11348", "abs": "https://arxiv.org/abs/2601.11348", "authors": ["Hansjoerg Albrecher", "Nora Muler"], "title": "Optimal Abatement Schedules for Excess Carbon Emissions Towards a Net-Zero Target", "comment": null, "summary": "Achieving net-zero carbon emissions requires a transformation of energy systems, industrial processes, and consumption patterns. In particular, a transition towards that goal involves a gradual reduction of excess carbon emissions that are not essential for the well-functioning of society. In this paper we study this problem from a stochastic control perspective to identify the optimal gradual reduction of the emission rate, when an allocated excess carbon budget is used up over time. Assuming that updates of the available carbon budget follow a diffusion process, we identify the emission strategy that maximizes expected discounted emissions under the constraint of a non-increasing emission rate, with an additional term rewarding the amount of time for which the budget is not yet depleted. We establish a link of this topic to optimal dividend problems in insurance risk theory under ratcheting constraints and show that the value function is the unique viscosity solution of the associated Hamilton-Jacobi-Bellman equation. We provide numerical illustrations of the resulting optimal abatement schedule of emissions and a quantitative evaluation of the effect of the non-increasing rate constraint on the value function."}
{"id": "2601.11317", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11317", "abs": "https://arxiv.org/abs/2601.11317", "authors": ["Robbe Vermeiren"], "title": "Constructing Orthonormal Rational Function Vectors with an application in Rational Approximation", "comment": "19 pages", "summary": "We present two algorithms for constructing orthonormal bases of rational function vectors with respect to a discrete inner product, and discuss how to use them for a rational approximation problem. Building on the pencil-based formulation of the inverse generalized eigenvalue problem by Van Buggenhout et al.\\ (2022), we extend it to rational vectors of arbitrary length $k$, where the recurrence relations are represented by a pair of $k$-Hessenberg matrices, i.e., matrices with possibly $k$ nonzero subdiagonals. An updating algorithm based on similarity transformations using rotations and a Krylov-type algorithm related to the rational Arnoldi method are derived. The performance is demonstrated on the rational approximation of $\\sqrt{z}$ on $[0,1]$, where the optimal lightning + polynomial convergence rate of Herremans, Huybrechs, and Trefethen (2023) is successfully recovered. This illustrates the robustness of the proposed methods for handling exponentially clustered poles near singularities."}
{"id": "2601.11395", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.11395", "abs": "https://arxiv.org/abs/2601.11395", "authors": ["Alberto Domínguez Corella", "Onésimo Hernández-Lerma"], "title": "The maximum principle for discrete-time control systems and applications to dynamic games", "comment": null, "summary": "We study deterministic nonstationary discrete-time optimal control problems in both finite and infinite horizon. With the aid of Gateaux differentials, we prove a discrete-time maximum principle in analogy with the well-known continuous-time maximum principle. We show that this maximum principle, together with a transversality condition, is a necessary condition for optimality; we also show that it is sufficient under additional hypotheses. We use Gateaux differentials as a natural setting to derive first-order conditions. Additionally, we use the discrete-time maximum principle to derive the discrete-time Euler equation and to characterize Nash equilibria for discrete-time dynamic games."}
{"id": "2601.11406", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11406", "abs": "https://arxiv.org/abs/2601.11406", "authors": ["Ahmed Aberqi", "Ahmed Miloudi"], "title": "Solving the Fisher nonlinear differential equations via Physics-Informed Neural Networks: A Comprehensive Retraining Study and Comparative Analysis with the Finite Difference Method", "comment": "14 pages, 9 Figures", "summary": "Physics-Informed Neural Networks (PINNs) represent a groundbreaking paradigm in scientific computing, seamlessly integrating the robust framework of deep learning with fundamental physical laws. This paper meticulously applies the standard PINN framework to solve the challenging one-dimensional nonlinear Fisher-KPP equation, a critical model in reaction-diffusion dynamics describing phenomena such as population spread and flame propagation. We detail a comprehensive methodology, encompassing the neural network architecture, the physics-informed loss function, and an in-depth investigation into retraining strategies aimed at optimizing model performance. Our approach is rigorously validated through a direct comparison of the PINN solution against both the known analytical solution and a numerical solution derived from the Finite Difference Method (FDM). Through this work, we elucidate the intricate balance between model complexity, training efficiency, and accuracy. Results highlight the PINN's remarkable capability in accurately approximating the solution to this complex PDE, while also shedding light on the critical aspects and challenges of model retraining, particularly concerning the optimizer's state. This study provides a thorough quantitative error analysis, demonstrating the efficacy of PINNs as a viable and competitive alternative to traditional numerical methods for solving nonlinear differential equations, and discusses their broader applications across various scientific domains."}
{"id": "2601.11420", "categories": ["math.OC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.11420", "abs": "https://arxiv.org/abs/2601.11420", "authors": ["Yulei You", "Junyi Liu"], "title": "Statistical Robustness of Interval CVaR Based Regression Models under Perturbation and Contamination", "comment": null, "summary": "Robustness under perturbation and contamination is a prominent issue in statistical learning. We address the robust nonlinear regression based on the so-called interval conditional value-at-risk (In-CVaR), which is introduced to enhance robustness by trimming extreme losses. While recent literature shows that the In-CVaR based statistical learning exhibits superior robustness performance than classical robust regression models, its theoretical robustness analysis for nonlinear regression remains largely unexplored. We rigorously quantify robustness under contamination, with a unified study of distributional breakdown point for a broad class of regression models, including linear, piecewise affine and neural network models with $\\ell_1$, $\\ell_2$ and Huber losses. Moreover, we analyze the qualitative robustness of the In-CVaR based estimator under perturbation. We show that under several minor assumptions, the In-CVaR based estimator is qualitatively robust in terms of the Prokhorov metric if and only if the largest portion of losses is trimmed. Overall, this study analyzes robustness properties of In-CVaR based nonlinear regression models under both perturbation and contamination, which illustrates the advantages of In-CVaR risk measure over conditional value-at-risk and expectation for robust regression in both theory and numerical experiments."}
{"id": "2601.11483", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11483", "abs": "https://arxiv.org/abs/2601.11483", "authors": ["Lukas Vierus", "Thomas Schuster", "Bernadette Hahn"], "title": "Tensor field tomography with attenuation and refraction: adjoint operators for the dynamic case and numerical experiments", "comment": "18 pages, 7 figures", "summary": "This article is concerned with tensor field tomography in a fairly general setting, that takes refraction, attenuation and time-dependence of tensor fields into account. The mathematical model is given by attenuated ray transforms of the fields along geodesic curves corresponding to a Riemannian metric that is defined by the index of refraction. The data are given at the boundary tangent bundle of the domain and it is well-known that they can be characterized as boundary data of a transport equation turning tensor field tomography into an inverse source problem. This way the adjoint of the forward mapping can be computed using the integral representation or, equivalently, associated to a dual transport equation. The article offers and proves two different representations for the adjoint mappings both in the dynamic and static case. The numerical implementation is demonstrated and evaluated for static fields using the damped Landweber method with Nesterov acceleration applied to both, the integral and PDE-based formulations. The transport equations are solved using a viscosity approximation. The error analysis reveals that the integral representation significantly outperforms PDE-based methods in terms of computational efficiency while achieving comparable reconstruction accuracy. The impact of noise and deviations from straight-line trajectories are investigated confirming improved accuracy if refraction is taken into account. We conclude that the inclusion of refraction to the forward model pays in spite of increased numerical cost."}
{"id": "2601.11435", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11435", "abs": "https://arxiv.org/abs/2601.11435", "authors": ["Menglian Wang", "Zhuanghua Liu", "Luo Luo"], "title": "Near-Optimal Decentralized Stochastic Nonconvex Optimization with Heavy-Tailed Noise", "comment": null, "summary": "This paper studies decentralized stochastic nonconvex optimization problem over row-stochastic networks. We consider the heavy-tailed gradient noise which is empirically observed in many popular real-world applications. Specifically, we propose a decentralized normalized stochastic gradient descent with Pull-Diag gradient tracking, which achieves approximate stationary points with the optimal sample complexity and the near-optimal communication complexity. We further follow our framework to study the setting of undirected networks, also achieving the nearly tight upper complexity bounds. Moreover, we conduct empirical studies to show the practical superiority of the proposed methods."}
{"id": "2601.11493", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.11493", "abs": "https://arxiv.org/abs/2601.11493", "authors": ["Lorenzo Lazzarino", "Katherine J. Pearce", "Nathaniel Pritchard"], "title": "Efficient error estimators for Generalized Nyström", "comment": null, "summary": "Randomized algorithms in numerical linear algebra have proven to be effective in ameliorating issues of scalability when working with large matrices, efficiently producing accurate low-rank approximations. A key remaining challenge, however, is to efficiently assess the approximation accuracy of randomized methods without additional expensive matrix accesses. Recent work has addressed this issue by deriving fast leave-one-out error estimators for the randomized SVD and Nyström decomposition, enabling accurate error estimation with no additional matrix accesses. In this work, we extend the leave-one-out framework to the generalized Nyström decomposition, an approach that can be applied to general rectangular matrices. We do this by deriving three new leave-one-out error estimators and validating their effectiveness through numerical experiments."}
{"id": "2601.11439", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11439", "abs": "https://arxiv.org/abs/2601.11439", "authors": ["Johan Thunberg", "Galina Sidorenko"], "title": "Projection-based discrete-time consensus on the unit sphere", "comment": "14 pages including appendix, 0 figures", "summary": "We address discrete-time consensus on the Euclidean unit sphere. For this purpose we consider a distributed algorithm comprising the iterative projection of a conical combination of neighboring states. Neighborhoods are represented by a strongly connected directed graph, and the conical combinations are represented by a (non-negative) weight matrix with a zero structure corresponding to the graph. A first result mirrors earlier results for gradient flows. Under the assumptions that each diagonal element of the weight matrix is more than $\\sqrt{2}$ larger than the sum of the other elements in the corresponding row, the sphere dimension is greater or equal to 2, and the graph, as well as the weight matrix, is symmetric, we show that the algorithm comprises gradient ascent, stable fixed points are consensus points, and the set of initial points for which the algorithm converges to a non-consensus fixed point has measure zero. The second result is that for the unit circle and a strongly connected graph or for any unit sphere with dimension greater than or equal to $1$ and the complete graph, only for a measure zero set of weight matrices there are fixed points for the algorithm which do not have consensus or antipodal configurations."}
{"id": "2601.10950", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.10950", "abs": "https://arxiv.org/abs/2601.10950", "authors": ["Kiyuob Jung"], "title": "Specular differentiation in normed vector spaces and its application to nonsmooth convex optimization", "comment": null, "summary": "This paper introduces specular differentiation, which generalizes Gâteaux and Fréchet differentiation in normed vector spaces. Fundamental theoretical properties of specular differentiation are investigated, including the Quasi-Mean Value Theorem and Quasi-Fermat's Theorem. As an application, three numerical methods using specular differentiation are devised to optimize nonsmooth convex functions in higher-dimensional Euclidean spaces. Numerical experiments demonstrate that the proposed methods are capable of minimizing non-differentiable functions that classical methods fail to minimize."}
{"id": "2601.11462", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.11462", "abs": "https://arxiv.org/abs/2601.11462", "authors": ["Anik Kumar Paul", "Karthik Shenoy", "Arun D. Mahindrakar"], "title": "Stochastic Recursive Inclusions under Biased Perturbations: An Input-to-State Stability Perspective", "comment": null, "summary": "This paper investigates the asymptotic behavior of stochastic recursive inclusions in the presence of non-zero, non-diminishing bias, a setting that frequently arises in zeroth-order optimization, stochastic approximation with iterate-dependent noise, and distributed learning with adversarial agents. The analysis is conducted through the lens of input-to-state stability of an associated differential inclusion, which serves as the continuous-time limit of the discrete recursion. We first establish that if the limiting differential inclusion is input-to-state stable and the iterates remain almost surely bounded, then the iterates converge almost surely to the neighborhood of desired equilibrium. We then provide a verifiable sufficient condition for almost sure boundedness by assuming that the underlying operator is single-valued and globally Lipschitz. Finally, we show that several zeroth-order variants of stochastic gradient naturally fit within this framework, and we demonstrate their input-to-state stability under standard conditions. Overall, the results provide a unified theoretical foundation for studying almost sure convergence of biased stochastic approximation schemes through the Input to State stability theory of differential inclusions."}
{"id": "2601.11467", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.11467", "abs": "https://arxiv.org/abs/2601.11467", "authors": ["Eduardo Queiroga", "Rafael Martinelli", "Anand Subramanian", "Eduardo Uchoa", "Thibaut Vidal"], "title": "The XL Instances for the Capacitated Vehicle Routing Problem", "comment": "18 pages, 4 figures", "summary": "This paper introduces a new set of large-scale benchmark instances for the Capacitated Vehicle Routing Problem (CVRP). The proposed XL set extends existing benchmarks by covering instances with 1,000 to 10,000 customers and a wide range of structural characteristics, following established generation principles from prior CVRP studies. A computational study involving several state-of-the-art algorithms is conducted to provide initial best known solutions (BKSs) for the XL instances, which serve as a baseline for a community-driven BKS challenge launched on the CVRPLib website. The instances are made publicly available to support experimental evaluation and comparison of solution methods. Furthermore, additional computational analyses are reported to compare algorithmic performance on other existing CVRP benchmark instances."}
{"id": "2601.11473", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11473", "abs": "https://arxiv.org/abs/2601.11473", "authors": ["Ahmed Attia"], "title": "A Probabilistic Approach to Trajectory-Based Optimal Experimental Design", "comment": "42 Figures, this version includes supplementary material as appendices", "summary": "We present a novel probabilistic approach for optimal path experimental design. In this approach a discrete path optimization problem is defined on a static navigation mesh, and trajectories are modeled as random variables governed by a parametric Markov policy. The discrete path optimization problem is then replaced with an equivalent stochastic optimization problem over the policy parameters, resulting in an optimal probability model that samples estimates of the optimal discrete path. This approach enables exploration of the utility function's distribution tail and treats the utility function of the design as a black box, making it applicable to linear and nonlinear inverse problems and beyond experimental design. Numerical verification and analysis are carried out by using a parameter identification problem widely used in model-based optimal experimental design."}
{"id": "2601.11445", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.11445", "abs": "https://arxiv.org/abs/2601.11445", "authors": ["Juan Guillermo Garrido", "Nabil Kazi-Tani", "Emilio Vilches"], "title": "Stochastic Perturbation of Sweeping Process for Uniformly Prox-Regular Moving Sets", "comment": null, "summary": "In this paper, we study the existence of solutions to a sweeping process in the presence of stochastic perturbations, where the moving set takes uniformly prox-regular values and varies continuously with respect to the Hausdorff distance, without smoothness assumptions. We consider several geometric assumptions and establish important relationships between them."}
