{"id": "2602.11307", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.11307", "abs": "https://arxiv.org/abs/2602.11307", "authors": ["M. D. Ruiz-Medina"], "title": "Noncentral limit results for spatiotemporal random fields on manifolds and beyond", "comment": null, "summary": "This paper derives noncentral limit results (NCLTs) for suitable scaling of functionals of spatially homogeneous and isotropic, and stationary in time, LRD Gaussian subordinated Spatiotemporal Random Fields (STRFs) with Hermite rank equal to two. The cases of connected and compact two point homogeneous spaces M_{d} in R^{d+1}, and compact convex sets K in R^{d+1},$ whose interior has positive Lebesgue measure, are analyzed. These NCLTs are obtained in the second Wiener Chaos by applying reduction theorems. The methodological approaches adopted in the derivation of these results are based on the pure point and continuous spectra of the Gaussian STRFs subordinators defined on M_{d} and K, respectively."}
{"id": "2602.11856", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.11856", "abs": "https://arxiv.org/abs/2602.11856", "authors": ["Ujué Etayo", "Pablo G. Arce"], "title": "Random points on $\\mathbb{S}^3$ with small logarithmic energy", "comment": "31 pages, 2 figures", "summary": "We analyse several constructions of random point sets on the sphere $\\mathbb{S}^{3}\\subset\\mathbb{R}^4$ evaluating and comparing them through their discrete logarithmic energy: \\begin{equation*}\n  E_0(ω_N) =\n  \\sum_{\\substack{i, j=1\\\\ i \\neq j}}^{N}\n  \\log\\frac{1}{\\|x_i - x_j\\|},\n  \\; \\text{ where}\\; ω_N=\\{x_1,\\ldots,x_N\\} \\subset \\mathbb{S}^3. \\end{equation*} Using the Hopf fibration, we lift a range of well-distributed families of points from the $2$-dimensional sphere - including uniformly random points, antipodally symmetric sets, determinantal point processes, and the Diamond ensemble - to $\\mathbb{S}^{3}$, in order to assess their energy performance. In particular, we carry out this asymptotic analysis for the Spherical ensemble (a well known determinantal point process on $\\mathbb{S}^2$), obtaining as a result a family of points on the $3$-dimensional sphere whose logarithmic energy is asymptotically the lowest achieved to date. This, in turn, provides a new upper bound for the minimal logarithmic energy on $\\mathbb{S}^3$. Although an analytic treatment of the lifted Diamond ensemble remains elusive, extensive simulations presented here show that its empirical energies lie below all other deterministic and non-deterministic constructions considered. Together, these results sharpen the quantitative link between potential-theoretic optima on $\\mathbb{S}^{2}$ and $\\mathbb{S}^{3}$ and provide both theoretical and numerical benchmarks for future work."}
{"id": "2602.11859", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.11859", "abs": "https://arxiv.org/abs/2602.11859", "authors": ["James Tian"], "title": "Tree Capacity and Splitting Isometries for Subinvariant Kernels", "comment": null, "summary": "Starting from a subinvariant positive definite kernel under a branching pullback, we attach to the resulting kernel tower a canonical electrical network on the word tree whose edge weights are the diagonal increments. This converts diagonal growth into effective resistance and capacity, giving explicit criteria and quantitative bounds, together with a matching upper bound under a mild level regularity condition. When the diagonal tower has finite limit at a point, we prove convergence of the full kernels and obtain an invariant completion with a minimality property. We also describe the associated RKHS splitting and a boundary martingale construction leading to weighted invariant majorants."}
{"id": "2602.11747", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.11747", "abs": "https://arxiv.org/abs/2602.11747", "authors": ["Paul Liautaud", "Pierre Gaillard", "Olivier Wintenberger"], "title": "High-Probability Minimax Adaptive Estimation in Besov Spaces via Online-to-Batch", "comment": null, "summary": "We study nonparametric regression over Besov spaces from noisy observations under sub-exponential noise, aiming to achieve minimax-optimal guarantees on the integrated squared error that hold with high probability and adapt to the unknown noise level. To this end, we propose a wavelet-based online learning algorithm that dynamically adjusts to the observed gradient noise by adaptively clipping it at an appropriate level, eliminating the need to tune parameters such as the noise variance or gradient bounds. As a by-product of our analysis, we derive high-probability adaptive regret bounds that scale with the $\\ell_1$-norm of the competitor. Finally, in the batch statistical setting, we obtain adaptive and minimax-optimal estimation rates for Besov spaces via a refined online-to-batch conversion. This approach carefully exploits the structure of the squared loss in combination with self-normalized concentration inequalities."}
{"id": "2602.11449", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11449", "abs": "https://arxiv.org/abs/2602.11449", "authors": ["Jörn Zimmerling", "Vladimir Druskin"], "title": "Adapting the Lanczos algorithm to matrices with almost continuous spectra", "comment": "Submitted to Research in Mathematical Sciences", "summary": "We consider the approximation of $B^T (A+sI)^{-1} B$ where $A\\in\\mathbb{R}^{n\\times n}$ is large, symmetric positive definite, and has a dense spectrum, and $B\\in\\mathbb{R}^{n\\times p}$, $p\\ll n$. Our target application is the computation of Multiple-Input Multiple-Output transfer functions arising from large-scale discretizations of problems with continuous spectral measures, such as linear time-invariant PDEs on unbounded domains. Traditional Krylov methods, such as Lanczos or conjugate gradients, focus on resolving individual eigenvalues of a dense discretization, while ignoring the underlying continuous spectral measure that these points approximate. We argue that it is more efficient to model the inherent branch cut of the original operator than to exhaustively resolve the artificial point spectrum induced by discretization. We place this problem in a framework, known in the physics literature as the square-root terminator. To overcome its limitations, we formulate a quadratic terminator using Kreĭn--Nudelman semi-infinite strings, with parameters chosen adaptively to maximize relative energy outflow.\n  This approach results in a low-rank modification to the (block) Lanczos matrix, dependent on $\\sqrt{s}$, with an additional $O(n)$ cost. We demonstrate significant error reductions for large-scale self-adjoint PDE discretizations in unbounded domains, including two- and three-dimensional Maxwell's equations in diffusive regimes. The method proves particularly advantageous in computing state-space solutions for wave propagation, specifically for 2D wave and 3D Maxwell's operators. Implicitly replacing the conventional Lanczos spectral decomposition with a representation in terms of the continuous Kreĭn--Nudelman spectrum, we obtain a qualitative improvement in finite-difference approximations, effectively transforming standing-wave artifacts into outgoing propagating waves."}
{"id": "2602.11289", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11289", "abs": "https://arxiv.org/abs/2602.11289", "authors": ["Antonio Candelieri", "Francesco Archetti"], "title": "Wasserstein-enabled characterization of designs and myopic decisions in Bayesian Optimization", "comment": null, "summary": "Impractical assumptions, an inherently myopic nature, and the crucial role of the initial design, all together contribute to making theoretical convergence proofs of little value in real-life Bayesian Optimization applications. In this paper, we propose a novel characterization of the design depending on its distributional properties, separately measured with respect to the coverage of the search space and the concentration around the best observed function value. These measures are based on the Wasserstein distance and enable a model-free evaluation of the information value of the design before deciding the next query. Then, embracing the myopic nature of Bayesian Optimization, we take an empirical approach to analyze the relation between the proposed characterization of the design and the quality of the next query. Ultimately, we provide important and useful insights that might inspire the definition of a new generation of acquisition functions in Bayesian Optimization."}
{"id": "2602.11490", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11490", "abs": "https://arxiv.org/abs/2602.11490", "authors": ["Yure Rocha", "Teobaldo Bulhões", "Anand Subramanian", "Joaquim Dias Garcia"], "title": "An Efficient Hybrid Heuristic for the Transmission Expansion Planning under Uncertainties", "comment": null, "summary": "We address the stochastic transmission expansion planning (STEP) problem considering uncertainties in renewable generation capacity and demand. STEP's objective is to minimize the total investment cost of new transmission lines and generation cost. To tackle the computational challenges of large-scale systems, we propose a heuristic approach that combines the progressive hedging (PH) algorithm for scenario-wise decomposition with an integrated framework for solving the resulting subproblems. The latter combines a destroy-and-repair operator, a beam search procedure, and a mixed-integer programming approach. The proposed framework is evaluated on large-scale systems from the literature, containing up to 10000 nodes, adapted to multiple scenarios based on parameters from the California test system (CATS). Compared with a non-trivial baseline algorithm that includes the integrated MIP and heuristics, the proposed PH-based framework consistently improved solution quality for the six systems considered (including CATS), achieving an average optimality gap reduction of 16.23% within a 2-hour time limit."}
