{"id": "2601.02489", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02489", "abs": "https://arxiv.org/abs/2601.02489", "authors": ["Gennadiy Feldman"], "title": "An Analogue of Heyde's Theorem for Discrete Torsion Abelian Groups with Cyclic $p$-Components", "comment": "18 pages", "summary": "According to the well-known Heyde theorem, the Gaussian distribution on the real line is characterized by the symmetry of the conditional distribution of one linear form of $n$ independent random variables given another. In the article, we prove an analogue of this theorem for two independent random variables taking values in a discrete torsion Abelian group $X$ with cyclic $p$-components. In doing so, we do not impose any restrictions on coefficients of the linear forms and the characteristic functions of random variables. The proof uses methods of abstract harmonic analysis and is based on the solution some functional equation on the character group of the group $X$."}
{"id": "2601.02501", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02501", "abs": "https://arxiv.org/abs/2601.02501", "authors": ["Sayan Banerjee", "Amarjit Budhiraja", "Dilshad Imon"], "title": "Long Time Asymptotics for the Stochastic Follow-the-Leader System", "comment": "40 pages", "summary": "We introduce and analyze a class of interacting particle systems on the real line that combine features of the stochastic rat race and (deterministic) follow-the-leader models. The particle system evolves as a continuous-time pure jump process: the leading particle moves independently, at Exponential jump times, with constant jump rate and iid jump sizes distributed according to a law $θ$, while each of the remaining particles jumps forward, at Exponential times, at rate equal to its distance from the particle immediately ahead, with jump sizes drawn uniformly from the corresponding gap. The dynamics thus encode competition for leadership together with distance-dependent stochastic interactions. Our main focus is the associated gap process, representing the vector of inter-particle distances. We establish the existence of a unique stationary distribution for the gap process and prove uniform geometric ergodicity. Further, when the leader's jump sizes follow an Exponential distribution, we identify the stationary law explicitly as a product of independent Exponential laws, and show that the associated mixing time scales between $Θ(n)$ and $O(n(\\log n)^2)$ for an $n$-particle system. As an application of the mixing time results we establish a functional limit theorem that characterizes fluctuations of particle states at large time, under a suitable spatial and temporal scaling and large particle limit. Finally, when the leader's jumps have heavy but integrable tails, we show that each gap has at least one additional finite moment under stationarity than that of the leader's jump size distribution. The model offers a tractable setting for exploring ergodicity, explicit invariant laws, and mixing behavior in non-diffusive particle systems."}
{"id": "2601.02558", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02558", "abs": "https://arxiv.org/abs/2601.02558", "authors": ["Foad Shokrollahi", "Saeed Vahdati"], "title": "Lamperti scaling for fractional Gaussian processes with non-stationary increments", "comment": null, "summary": "The Lamperti transform offers a powerful bridge between self-similar processes and stationary dynamics, making it especially useful for analyzing anomalous diffusion models that lack stationary increments. In this paper we examine the Lamperti transforms of scaled sub-fractional and bi-fractional Brownian motions, deriving explicit covariance formulas, asymptotic behaviour, and precise exponential mixing rates. We also introduce Langevin type integral processes driven by these Gaussian fields, identify their self-similarity exponents, and show that their Lamperti images again form stationary Gaussian processes with rapid decorrelation. Through inverse Lamperti relations and Birkhoff's theorem, we establish rigorous single trajectory reconstruction of ensemble quantities for the original non-stationary processes. The results extend the scope of the scaled Lamperti framework to Gaussian processes with non-stationary increments and richer dependence structures."}
{"id": "2601.02622", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02622", "abs": "https://arxiv.org/abs/2601.02622", "authors": ["Chunhao Cai"], "title": "Local Asymptotic Normality for Mixed Fractional Brownian Motion with $H>3/4$ Under High-Frequency Observation", "comment": null, "summary": "In this paper we will consider the LAN property for both the Hurst parameter $H>3/4$ and the variance of the fractional Brownian motion plus an independent standard Brownian motion (called mixed fractional Brownian motion) with high-frequency observation. We will first remove the $H$-score linear term and orthogonalize the remainder through two non-diagonal transformations, then we can construct the CLT for the quadratic form base on $\\| \\cdot \\|_{\\mathrm{op}}/\\|\\cdot\\|_F\\to0$. At last we obtain a diagonal Gaussian LAN expansion with an explicit information matrix."}
{"id": "2601.02811", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.02811", "abs": "https://arxiv.org/abs/2601.02811", "authors": ["Marios Papamichalis", "Regina Ruane", "Simon Lunagomez", "Swati Chandna"], "title": "Decision-Theoretic Robustness for Network Models", "comment": "This is the first version of the paper", "summary": "Bayesian network models (Erdos Renyi, stochastic block models, random dot product graphs, graphons) are widely used in neuroscience, epidemiology, and the social sciences, yet real networks are sparse, heterogeneous, and exhibit higher-order dependence. How stable are network-based decisions, model selection, and policy recommendations to small model misspecification? We study local decision-theoretic robustness by allowing the posterior to vary within a small Kullback-Leibler neighborhood and choosing actions that minimize worst-case posterior expected loss. Exploiting low-dimensional functionals available under exchangeability, we (i) adapt decision-theoretic robustness to exchangeable graphs via graphon limits and derive sharp small-radius expansions of robust posterior risk; under squared loss the leading inflation is controlled by the posterior variance of the loss, and for robustness indices that diverge at percolation/fragmentation thresholds we obtain a universal critical exponent describing the explosion of decision uncertainty near criticality. (ii) Develop a nonparametric minimax theory for robust model selection between sparse Erdos-Renyi and block models, showing-via robustness error exponents-that no Bayesian or frequentist method can uniformly improve upon the decision-theoretic limits over configuration models and sparse graphon classes for percolation-type functionals. (iii) Propose a practical algorithm based on entropic tilting of posterior or variational samples, and demonstrate it on functional brain connectivity and Karnataka village social networks."}
{"id": "2601.02492", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.02492", "abs": "https://arxiv.org/abs/2601.02492", "authors": ["M. M. Hammad"], "title": "Variational (Energy-Based) Spectral Learning: A Machine Learning Framework for Solving Partial Differential Equations", "comment": null, "summary": "We introduce variational spectral learning (VSL), a machine learning framework for solving partial differential equations (PDEs) that operates directly in the coefficient space of spectral expansions. VSL offers a principled bridge between variational PDE theory, spectral discretization, and contemporary machine learning practice. The core idea is to recast a given PDE \\[ \\mathcal{L}u = f \\quad \\text{in} \\quad Q=Ω\\times(0,T), \\] together with boundary and initial conditions, into differentiable space-time energies built from strong-form least-squares residuals and weak (Galerkin) formulations. The solution is represented as a finite spectral expansion \\[ u_N(x,t)=\\sum_{n=1}^{N} c_n\\,φ_n(x,t), \\] where $φ_n$ are tensor-product Chebyshev bases in space and time, with Dirichlet-satisfying spatial modes enforcing homogeneous boundary conditions analytically. This yields a compact linear parameterization in the coefficient vector $\\mathbf{c}$, while all PDE complexity is absorbed into the variational energy. We show how to construct strong-form and weak-form space-time functionals, augment them with initial-condition and Tikhonov regularization terms, and minimize the resulting objective with gradient-based optimization. In practice, VSL is implemented in TensorFlow using automatic differentiation and Keras cosine-decay-with-restarts learning-rate schedules, enabling robust optimization of moderately sized coefficient vectors. Numerical experiments on benchmark elliptic and parabolic problems, including one- and two-dimensional Poisson, diffusion, and Burgers-type equations, demonstrate that VSL attains accuracy comparable to classical spectral collocation with Crank-Nicolson time stepping, while providing a differentiable objective suitable for modern optimization tooling."}
{"id": "2601.02429", "categories": ["math.OC", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.02429", "abs": "https://arxiv.org/abs/2601.02429", "authors": ["Parham Oveissi", "Gohar T. Khokhar", "Kyle Hanquist", "Ankit Goel"], "title": "Thrust Regulation in a Solid Fuel Ramjet using Dynamic Mode Adaptive Control", "comment": "arXiv admin note: substantial text overlap with arXiv:2601.01683", "summary": "This paper presents the application of a novel data-driven adaptive control technique, called dynamic mode adaptive control (DMAC), for regulating thrust in a solid fuel ramjet (SFRJ). A high-fidelity computational model incorporating compressible flow theory and equilibrium chemistry is used to simulate the combustion dynamics. An adaptive tracking controller is designed using the DMAC framework, which leverages dynamic mode decomposition to approximate the local system behavior, followed by a tracking controller synthesized around the identified model. Simulation results demonstrate that DMAC provides an effective and reliable approach for thrust regulation in SFRJs. In addition, a systematic hyperparameter sensitivity study is conducted by varying the tuning parameters over several orders of magnitude. The resulting responses show that the closed-loop performance and tracking error remain stable across wide parameter variations, indicating that DMAC exhibits strong robustness to hyper parameter tuning."}
{"id": "2601.02705", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02705", "abs": "https://arxiv.org/abs/2601.02705", "authors": ["Masahiro Kobayashi", "Masakiyo Miyazawa", "Yutaka Sakuma"], "title": "Diffusion limit for the stationary distribution of a history-dependent two-level M/M/1 queue", "comment": null, "summary": "Recently, Atar and Miyazawa [2] introduced a multi-level GI/G/1 queue with a finite number of levels, where both the arrival and service rates depend on the level corresponding to the current queue length. For this model, they proved that the diffusion limit of its queue length process in heavy traffic is the level-dependent reflected Brownian motion of [6]. In a subsequent study, Kobayashi et al. [4] derived the corresponding diffusion limit of the stationary distribution. These studies are motivated by the control of service capacity depending on the queue length. We are interested in the more general case where this control may also depend on the history of the queue length. As the first step toward such a generalization, we specialize the multi-level GI/G/1 queue to a two-level M/M/1 queue. We then extend the dynamics of this model so that its arrival and service rates depend not only on the current queue length but also on the recent history of queue lengths. Under the stability condition for this model, we first compute its stationary distribution in closed form, then derive its diffusion limit in heavy traffic. Finally, using this diffusion limit, we derive approximation formulas for the stationary distribution and then numerically assess their accuracy."}
{"id": "2601.02828", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.02828", "abs": "https://arxiv.org/abs/2601.02828", "authors": ["Marios Papamichalis", "Regina Ruane"], "title": "Collapsed Structured Block Models for Community Detection in Complex Networks", "comment": "This is the first version of the paper", "summary": "Community detection seeks to recover mesoscopic structure from network data that may be binary, count-valued, signed, directed, weighted, or multilayer. The stochastic block model (SBM) explains such structure by positing a latent partition of nodes and block-specific edge distributions. In Bayesian SBMs, standard MCMC alternates between updating the partition and sampling block parameters, which can hinder mixing and complicate principled comparison across different partitions and numbers of communities. We develop a collapsed Bayesian SBM framework in which block-specific nuisance parameters are analytically integrated out under conjugate priors, so the marginal likelihood p(Y|z) depends only on the partition z and blockwise sufficient statistics. This yields fast local Gibbs/Metropolis updates based on ratios of closed-form integrated likelihoods and provides evidence-based complexity control that discourages gratuitous over-partitioning. We derive exact collapsed marginals for the most common SBM edge types-Beta-Bernoulli (binary), Gamma-Poisson (counts), and Normal-Inverse-Gamma (Gaussian weights)-and we extend collapsing to gap-constrained SBMs via truncated conjugate priors that enforce explicit upper bounds on between-community connectivity. We further show that the same collapsed strategy supports directed SBMs that model reciprocity through dyad states, signed SBMs via categorical block models, and multiplex SBMs where multiple layers contribute additive evidence for a shared partition. Across synthetic benchmarks and real networks (including email communication, hospital contact counts, and citation graphs), collapsed inference produces accurate partitions and interpretable posterior block summaries of within- and between-community interaction strengths while remaining computationally simple and modular."}
{"id": "2601.02513", "categories": ["math.NA", "physics.ao-ph"], "pdf": "https://arxiv.org/pdf/2601.02513", "abs": "https://arxiv.org/abs/2601.02513", "authors": ["Kenneth Duru", "Chuqiao Xu"], "title": "On well-posed energy/entropy stable boundary conditions for the rotating shallow water equations", "comment": null, "summary": "We derive and analyze well-posed, energy- and entropy-stable boundary conditions (BCs) for the two-dimensional linear and nonlinear rotating shallow water equations (RSWE) in vector invariant form. The focus of the study is on subcritical flows, which are commonly observed in atmospheric, oceanic, and geostrophic flow applications. We consider spatial domains with smooth boundaries and formulate both linear and nonlinear BCs using mass flux, Riemann's invariants, and Bernoulli's potential, ensuring that the resulting initial boundary value problem (IBVP) is provably entropy- and energy-stable. The linear analysis is comprehensive, providing sufficient conditions to establish the existence, uniqueness, and energy stability of solutions to the linear IBVP. For the nonlinear IBVP, which admits more general solutions, our goal is to develop nonlinear BCs that guarantee entropy stability. We introduce the concepts of linear consistency and linear stability for nonlinear IBVPs, demonstrating that if a nonlinear IBVP is both linearly consistent and linearly stable, then, for sufficiently regular initial and boundary data over a finite time interval, a unique smooth solution exists. Both the linear and nonlinear IBVPs can be efficiently solved using high-order accurate numerical methods. By employing high-order summation-by-parts operators to discretize spatial derivatives and implementing weak enforcement of BCs via penalty techniques, we develop provably energy- and entropy-stable numerical schemes on curvilinear meshes. Extensive numerical experiments are presented to verify the accuracy of the methods and to demonstrate the robustness of the proposed BCs and numerical schemes."}
{"id": "2601.02523", "categories": ["math.OC", "cs.DC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.02523", "abs": "https://arxiv.org/abs/2601.02523", "authors": ["Artavazd Maranjyan"], "title": "First Provably Optimal Asynchronous SGD for Homogeneous and Heterogeneous Data", "comment": "PhD thesis", "summary": "Artificial intelligence has advanced rapidly through large neural networks trained on massive datasets using thousands of GPUs or TPUs. Such training can occupy entire data centers for weeks and requires enormous computational and energy resources. Yet the optimization algorithms behind these runs have not kept pace. Most large scale training still relies on synchronous methods, where workers must wait for the slowest device, wasting compute and amplifying the effects of hardware and network variability. Removing synchronization seems like a simple fix, but asynchrony introduces staleness, meaning updates computed on outdated models. This makes analysis difficult, especially when delays arise from system level randomness rather than algorithmic choices. As a result, the time complexity of asynchronous methods remains poorly understood. This dissertation develops a rigorous framework for asynchronous first order stochastic optimization, focusing on the core challenge of heterogeneous worker speeds. Within this framework, we show that with proper design, asynchronous SGD can achieve optimal time complexity, matching guarantees previously known only for synchronous methods. Our first contribution, Ringmaster ASGD, attains optimal time complexity in the homogeneous data setting by selectively discarding stale updates. The second, Ringleader ASGD, extends optimality to heterogeneous data, common in federated learning, using a structured gradient table mechanism. Finally, ATA improves resource efficiency by learning worker compute time distributions and allocating tasks adaptively, achieving near optimal wall clock time with less computation. Together, these results establish asynchronous optimization as a theoretically sound and practically efficient foundation for distributed learning, showing that coordination without synchronization can be both feasible and optimal."}
{"id": "2601.02725", "categories": ["math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.02725", "abs": "https://arxiv.org/abs/2601.02725", "authors": ["Xiaoyu Wang", "Yingli Wang", "Lingjiong Zhu"], "title": "Sampling non-log-concave densities via Hessian-free high-resolution dynamics", "comment": "85 pages, 4 figures", "summary": "We study the problem of sampling from a target distribution $π(q)\\propto e^{-U(q)}$ on $\\mathbb{R}^d$, where $U$ can be non-convex, via the Hessian-free high-resolution (HFHR) dynamics, which is a second-order Langevin-type process that has $e^{-U(q)-\\frac12|p|^2}$ as its unique invariant distribution, and it reduces to kinetic Langevin dynamics (KLD) as the resolution parameter $α\\to0$. The existing theory for HFHR dynamics in the literature is restricted to strongly-convex $U$, although numerical experiments are promising for non-convex settings as well. We focus on studying the convergence of HFHR dynamics when $U$ can be non-convex, which bridges a gap between theory and practice. Under a standard assumption of dissipativity and smoothness on $U$, we adopt the reflection/synchronous coupling method. This yields a Lyapunov-weighted Wasserstein distance in which the HFHR semigroup is exponentially contractive for all sufficiently small $α>0$ whenever KLD is. We further show that, under an additional assumption that asymptotically $\\nabla U$ has linear growth at infinity, the contraction rate for HFHR dynamics is strictly better than that of KLD, with an explicit gain. As a case study, we verify the assumptions and the resulting acceleration for three examples: a multi-well potential, Bayesian linear regression with $L^p$ regularizer and Bayesian binary classification. We conduct numerical experiments based on these examples, as well as an additional example of Bayesian logistic regression with real data processed by the neural networks, which illustrates the efficiency of the algorithms based on HFHR dynamics and verifies the acceleration and superior performance compared to KLD."}
{"id": "2601.02832", "categories": ["math.PR", "math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.02832", "abs": "https://arxiv.org/abs/2601.02832", "authors": ["Yueqi Cao"], "title": "Varadhan Functions, Variances, and Means on Compact Riemannian Manifolds", "comment": null, "summary": "Motivated by Varadhan's theorem, we introduce Varadhan functions, variances, and means on compact Riemannian manifolds as smooth approximations to their Fréchet counterparts. Given independent and identically distributed samples, we prove uniform laws of large numbers for their empirical versions. Furthermore, we prove central limit theorems for Varadhan functions and variances for each fixed $t\\ge0$, and for Varadhan means for each fixed $t>0$. By studying small time asymptotics of gradients and Hessians of Varadhan functions, we build a strong connection to the central limit theorem for Fréchet means, without assumptions on the geometry of the cut locus."}
{"id": "2601.02540", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.02540", "abs": "https://arxiv.org/abs/2601.02540", "authors": ["Collin Wittenstein", "Vincent Marks", "Mario Ricchiuto", "Hendrik Ranocha"], "title": "GPU-Accelerated Energy-Conserving Methods for the Hyperbolized Serre-Green-Naghdi Equations in 2D", "comment": "33 pages, 16 figures. Collin Wittenstein and Vincent Marks contributed equally to this work", "summary": "We develop energy-conserving numerical methods for a two-dimensional hyperbolic approximation of the Serre-Green-Naghdi equations with variable bathymetry for both periodic and reflecting boundary conditions. The hyperbolic formulation avoids the costly inversion of an elliptic operator present in the classical model. Our schemes combine split forms with summation-by-parts (SBP) operators to construct semidiscretizations that conserve the total water mass and the total energy. We provide analytical proofs of these conservation properties and also verify them numerically. While the framework is general, our implementation focuses on second-order finite-difference SBP operators. The methods are implemented in Julia for CPU and GPU architectures (AMD and NVIDIA) and achieve substantial speedups on modern accelerators. We validate the approach through convergence studies based on solitary-wave and manufactured-solution tests, and by comparisons to analytical, experimental, and existing numerical results. All source code to reproduce our results is available online."}
{"id": "2601.02607", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.02607", "abs": "https://arxiv.org/abs/2601.02607", "authors": ["Elisio Juvenal Muchave", "Pedro Henrique Silva Coutinho", "Tiago Roux Oliveira", "Miroslav Krstić"], "title": "Extremum Seeking Control for Wave-PDE Actuation with Distributed Effects", "comment": "10 pages, 4 figures", "summary": "This paper deals with the gradient-based extremum seeking control (ESC) with actuation dynamics governed by distributed wave partial differential equations (PDEs). To achieve the control objective of real-time optimization for this class of infinite-dimensional systems, we first solve the trajectory generation problem to re-design the additive perturbation signal of the ESC system. Then, we develop a boundary control law through the backstepping method to compensate for the wave PDE with distributed effects, which ensures the exponential stability of the average closed-loop system by means of a Lyapunov-based analysis. At last, by employing the averaging theory for infinite-dimensional systems, we prove that the closed-loop trajectories converge to a small neighborhood surrounding the optimal point. Numerical simulations are presented to illustrate the effectiveness of the proposed method."}
{"id": "2601.02809", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02809", "abs": "https://arxiv.org/abs/2601.02809", "authors": ["Wolfgang Woess"], "title": "Diffusion on homogeneous ultrametric spaces: the contributions of Alessandro Figà-Talamanca", "comment": null, "summary": "Alessandro Figà-Talamanca (1938-2023) was an influential Italian mathematician, scientific leader of the Italian group of harmonic analysis for many years. Since the late 1970ies, his interest focussed on harmonic analysis on free groups and trees. In the later years of his scientific work he became also interested in diffusion processes on homogeneous ultrametric spaces such as local fields and totally disconnected Abelian groups. This is related with the close connection of those spaces with trees and their boundaries and concerns, in particular, the construction of such processes via discrete-time walks on trees. The present notes provide rather detailed comments on this part of his work and the related, quite abundant literature. This is intended to become part of a volume of selected papers by Figà-Talamanca, accompanied by comments such as the present text."}
{"id": "2601.02561", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.02561", "abs": "https://arxiv.org/abs/2601.02561", "authors": ["Guosheng Fu", "Chun Liu"], "title": "A Schrödinger-Based Dispersive Regularization Approach for Numerical Simulation of One-Dimensional Shallow Water Equations", "comment": "15 pages", "summary": "We propose a novel dispersive regularization framework for the numerical simulation of the one-dimensional shallow water equations (SWE). The classical hyperbolic system is regularized by a third-order dispersive term in the momentum equation, which renders the system equivalent, via the Madelung transform, to a defocusing cubic nonlinear Schrödinger equation with a drift term induced by bottom topography.\n  Instead of solving the shallow water equations directly, we solve the associated Schrödinger equation and recover the hydrodynamic variables through a simple postprocessing procedure. This approach transforms the original nonlinear hyperbolic system into a semilinear complex-valued equation, which can be efficiently approximated using a Strang time-splitting method combined with a spectral element discretization in space.\n  Numerical experiments demonstrate that, in subcritical regimes without shock formation, the Schrödinger regularization provides an $O(\\varepsilon)$ approximation to the classical shallow water solution, where $\\varepsilon$ denotes the regularization parameter. Importantly, we observe that this convergence behavior persists even in the presence of moving wetting--drying interfaces, where vacuum states emerge and standard shallow water solvers often encounter difficulties. These results suggest that the Schrödinger-based formulation offers a robust and promising alternative framework for the numerical simulation of shallow water flows with dry states."}
{"id": "2601.02690", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02690", "abs": "https://arxiv.org/abs/2601.02690", "authors": ["Ji Cheng", "Bin Zhu"], "title": "Revisiting a Fast Newton Solver for a 2-D Spectral Estimation Problem: Computations with the Full Hessian", "comment": null, "summary": "Spectral estimation plays a fundamental role in frequency-domain identification and related signal processing problems. This paper revisits a 2-D spectral estimation problem formulated in terms of convex optimization. More precisely, we work with the dual optimization problem and show that the full Hessian of the dual function admits a Toeplitz-block Toeplitz structure which is consistent with our finding in a previous work. This particular structure of the Hessian enables a fast inversion algorithm in the solution of the dual optimization problem via Newton's method whose superior speed of convergence is illustrated via simulations."}
{"id": "2601.02832", "categories": ["math.PR", "math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.02832", "abs": "https://arxiv.org/abs/2601.02832", "authors": ["Yueqi Cao"], "title": "Varadhan Functions, Variances, and Means on Compact Riemannian Manifolds", "comment": null, "summary": "Motivated by Varadhan's theorem, we introduce Varadhan functions, variances, and means on compact Riemannian manifolds as smooth approximations to their Fréchet counterparts. Given independent and identically distributed samples, we prove uniform laws of large numbers for their empirical versions. Furthermore, we prove central limit theorems for Varadhan functions and variances for each fixed $t\\ge0$, and for Varadhan means for each fixed $t>0$. By studying small time asymptotics of gradients and Hessians of Varadhan functions, we build a strong connection to the central limit theorem for Fréchet means, without assumptions on the geometry of the cut locus."}
{"id": "2601.02595", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.02595", "abs": "https://arxiv.org/abs/2601.02595", "authors": ["C. Lovadina", "L. Molinari"], "title": "Volumetric locking-free Mixed Virtual Element Methods for Contact Problems", "comment": null, "summary": "We consider the approximation of the 2D frictionless contact problem in elasticity using the Virtual Element Methods (VEMs). To overcome the volumetric locking phenomenon in the nearly incompressible case, we adopt a mixed displacement/pressure ($u/p$) variational formulation, where pressure is introduced as an independent unknown. We present the VEM discretization and develop a general error analysis, keeping explicit track of the constants involved in the error estimates, thus allowing to consider meshes with \"small edges\". As examples, we consider two possible VEM schemes: a first-order scheme and a second-order scheme. The numerical results confirm the theoretical predictions, specifically both schemes show: 1) robustness with respect to the volumetric parameter $λ$, thus preventing the occurrence of the volumetric locking phenomenon; 2) good behavior even in the presence of \"small edges\"; 3) achievement of the expected theoretical convergence rates."}
{"id": "2601.02748", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02748", "abs": "https://arxiv.org/abs/2601.02748", "authors": ["Haoyan Lin", "Jie Huang"], "title": "Data-Driven Output-Based Approach to the Output Regulation Problem of Unknown Linear Systems via Value Iteration", "comment": null, "summary": "The output regulation problem for unknown linear systems has been studied using state-based and output-based internal model approaches in the special case with no disturbances. This paper further investigates the output regulation problem for unknown linear systems using a data-driven output-based approach via value iteration. For this purpose, we first develop a novel output-feedback control law that does not explicitly rely on the observer gain to solve the output regulation problem. We then show that the data-driven approach for designing an output-feedback control law for the given plant can be reduced to the data-driven design of a state-feedback control law for a well-defined augmented auxiliary system. As a result, we develop a systematic data-driven approach to solve the output regulation problem for unknown linear systems via value iteration. Finally, we establish a relation between the data-driven state-feedback control law and the data-driven output-feedback control law in the LQR sense."}
{"id": "2601.02834", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.02834", "abs": "https://arxiv.org/abs/2601.02834", "authors": ["Guillaume Dubach", "Jana Reker"], "title": "Une brève histoire des perturbations non-hermitiennes de rang un", "comment": "20 pages, 6 figures, French text", "summary": "Les perturbations de faible rang de matrices aléatoires ont été au cœur de nombreux travaux ces vingt dernières années. En particulier, les cas non-hermitiens, moins représentés dans la littérature en règle générale, font ici l'objet d'une attention spéciale en raison de leurs applications à la physique et à l'étude des réseaux de neurones. Petit tour d'horizon.\n  --\n  A brief history of non-Hermitian perturbations of rank one:  Low-rank perturbations of random matrices have been the focus of active research over the past twenty years. We give an overview of different non-Hermitian models, which are generally less represented in the literature, as well as some of their applications in physics and the study of neural networks."}
{"id": "2601.02650", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.02650", "abs": "https://arxiv.org/abs/2601.02650", "authors": ["Qiang Du", "Baoming Shi", "Lei Zhang", "Xiangcheng Zheng"], "title": "A Derivative-Free Saddle-search Algorithm With Linear Convergence Rate", "comment": null, "summary": "We propose a derivative-free saddle-search algorithm designed to locate transition states using only function evaluations. The algorithm employs a nested architecture consisting of an inner eigenvector search and an outer saddle-point search. Through rigorous numerical analysis, we prove the almost sure convergence of the inner step under suitable assumptions. Furthermore, we establish the convergence of the outer search using a decaying step size, while demonstrating linear convergence under constant step size and boundedness conditions. Numerical experiments are provided to validate our theoretical results and demonstrate the algorithm's practical applicability."}
{"id": "2601.02796", "categories": ["math.OC", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.02796", "abs": "https://arxiv.org/abs/2601.02796", "authors": ["Kathrin Klamroth", "Michael Stiglmayr", "Julia Sudhoff Santos"], "title": "Adapting Polyhedral Dominance Cones to Ordinal Preference Structures", "comment": null, "summary": "In combinatorial optimization, ordinal costs can be used to model the quality of elements whenever numerical values are not available. When considering, for example, routing problems for cyclists, the safety of a street can be ranked in ordered categories like safe (separate bike lane), medium safe (street with a bike lane) and unsafe (street without a bike lane). However, ordinal optimization may suggest unrealistic solutions with huge detours to avoid unsafe street segments. In this paper, we investigate how partial preference information regarding the relative quality of the ordinal categories can be used to improve the relevance of the computed solutions. By introducing preference weights which describe how much better a category is at least or at most, compared to the subsequent category, we enlarge the ordinal dominance cone. This leads to a smaller set of alternatives, i. e., of ordinally efficient solutions. We show that the corresponding weighted ordinal ordering cone is a polyhedral cone and provide descriptions via its extreme rays and via its facets. The latter implies a linear transformation to an associated multi-objective optimization problem. This paves the way for the application of standard multi-objective solution approaches. We demonstrate the usefulness of the weighted ordinal ordering cone by investigating a safest path problem with different preference weights. Moreover, we investigate the interrelation between the weighted ordering cone to standard dominance concepts of multi-objective optimization, like, e.g., Pareto dominance, lexicographic dominance and weighted sum dominance."}
{"id": "2601.02929", "categories": ["math.PR", "math.MG"], "pdf": "https://arxiv.org/pdf/2601.02929", "abs": "https://arxiv.org/abs/2601.02929", "authors": ["Abdulamin Ismailov"], "title": "With what probability does an inscribed triangle contain a given point?", "comment": null, "summary": "Three points uniformly selected on the unit circle form a triangle containing a point $X$ at distance $r \\in [0; 1]$ from its center with probability $P(r) = \\frac{1}{4} - \\frac{3}{2 π^2}\\textrm{Li}_2(r^2)$, where $\\textrm{Li}_2$ is the dilogarithm function (Jeremy Tan Jie Rui, 2018). In this paper we present an alternative proof of this fact. We also discuss a couple of other geometric probability problems where the dilogarithm function arises."}
{"id": "2601.02847", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.02847", "abs": "https://arxiv.org/abs/2601.02847", "authors": ["Bangwei She", "Tian Tian", "Karel Tuma"], "title": "Stability and error estimates of a linear and partitioned finite element method approximating nonlinear fluid-structure interactions", "comment": null, "summary": "We propose and analyze a linear and partitioned finite element method for fluid-shell interactions under the arbitrary Lagrangian-Eulerian (ALE) framework. We adopt the P1-bubble/P1/P1 elements for the fluid velocity, pressure, and structure velocity, respectively. We show the stability and error estimates of the scheme without assuming infinitesimal structural deformation nor neglecting fluid convection effects. The theoretical convergence rate is further corroborated by numerical experiments."}
{"id": "2601.02797", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02797", "abs": "https://arxiv.org/abs/2601.02797", "authors": ["Jiyoung Choi", "Jiawang Nie", "Xindong Tang", "Suhan Zhong"], "title": "Log-Polynomial Optimization", "comment": "24 pages", "summary": "We study an optimization problem in which the objective is given as a sum of logarithmic-polynomial functions. This formulation is motivated by statistical estimation principles such as maximum likelihood estimation, and by loss functions including cross-entropy and Kullback-Leibler divergence. We propose a hierarchy of moment relaxations based on the truncated $K$-moment problems to solve log-polynomial optimization. We provide sufficient conditions for the hierarchy to be tight and introduce a numerical method to extract the global optimizers when the tightness is achieved. In addition, we modify relaxations with optimality conditions to better fit log-polynomial optimization with convenient Lagrange multipliers expressions. Various applications and numerical experiments are presented to show the efficiency of our method."}
{"id": "2601.02935", "categories": ["math.PR", "cond-mat.stat-mech"], "pdf": "https://arxiv.org/pdf/2601.02935", "abs": "https://arxiv.org/abs/2601.02935", "authors": ["Johel Beltrán", "Kyuhyeon Choi", "Claudio Landim"], "title": "Dimension-decaying diffusion processes as the scaling limit of condensing zero-range processes", "comment": null, "summary": "In this article, we prove that, on the diffusive time scale, condensing zero-range processes converge to a dimension-decaying diffusion process on the simplex \\[ Σ= \\{(x_1,\\dots,x_S) : x_i \\ge 0,\\; \\sum_{i\\in S} x_i = 1\\}, \\] where $S$ is a finite set. This limiting diffusion has the distinctive feature of being absorbed at the boundary of the simplex. More precisely, once the process reaches a face \\[ Σ_A = \\{(x_1,\\dots,x_S) : x_i \\ge 0,\\; \\sum_{i\\in A} x_i = 1\\}, \\qquad A \\subset S, \\] it remains confined to this set and evolves in the corresponding lower-dimensional simplex according to a new diffusion whose parameters depend on the subset $A$. This mechanism repeats itself, leading to successive reductions of the dimension, until one of the vertices of the simplex is reached in finite time. At that point, the process becomes permanently trapped.\n  The proof relies on a method to extend the domain of the associated martingale problem, which may be of independent interest and useful in other contexts."}
{"id": "2601.02975", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.02975", "abs": "https://arxiv.org/abs/2601.02975", "authors": ["Jiyu Liu", "Zhixuan Li", "Jiatu Yan", "Zhiqi Li", "Qinghai Zhang"], "title": "A Fourth-Order Cut-cell Multigrid Method for Generic Elliptic Equations on Arbitrary Domains", "comment": null, "summary": "To numerically solve a generic elliptic equation on two-dimensional domains with rectangular Cartesian grids, we propose a cut-cell geometric multigrid method that features (1) general algorithmic steps that apply to all forms of elliptic equations and all types of boundary conditions, (2) the versatility of handling both regular and irregular domains with arbitrarily complex topology and geometry, (3) the fourth-order accuracy even at the presence of ${\\cal C}^1$ discontinuities on the domain boundary, and (4) the optimal complexity of $O(h^{-2})$. Test results demonstrate the generality, accuracy, efficiency, robustness, and excellent conditioning of the proposed method."}
{"id": "2601.02899", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02899", "abs": "https://arxiv.org/abs/2601.02899", "authors": ["Hai Liu", "Tiande Guo", "Congying Han"], "title": "Relating Checkpoint Update Probabilities to Momentum Parameters in Single-Loop Variance Reduction Methods", "comment": null, "summary": "Variance reduction (VR) is a crucial tool for solving finite-sum optimization problems, including the composite general convex setting, which is the focus of this work. On the one hand, denoting the number of component functions as $n$ and the target accuracy as $ε$, some VR methods achieve the near-optimal complexity $\\widetilde{\\mathcal{O}}\\left(n+\\sqrt{n}/\\sqrtε\\right)$, but they all have nested structure and fail to provide convergence guarantee for the iterate sequence itself. On the other hand, single-loop VR methods, being free from the aforementioned disadvantages, have complexity no better than $\\mathcal{O}\\left(n+n/\\sqrtε\\right)$ which is the complexity of the deterministic method FISTA, thus leaving a critical gap unaddressed. In this work, we propose the \\textit{Harmonia} technique which relates checkpoint update probabilities to momentum parameters in single-loop VR methods. Based on this technique, we further propose to vary the growth rate of the momentum parameter, creating a novel continuous trade-off between acceleration and variance reduction, controlled by the key parameter $α\\in[0,1]$. The proposed techniques lead to following favourable consequences. First, several known complexity of quite different algorithms are re-discovered under the proposed unifying algorithmic framework Katyusha-H. Second, under an extra mild condition, Katyusha-H achieves the near-optimal complexity for $α$ belonging to a certain interval, highlighting the effectiveness of the acceleration-variance reduction trade-off. Last, without extra conditions, Katyusha-H achieves the complexity $\\widetilde{\\mathcal{O}}(n+\\sqrt{n}/\\sqrtε)$ with $α=1$ and proper mini-batch sizes. The proposed idea and techniques may be of general interest beyond the considered problem in this work."}
{"id": "2601.02992", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.02992", "abs": "https://arxiv.org/abs/2601.02992", "authors": ["Wei Qian"], "title": "Coupling Brownian loop soups and random walk loop soups at all polynomial scales", "comment": "12 pages", "summary": "Lawler and Trujillo Ferreras constructed a well-known coupling between the Brownian loop soups in $\\mathbb{R}^2$ and the random walk loop soups on $\\mathbb{Z}^2$ (one rescales the random walk loops by $1/N$, their time parametrizations by $1/(2N^2)$, and let $N\\to \\infty$), which led to numerous applications. It nevertheless only holds for loops with time length at least $N^{θ-2}$ for $θ\\in(2/3,2)$. In particular, there is no control on mesoscopic loops with time length less than $N^{-4/3}$ (i.e.\\ roughly diameter less than $N^{-2/3}$).\n  In this paper, we find a simple way to remove the restriction $θ>2/3$, so that such a coupling works for all $θ\\in (0,2)$, i.e. for loops at all polynomial scales. We also establish this coupling in any dimension $d\\ge 1$ (i.e. for random walk loop soups on $\\mathbb{Z}^d$ and Brownian loop soups on $\\mathbb{R}^d$)."}
{"id": "2601.03010", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.03010", "abs": "https://arxiv.org/abs/2601.03010", "authors": ["Angelo Iollo", "Jon Labatut", "Pierre Mounoud", "Tommaso Taddei"], "title": "Mathematical aspects of registration methods in bounded domains", "comment": null, "summary": "Registration methods in bounded domains have received significant attention in the model reduction literature, as a valuable tool for nonlinear approximation. The aim of this work is to provide a concise yet complete overview of relevant results for registration methods in $n$-dimensional domains, from the perspective of parametric model reduction. We present a thorough analysis of two classes of methods, vector flows and compositional maps: we discuss the enforcement of the bijectivity constraint and we comment on the approximation properties of the two methods, for Lipschitz $n$-dimensional domains."}
{"id": "2601.02951", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02951", "abs": "https://arxiv.org/abs/2601.02951", "authors": ["Arjan van der Schaft"], "title": "Hopfield neural networks as port-Hamiltonian and gradient systems", "comment": "9 pages", "summary": "The structure of continuous Hopfield networks is revisited from a system-theoretic point of view. After adopting a novel electrical network interpretation involving nonlinear capacitors, it is shown that Hopfield networks admit a port-Hamiltonian formulation provided an extra passivity condition is satisfied. Subsequently it is shown that any Hopfield network can be represented as a gradient system, with Riemannian metric given by the inverse of the Hessian matrix of the total energy stored in the nonlinear capacitors. On the other hand, the well-known 'energy' function employed by Hopfield turns out to be the dissipation potential of the gradient system, and this potential is shown to satisfy a dissipation inequality that can be used for analysis and interconnection."}
{"id": "2601.03006", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.03006", "abs": "https://arxiv.org/abs/2601.03006", "authors": ["Xue Zhang", "Renxing Li"], "title": "G-BSDEs with time-varying monotonicity condition", "comment": null, "summary": "In this paper, we study backward stochastic differential equations driven by G-Brownian motion where the generator has time-varying monotonicity with respect to y and Lipsitz property with respect to z. Through the Yosida approximation, we have proved the existence and uniqueness of the solutions to these equations."}
{"id": "2601.03086", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.03086", "abs": "https://arxiv.org/abs/2601.03086", "authors": ["Yizheng Wang", "Zhongkai Hao", "Mohammad Sadegh Eshaghi", "Cosmin Anitescu", "Xiaoying Zhuang", "Timon Rabczuk", "Yinghua Liu"], "title": "Pretrain Finite Element Method: A Pretraining and Warm-start Framework for PDEs via Physics-Informed Neural Operators", "comment": null, "summary": "We propose a Pretrained Finite Element Method (PFEM),a physics driven framework that bridges the efficiency of neural operator learning with the accuracy and robustness of classical finite element methods (FEM). PFEM consists of a physics informed pretraining stage and an optional finetuning stage. In the pretraining stage, a neural operator based on the Transolver architecture is trained solely from governing partial differential equations, without relying on labeled solution data. The model operates directly on unstructured point clouds, jointly encoding geometric information, material properties, and boundary conditions, and produces physically consistent initial solutions with extremely high computational efficiency. PDE constraints are enforced through explicit finite element, based differentiation, avoiding the overhead associated with automatic differentiation. In the fine-tuning stage, the pretrained prediction is used as an initial guess for conventional FEM solvers, preserving their accuracy, convergence guarantees, and extrapolation capability while substantially reducing the number of iterations required to reach a prescribed tolerance. PFEM is validated on a broad range of benchmark problems, including linear elasticity and nonlinear hyperelasticity with complex geometries, heterogeneous materials, and arbitrary boundary conditions. Numerical results demonstrate strong generalization in the pretraining stage with relative errors on the order of 1\\%, and speedups of up to one order of magnitude in the fine-tuning stage compared to FEM with zero initial guesses."}
{"id": "2601.03008", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.03008", "abs": "https://arxiv.org/abs/2601.03008", "authors": ["Lianghai Xiao", "Yitian Qian", "Shaohua Pan"], "title": "A Relaxation Method for Nonsmooth Nonlinear Optimization with Binary Constraints", "comment": null, "summary": "We study binary optimization problems of the form \\( \\min_{x\\in\\{-1,1\\}^n} f(Ax-b) \\) with possibly nonsmooth loss \\(f\\). Following the lifted rank-one semidefinite programming (SDP) approach\\cite{qian2023matrix}, we develop a majorization-minimization algorithm by using the difference-of-convexity (DC) reformuation for the rank-one constraint and the Moreau envelop for the nonsmooth loss. We provide global complexity guarantees for the proposed \\textbf{D}ifference of \\textbf{C}onvex \\textbf{R}elaxation \\textbf{A}lgorithm (DCRA) and show that it produces an approximately feasible binary solution with an explicit bound on the optimality gap. Numerical experiments on synthetic and real datasets confirm that our method achieves superior accuracy and scalability compared with existing approaches."}
{"id": "2601.03064", "categories": ["math.PR", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.03064", "abs": "https://arxiv.org/abs/2601.03064", "authors": ["Joseph Samuel Miller"], "title": "Similarity-Sensitive Entropy: Induced Kernels and Data-Processing Inequalities", "comment": "33 pages", "summary": "We study an entropy functional $H_K$ that is sensitive to a prescribed similarity structure on a state space. For finite spaces, $H_K$ coincides with the order-1 similarity-sensitive entropy of Leinster and Cobbold. We work in the general measure-theoretic setting of kernelled probability spaces $(Ω,μ,K)$ introduced by Leinster and Roff, and develop basic structural properties of $H_K$.\n  Our main results concern the behavior of $H_K$ under coarse-graining. For a measurable map $f:Ω\\to Y$ and input law $μ$, we define a law-induced kernel on $Y$ whose pullback minimally dominates $K$, and show that it yields a coarse-graining inequality and a data-processing inequality for $H_K$, for both deterministic maps and general Markov kernels. We also introduce conditional similarity-sensitive entropy and an associated mutual information, and compare their behavior to the classical Shannon case."}
{"id": "2601.03160", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.03160", "abs": "https://arxiv.org/abs/2601.03160", "authors": ["Matteo Ferrari", "Ilaria Perugia", "Enrico Zampa"], "title": "Stability, convergence, and geometric properties of second-order-in-time space-time discretizations for linear and semilinear wave equations", "comment": null, "summary": "We revisit second-order-in-time space-time discretizations of the linear and semilinear wave equations by establishing precise equivalences with first-order-in-time formulations. Focusing on schemes using continuous piecewise-polynomial trial functions in time, we analyze their stability, convergence, and geometric properties. We consider first a weak space-time formulation with test functions projected onto discontinuous polynomials of one degree lower in time, showing that it is equivalent to the scheme proposed in [French, Peterson 1996] in the linear case, and extended in [Karakashian, Makridakis 2005] to the semilinear case. In particular, this equivalence shows that this method conserves energy at mesh nodes but is not symplectic. We then introduce two symplectic variants, obtained through Gauss-Legendre and Gauss-Lobatto quadratures in time, and show that they correspond to specific Runge-Kutta time integrators. These connections clarify the geometric structure of the space-time methods considered."}
{"id": "2601.03016", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.03016", "abs": "https://arxiv.org/abs/2601.03016", "authors": ["Felix Laurent", "Feiran Zhao", "Jaap Eising", "Florian Dörfler"], "title": "Adaptive Control of Unknown Linear Switched Systems via Policy Gradient Methods", "comment": null, "summary": "We consider the policy gradient adaptive control (PGAC) framework, which adaptively updates a control policy in real time, by performing data-based gradient descent steps on the linear quadratic regulator cost. This method has empirically shown to react to changing circumstances, such as model parameters, efficiently. To formalize this observation, we design a PGAC method which stabilizes linear switched systems, where both model parameters and switching time are unknown. We use sliding window data for the policy gradient estimate and show that under a dwell time condition and small dynamics variation, the policy can track the switching dynamics and ensure closed-loop stability. We perform simulations to validate our theoretical results."}
{"id": "2601.03109", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.03109", "abs": "https://arxiv.org/abs/2601.03109", "authors": ["Alexander Iksanov", "Zakhar Kabluchko", "Vitali Wachtel"], "title": "First passage times for decoupled random walks", "comment": "22 pages, 4 figures", "summary": "Motivated by a connection to the infinite Ginibre point process, decoupled random walks were introduced in a recent article Alsmeyer, Iksanov and Kabluchko (2025). The decoupled random walk is a sequence of independent random variables, in which the $n$th variable has the same distribution as the position at time $n$ of a standard random walk with nonnegative increments. We prove distributional convergence in the Skorokhod space equipped with the $J_1$-topology of the running maxima and the first passage times of decoupled random walks. We show that there exist five different regimes, in which distinct limit theorems arise. Rather different functional limit theorems for the number of visits of decoupled standard random walk to the interval $[0,t]$ as $t\\to\\infty$ were earlier obtained in the aforementioned paper Alsmeyer, Iksanov and Kabluchko (2025). While the limit processes for the first passage times are inverse extremal-like processes, the limit processes for the number of visits are stationary Gaussian."}
{"id": "2601.03182", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.03182", "abs": "https://arxiv.org/abs/2601.03182", "authors": ["Ding Ding", "Yang Li", "Poh Ling Neo", "Zhiyuan Wang", "Chongwu Xia"], "title": "Subjective-Objective Median-based Importance Technique (SOMIT) to Aid Multi-Criteria Renewable Energy Evaluation", "comment": null, "summary": "Accelerating the renewable energy transition requires informed decision-making that accounts for the diverse financial, technical, environmental, and social trade-offs across different renewable energy technologies. A critical step in this multi-criteria decision-making (MCDM) process is the determination of appropriate criteria weights. However, deriving these weights often solely involves either subjective assessment from decision-makers or objective weighting methods, each of which has limitations in terms of cognitive burden, potential bias, and insufficient contextual relevance. This study proposes the subjective-objective median-based importance technique (SOMIT), a novel hybrid approach for determining criteria weights in MCDM. By tailoring SOMIT to renewable energy evaluation, the method directly supports applied energy system planning, policy analysis, and technology prioritization under carbon neutrality goals. The practical utility of SOMIT is demonstrated through two MCDM case studies on renewable energy decision-making in India and Saudi Arabia. Using the derived weights from SOMIT, the TOPSIS method ranks the renewable energy alternatives, with solar power achieving the highest performance scores in both cases. The main contributions of this work are five-fold: 1) the proposed SOMIT reduces the number of required subjective comparisons from the conventional quadratic order to a linear order; 2) SOMIT is more robust to outliers in the alternatives-criteria matrix (ACM); 3) SOMIT balances subjective expert knowledge with objective data-driven insights, thereby mitigating bias; 4) SOMIT is inherently modular, allowing both its individual parts and the complete approach to be seamlessly coupled with a wide range of MCDM methods commonly applied in energy systems and policy analysis; 5) a dedicated Python library, pysomit, is developed for SOMIT."}
{"id": "2601.02650", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.02650", "abs": "https://arxiv.org/abs/2601.02650", "authors": ["Qiang Du", "Baoming Shi", "Lei Zhang", "Xiangcheng Zheng"], "title": "A Derivative-Free Saddle-search Algorithm With Linear Convergence Rate", "comment": null, "summary": "We propose a derivative-free saddle-search algorithm designed to locate transition states using only function evaluations. The algorithm employs a nested architecture consisting of an inner eigenvector search and an outer saddle-point search. Through rigorous numerical analysis, we prove the almost sure convergence of the inner step under suitable assumptions. Furthermore, we establish the convergence of the outer search using a decaying step size, while demonstrating linear convergence under constant step size and boundedness conditions. Numerical experiments are provided to validate our theoretical results and demonstrate the algorithm's practical applicability."}
