{"id": "2601.00987", "categories": ["math.ST", "stat.AP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.00987", "abs": "https://arxiv.org/abs/2601.00987", "authors": ["Hélène Halconruy", "Benjamin Bobbia", "Paul Lejamtel"], "title": "Tessellation Localized Transfer learning for nonparametric regression", "comment": "57 pages, 2 figures", "summary": "Transfer learning aims to improve performance on a target task by leveraging information from related source tasks. We propose a nonparametric regression transfer learning framework that explicitly models heterogeneity in the source-target relationship. Our approach relies on a local transfer assumption: the covariate space is partitioned into finitely many cells such that, within each cell, the target regression function can be expressed as a low-complexity transformation of the source regression function. This localized structure enables effective transfer where similarity is present while limiting negative transfer elsewhere. We introduce estimators that jointly learn the local transfer functions and the target regression, together with fully data-driven procedures that adapt to unknown partition structure and transfer strength. We establish sharp minimax rates for target regression estimation, showing that local transfer can mitigate the curse of dimensionality by exploiting reduced functional complexity. Our theoretical guarantees take the form of oracle inequalities that decompose excess risk into estimation and approximation terms, ensuring robustness to model misspecification. Numerical experiments illustrate the benefits of the proposed approach."}
{"id": "2601.01051", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.01051", "abs": "https://arxiv.org/abs/2601.01051", "authors": ["Koustav Mallik"], "title": "Quotient EM under Misspecification:Tight Local Rates and Finite-Sample Bounds in General Integral Probability Metrics", "comment": null, "summary": "We study the expectation-maximization (EM) algorithm for general latent-variable models under (i) distributional misspecification and (ii) nonidentifiability induced by a group action. We formulate EM on the quotient parameter space and measure error using an arbitrary integral probability metric (IPM). Our main results give (a) a sharp local linear convergence rate for population EM governed by the spectral radius of the linearization on a local slice, and (b) tight finite-sample bounds for sample EM obtained via perturbed contraction inequalities and generic chaining/entropy control of EM-induced empirical processes."}
{"id": "2601.01325", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.01325", "abs": "https://arxiv.org/abs/2601.01325", "authors": ["Qunqiang Feng", "Jiashun Jin", "Yaru Tian", "Ting Yan"], "title": "Optimal estimators and tests for reciprocal effects", "comment": "28 pages, 5 figures, 7 tables", "summary": "The $p_1$ model plays a fundamental role in modeling directed networks, where the reciprocal effect parameter $ρ$ is of special interest in practice. However, due to nonlinear factors in this model, how to estimate $ρ$ efficiently is a long-standing open problem. We tackle the problem by the cycle count approach. The challenge is, due to the nonlinear factors in the model, for any given type of generalized cycles, the expected count is a complicated function of many parameters in the model, so it is unclear how to use cycle counts to estimate $ρ$. However, somewhat surprisingly, we discover that, among many types of generalized cycles with the same length, we can carefully pick a pair of them such that in the ratio between the expected cycle counts of the two types, the non-linear factors cancel out nicely with each other, and as a result, the ratio equals to $\\mathrm{exp}(ρ)$ exactly. Therefore, though the expected count of cycles of any type is not tractable, the ratio between the expected cycle counts of a (carefully chosen) pair of generalized cycles may have an utterly simple form. We study to what extent such pairs exist, and use our discovery to derive both an estimate for $ρ$ and a testing procedure for testing $ρ= ρ_0$. In a setting where we allow a wide range of reciprocal effects and a wide variety of network sparsity and degree heterogeneity, we show that our estimator achieves the optimal rate and our test achieves the optimal phase transition. Technically, first, motivated by what we observe on real networks, we do not want to impose strong conditions on reciprocal effects, network sparsity, and degree heterogeneity. Second, our proposed statistic is a type of $U$-statistic, the analysis of which involves complex combinatorics and is error-prone. For these reasons, our analysis is long and delicate."}
{"id": "2601.01345", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.01345", "abs": "https://arxiv.org/abs/2601.01345", "authors": ["Mathias Nthiani Muia"], "title": "Uniform Asymptotic Theory for Local Likelihood Estimation of Covariate-Dependent Copula Parameters", "comment": "35 pages, 9 figures", "summary": "Conditional copula models allow dependence structures to vary with observed covariates while preserving a separation between marginal behavior and association. We study the uniform asymptotic behavior of kernel-weighted local likelihood estimators for smoothly varying copula parameters in multivariate conditional copula models. Using a local polynomial approximation of a suitably transformed calibration function, we establish uniform convergence rates over compact covariate sets for the local log-likelihood, its score, and its Hessian. These results yield uniform consistency of the local maximum likelihood estimator and of the induced copula parameter function. The analysis is based on empirical process techniques for kernel-indexed classes with shrinking neighborhoods and polynomial entropy bounds, providing theoretical support for global consistency and stable local optimization in covariate-dependent copula models."}
{"id": "2601.01189", "categories": ["math.PR", "math.ST", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2601.01189", "abs": "https://arxiv.org/abs/2601.01189", "authors": ["Chenguang Liu", "Liping Xu", "An Zhang"], "title": "Central limit theorem for a partially observed interacting system of Hawkes processes I: subcritical case", "comment": "57 pages.This work overlaps with a portion of the content from arXiv:1906.08080", "summary": "We consider a system of $N$ Hawkes processes and observe the actions of a subpopulation of size $K \\le N$ up to time $t$, where $K$ is large. The influence relationships between each pair of individuals are modeled by i.i.d.Bernoulli($p$) random variables, where $p \\in [0,1]$ is an unknown parameter. Each individual acts at a {\\it baseline} rate $μ> 0$ and, additionally, at an {\\it excitation} rate of the form $N^{-1} \\sum_{j=1}^{N} θ_{ij} \\int_{0}^{t} φ(t-s)\\,dZ_s^{j,N}$, which depends on the past actions of all individuals that influence it, scaled by $N^{-1}$ (i.e. the mean-field type), with the influence of older actions discounted through a memory kernel $φ\\colon \\mathbb{R}{+} \\to \\mathbb{R}{+}$. Here, $μ$ and $φ$ are treated as nuisance parameters. The aim of this paper is to establish a central limit theorem for the estimator of $p$ proposed in \\cite{D}, under the subcritical condition $Λp < 1$."}
{"id": "2601.00986", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.00986", "abs": "https://arxiv.org/abs/2601.00986", "authors": ["Chunmei Wang", "Shangyou Zhang"], "title": "A Simple Weak Galerkin Finite Element Method for Convection-Diffusion-Reaction Equations on Nonconvex Polytopal Meshes", "comment": "24 pages, 16 tables, 4 figures", "summary": "This article introduces a simple weak Galerkin (WG) finite element method for solving convection-diffusion-reaction equation. The proposed method offers significant flexibility by supporting discontinuous approximating functions on general nonconvex polytopal meshes. We establish rigorous error estimates within a suitable norm. Finally, numerical experiments are presented to validate the theoretical convergence rates and demonstrate the computational efficiency of the approach."}
{"id": "2601.01160", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.01160", "abs": "https://arxiv.org/abs/2601.01160", "authors": ["Boris Prokhorov", "Semyon Chebykin", "Alexander Gasnikov", "Aleksandr Beznosikov"], "title": "Gradient-Free Approaches is a Key to an Efficient Interaction with Markovian Stochasticity", "comment": null, "summary": "This paper deals with stochastic optimization problems involving Markovian noise with a zero-order oracle. We present and analyze a novel derivative-free method for solving such problems in strongly convex smooth and non-smooth settings with both one-point and two-point feedback oracles. Using a randomized batching scheme, we show that when mixing time $τ$ of the underlying noise sequence is less than the dimension of the problem $d$, the convergence estimates of our method do not depend on $τ$. This observation provides an efficient way to interact with Markovian stochasticity: instead of invoking the expensive first-order oracle, one should use the zero-order oracle. Finally, we complement our upper bounds with the corresponding lower bounds. This confirms the optimality of our results."}
{"id": "2601.01371", "categories": ["math.ST", "cs.LG", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.01371", "abs": "https://arxiv.org/abs/2601.01371", "authors": ["Yinan Shen", "Yichen Zhang", "Wen-Xin Zhou"], "title": "SGD with Dependent Data: Optimal Estimation, Regret, and Inference", "comment": null, "summary": "This work investigates the performance of the final iterate produced by stochastic gradient descent (SGD) under temporally dependent data. We consider two complementary sources of dependence: $(i)$ martingale-type dependence in both the covariate and noise processes, which accommodates non-stationary and non-mixing time series data, and $(ii)$ dependence induced by sequential decision making. Our formulation runs in parallel with classical notions of (local) stationarity and strong mixing, while neither framework fully subsumes the other. Remarkably, SGD is shown to automatically accommodate both independent and dependent information under a broad class of stepsize schedules and exploration rate schemes.\n  Non-asymptotically, we show that SGD simultaneously achieves statistically optimal estimation error and regret, extending and improving existing results. In particular, our tail bounds remain sharp even for potentially infinite horizon $T=+\\infty$. Asymptotically, the SGD iterates converge to a Gaussian distribution with only an $O_{\\PP}(1/\\sqrt{t})$ remainder, demonstrating that the supposed estimation-regret trade-off claimed in prior work can in fact be avoided. We further propose a new ``conic'' approximation of the decision region that allows the covariates to have unbounded support. For online sparse regression, we develop a new SGD-based algorithm that uses only $d$ units of storage and requires $O(d)$ flops per iteration, achieving the long term statistical optimality. Intuitively, each incoming observation contributes to estimation accuracy, while aggregated summary statistics guide support recovery."}
{"id": "2601.01212", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.01212", "abs": "https://arxiv.org/abs/2601.01212", "authors": ["Jürgen Angst", "Oanh Nguyen", "Guillaume Poly"], "title": "Convergence of higher derivatives of random polynomials with independent roots", "comment": null, "summary": "Let $μ$ be a probability measure on $\\mathbb C$, and let $P_n$ be the random polynomial whose zeros are sampled independently from $μ$. We study the asymptotic distribution of zeros of high-order derivatives of $P_n$. We show that, for large classes of measures $μ$, the empirical distribution of zeros of the $k$-th derivative converges back to $μ$ for all derivative orders $k=o(n/\\log n)$. This includes all discrete measures and a broad family of measures satisfying a mild dimension-nondegeneracy condition.\n  We further establish a robustness result showing that, for arbitrary $μ$, even after adding a vanishing proportion of roots drawn from a dimension-nondegenerate perturbation, the derivative zero measures still converge back to $μ$. These results break the previously known logarithmic barrier on the order of differentiation and demonstrate that the limiting root distribution is preserved under differentiation of order growing nearly linearly with the degree."}
{"id": "2601.01007", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01007", "abs": "https://arxiv.org/abs/2601.01007", "authors": ["Yusaku Yamamoto"], "title": "On solving nonlinear simultaneous equations arising from the double-exponential Sinc-collocation method for initial value problems", "comment": null, "summary": "The double-exponential Sinc-collocation method is known as a super-accurate method for solving initial value problems of ordinary differential equations, for which the error decreases almost exponentially as a function of the number of sample points in the temporal direction, $N$. However, this method requires solving nonlinear simultaneous equations in $nN$ variables when the problem dimension is $n$. Recently, Ogata pointed out that Gauss-Seidel type fixed-point iteration works surprisingly well for solving these equations, typically reducing the error by one or two orders of magnitude at each iteration. In this paper, we analyze the convergence of this iteration and give a sufficient condition for its global convergence. We also provide an upper bound on its convergence factor, which explains the efficiency of this iteration. Some numerical examples that illustrate the validity of our analysis are also provided."}
{"id": "2601.01175", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01175", "abs": "https://arxiv.org/abs/2601.01175", "authors": ["Zhongyuan Cao", "Kaustav Das", "Nicolas Langrené", "Mathieu Laurière"], "title": "Scalable Method for Mean Field Control with Kernel Interactions via Random Fourier Features", "comment": null, "summary": "We develop a scalable algorithm for mean field control problems with kernel interactions by combining particle system simulations with random Fourier feature approximations. The method replaces the quadratic-cost kernel evaluations by linear-time estimates, enabling efficient stochastic gradient descent for training feedback controls in large populations. We provide theoretical complexity bounds and demonstrate through crowd motion and flocking examples that the approach preserves control performance while substantially reducing computational cost. The results indicate that random feature approximations offer an effective and practical tool for high dimensional and large scale mean field control."}
{"id": "2601.01471", "categories": ["math.ST", "econ.EM", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.01471", "abs": "https://arxiv.org/abs/2601.01471", "authors": ["Shuyuan Chen", "Peng Zhang", "Yifan Cui"], "title": "Double Machine Learning of Continuous Treatment Effects with General Instrumental Variables", "comment": null, "summary": "Estimating causal effects of continuous treatments is a common problem in practice, for example, in studying dose-response functions. Classical analyses typically assume that all confounders are fully observed, whereas in real-world applications, unmeasured confounding often persists. In this article, we propose a novel framework for local identification of dose-response functions using instrumental variables, thereby mitigating bias induced by unobserved confounders. We introduce the concept of a uniform regular weighting function and consider covering the treatment space with a finite collection of open sets. On each of these sets, such a weighting function exists, allowing us to identify the dose-response function locally within the corresponding region. For estimation, we develop an augmented inverse probability weighting score for continuous treatments under a debiased machine learning framework with instrumental variables. We further establish the asymptotic properties when the dose-response function is estimated via kernel regression or empirical risk minimization. Finally, we conduct both simulation and empirical studies to assess the finite-sample performance of the proposed methods."}
{"id": "2601.01226", "categories": ["math.PR", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.01226", "abs": "https://arxiv.org/abs/2601.01226", "authors": ["Mykola Pratsiovytyi", "Sofiia Ratushniak"], "title": "Singular distributions of random variables with independent digits of representation in numeral system with natural base and redundant alphabet", "comment": null, "summary": "Given natural parameters s and r, where $2\\leq s\\leq r$, we consider the distribution of a random variable $ξ=\\sum\\limits_{k=1}^{\\infty}s^{-k}ξ_k\\equivΔ^{r_s}_{ξ_1ξ_2...ξ_k...},$ where $(ξ_k)$ is a sequence of independent random variables taking values in $\\{0,1,...,r\\}$ with probabilities $p_0,p_1,...,p_r$, respectively, and all $ p_i<1$. In the case s=3=r, necessary and sufficient conditions for the singularity and absolute continuity of the distribution of random variable are established. The work also discusses the connection between the distribution of random variable and infinite Bernoulli convolutions governed by the corresponding series as well as representations of numbers in the base-3 numeral system with one redundant digit. Several open problems are formulated."}
{"id": "2601.01072", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01072", "abs": "https://arxiv.org/abs/2601.01072", "authors": ["Zhijun Zeng", "Jianlong Chen"], "title": "Flow Matching Transport for Quasi-Monte Carlo Integration", "comment": null, "summary": "High-dimensional integration with respect to complex target measures remains a fundamental challenge in computational science. While Flow Matching (FM) offers a powerful paradigm for constructing continuous-time transport maps, its deployment in high-precision integration is severely limited by the discretization bias inherent to numerical ODE solvers and the lack of rigorous convergence guarantees when coupled with Quasi-Monte Carlo (QMC) methods. This paper addresses these critical gaps by proposing Flow Matching Importance Sampling Quasi-Monte Carlo (FM-ISQMC), a framework designed to transform biased generative flows into unbiased, high-order integration schemes. Methodologically, we construct a transport map by composing a logistic base transformation with an Euler-discretized neural ODE field and employ importance sampling to correct for residual transport errors. Our central contribution is twofold. First, we establish a general convergence analysis for QMC importance sampling with arbitrary transport maps, identifying sufficient growth conditions for the $\\mathcal{O}(N^{-1+\\varepsilon})$ root-mean-square error rate. Second, we rigorously prove that the specific transport architecture of Flow Matching satisfies these conditions. Consequently, we establish a $\\mathcal{O}(N^{-1+\\varepsilon})$ root-mean-square error for the unbiased FM-ISQMC estimator, extending classical QMC theory to the realm of generative models. Numerical experiments validate that FM-ISQMC consistently breaks through the error floor observed in direct transport methods, delivering superior precision. This work thus bridges the divide between deep generative modeling and numerical integration."}
{"id": "2601.01248", "categories": ["math.OC", "cs.LG", "math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.01248", "abs": "https://arxiv.org/abs/2601.01248", "authors": ["Jinniao Qiu"], "title": "Stochastic Control Methods for Optimization", "comment": null, "summary": "In this work, we investigate a stochastic control framework for global optimization over both finite-dimensional Euclidean spaces and the Wasserstein space of probability measures. In the Euclidean setting, the original minimization problem is approximated by a family of regularized stochastic control problems; using dynamic programming, we analyze the associated Hamilton--Jacobi--Bellman equations and obtain tractable representations via the Cole--Hopf transform and the Feynman--Kac formula. For optimization over probability measures, we formulate a regularized mean-field control problem characterized by a master equation, and further approximate it by controlled $N$-particle systems. We establish that, as the regularization parameter tends to zero (and as the particle number tends to infinity for the optimization over probability measures), the value of the control problem converges to the global minimum of the original objective. Building on the resulting probabilistic representations, Monte Carlo-based numerical schemes are proposed and numerical experiments are reported to illustrate the practical performance of the methods and to support the theoretical convergence rates."}
{"id": "2601.01805", "categories": ["math.ST", "eess.SP", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.01805", "abs": "https://arxiv.org/abs/2601.01805", "authors": ["Masahiro Kurisaki"], "title": "Pathwise Representation of the Smoothing Distribution in Continuous-Time Linear Gaussian Models", "comment": null, "summary": "We study the filtering and smoothing problem for continuous-time linear Gaussian systems. While classical approaches such as the Kalman-Bucy filter and the Rauch-Tung-Striebel (RTS) smoother provide recursive formulas for the conditional mean and covariance, we present a pathwise perspective that characterizes the smoothing error dynamics as an Ornstein-Uhlenbeck process. As an application, we show that standard filtering and smoothing equations can be uniformly derived as corollaries of our main theorem. In particular, we provide the first mathematically rigorous derivation of the Bryson-Frazier smoother in the continuous-time setting. Beyond offering a more transparent understanding of the smoothing distribution, our formulation enables pathwise sampling from it, which facilitates Monte Carlo methods for evaluating nonlinear functionals."}
{"id": "2601.01447", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.01447", "abs": "https://arxiv.org/abs/2601.01447", "authors": ["Platon Promyslov"], "title": "On the integro-differential equation arising in the ruin problem for annuity payment models", "comment": null, "summary": "We study a ruin problem for an annuity model where a fixed fraction of capital is invested in a risky asset. Under weak assumptions on jumps, the ruin probability solves a second-order integro-differential equation and decays as a power function for large initial capital."}
{"id": "2601.01081", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01081", "abs": "https://arxiv.org/abs/2601.01081", "authors": ["Yuyang Liu", "Hua Su", "Zixiang Xiao", "Lei Zhang", "Jin Zhao"], "title": "SaddleScape V1.0: A Python Package for Constructing Solution Landscapes via High-index Saddle Dynamics", "comment": null, "summary": "We present SaddleScape V1.0, a Python software package designed for the exploration and construction of solution landscapes in complex systems. The package implements the High-index Saddle Dynamics (HiSD) framework and its variants, including the Generalized HiSD for non-gradient systems and the Accelerated HiSD. SaddleScape V1.0 enables the systematic identification of critical points, including both local minima and high-index saddle points, by dynamically updating both the state estimate and an associated subspace characterizing the saddle's local manifold. It supports both gradient systems, defined by energy functions/functionals, and general non-gradient autonomous dynamical systems. Key features include automatic differentiation for symbolic inputs, numerical approximation techniques for Hessian-vector products, diverse eigenvalue solvers, and algorithms for constructing solution landscapes. The software offers a user-friendly interface with flexible parameter configuration, tools for trajectory and landscape visualization, and data export capabilities. By providing an efficient and accessible implementation of advanced saddle dynamics, SaddleScape V1.0 facilitates the construction of solution landscapes, empowering researchers in various scientific disciplines to gain deeper insights into the hierarchical structure of complex systems. The source code is available at the repository https://github.com/HiSDpackage/saddlescape. The package's introductory website is available at https://hisdpackage.github.io/saddlescape."}
{"id": "2601.01311", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.01311", "abs": "https://arxiv.org/abs/2601.01311", "authors": ["Hong T. M. Chu"], "title": "Concave Certificates: Geometric Framework for Distributionally Robust Risk and Complexity Analysis", "comment": "30 pages, 7 figures", "summary": "Distributionally Robust (DR) optimization aims to certify worst-case risk within a Wasserstein uncertainty set. Current certifications typically rely either on global Lipschitz bounds, which are often conservative, or on local gradient information, which provides only a first-order approximation. This paper introduces a novel geometric framework based on the least concave majorants of the growth rate function. Our proposed concave certificate establishes a tight bound of DR risk that remains applicable to non-Lipschitz and non-differentiable losses. We extend this framework to complexity analysis, introducing a deterministic bound that complements standard statistical generalization bound. Furthermore, we utilize this certificate to bound the gap between adversarial and empirical Rademacher complexity, demonstrating that dependencies on input diameter, network width, and depth can be eliminated. For practical application in deep learning, we introduce the adversarial score as a tractable relaxation of the concave certificate that enables efficient and layer-wise analysis of neural networks. We validate our theoretical results in various numerical experiments on classification and regression tasks on real-world data."}
{"id": "2601.01871", "categories": ["math.ST", "q-fin.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.01871", "abs": "https://arxiv.org/abs/2601.01871", "authors": ["Takaaki Shiotani", "Takaki Hayashi", "Yuta Koike"], "title": "On lead-lag estimation of non-synchronously observed point processes", "comment": "52 pages, 6 figures, 1 table", "summary": "This paper introduces a new theoretical framework for analyzing lead-lag relationships between point processes, with a special focus on applications to high-frequency financial data. In particular, we are interested in lead-lag relationships between two sequences of order arrival timestamps. The seminal work of Dobrev and Schaumburg proposed model-free measures of cross-market trading activity based on cross-counts of timestamps. While their method is known to yield reliable results, it faces limitations because its original formulation inherently relies on discrete-time observations, an issue we address in this study. Specifically, we formulate the problem of estimating lead-lag relationships in two point processes as that of estimating the shape of the cross-pair correlation function (CPCF) of a bivariate stationary point process, a quantity well-studied in the neuroscience and spatial statistics literature. Within this framework, the prevailing lead-lag time is defined as the location of the CPCF's sharpest peak. Under this interpretation, the peak location in Dobrev and Schaumburg's cross-market activity measure can be viewed as an estimator of the lead-lag time in the aforementioned sense. We further propose an alternative lead-lag time estimator based on kernel density estimation and show that it possesses desirable theoretical properties and delivers superior numerical performance. Empirical evidence from high-frequency financial data demonstrates the effectiveness of our proposed method."}
{"id": "2601.01489", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.01489", "abs": "https://arxiv.org/abs/2601.01489", "authors": ["Carsten Hartmann", "Annika Jöster", "Christof Schütte", "Alexander Sikorski", "Marcus Weber"], "title": "Importance sampling of unbounded random stopping times: computing committor functions and exit rates without reweighting", "comment": "51 pages, 7 figures", "summary": "Rare events in molecular dynamics are often related to noise-induced transitions between different macroscopic states (e.g., in protein folding). A common feature of these rare transitions is that they happen on timescales that are on average exponentially long compared to the characteristic timescale of the system, with waiting time distributions that have (sub)exponential tails and infinite support. As a result, sampling such rare events can lead to trajectories that can be become arbitrarily long, with not too low probability, which makes the reweighting of such trajectories a real challenge. Here, we discuss rare event simulation by importance sampling from a variational perspective, with a focus on applications in molecular dynamics, in particular the computation of committor functions. The idea is to design importance sampling schemes that (a) reduce the variance of a rare event estimator while controlling the average length of the trajectories and (b) that do not require the reweighting of possibly very long trajectories. In doing so, we study different stochastic control formulations for committor and mean first exit times, which we compare both from a theoretical and a computational point of view, including numerical studies of some benchmark examples."}
{"id": "2601.01433", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01433", "abs": "https://arxiv.org/abs/2601.01433", "authors": ["Zhenghua Duan", "Meng Li"], "title": "Adaptive finite difference methods for the Willmore flow: mesh redistribution algorithm and tangential velocity approach", "comment": null, "summary": "We develop two adaptive finite difference methods for the numerical simulation of the Willmore flow, employing the kth-order backward differentiation formula (BDFk) for time discretization, together with monitor functions for dynamic mesh adaptation along evolving interfaces. The first approach is based on a weighted arc-length equidistribution strategy driven by a monitor function to adaptively redistribute grid points. An adaptive monitor selection mechanism, constructed from the curvature and its variation, enhances spatial resolution in regions of strong geometric complexity while preserving mesh regularity. The second approach eliminates explicit reparameterization by incorporating a tangential velocity into the Willmore flow, with mesh redistribution inherently embedded in the geometric evolution. We further develop an energy-stable correction algorithm for the second method to guarantee discrete energy stability at the theoretical level. In both approaches, the monitor function serves as the core component of the adaptive framework, encoding essential geometric information -- such as curvature and curvature variation -- to guide mesh refinement and redistribution. Extensive numerical experiments demonstrate that the proposed BDFk-based adaptive schemes accurately capture the geometric evolution of the Willmore flow and exhibit excellent robustness and computational efficiency for problems involving complex interface geometries."}
{"id": "2601.01385", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.01385", "abs": "https://arxiv.org/abs/2601.01385", "authors": ["Ziheng Jiao", "Chengshuai Wu", "Bo Fan", "Meng Zhang", "Romeo Ortega"], "title": "On IDA-PBC with Maximum Energy Shapeability", "comment": "7 pages, 2 figures", "summary": "Interconnection and Damping Assignment Passivity-Based Control (IDA-PBC) is a well-established stabilization technique for affine nonlinear systems. However, its application is generally hindered by the requirement of solving a set of partial differential equations (PDEs), i.e., the so-called matching equation. This paper introduces the notion of \\emph{maximum energy shapeability} which describes the scenario that the homogeneous part of the matching equation admits $m$ independent solutions with $m$ the dimension of the control input. We demonstrate that the maximum energy shapeability enables a systematic procedure for the IDA-PBC design by transforming the matching equation into a set of easier-to-solve PDEs. Sufficient conditions for maximum energy shapeability are also provided. It is shown that some existing constructive IDA-PBC designs actually implicitly exploit the maximum energy shapeability. The proposed procedure for the IDA-PBC design is illustrated with the magnetic levitation system."}
{"id": "2601.02025", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.02025", "abs": "https://arxiv.org/abs/2601.02025", "authors": ["Antoine Ayache", "laurent Loosveldt", "Ciprian Tudor"], "title": "Modified weighted power variations of the Hermite process and applications to integrated volatility", "comment": null, "summary": "We study the asymptotic behaviour of modified weighted power variations of the Hermite process of arbitrary order. By selecting suitable \"good\" increments and exploiting their decomposition into dominant independent components, we establish a central limit theorem for weighted $p$-variations using tools from Stein-Malliavin calculus. Our results extend previous works on modified quadratic and wavelet-based variations to general powers and to weighted settings, with explicit bounds in Wasserstein distance. We further apply these limit theorems to construct asymptotically Gaussian estimators of integrated volatility in Hermite-driven models, thereby extending fBm-based methods to non-Gaussian settings. The last part of our work contains numerical simulations which illustrate the practical performance of the proposed estimators."}
{"id": "2601.01797", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.01797", "abs": "https://arxiv.org/abs/2601.01797", "authors": ["Tamim Aziz", "Sanjoy Ghosal"], "title": "On the role of the Ky Fan metric in rough ideal convergence in probability", "comment": "15 pages, 0 figures", "summary": "Given a probability space $(S,Δ, \\mathbb{P})$ and a separable metric space $(U,d)$, the $Ky~Fan$ metric $ρ(X,Y)$ on the space $\\mathfrak{X}^0$ of equivalence classes of random variables (w.r.t. almost sure equality) formed from the set $\\mathfrak{X}(U)$ of $U$-valued random variables is given by $ρ(X,Y)=\\inf \\{\\varepsilon>0:\\mathbb{P}(d(X,Y)>\\varepsilon)\\leq\\varepsilon\\}.$ In this article, we primarily introduce the concept of rough ideal convergence in probability which serves as a unifying generalization of both ideal convergence of sequences in metric spaces and convergence of random variables in probability. We demonstrate that the rough ideal limit set is closed and bounded w.r.t. the $Ky~Fan$ metric $ρ$, and that, for a certain class of ideals, it forms an $F_{σδ}$ subset of $\\mathfrak{X}^0$. In this process, we present the key concepts of strong and weak rough ideal cluster points in probability. It turns out that the set of strong rough ideal cluster points in probability is always closed, whereas the weak set is conditionally closed in the metric space ($\\mathfrak{X}^0,ρ)$. Finally, we obtain a characterization of a maximal admissible ideal in terms of the sets of strong rough ideal cluster points and the rough ideal limit set in probability."}
{"id": "2601.01462", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01462", "abs": "https://arxiv.org/abs/2601.01462", "authors": ["Elie Abdo", "Lihui Chai", "Ruimeng Hu", "Xu Yang"], "title": "Convergence Analysis of PINNs for Fractional Diffusion Equations in Bounded Domains", "comment": null, "summary": "We establish the convergence of physics-informed neural networks (PINNs) for time-dependent fractional diffusion equations posed on bounded domains. The presence of fractional Laplacian operators introduces nonlocal behavior and regularity constraints, and standard neural network approximations do not naturally enforce the associated spectral boundary conditions. To address this challenge, we introduce a spectrally-defined mollification strategy that preserves the structure of the nonlocal operator while ensuring boundary compatibility. This enables the derivation of rigorous energy estimates in Sobolev spaces. Our results rely on analytical tools from PDE theory, highlighting the compatibility of PINN approximations with classical energy estimates for nonlocal equations. We prove convergence of the PINN approximation in any space-time Sobolev norm $H^k$ (with $k \\in \\N)$. The analysis highlights the role of mollified residuals in enabling theoretical guarantees for neural-network-based solvers of nonlocal PDEs."}
{"id": "2601.01502", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.01502", "abs": "https://arxiv.org/abs/2601.01502", "authors": ["Milind Nakul", "Tianjiao Li", "Ashwin Pananjady"], "title": "Multiscale replay: A robust algorithm for stochastic variational inequalities with a Markovian buffer", "comment": null, "summary": "We introduce the Multiscale Experience Replay (MER) algorithm for solving a class of stochastic variational inequalities (VIs) in settings where samples are generated from a Markov chain and we have access to a memory buffer to store them. Rather than uniformly sampling from the buffer, MER utilizes a multi-scale sampling scheme to emulate the behavior of VI algorithms designed for independent and identically distributed samples, overcoming bias in the de facto serial scheme and thereby accelerating convergence. Notably, unlike standard sample-skipping variants of serial algorithms, MER is robust in that it achieves this acceleration in iteration complexity whenever possible, and without requiring knowledge of the mixing time of the Markov chain. We also discuss applications of MER, particularly in policy evaluation with temporal difference learning and in training generalized linear models with dependent data."}
{"id": "2601.02252", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.02252", "abs": "https://arxiv.org/abs/2601.02252", "authors": ["Dominikus Noll"], "title": "Convergence of the EM algorithm via proximal techniques", "comment": "29 pages", "summary": "We investigate convergence of the expectation maximization algorithm by representing it as a generalized proximal method. Convergence of iterates and not just in value is investigated under natural hypotheses such as definability of the incomplete data log-likelihood in the sense of o-minimal structure theory."}
{"id": "2601.01845", "categories": ["math.PR", "math-ph", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.01845", "abs": "https://arxiv.org/abs/2601.01845", "authors": ["S. V. Dzhenzher", "V. Zh. Sakbaev"], "title": "Limit theorems for the evolution of quantum pure states", "comment": "6 pages, no figures", "summary": "Limit theorems of strong law of large numbers and central limit theorem types are obtained for the compositions of independent identically distributed random unitary channels."}
{"id": "2601.01553", "categories": ["math.NA", "math.CV"], "pdf": "https://arxiv.org/pdf/2601.01553", "abs": "https://arxiv.org/abs/2601.01553", "authors": ["Linus Balicki", "Mark Embree", "Serkan Gugercin"], "title": "A parametric Keldysh decomposition", "comment": null, "summary": "Contour integral algorithms seek to compute a small number of eigenvalues located within a bounded region of the complex plane. These methods can be applied to both linear and nonlinear matrix eigenvalue problems. In the latter case, the foundation of these methods comes from the Keldysh decomposition, which breaks the nonlinear matrix-valued function into two parts: a rational function whose poles match the desired eigenvalues, and a remainder term that is analytic within the target region. Under contour integration this analytic part vanishes (via Cauchy's theorem), leaving only the component containing the desired eigenvalues. We propose an extension of the Keldysh decomposition for matrix-valued functions that depend analytically on an additional parameter. We establish key properties of this parametric Keldysh decomposition, and introduce an algorithm for solving parametric nonlinear eigenvalue problems that is based upon it."}
{"id": "2601.01538", "categories": ["math.OC", "eess.SY", "math.CA"], "pdf": "https://arxiv.org/pdf/2601.01538", "abs": "https://arxiv.org/abs/2601.01538", "authors": ["Declan S. Jagt", "Matthew M. Peet"], "title": "Lyapunov Functions can Exactly Quantify Rate Performance of Nonlinear Differential Equations", "comment": null, "summary": "Pointwise-in-time stability notions for Ordinary Differential Equations (ODEs) provide quantitative metrics for system performance by establishing bounds on the rate of decay of the system state in terms of initial condition -- allowing stability to be quantified by e.g. the maximum provable decay rate. Such bounds may be obtained by finding suitable Lyapunov functions using, e.g. Sum-of-Squares (SOS) optimization. While Lyapunov tests have been proposed for numerous pointwise-in-time stability notions, including exponential, rational, and finite-time stability, it is unclear whether these characterizations are able to provide accurate bounds on system performance.\n  In this paper, we start by proposing a generalized notion of rate performance -- with exponential, rational, and finite-time decay rates being special cases. Then, for any such notion and rate, we associate a Lyapunov condition which is shown to be necessary and sufficient for a system to achieve that rate. Finally, we show how the proposed conditions can be enforced using SOS programming in the case of exponential, rational, and finite-time stability. Numerical examples in each case demonstrate that the corresponding SOS test can achieve tight bounds on the rate performance with accurate inner bounds on the associated regions of performance."}
{"id": "2601.02305", "categories": ["math.ST", "math.DG", "stat.CO", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.02305", "abs": "https://arxiv.org/abs/2601.02305", "authors": ["Didong Li", "Aritra Halder", "Sudipto Banerjee"], "title": "On Statistical Inference for Rates of Change in Spatial Processes over Riemannian Manifolds", "comment": null, "summary": "Statistical inference for spatial processes from partially realized or scattered data has seen voluminous developments in diverse areas ranging from environmental sciences to business and economics. Inference on the associated rates of change has seen some recent developments. The literature has been restricted to Euclidean domains, where inference is sought on directional derivatives, rates along a chosen direction of interest, at arbitrary locations. Inference for higher order rates, particularly directional curvature has also proved useful in these settings. Modern spatial data often arise from non-Euclidean domains. This manuscript particularly considers spatial processes defined over compact Riemannian manifolds. We develop a comprehensive inferential framework for spatial rates of change for such processes over vector fields. In doing so, we formalize smoothness of process realizations and construct differential processes -- the derivative and curvature processes. We derive conditions for kernels that ensure the existence of these processes and establish validity of the joint multivariate process consisting of the ``parent'' Gaussian process (GP) over the manifold and the associated differential processes. Predictive inference on these rates is devised conditioned on the realized process over the manifold. Manifolds arise as polyhedral meshes in practice. The success of our simulation experiments for assessing derivatives for processes observed over such meshes validate our theoretical findings. By enhancing our understanding of GPs on manifolds, this manuscript unlocks a variety of potential applications in machine learning and statistics where GPs have seen wide usage. We propose a fully model-based approach to inference on the differential processes arising from a spatial process from partially observed or realized data across scattered location on a manifold."}
{"id": "2601.01248", "categories": ["math.OC", "cs.LG", "math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.01248", "abs": "https://arxiv.org/abs/2601.01248", "authors": ["Jinniao Qiu"], "title": "Stochastic Control Methods for Optimization", "comment": null, "summary": "In this work, we investigate a stochastic control framework for global optimization over both finite-dimensional Euclidean spaces and the Wasserstein space of probability measures. In the Euclidean setting, the original minimization problem is approximated by a family of regularized stochastic control problems; using dynamic programming, we analyze the associated Hamilton--Jacobi--Bellman equations and obtain tractable representations via the Cole--Hopf transform and the Feynman--Kac formula. For optimization over probability measures, we formulate a regularized mean-field control problem characterized by a master equation, and further approximate it by controlled $N$-particle systems. We establish that, as the regularization parameter tends to zero (and as the particle number tends to infinity for the optimization over probability measures), the value of the control problem converges to the global minimum of the original objective. Building on the resulting probabilistic representations, Monte Carlo-based numerical schemes are proposed and numerical experiments are reported to illustrate the practical performance of the methods and to support the theoretical convergence rates."}
{"id": "2601.01585", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01585", "abs": "https://arxiv.org/abs/2601.01585", "authors": ["Cuiyu He"], "title": "A Unified Equilibrated Flux Recovery Framework with Robust A Posteriori Error Estimation", "comment": "21 pages, 6 figures", "summary": "We introduce the Equilibrated Averaging Residual Method (EARM), a unified equilibrated flux-recovery framework for elliptic interface problems that applies to a broad class of finite element discretizations. The method is applicable in both two and three dimensions and for arbitrary polynomial orders, and it enables the construction of computationally efficient recovered fluxes. We develop EARM for both discontinuous Galerkin (DG) and conforming finite element discretizations. For DG methods, EARM can be applied directly and yields an explicit recovered flux that coincides with state-of-the-art conservative flux reconstructions.\n  For conforming discretizations, we further propose the Orthogonal Null-space--Eliminated EARM (ON-EARM), which ensures uniqueness by restricting the correction flux to the orthogonal complement of the divergence-free null space. We prove local conservation and establish a robust a~posteriori error estimator for the recovered flux in two dimensions, with robustness measured with respect to jumps in the diffusion coefficient. Numerical results in two and three dimensions confirm the theoretical findings."}
{"id": "2601.01575", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01575", "abs": "https://arxiv.org/abs/2601.01575", "authors": ["Hanfeng Zeng", "Yang Liu", "Wenqing Ouyang", "Andre Milzarek"], "title": "A MINRES-based Linesearch Algorithm for Nonconvex Optimization with Non-positive Curvature Detection", "comment": "36 pages, 9 figures", "summary": "We propose a MINRES-based Newton-type algorithm for solving unconstrained nonconvex optimization problems. Our approach uses the minimal residual method (MINRES), a well-known solver for indefinite symmetric linear systems, to compute descent directions that leverage second-order and non-positive curvature (NPC) information. Comprehensive asymptotic convergence properties are derived under standard assumptions. In particular, under the Kurdyka-Łojasiewicz inequality and a mild NPC-detectability condition, we prove that our algorithm can avoid strict saddle points and converge to second-order critical points. This is primarily achieved by integrating proper regularization techniques and forward linesearch mechanisms along NPC directions. Furthermore, fast local superlinear convergence to potentially non-isolated minima is established, when the local Polyak-Łojasiewicz condition is satisfied. Numerical experiments on the CUTEst test collection and on a deep auto-encoder problem illustrate the efficiency of the proposed method."}
{"id": "2601.01189", "categories": ["math.PR", "math.ST", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2601.01189", "abs": "https://arxiv.org/abs/2601.01189", "authors": ["Chenguang Liu", "Liping Xu", "An Zhang"], "title": "Central limit theorem for a partially observed interacting system of Hawkes processes I: subcritical case", "comment": "57 pages.This work overlaps with a portion of the content from arXiv:1906.08080", "summary": "We consider a system of $N$ Hawkes processes and observe the actions of a subpopulation of size $K \\le N$ up to time $t$, where $K$ is large. The influence relationships between each pair of individuals are modeled by i.i.d.Bernoulli($p$) random variables, where $p \\in [0,1]$ is an unknown parameter. Each individual acts at a {\\it baseline} rate $μ> 0$ and, additionally, at an {\\it excitation} rate of the form $N^{-1} \\sum_{j=1}^{N} θ_{ij} \\int_{0}^{t} φ(t-s)\\,dZ_s^{j,N}$, which depends on the past actions of all individuals that influence it, scaled by $N^{-1}$ (i.e. the mean-field type), with the influence of older actions discounted through a memory kernel $φ\\colon \\mathbb{R}{+} \\to \\mathbb{R}{+}$. Here, $μ$ and $φ$ are treated as nuisance parameters. The aim of this paper is to establish a central limit theorem for the estimator of $p$ proposed in \\cite{D}, under the subcritical condition $Λp < 1$."}
{"id": "2601.01805", "categories": ["math.ST", "eess.SP", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.01805", "abs": "https://arxiv.org/abs/2601.01805", "authors": ["Masahiro Kurisaki"], "title": "Pathwise Representation of the Smoothing Distribution in Continuous-Time Linear Gaussian Models", "comment": null, "summary": "We study the filtering and smoothing problem for continuous-time linear Gaussian systems. While classical approaches such as the Kalman-Bucy filter and the Rauch-Tung-Striebel (RTS) smoother provide recursive formulas for the conditional mean and covariance, we present a pathwise perspective that characterizes the smoothing error dynamics as an Ornstein-Uhlenbeck process. As an application, we show that standard filtering and smoothing equations can be uniformly derived as corollaries of our main theorem. In particular, we provide the first mathematically rigorous derivation of the Bryson-Frazier smoother in the continuous-time setting. Beyond offering a more transparent understanding of the smoothing distribution, our formulation enables pathwise sampling from it, which facilitates Monte Carlo methods for evaluating nonlinear functionals."}
{"id": "2601.01731", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01731", "abs": "https://arxiv.org/abs/2601.01731", "authors": ["Ansgar Jüngel", "Panchi Li", "Zhiwei Sun"], "title": "A generalized Scharfetter-Gummel scheme for nonlocal cross-diffusion systems", "comment": null, "summary": "An implicit Euler finite-volume scheme for a nonlocal cross-diffusion system on the multidimensional torus is analyzed. The equations describe the dynamics of population species with repulsive or attractive interactions. The numerical scheme is based on a generalized Scharfetter-Gummel discretization of the nonlocal flux term. For merely integrable kernel functions, the scheme preserves the positivity, total mass, and entropy structure. The existence of a discrete solution and its convergence to a solution to the continuous problem, as the mesh size tends to zero, are shown. A key difficulty is the degeneracy of the generalized Bernoulli function in the Scharfetter-Gummel approximation. This issue is overcome by proving a uniform estimate for the discrete Fisher information, which requires both the Boltzmann and Rao entropy inequalities. Numerical simulations illustrate the features of the scheme in one and two space dimensions."}
{"id": "2601.01591", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01591", "abs": "https://arxiv.org/abs/2601.01591", "authors": ["Giuseppe Buttazzo", "Juan Casado-Díaz", "Faustino Maestre"], "title": "Optimization problems for elliptic PDEs", "comment": "19 pages, 8 figures", "summary": "In this paper we consider some optimal control problems governed by elliptic partial differential equations. The solution is the state variable, while the control variable is, depending on the case, the coefficient of the PDE, the potential, the right-hand side. The cost functional is of integral type and involves both the state and control variables."}
{"id": "2601.02025", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.02025", "abs": "https://arxiv.org/abs/2601.02025", "authors": ["Antoine Ayache", "laurent Loosveldt", "Ciprian Tudor"], "title": "Modified weighted power variations of the Hermite process and applications to integrated volatility", "comment": null, "summary": "We study the asymptotic behaviour of modified weighted power variations of the Hermite process of arbitrary order. By selecting suitable \"good\" increments and exploiting their decomposition into dominant independent components, we establish a central limit theorem for weighted $p$-variations using tools from Stein-Malliavin calculus. Our results extend previous works on modified quadratic and wavelet-based variations to general powers and to weighted settings, with explicit bounds in Wasserstein distance. We further apply these limit theorems to construct asymptotically Gaussian estimators of integrated volatility in Hermite-driven models, thereby extending fBm-based methods to non-Gaussian settings. The last part of our work contains numerical simulations which illustrate the practical performance of the proposed estimators."}
{"id": "2601.01742", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01742", "abs": "https://arxiv.org/abs/2601.01742", "authors": ["Georgios Akrivis", "Minghua Chen", "Fan Yu"], "title": "Implicit and implicit--explicit high-order BDF methods for coupled elliptic--parabolic systems", "comment": "25 pages, 1 figures", "summary": "First-order fully implicit as well as implicit--explicit schemes for coupled elliptic-parabolic systems are discussed in [Ern and Meunier, ESAIM: M2AN, 2009] and [Altmann et al., Math.\\ Comp., 2021], respectively. The extension of the analysis to higher-order (third-, fourth-, fifth-, and sixth-order) schemes is not straightforward since explicitly constructing $G$ matrices (G-stability) is often tricky. In this article, we develop fully implicit as well as implicit--explicit backward difference formula (BDF) schemes of order up to six. The implicit--explicit variants are decoupled, thereby enhancing computational efficiency; their convergence analysis requires a weak coupling condition on the poroelastic parameters. In contrast, no coupling conditions are needed for the fully implicit, coupled schemes. We determine novel and suitable multipliers for the two proposed classes and establish error estimates via the energy technique. A prominent advantage of these higher-order schemes is that, with almost the computational cost of first-order schemes, they greatly improve the accuracy."}
{"id": "2601.01621", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01621", "abs": "https://arxiv.org/abs/2601.01621", "authors": ["Vyacheslav Kungurtsev"], "title": "A Three-Tier Time-Scale Architecture for Controlling Complex Nonlinear Systems", "comment": null, "summary": "This letter proposes a three-tier computational architecture for the real-time control of nonlinear complex systems, such as time-dependent PDEs. There is an important class of such problems for which existing single- and two-time-scale approaches are fundamentally insufficient due to lack of a priori system knowledge, computational complexity, model fidelity requirements, and uncertainty. The proposed architecture consists of an offline, meso-scale, and real-time layer of computation, with distinct roles for each layer and specific information flow between them. The result is a practical systems-level paradigm that enables real-time operation of complex nonlinear control problems."}
{"id": "2601.01756", "categories": ["math.NA", "cs.NE"], "pdf": "https://arxiv.org/pdf/2601.01756", "abs": "https://arxiv.org/abs/2601.01756", "authors": ["N. Sukumar", "Ritwick Roy"], "title": "A Wachspress-based transfinite formulation for exactly enforcing Dirichlet boundary conditions on convex polygonal domains in physics-informed neural networks", "comment": "47 pages, 21 figures", "summary": "In this paper, we present a Wachspress-based transfinite formulation on convex polygonal domains for exact enforcement of Dirichlet boundary conditions in physics-informed neural networks. This approach leverages prior advances in geometric design such as blending functions and transfinite interpolation over convex domains. For prescribed Dirichlet boundary function $\\mathcal{B}$, the transfinite interpolant of $\\mathcal{B}$, $g : \\bar P \\to C^0(\\bar P)$, $\\textit{lifts}$ functions from the boundary of a two-dimensional polygonal domain to its interior. The trial function is expressed as the difference between the neural network's output and the extension of its boundary restriction into the interior of the domain, with $g$ added to it. This ensures kinematic admissibility of the trial function in the deep Ritz method. Wachspress coordinates for an $n$-gon are used in the transfinite formula, which generalizes bilinear Coons transfinite interpolation on rectangles to convex polygons. The neural network trial function has a bounded Laplacian, thereby overcoming a limitation in a previous contribution where approximate distance functions were used to exactly enforce Dirichlet boundary conditions. For a point $\\boldsymbol{x} \\in \\bar{P}$, Wachspress coordinates, $\\boldsymbolλ : \\bar P \\to [0,1]^n$, serve as a geometric feature map for the neural network: $\\boldsymbolλ$ encodes the boundary edges of the polygonal domain. This offers a framework for solving problems on parametrized convex geometries using neural networks. The accuracy of physics-informed neural networks and deep Ritz is assessed on forward, inverse, and parametrized geometric Poisson boundary-value problems."}
{"id": "2601.01631", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01631", "abs": "https://arxiv.org/abs/2601.01631", "authors": ["Javad A. Asadzade", "Nazim I. Mahmudov"], "title": "Stochastic Maximum Principles and Linear-Quadratic Optimal Control Problems for Fractional Backward Stochastic Evolution Equations in Hilbert Spaces", "comment": null, "summary": "This paper develops a comprehensive framework for optimal control of systems governed by fractional backward stochastic evolution equations (FBSEEs) in Hilbert spaces. We first establish a stochastic maximum principle (SMP) as a necessary condition for optimality. This is achieved by introducing spike variations, deriving precise estimates for the associated variational equations, and constructing an adjoint process tailored to the fractional dynamics. Subsequently, we apply this general principle to solve the linear-quadratic (LQ) optimal control problem explicitly. The resulting optimal control is characterized in closed form via the adjoint process and is shown to be governed by a system of coupled fractional forward-backward stochastic equations. Our work bridges fractional calculus with stochastic control theory, providing a rigorous foundation for controlling infinite-dimensional systems with memory and long-range dependencies."}
{"id": "2601.01808", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01808", "abs": "https://arxiv.org/abs/2601.01808", "authors": ["Tizian Wenzel"], "title": "Sharp inverse statements for kernel approximation: Superconvergence and saturation", "comment": null, "summary": "This article establishes sharp inverse and saturation statements for kernel-based approximation using finitely smooth Sobolev kernels on bounded Lipschitz regions. The analysis focuses on the superconvergence regime, for which direct statements have only recently been obtained. The resulting theory yields a one-to-one correspondence between the smoothness of a target function - quantified in terms of power spaces - and the achievable approximation rates by kernel-based approximation. In this way, we extend existing results beyond the escaping-the-native-space regime and provide a unified characterization covering the full scale of admissible smoothness spaces."}
{"id": "2601.01634", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01634", "abs": "https://arxiv.org/abs/2601.01634", "authors": ["Bouchra Elghazi", "Birgit Jacob", "Hans Zwart"], "title": "Boundary control systems on a one-dimension spatial domain", "comment": "24 pages", "summary": "The aim of this paper is to investigate the well-posedness of a class of boundary control and observation systems on a one dimensional spatial domain. We derive a necessary and sufficient condition characterizing the well-posedness of these systems. Furthermore, we show that the well-posedness and full control and observation implies exact controllability and exact observability. The theoretical results are illustrated using Euler-Bernoulli beam models."}
{"id": "2601.01889", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01889", "abs": "https://arxiv.org/abs/2601.01889", "authors": ["Jiawei He", "Jianhua Huang", "Fang Su"], "title": "Approximation for stochastic time-space fractional cable equations driven by rough noise", "comment": "34 pages", "summary": "The time-space fractional cable equation arises from extending the generalized fractional Ohm's law to model anomalous diffusion processes. In this paper, we develop and analyze a numerical approximation for stochastic nonlinear time-space fractional cable equation driven by rough noise. The model involves both two nonlocal terms in time and one in space. By an operator theoretic approach, we establish the existence, uniqueness, and regularities of solutions. We also obtain a convergence result for the regularized equation via Wong-Zakai approximation to regularize the rough noise. The numerical scheme approximates the model in space by the standard spectral Galerkin method and in time by the backward Euler convolution quadrature method. After that, error estimates are established."}
{"id": "2601.01683", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.01683", "abs": "https://arxiv.org/abs/2601.01683", "authors": ["Parham Oveissi", "Ryan DeBoskey", "Venkateswaran Narayanaswamy", "Ankit Goel"], "title": "Adaptive Thrust Regulation in Solid-fuel Ramjet with Variable Geometry Inlet", "comment": null, "summary": "This paper presents the application of a novel data-driven adaptive control technique, dynamic mode adaptive control (DMAC), to regulate thrust in a solid-fuel ramjet (SFRJ). A quasi-static one-dimensional model of SFRJ with a variable geometry inlet is developed to compute thrust. An adaptive tracking controller is then designed using the DMAC framework, which leverages dynamic mode decomposition to approximate the local system behavior, followed by a tracking controller designed around the identified model. Simulation results demonstrate that DMAC achieves accurate thrust regulation across a range of commanded profiles and operating conditions, without requiring an analytical model of the SFRJ. These findings indicate that DMAC provides a reliable and effective approach for model-free thrust regulation in an SFRJ with variable-geometry inlets as the control input."}
{"id": "2601.01894", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01894", "abs": "https://arxiv.org/abs/2601.01894", "authors": ["Yingsong Jiang", "Chenxu Pang", "Xiaojie Wang"], "title": "An explicit scheme for stochastic Allen-Cahn equations with space-time white noise near the sharp interface limit", "comment": null, "summary": "This article investigates time-discrete approximations of Allen-Cahn type SPDEs driven by space-time white noise near the sharp interface limit $ε\\to 0$, where the small parameter $ε$ is the diffuse interface thickness. We propose an explicit and easily implementable exponential integrator with a modified nonlinearity for the considered problem. Uniform-in-time and uniform-in-$ε$ moment bounds of the scheme are established and the convergence in total variation distance of order $O(T\\cdot\\text{Poly}(ε^{-1})τ^γ),γ<\\tfrac12$ is established, between the law of the numerical scheme and that of the SPDE over $[0,T]$. In contrast to the exponential dependence due to standard arguments, the obtained error bound depends on $ε^{-1}$ and $T$ polynomially. By incorporating carefully chosen method parameters, we only require a mild and $ε$-independent restriction on the time step-size $τ$, getting rid of the severe restriction $τ=O(ε^σ),σ\\geq1$ in the literature. Also, a uniform-in-time error bound of order $O(τ^γ),γ<\\tfrac12$, is obtained for a fixed $ε=1$, which improves the existing ones in the literature and matches the classical weak convergence rate in the globally Lipschitz setting. The error analysis is highly nontrivial due to the low regularity of the considered problem, the super-linear growth of the drift, the non-smooth observables inherent in the total variation metric and the presence of the small interface parameter $ε\\to0$. These difficulties are addressed by introducing a new strategy of nonlinearity modification and establishing refined regularity estimates for the associated Kolmogorov equation to an auxiliary process with non-smooth test functions. Numerical experiments confirm the theoretical convergence and the ability of interface-capturing for the proposed scheme."}
{"id": "2601.01853", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.01853", "abs": "https://arxiv.org/abs/2601.01853", "authors": ["Ruinan Jin", "Xiaoyu Wang"], "title": "Asymptotic Convergence and Stability of Adaptive Gradient Methods in Smooth Non-convex Optimization", "comment": "32 pages", "summary": "Adaptive gradient methods, such as AdaGrad, have become fundamental tools in deep learning. Despite their widespread use, the asymptotic convergence of AdaGrad remains poorly understood in non-convex scenarios. In this work, we present the first rigorous asymptotic convergence analysis of AdaGrad-Norm for smooth non-convex optimization. Using a novel stopping-time partitioning technique, we establish a key stability result: the objective function values remain bounded in expectation, and the iterates are bounded almost surely under a mild coercivity assumption. Building on these stability results, we prove that AdaGrad-Norm achieves both almost sure and mean-square convergence. Furthermore, we extend our analysis to RMSProp and show that, with appropriate hyperparameter choices, it also enjoys stability and asymptotic convergence. The techniques developed herein may be of independent interest for analyzing other adaptive stochastic optimization algorithms."}
{"id": "2601.01895", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01895", "abs": "https://arxiv.org/abs/2601.01895", "authors": ["Max Ebstrup Bitsch", "Irene Torpe Heilmann", "Allan Peter Engsig-Karup", "Ole Rene Sørensen", "Jesper Grooss"], "title": "An unstructured second-order subgrid method for the shallow water equations", "comment": "24 pages, 13 figures, submitted to International Journal for Numerical Methods in Fluids", "summary": "We propose a new unstructured numerical subgrid method for solving the shallow water equations using a finite volume method with enhanced bathymetry resolution. The method employs an unstructured triangular mesh with support for triangulation of elements to form finer subgrids locally. The bathymetry is represented on the fine mesh, allowing the incorporation of small-scale features, while velocities are defined on the coarse mesh. The governing equations are solved numerically on the coarse mesh, making the method computationally cheaper compared to a traditional fine mesh computation. To accurately represent the velocities, we employ a second-order accurate WENO method and for temporal integration an explicit second-order accurate Runge-Kutta method. Furthermore, we present a novel subgrid face value reconstruction that accounts for partially wet cells, where only some of the subgrid cells are wet. Together with a newly developed gravity source term discretization, we demonstrate that the scheme is well-balanced on the subgrid level. Finally, the subgrid method is validated on several test cases to show: i) that the scheme is well-balanced, ii) confirm the order of the accuracy of the scheme, and iii) demonstrate the capability of handling moving flood and dry boundaries. We also highlight when it is beneficial to increase the number of subgrid cells to improve the results of the finite volume method."}
{"id": "2601.02084", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02084", "abs": "https://arxiv.org/abs/2601.02084", "authors": ["Zhangcheng Feng", "Yancheng Yuan"], "title": "A Perturbed DCA for Computing d-Stationary Points of Nonsmooth DC Programs", "comment": null, "summary": "This paper introduces an efficient perturbed difference-of-convex algorithm (pDCA) for computing d-stationary points of an important class of structured nonsmooth difference-of-convex problems. Compared to the principal algorithms introduced in [J.-S. Pang, M. Razaviyayn, and A. Alvarado, Math. Oper. Res. 42(1):95--118 (2017)], which may require solving several subproblems for a one-step update, pDCA only requires solving a single subproblem. Therefore, the computational cost of pDCA for one-step update is comparable to the widely used difference-of-convex algorithm (DCA) introduced in [D. T. Pham and H. A. Le Thi, Acta Math. Vietnam. 22(1):289--355 (1997)] for computing a critical point. Importantly, under practical assumptions, we prove that every accumulation point of the sequence generated by pDCA is a d-stationary point almost surely. Numerical experiment results on several important examples of nonsmooth DC programs demonstrate the efficiency of pDCA for computing d-stationary points."}
{"id": "2601.01902", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01902", "abs": "https://arxiv.org/abs/2601.01902", "authors": ["Victory Obieke"], "title": "Energy Conserving Data Driven Discretizations for Maxwells Equations", "comment": "17 pages, 6 figures. Numerical experiments with convex solvers (PG, NAG, ADMM, CVX) for learned Maxwell stencils", "summary": "We study data-driven construction of spatial discretizations for the one-dimensional Maxwell system. Given high-fidelity training data generated by a spectral discretization, we learn a linear convolution stencil that approximates the spatial derivative operator appearing in Maxwell's equations. The stencil is obtained by solving a convex quadratic optimization problem, subject to linear constraints that enforce skew-adjointness of the discrete derivative. These constraints guarantee a semi-discrete energy identity for the resulting Maxwell system. We prove that our constraints characterize the class of skew-symmetric convolution operators and express the associated numerical wave speed and CFL restriction for the classical leapfrog scheme in terms of the learned stencil's Fourier symbol. We then compare several convex solvers for the resulting quadratic program -- projected gradient, Nesterov-accelerated gradient, ADMM, and an interior-point reference implemented in CVXPY -- and evaluate the learned schemes in time-dependent one-dimensional Maxwell simulations using a Crank--Nicolson (CN) time discretization. Our numerical experiments show that (i) energy-constrained learned stencils achieve accuracy comparable to standard central differences while exactly preserving the discrete electromagnetic energy under CN time-stepping, and (ii) ADMM and interior-point methods produce nearly identical operators, with ADMM offering a favorable tradeoff between accuracy, constraint satisfaction, and runtime."}
{"id": "2601.02134", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02134", "abs": "https://arxiv.org/abs/2601.02134", "authors": ["Florentin Goyens", "Geovani N. Grapiglia"], "title": "Complexity of quadratic penalty methods with adaptive accuracy under a PL condition for the constraints", "comment": null, "summary": "We study the quadratic penalty method (QPM) for smooth nonconvex optimization problems with equality constraints. Assuming the constraint violation satisfies the PL condition near the feasible set, we derive sharper worst-case complexity bounds for obtaining approximate first-order KKT points. When the objective and constraints are twice continuously differentiable, we show that QPM equipped with a suitable first-order inner solver requires at most $O(\\varepsilon_{0}^{-1}\\varepsilon_{1}^{-2})$ first-order oracle calls to find an $(\\varepsilon_{0},\\varepsilon_{1})$-approximate KKT point -- that is, a point that is $\\varepsilon_{0}$-approximately feasible and $\\varepsilon_{1}$-approximately stationary. Furthermore, when the objective and constraints are three times continuously differentiable, we show that QPM with a suitable second-order inner solver requires at most $O\\left(\\varepsilon_{0}^{-1/2}\\varepsilon_{1}^{-3/2}\\right)$ second-order oracle calls to find an $(\\varepsilon_{0},\\varepsilon_{1})$-approximate KKT point. We also introduce an adaptive, feasibility-aware stopping criterion for the subproblems, which relaxes the stationarity tolerance when far from feasibility. This rule preserves all theoretical guarantees while substantially reducing computational effort in practice."}
{"id": "2601.01965", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01965", "abs": "https://arxiv.org/abs/2601.01965", "authors": ["Roland Becker", "Maximilian Brunner", "Paula Hilbert", "Michael Innerberger", "Dirk Praetorius"], "title": "Multigoal-oriented adaptive finite element method with convergence rates", "comment": null, "summary": "We formulate and analyze a goal-oriented adaptive finite element method for a symmetric linear elliptic partial differential equation (PDE) that can simultaneously deal with multiple linear goal functionals. In each step of the algorithm, only two linear finite element systems have to be solved. Moreover, all finite element solutions are computed with respect to the same discrete space, while the underlying triangulations are adapted to resolve all inherent singularities simultaneously. Unlike available results for such a setting in the literature, we give a thorough convergence analysis and verify that our algorithm guarantees, in an appropriate sense, even optimal convergence rates. Numerical experiments underline the derived theoretical results."}
{"id": "2601.02207", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02207", "abs": "https://arxiv.org/abs/2601.02207", "authors": ["Arash Khojaste", "Jonathan Pearce", "Daniela Pucci de Farias", "Geoffrey Pritchard", "Golbon Zakeri"], "title": "Risk-Averse Markov Decision Processes: Applications to Electricity Grid and Reservoir Management", "comment": null, "summary": "This paper develops risk-averse models to support system operators in planning and operating the electricity grid under uncertainty from renewable power generation. We incorporate financial risk hedging using conditional value at risk (CVaR) within a Markov Decision Process (MDP) framework and propose efficient, exact solution methods for these models. In addition, we introduce a power reliability-oriented risk measure and present new, computationally efficient models for risk-averse grid planning and operations."}
{"id": "2601.01995", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.01995", "abs": "https://arxiv.org/abs/2601.01995", "authors": ["Barbara Kaltenbacher", "Paul Manns"], "title": "Locally-averaged McCormick relaxations for discretization-regularized inverse problems", "comment": null, "summary": "In this paper, by means of a standard model problem, we devise an approach to computing approximate dual bounds for use in global optimization of coefficient identification in partial differential equations (PDEs) by, e.g., (spatial) branch-and-bound methods. Linearization is achieved by a McCormick relaxation (that is, replacing the bilinear PDE term by a linear one and adding inequality constraints), combined with local averaging to reduce the number of inequalities. Optimization-based bound tightening allows us to tighten the relaxation and thus reduce the induced error. Combining this with a quantification of the discretization error and the propagated noise, we prove that the resulting discretization regularizes the inverse problem, thus leading to an overall convergent scheme. Numerical experiments illustrate the theoretical findings."}
{"id": "2601.02229", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.02229", "abs": "https://arxiv.org/abs/2601.02229", "authors": ["Andreas H Hamel"], "title": "Extended real number arithmetics via Dedekind cuts", "comment": "18 pages", "summary": "It is shown how Dedekind cuts can be used to introduce the extended real numbers along with sound arithmetic laws via one simple rule for the addition of sets. The crucial idea is that the use of the lower and the upper part of the cuts, respectively, leads to two different additions which are known in the literature as inf-addition and sup-addition. Moreover, the two resulting structures are conlinear spaces which at the same time are complete lattices with respect to the natural order. This admits the definition of pseudo-differences on the extended reals which also provide formulas for expressions like $(+\\infty) - (+\\infty)$, $(-\\infty) - (-\\infty)$. There are two major motivations: one is that proper and improper extended real-valued functions can be treated in a unified manner, the other that set-valued functions can often be represented by families of scalar functions which may include improper ones."}
{"id": "2601.02079", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.02079", "abs": "https://arxiv.org/abs/2601.02079", "authors": ["Stefano Maset"], "title": "Asymptotic condition numbers for linear ordinary differential equations: the generic real case", "comment": "This manuscript is the second half of the first version of arXiv 2507.08762. It includes in Section 5.5 a numerical example from the first version of arXiv 2507.08752", "summary": "The paper \\cite{M0} studied, for a \\emph{complex} linear ordinary differential equation $y^\\prime(t)=Ay(t)$, the long-time propagation to the solution $y(t)$ of a perturbation of the initial value. By measuring the perturbations with relative errors, this paper introduced a directional pointwise condition number, defined for a specific initial value and for a specific direction of perturbation of this initial value, and a pointwise condition number, defined for a specific initial value and the worst-case scenario for the direction of perturbation. The asymptotic (long-time) behaviors of these two condition numbers were determined. The present paper analyzes such asymptotic behaviors in depth, for a \\emph{real} linear ordinary differential equation in a generic case."}
{"id": "2601.02347", "categories": ["math.OC", "cs.DS", "cs.GT"], "pdf": "https://arxiv.org/pdf/2601.02347", "abs": "https://arxiv.org/abs/2601.02347", "authors": ["Ishani Karmarkar", "Liam O'Carroll", "Aaron Sidford"], "title": "Solving Matrix Games with Even Fewer Matrix-Vector Products", "comment": null, "summary": "We study the problem of computing an $ε$-approximate Nash equilibrium of a two-player, bilinear, zero-sum game with a bounded payoff matrix $A \\in \\mathbb{R}^{m \\times n}$, when the players' strategies are constrained to lie in simple sets. We provide algorithms which solve this problem in $\\tilde{O}(ε^{-2/3})$ matrix-vector multiplies (matvecs) in two well-studied cases: $\\ell_1$-$\\ell_1$ games, where the players' strategies are both in the probability simplex, and $\\ell_2$-$\\ell_1$ games, where the players' strategies are in the unit Euclidean ball and probability simplex respectively. These results improve upon the previous state-of-the-art complexities of $\\tilde{O}(ε^{-8/9})$ for $\\ell_1$-$\\ell_1$ and of $\\tilde{O}(ε^{-7/9})$ for $\\ell_2$-$\\ell_1$ due to [KOS '25]. In particular, our result for $\\ell_2$-$\\ell_1$, which corresponds to hard-margin support vector machines (SVMs), matches the lower bound of [KS '25] up to polylogarithmic factors."}
{"id": "2601.02108", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.02108", "abs": "https://arxiv.org/abs/2601.02108", "authors": ["Shengyue Wang", "Aihui zhou"], "title": "A quasi-orthogonal iterative method for eigenvalue problems", "comment": null, "summary": "For large-scale eigenvalue problems requiring many mutually orthogonal eigenvectors, traditional numerical methods suffer substantial computational and communication costs with limited parallel scalability, primarily due to explicit orthogonalization. To address these challenges, we propose a quasi-orthogonal iterative method that dispenses with explicit orthogonalization and orthogonal initial data. It inherently preserves quasi-orthogonality (the iterates asymptotically tend to be orthogonal) and enhances robustness against numerical perturbations. Rigorous analysis confirms its energy-decay property and convergence of energy, gradient, and iterate. Numerical experiments validate the theoretical results, demonstrate key advantages of strong robustness and high-precision numerical orthogonality preservation, and thereby position our iterative method as an efficient, stable alternative for large-scale eigenvalue computations."}
{"id": "2601.01489", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.01489", "abs": "https://arxiv.org/abs/2601.01489", "authors": ["Carsten Hartmann", "Annika Jöster", "Christof Schütte", "Alexander Sikorski", "Marcus Weber"], "title": "Importance sampling of unbounded random stopping times: computing committor functions and exit rates without reweighting", "comment": "51 pages, 7 figures", "summary": "Rare events in molecular dynamics are often related to noise-induced transitions between different macroscopic states (e.g., in protein folding). A common feature of these rare transitions is that they happen on timescales that are on average exponentially long compared to the characteristic timescale of the system, with waiting time distributions that have (sub)exponential tails and infinite support. As a result, sampling such rare events can lead to trajectories that can be become arbitrarily long, with not too low probability, which makes the reweighting of such trajectories a real challenge. Here, we discuss rare event simulation by importance sampling from a variational perspective, with a focus on applications in molecular dynamics, in particular the computation of committor functions. The idea is to design importance sampling schemes that (a) reduce the variance of a rare event estimator while controlling the average length of the trajectories and (b) that do not require the reweighting of possibly very long trajectories. In doing so, we study different stochastic control formulations for committor and mean first exit times, which we compare both from a theoretical and a computational point of view, including numerical studies of some benchmark examples."}
{"id": "2601.01248", "categories": ["math.OC", "cs.LG", "math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.01248", "abs": "https://arxiv.org/abs/2601.01248", "authors": ["Jinniao Qiu"], "title": "Stochastic Control Methods for Optimization", "comment": null, "summary": "In this work, we investigate a stochastic control framework for global optimization over both finite-dimensional Euclidean spaces and the Wasserstein space of probability measures. In the Euclidean setting, the original minimization problem is approximated by a family of regularized stochastic control problems; using dynamic programming, we analyze the associated Hamilton--Jacobi--Bellman equations and obtain tractable representations via the Cole--Hopf transform and the Feynman--Kac formula. For optimization over probability measures, we formulate a regularized mean-field control problem characterized by a master equation, and further approximate it by controlled $N$-particle systems. We establish that, as the regularization parameter tends to zero (and as the particle number tends to infinity for the optimization over probability measures), the value of the control problem converges to the global minimum of the original objective. Building on the resulting probabilistic representations, Monte Carlo-based numerical schemes are proposed and numerical experiments are reported to illustrate the practical performance of the methods and to support the theoretical convergence rates."}
