{"id": "2512.23845", "categories": ["math.PR", "math-ph", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.23845", "abs": "https://arxiv.org/abs/2512.23845", "authors": ["Sergio Cacciatori", "Batu Güneysu", "Sebastian Wündsch"], "title": "Multigraphs and Time Ordered Isserlis-Wick formulae", "comment": null, "summary": "Given a m-dimensional Gaussian process and polynomial m variables with real coefficients, we calculate the induced path odered exponenial in two different ways: one is purely algebraic in spirit and the other one is diagrammatic in spirit and uses multigraph labelings (and is inspired by the use of Feynman diagrams in quantum field theory)."}
{"id": "2512.23957", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.23957", "abs": "https://arxiv.org/abs/2512.23957", "authors": ["Kihoon Seong", "Hao Shen", "Philippe Sosoe"], "title": "Concentration and fluctuations of sine-Gordon measure around topological multi-soliton manifold", "comment": "68 pages", "summary": "We study the sine-Gordon measure defined on each homotopy class. The energy space decomposes into infinitely many such classes indexed by the topological degree $Q \\in \\mathbb{Z}$. Even though the sine-Gordon action admits no minimizer in homotopy classes with $|Q| \\ge 2$, we prove that the Gibbs measure on each class nevertheless concentrates and exhibits Ornstein-Uhlenbeck fluctuations near the multi-soliton manifold in the joint low-temperature and infinite-volume limit. Furthermore, we show that the joint distribution of the multi-soliton centers coincides with the ordered statistics of independent uniform random variables, so that each soliton's location follows a Beta distribution."}
{"id": "2512.24047", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24047", "abs": "https://arxiv.org/abs/2512.24047", "authors": ["Xinxin Chen", "Shen Lin"], "title": "Yaglom theorem for critical branching random walk on $\\mathbb{Z}^d$", "comment": "59 pages, 3 figures", "summary": "We study the critical branching random walk on $\\mathbb{Z}^d$ started from a distant point $x$ and conditioned to hit some compact set $K$ in $\\mathbb{Z}^d$. We are interested in the occupation time in $K$ and present its asymptotic behaviors in different dimensions. It is shown in this work that the occupation time is of order $\\|x\\|^{4-d}$ in dimensions $d\\leq 3$, of order $\\log\\|x\\|$ in dimension $d=4$, and of order 1 in dimensions $d\\geq 5$. The corresponding weak convergences are also established. These results answer a question raised by Le Gall and Merle (Elect. Comm. in Probab. 11 (2006), 252-265)."}
{"id": "2512.24199", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24199", "abs": "https://arxiv.org/abs/2512.24199", "authors": ["Shuhei Mano"], "title": "Gaussian free fields on Hamming graphs and lattice spin systems", "comment": "31 pages", "summary": "We discuss a class of discrete Gaussian free fields on Hamming graphs, where interactions are determined solely by the Hamming distance between vertices. The purpose of examining this class is that it differs significantly from the commonly discussed spin system on the integer lattice with nearest-neighbour interactions. After introducing general results on the partition function and covariance for the class of Gaussian free fields, we present detailed properties of some specific models. Group-theoretic arguments and the Fourier transform give some explicit results."}
{"id": "2512.23807", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.23807", "abs": "https://arxiv.org/abs/2512.23807", "authors": ["Marco Zank"], "title": "A note on the space-time variational formulation for the wave equation with source term in $L^2(Q)$", "comment": "8 pages", "summary": "We derive a variational formulation for the scalar wave equation in the second-order formulation on bounded Lipschitz domains and homogeneous initial conditions. We investigate a variational framework in a bounded space-time cylinder $Q$ with a new solution space and the test space $L^2(Q)$ for source terms in $L^2(Q)$. Using existence and uniqueness results in $H^1(Q)$, we prove that this variational setting fits the inf-sup theory, including an isomorphism as solution operator. Moreover, we show that the new solution space is not a subspace of $H^2(Q)$. This new uniqueness and solvability result is not only crucial for discretizations using space-time methods, including least-squares approaches, but also important for regularity results and the analysis of related space-time boundary integral equations, which form the basis for space-time boundary element methods."}
{"id": "2512.23804", "categories": ["math.OC", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.23804", "abs": "https://arxiv.org/abs/2512.23804", "authors": ["Zhendong Li", "Akwum Onwunta", "Bedřich Sousedík"], "title": "Stochastic Galerkin Method and Hierarchical Preconditioning for PDE-constrained Optimization", "comment": null, "summary": "We develop efficient hierarchical preconditioners for optimal control problems governed by partial differential equations with uncertain coefficients. Adopting a discretize-then-optimize framework that integrates finite element discretization, stochastic Galerkin approximation, and advanced time-discretization schemes, the approach addresses the challenge of large-scale, ill-conditioned linear systems arising in uncertainty quantification. By exploiting the sparsity inherent in generalized polynomial chaos expansions, we derive hierarchical preconditioners based on truncated stochastic expansion that strike an effective balance between computational cost and preconditioning quality. Numerical experiments demonstrate that the proposed preconditioners significantly accelerate the convergence of iterative solvers compared to existing methods, providing robust and efficient solvers for both steady-state and time-dependent optimal control applications under uncertainty."}
{"id": "2512.23979", "categories": ["math.ST", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.23979", "abs": "https://arxiv.org/abs/2512.23979", "authors": ["Sarvesh Ravichandran Iyer", "Himadri Mandal", "Dhruman Gupta", "Rushil Gupta", "Agniv Bandhyopadhyay", "Achal Bassamboo", "Varun Gupta", "Sandeep Juneja"], "title": "Fundamental limits for weighted empirical approximations of tilted distributions", "comment": "84 pages, 6 figures", "summary": "Consider the task of generating samples from a tilted distribution of a random vector whose underlying distribution is unknown, but samples from it are available. This finds applications in fields such as finance and climate science, and in rare event simulation. In this article, we discuss the asymptotic efficiency of a self-normalized importance sampler of the tilted distribution. We provide a sharp characterization of its accuracy, given the number of samples and the degree of tilt. Our findings reveal a surprising dichotomy: while the number of samples needed to accurately tilt a bounded random vector increases polynomially in the tilt amount, it increases at a super polynomial rate for unbounded distributions."}
{"id": "2512.24307", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.24307", "abs": "https://arxiv.org/abs/2512.24307", "authors": ["Anna Ben-Hamou", "Pierre Tarrago"], "title": "Universality of cutoff for independent random walks on the circle conditioned not to intersect", "comment": "40 pages, 2 figures", "summary": "In the present paper, we consider a class of Markov processes on the discrete circle which has been introduced by König, O'Connell and Roch. These processes describe movements of exchangeable interacting particles and are discrete analogues of the unitary Dyson Brownian motion: a random number of particles jump together either to the left or to the right, with trajectories conditioned to never intersect. We provide asymptotic mixing times for stochastic processes in this class as the number of particles goes to infinity, under a sub-Gaussian assumption on the random number of particles moving at each step. As a consequence, we prove that a cutoff phenomenon holds independently of the transition probabilities, subject only to the sub-Gaussian assumption and a minimal aperiodicity hypothesis. Finally, an application to dimer models on the hexagonal lattice is provided."}
{"id": "2512.23814", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.23814", "abs": "https://arxiv.org/abs/2512.23814", "authors": ["Filip Bělík", "Yanlai Chen", "Akil Narayan"], "title": "Greedy Rational Approximation for Frequency-Domain Model Reduction of Parametric LTI Systems", "comment": null, "summary": "We investigate model reduction of parametric linear time-invariant (LTI) dynamical systems. When posed in the frequency domain, this problem can be formulated as seeking a low-order rational function approximation of a high-order rational function. We propose to use a standard reduced basis method (RBM) to construct this low-order rational function. Algorithmically, this procedure is an iterative greedy approach, where the greedy objective is evaluated through an error estimator that exploits the linearity of the frequency domain representation. The greedy framework is motivated through theoretical results of rational approximability of functions. This framework provides a principled approach to rational compression of high-order rational functions, and provides a computational pathway for model reduction of parametric LTI systems."}
{"id": "2512.23843", "categories": ["math.OC", "math.DS", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.23843", "abs": "https://arxiv.org/abs/2512.23843", "authors": ["Manish Krishan Lal"], "title": "The Flow-Limit of Reflect-Reflect-Relax: Existence, Stability, and Discrete-Time Behavior", "comment": null, "summary": "We study the Reflect-Reflect-Relax (RRR) algorithm in its small-step (flow-limit) regime. In the smooth transversal setting, we show that the transverse dynamics form a hyperbolic sink, yielding exponential decay of a natural gap measure. Under uniform geometric assumptions, we construct a tubular neighborhood of the feasible manifold on which the squared gap defines a strict Lyapunov function, excluding recurrent dynamics and chaotic behavior within this basin.\n  In the discrete setting, the induced flow is piecewise constant on W-domains and supports Filippov sliding along convergent boundaries, leading to finite-time capture into a solution domain. We prove that small-step RRR is a forward-Euler discretization of this flow, so that solution times measured in rescaled units converge to a finite limit while iteration counts diverge, explaining the emergence of iteration-optimal relaxation parameters. Finally, we introduce a heuristic mesoscopic framework based on percolation and renormalization group to organize performance deterioration near the Douglas-Rachford limit."}
{"id": "2512.24042", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.24042", "abs": "https://arxiv.org/abs/2512.24042", "authors": ["Chunhao Cai"], "title": "Local Asymptotic Normality for Mixed Fractional Brownian Motion with $0<H<3/4$", "comment": null, "summary": "This paper establishes the Local Asymptotic Normality (LAN) property for the mixed fractional Brownian motion under high-frequency observations with Hurst index $H \\in (0, 3/4)$. The simultaneous estimation of the volatility and the Hurst index encounters a degeneracy problem in the Fisher information matrix."}
{"id": "2512.24352", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24352", "abs": "https://arxiv.org/abs/2512.24352", "authors": ["José M. Zapata"], "title": "Heavy-tailed distributions; extreme value theory; large deviations; ruin probabilities; solvency risk", "comment": null, "summary": "We establish sharp large deviation asymptotics for the maximum order statistic of independent and identically distributed heavy-tailed random variables, valid for all Borel subsets of the right tail. This result yields exact decay rates for exceedance probabilities at thresholds that grow faster than the natural extreme-value scaling. As an application, we derive the polynomial rate of decay of ruin probabilities in insurance portfolios where insolvency is driven by a single extreme claim."}
{"id": "2512.23829", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.23829", "abs": "https://arxiv.org/abs/2512.23829", "authors": ["Oluwatosin Akande", "Gabriel P. Langlois", "Akwum Onwunta"], "title": "Deep learning methods for inverse problems using connections between proximal operators and Hamilton-Jacobi equations", "comment": null, "summary": "Inverse problems are important mathematical problems that seek to recover model parameters from noisy data. Since inverse problems are often ill-posed, they require regularization or incorporation of prior information about the underlying model or unknown variables. Proximal operators, ubiquitous in nonsmooth optimization, are central to this because they provide a flexible and convenient way to encode priors and build efficient iterative algorithms. They have also recently become key to modern machine learning methods, e.g., for plug-and-play methods for learned denoisers and deep neural architectures for learning priors of proximal operators. The latter was developed partly due to recent work characterizing proximal operators of nonconvex priors as subdifferential of convex potentials. In this work, we propose to leverage connections between proximal operators and Hamilton-Jacobi partial differential equations (HJ PDEs) to develop novel deep learning architectures for learning the prior. In contrast to other existing methods, we learn the prior directly without recourse to inverting the prior after training. We present several numerical results that demonstrate the efficiency of the proposed method in high dimensions."}
{"id": "2512.24056", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.24056", "abs": "https://arxiv.org/abs/2512.24056", "authors": ["Wenye Li", "Hongxu Chen", "Jiacai Liu", "Ke Wei"], "title": "Policy Mirror Descent with Temporal Difference Learning: Sample Complexity under Online Markov Data", "comment": null, "summary": "This paper studies the policy mirror descent (PMD) method, which is a general policy optimization framework in reinforcement learning and can cover a wide range of policy gradient methods by specifying difference mirror maps. Existing sample complexity analysis for policy mirror descent either focuses on the generative sampling model, or the Markovian sampling model but with the action values being explicitly approximated to certain pre-specified accuracy. In contrast, we consider the sample complexity of policy mirror descent with temporal difference (TD) learning under the Markovian sampling model. Two algorithms called Expected TD-PMD and Approximate TD-PMD have been presented, which are off-policy and mixed policy algorithms respectively. Under a small enough constant policy update step size, the $\\tilde{O}(\\varepsilon^{-2})$ (a logarithm factor about $\\varepsilon$ is hidden in $\\tilde{O}(\\cdot)$) sample complexity can be established for them to achieve average-time $\\varepsilon$-optimality. The sample complexity is further improved to $O(\\varepsilon^{-2})$ (without the hidden logarithm factor) to achieve the last-iterate $\\varepsilon$-optimality based on adaptive policy update step sizes."}
{"id": "2512.24128", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.24128", "abs": "https://arxiv.org/abs/2512.24128", "authors": ["Bruno Ebner", "Daniel Hlubinka"], "title": "A goodness-of-fit test for the Zeta distribution with unknown parameter", "comment": "14 pages, 1 table", "summary": "We introduce a new goodness-of-fit test for count data on $\\mathbb{N}$ for the Zeta distribution with unknown parameter. The test is built on a Stein-type characterization that uses, as Stein operator, the infinitesimal generator of a birth-death process whose stationary distribution is Zeta. The resulting $L^2$-type statistic is shown to be omnibus consistent, and we establish the limit null behavior as well as the validity of the associated parametric bootstrap procedure. In a Monte Carlo simulation study, we compare the proposed test with the only existing Zeta-specific procedure of Meintanis (2009), as well as with more general competitors based on empirical distribution functions, kernel Stein discrepancies and other Stein-type characterizations."}
{"id": "2512.24367", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24367", "abs": "https://arxiv.org/abs/2512.24367", "authors": ["David Alonso-Gutiérrez", "Javier Martín Goñi", "Joscha Prochno"], "title": "Limit theorems for the distance of random points in $l_p^n$-balls", "comment": null, "summary": "In this paper, we prove that the Euclidean distance between two independent random vectors uniformly distributed on $l_p^n$-balls $(1 \\leq p \\leq \\infty)$ or on its boundary satisfies a central limit theorem as $n$ tends to $\\infty$. Also, we give a compact proof of the case of the sphere, which was proved by Hammersley. Furthermore, we complement our central limit theorem by providing large deviation principles for the cases $p \\geq 2$."}
{"id": "2512.23965", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.23965", "abs": "https://arxiv.org/abs/2512.23965", "authors": ["Xiaojie Wang", "Xiaoyan Zhang"], "title": "Multimodal sampling via Schrödinger-Föllmer samplers with temperatures", "comment": null, "summary": "Generating samples from complex and high-dimensional distributions is ubiquitous in various scientific fields of statistical physics, Bayesian inference, scientific computing and machine learning. Very recently, Huang et al. (IEEE Trans. Inform. Theory, 2025) proposed new Schrödinger-Föllmer samplers (SFS), based on the Euler discretization of the Schrödinger-Föllmer diffusion evolving on the unit interval $[0, 1]$. There, a convergence rate of order $\\mathcal{O}(\\sqrt{h})$ in the $L^2$-Wasserstein distance was obtained for the Euler discretization with a uniform time step-size $h>0$.\n  By incorporating a temperature parameter, different samplers are introduced in this paper, based on the Euler discretization of the Schrödinger-Föllmer process with temperatures. As revealed by numerical experiments, high temperatures are vital, particularly in sampling from multimodal distributions. Further, a novel approach of error analysis is developed for the time discretization and an enhanced convergence rate of order ${ \\mathcal{O}(h)}$ is obtained in the $L^2$-Wasserstein distance, under certain smoothness conditions on the drift. This significantly improves the existing order-half convergence in the aforementioned paper. Unlike Langevin samplers, SFS is of gradient-free, works in a unit interval $[0, 1]$ and does not require any ergodicity. Numerical experiments confirm the convergence rate and show that, the SFS substantially outperforms vanilla Langevin samplers, particularly in sampling from multimodal distributions."}
{"id": "2512.24059", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24059", "abs": "https://arxiv.org/abs/2512.24059", "authors": ["Hao Zhang", "Naoki Marumo", "Ting Kei Pong", "Akiko Takeda"], "title": "Complexity and convergence analysis of a single-loop SDCAM for Lipschitz composite optimization and beyond", "comment": null, "summary": "We develop and analyze a single-loop algorithm for minimizing the sum of a Lipschitz differentiable function $f$, a prox-friendly proper closed function $g$ (with a closed domain on which $g$ is continuous) and the composition of another prox-friendly proper closed function $h$ (whose domain is closed on which $h$ is continuous) with a continuously differentiable mapping $c$ (that is Lipschitz continuous and Lipschitz differentiable on the convex closure of the domain of $g$). Such models arise naturally in many contemporary applications, where $f$ is the loss function for data misfit, and $g$ and $h$ are nonsmooth functions for inducing desirable structures in $x$ and $c(x)$. Existing single-loop algorithms mainly focus either on the case where $h$ is Lipschitz continuous or the case where $h$ is an indicator function of a closed convex set. In this paper, we develop a single-loop algorithm for more general possibly non-Lipschitz $h$. Our algorithm is a single-loop variant of the successive difference-of-convex approximation method (SDCAM) proposed in [22]. We show that when $h$ is Lipschitz, our algorithm exhibits an iteration complexity that matches the best known complexity result for obtaining an $(ε_1,ε_2,0)$-stationary point. Moreover, we show that, by assuming additionally that dom $g$ is compact, our algorithm exhibits an iteration complexity of $\\tilde{O}(ε^{-4})$ for obtaining an $(ε,ε,ε)$-stationary point when $h$ is merely continuous and real-valued. Furthermore, we consider a scenario where $h$ does not have full domain and establish vanishing bounds on successive changes of iterates. Finally, in all three cases mentioned above, we show that one can construct a subsequence such that any accumulation point $x^*$ satisfies $c(x^*)\\in$ dom $h$, and if a standard constraint qualification holds at $x^*$, then $x^*$ is a stationary point."}
{"id": "2512.24152", "categories": ["math.ST", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.24152", "abs": "https://arxiv.org/abs/2512.24152", "authors": ["M. J. Wainwright"], "title": "Score-based sampling without diffusions: Guidance from a simple and modular scheme", "comment": null, "summary": "Sampling based on score diffusions has led to striking empirical results, and has attracted considerable attention from various research communities. It depends on availability of (approximate) Stein score functions for various levels of additive noise. We describe and analyze a modular scheme that reduces score-based sampling to solving a short sequence of ``nice'' sampling problems, for which high-accuracy samplers are known. We show how to design forward trajectories such that both (a) the terminal distribution, and (b) each of the backward conditional distribution is defined by a strongly log concave (SLC) distribution. This modular reduction allows us to exploit \\emph{any} SLC sampling algorithm in order to traverse the backwards path, and we establish novel guarantees with short proofs for both uni-modal and multi-modal densities. The use of high-accuracy routines yields $\\varepsilon$-accurate answers, in either KL or Wasserstein distances, with polynomial dependence on $\\log(1/\\varepsilon)$ and $\\sqrt{d}$ dependence on the dimension."}
{"id": "2512.24441", "categories": ["math.PR", "math.DS", "math.FA"], "pdf": "https://arxiv.org/pdf/2512.24441", "abs": "https://arxiv.org/abs/2512.24441", "authors": ["Alexander I. Bufetov"], "title": "Uniform Continuity in Distribution for Borel Transformations of Random Fields", "comment": "8 pages", "summary": "Simple sufficient conditions are given that ensure the uniform continuity in distribution for Borel transformations of random fields."}
{"id": "2512.24121", "categories": ["math.NA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.24121", "abs": "https://arxiv.org/abs/2512.24121", "authors": ["Stefano Muzzolon", "Michael Dumbser", "Olindo Zanotti", "Elena Gaburro"], "title": "High order numerical discretizations of the Einstein-Euler equations in the Generalized Harmonic formulation", "comment": null, "summary": "We propose two new alternative numerical schemes to solve the coupled Einstein-Euler equations in the Generalized Harmonic formulation. The first one is a finite difference (FD) Central Weighted Essentially Non-Oscillatory (CWENO) scheme on a traditional Cartesian mesh, while the second one is an ADER (Arbitrary high order Derivatives) discontinuous Galerkin (DG) scheme on 2D unstructured polygonal meshes. The latter, in particular, represents a preliminary step in view of a full 3D numerical relativity calculation on moving meshes. Both schemes are equipped with a well-balancing (WB) property, which allows to preserve the equilibrium of a priori known stationary solutions exactly at the discrete level. We validate our numerical approaches by successfully reproducing standard vacuum test cases, such as the robust stability, the linearized wave, and the gauge wave tests, as well as achieving long-term stable evolutions of stationary black holes, including Kerr black holes with extreme spin. Concerning the coupling with matter, modeled by the relativistic Euler equations, we perform a classical test of spherical accretion onto a Schwarzschild black hole, as well as an evolution of a perturbed non-rotating neutron star, demonstrating the capability of our schemes to operate also on the full Einstein-Euler system. Altogether, these results provide a solid foundation for addressing more complex and challenging simulations of astrophysical sources through DG schemes on unstructured 3D meshes."}
{"id": "2512.24262", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24262", "abs": "https://arxiv.org/abs/2512.24262", "authors": ["Simão N. Stelmastchuk"], "title": "Complete lift of control system", "comment": "17 pages", "summary": "We study affine control systems on smooth manifolds and their complete lifts to the tangent bundle, providing an explicit geometric description of the solutions of the lifted system. We show that, although controllability of the complete lift implies controllability of the original system, the lifted system is never controllable due to intrinsic geometric constraints. By introducing chain controllability, we prove that controllability of the original system guarantees chain controllability of its complete lift."}
{"id": "2512.24378", "categories": ["math.ST", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.24378", "abs": "https://arxiv.org/abs/2512.24378", "authors": ["Konstantin Yakovlev", "Anna Markovich", "Nikita Puchkin"], "title": "Implicit score matching meets denoising score matching: improved rates of convergence and log-density Hessian estimation", "comment": "52 pages", "summary": "We study the problem of estimating the score function using both implicit score matching and denoising score matching. Assuming that the data distribution exhibiting a low-dimensional structure, we prove that implicit score matching is able not only to adapt to the intrinsic dimension, but also to achieve the same rates of convergence as denoising score matching in terms of the sample size. Furthermore, we demonstrate that both methods allow us to estimate log-density Hessians without the curse of dimensionality by simple differentiation. This justifies convergence of ODE-based samplers for generative diffusion models. Our approach is based on Gagliardo-Nirenberg-type inequalities relating weighted $L^2$-norms of smooth functions and their derivatives."}
{"id": "2512.24491", "categories": ["math.PR", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2512.24491", "abs": "https://arxiv.org/abs/2512.24491", "authors": ["Graeme Baker", "Ankita Chatterjee"], "title": "Minimal Solutions to the Skorokhod Reflection Problem Driven by Jump Processes and an Application to Reinsurance", "comment": null, "summary": "We consider a reflected process in the positive orthant driven by an exogenous jump process. For a given input process, we show that there exists a unique minimal strong solution to the given particle system up until a certain maximal stopping time, which is stated explicitly in terms of the dual formulation of a linear programming problem associated with the state of the system. We apply this model to study the ruin time of interconnected insurance firms, where the stopping time can be interpreted as the failure time of a reinsurance agreement between the firms. Our work extends the analysis of the particle system in Baker, Hambly, and Jettkant (2025) to the case of jump driving processes, and the existence result of Reiman (1984) beyond the case of sub-stochastic reflection matrices."}
{"id": "2512.24127", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24127", "abs": "https://arxiv.org/abs/2512.24127", "authors": ["Alessia Lucca", "Michael Dumbser"], "title": "Structure-preserving schemes for nonlinear symmetric hyperbolic and thermodynamically compatible systems of partial differential equations", "comment": null, "summary": "This paper aims at developing exactly energy-conservative and structure-preserving finite volume schemes for the discretisation of first-order symmetric-hyperbolic and thermodynamically compatible (SHTC) systems of partial differential equations in continuum physics. Due to their thermodynamic compatibility the class of SHTC systems satisfies an additional conservation law for the total energy and many PDE in this class of equations also satisfy stationary differential constraints (involutions). First, we propose a simple semi-discrete cell-centered HTC finite volume scheme that employs collocated grids and that is compatible with the total energy conservation law, but which does not satisfy the involutions. Second, we develop a fully discrete semi-implicit finite volume scheme that conserves total energy and which can be proven to satisfy also the involution constraints exactly at the discrete level. This method is a vertex-based staggered semi-implicit scheme that preserves the basic vector calculus identities $\\nabla \\cdot \\nabla \\times A = 0$ and $\\nabla \\times \\nabla φ= 0$ for any vector and scalar field, respectively, exactly at the discrete level and which is also exactly totally energy conservative. The main key ingredient of the proposed implicit scheme is the fact that it uses a discrete version of the symmetric-hyperbolic Godunov-form of the governing PDE system. This leads naturally to sequences of symmetric and positive definite linear algebraic systems to be solved inside an iterative fixed-point method used in each time step. We apply our new schemes to three different SHTC systems. In particular, we consider the equations of nonlinear acoustics, the nonlinear Maxwell equations in the absence of charges and a nonlinear version of the Maxwell-GLM system. We also show some numerical results to provide evidence of the stated properties of the proposed schemes."}
{"id": "2512.24291", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24291", "abs": "https://arxiv.org/abs/2512.24291", "authors": ["Xu Shi", "Yinglin Du", "Rufeng Xiao", "Rujun Jiang"], "title": "Adaptive Algorithms for Nonconvex Bilevel Optimization under PŁ Conditions", "comment": null, "summary": "Existing methods for nonconvex bilevel optimization (NBO) require prior knowledge of first- and second-order problem-specific parameters (e.g., Lipschitz constants and the Polyak-Łojasiewicz (PŁ) parameters) to set step sizes, a requirement that poses practical limitations when such parameters are unknown or computationally expensive. We introduce the Adaptive Fully First-order Bilevel Approximation (AF${}^2$BA) algorithm and its accelerated variant, A${}^2$F${}^2$BA, for solving NBO problems under the PŁ conditions. To our knowledge, these are the first methods to employ fully adaptive step size strategies, eliminating the need for any problem-specific parameters in NBO. We prove that both algorithms achieve $\\mathcal{O}(1/ε^2)$ iteration complexity for finding an $ε$-stationary point, matching the iteration complexity of existing well-tuned methods. Furthermore, we show that A${}^2$F${}^2$BA enjoys a near-optimal first-order oracle complexity of $\\tilde{\\mathcal{O}}(1/ε^2)$, matching the oracle complexity of existing well-tuned methods, and aligning with the complexity of gradient descent for smooth nonconvex single-level optimization when ignoring the logarithmic factors."}
{"id": "2512.24527", "categories": ["math.ST", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24527", "abs": "https://arxiv.org/abs/2512.24527", "authors": ["Matieyendou Lamboni"], "title": "Dimension-free estimators of gradients of functions with(out) non-independent variables", "comment": null, "summary": "This study proposes a unified stochastic framework for approximating and computing the gradient of every smooth function evaluated at non-independent variables, using $\\ell_p$-spherical distributions on $\\R^d$ with $d, p\\geq 1$. The upper-bounds of the bias of the gradient surrogates do not suffer from the curse of dimensionality for any $p\\geq 1$. Also, the mean squared errors (MSEs) of the gradient estimators are bounded by $K_0 N^{-1} d$ for any $p \\in [1, 2]$, and by $K_1 N^{-1} d^{2/p}$ when $2 \\leq p \\ll d$ with $N$ the sample size and $K_0, K_1$ some constants. Taking $\\max\\left\\{2, \\log(d) \\right\\} < p \\ll d$ allows for achieving dimension-free upper-bounds of MSEs. In the case where $d\\ll p< +\\infty$, the upper-bound $K_2 N^{-1} d^{2-2/p}/ (d+2)^2$ is reached with $K_2$ a constant. Such results lead to dimension-free MSEs of the proposed estimators, which boil down to estimators of the traditional gradient when the variables are independent. Numerical comparisons show the efficiency of the proposed approach."}
{"id": "2512.24522", "categories": ["math.PR", "cs.CC", "cs.DS"], "pdf": "https://arxiv.org/pdf/2512.24522", "abs": "https://arxiv.org/abs/2512.24522", "authors": ["Kritika Bhandari", "Mark Huber"], "title": "Proper colorings of a graph in linear time using a number of colors linear in the maximum degree of the graph", "comment": null, "summary": "A new algorithm for exactly sampling from the set of proper colorings of a graph is presented. This is the first such algorithm that has an expected running time that is guaranteed to be linear in the size of a graph with maximum degree \\( Δ\\) when the number of colors is greater than \\( 3.637 Δ+ 1\\)."}
{"id": "2512.24405", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24405", "abs": "https://arxiv.org/abs/2512.24405", "authors": ["Uria Mor"], "title": "Sufficient and Necessary Conditions for Eckart-Young-like Result for Tubal Tensors", "comment": null, "summary": "A valuable feature of the tubal tensor framework is that many familiar constructions from matrix algebra carry over to tensors, including SVD and notions of rank. Most importantly, it has been shown that for a specific family of tubal products, an Eckart-Young type theorem holds, i.e., the best low-rank approximation of a tensor under the Frobenius norm is obtained by truncating its tubal SVD. In this paper, we provide a complete characterization of the family of tubal products that yield an Eckart-Young type result. We demonstrate the practical implications of our theoretical findings by conducting experiments with video data and data-driven dynamical systems."}
{"id": "2512.24295", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24295", "abs": "https://arxiv.org/abs/2512.24295", "authors": ["Jiatai Tong", "Yilin Zhu", "Thiago Serra", "Samuel Burer"], "title": "Optimization over Trained Neural Networks: Going Large with Gradient-Based Algorithms", "comment": null, "summary": "When optimizing a nonlinear objective, one can employ a neural network as a surrogate for the nonlinear function. However, the resulting optimization model can be time-consuming to solve globally with exact methods. As a result, local search that exploits the neural-network structure has been employed to find good solutions within a reasonable time limit. For such methods, a lower per-iteration cost is advantageous when solving larger models. The contribution of this paper is two-fold. First, we propose a gradient-based algorithm with lower per-iteration cost than existing methods. Second, we further adapt this algorithm to exploit the piecewise-linear structure of neural networks that use Rectified Linear Units (ReLUs). In line with prior research, our methods become competitive with -- and then dominant over -- other local search methods as the optimization models become larger."}
{"id": "2512.24669", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.24669", "abs": "https://arxiv.org/abs/2512.24669", "authors": ["Wanteng Ma", "T. Tony Cai"], "title": "Nonparametric Bandits with Single-Index Rewards: Optimality and Adaptivity", "comment": null, "summary": "Contextual bandits are a central framework for sequential decision-making, with applications ranging from recommendation systems to clinical trials. While nonparametric methods can flexibly model complex reward structures, they suffer from the curse of dimensionality. We address this challenge using a single-index model, which projects high-dimensional covariates onto a one-dimensional subspace while preserving nonparametric flexibility.\n  We first develop a nonasymptotic theory for offline single-index regression for each arm, combining maximum rank correlation for index estimation with local polynomial regression. Building on this foundation, we propose a single-index bandit algorithm and establish its convergence rate. We further derive a matching lower bound, showing that the algorithm achieves minimax-optimal regret independent of the ambient dimension $d$, thereby overcoming the curse of dimensionality.\n  We also establish an impossibility result for adaptation: without additional assumptions, no policy can adapt to unknown smoothness levels. Under a standard self-similarity condition, however, we construct a policy that remains minimax-optimal while automatically adapting to the unknown smoothness. Finally, as the dimension $d$ increases, our algorithm continues to achieve minimax-optimal regret, revealing a phase transition that characterizes the fundamental limits of single-index bandit learning."}
{"id": "2512.24576", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24576", "abs": "https://arxiv.org/abs/2512.24576", "authors": ["Xuanang Hu", "Vladimir V. Ulyanov", "Hanchao Wang"], "title": "The Dual Majorizing Measure Theorem for Canonical Processes", "comment": null, "summary": "We completely characterize the boundedness of the log-concave-tailed canonical processes. The corresponding new majorizing measure theorem for log-concave-tailed canonical processes is proved using the new tree structure. Moreover, we introduce the new growth condition. Combining this condition with the dual majorizing measure theorem proven in the paper, we have developed a polynomial-time algorithm for computing expected supremum of the log-concave canonical processes."}
{"id": "2512.24456", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24456", "abs": "https://arxiv.org/abs/2512.24456", "authors": ["Gentian Zavalani"], "title": "Fast high-order spectral solvers for PDEs on triangulated surfaces with applications to deforming surfaces", "comment": "36 pages, 22 figures", "summary": "In this paper, we extend the classical quadrilateral based hierarchical Poincaré-Steklov (HPS) framework to triangulated geometries. Traditionally, the HPS method takes as input an unstructured, high-order quadrilateral mesh and relies on tensor-product spectral discretizations on each element. To overcome this restriction, we introduce two complementary high-order strategies for triangular elements: a reduced quadrilateralization approach which is straightforward to implement, and triangle based spectral element method based on Dubiner polynomials. We show numerically that these extensions preserve the spectral accuracy, efficiency, and fast direct-solver structure of the HPS framework. The method is further extended to time dependent and evolving surfaces, and its performance is demonstrated through numerical experiments on reaction-diffusion systems, and geometry driven surface evolution."}
{"id": "2512.24302", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24302", "abs": "https://arxiv.org/abs/2512.24302", "authors": ["Hauke Brinkop", "Hua Chen", "Lin Chen", "Klaus Jansen", "Guochuan Zhang"], "title": "Approximation algorithms for integer programming with resource augmentation", "comment": null, "summary": "The classic algorithm [Papadimitriou, J.ACM '81] for IPs has a running time $n^{O(m)}(m\\cdot\\max\\{Δ,\\|\\textbf{b}\\|_{\\infty}\\})^{O(m^2)}$, where $m$ is the number of constraints, $n$ is the number of variables, and $Δ$ and $\\|\\textbf{b}\\|_{\\infty}$ are, respectively, the largest absolute values among the entries in the constraint matrix and the right-hand side vector of the constraint. The running time is exponential in $m$, and becomes pseudo-polynomial if $m$ is a constant. In recent years, there has been extensive research on FPT (fixed parameter tractable) algorithms for the so-called $n$-fold IPs, which may possess a large number of constraints, but the constraint matrix satisfies a specific block structure. It is remarkable that these FPT algorithms take as parameters $Δ$ and the number of rows and columns of some small submatrices. If $Δ$ is not treated as a parameter, then the running time becomes pseudo-polynomial even if all the other parameters are taken as constants.\n  This paper explores the trade-off between time and accuracy in solving an IP. We show that, for arbitrary small $\\varepsilon>0$, there exists an algorithm for IPs with $m$ constraints that runs in ${f(m,\\varepsilon)}\\cdot\\textnormal{poly}(|I|)$ time, and returns a near-feasible solution that violates the constraints by at most $\\varepsilonΔ$. Furthermore, for $n$-fold IPs, we establish a similar result -- our algorithm runs in time that depends on the number of rows and columns of small submatrices together with $1/\\varepsilon$, and returns a solution that slightly violates the constraints. Meanwhile, both solutions guarantee that their objective values are no worse than the corresponding optimal objective values satisfying the constraints. As applications, our results can be used to obtain additive approximation schemes for multidimensional knapsack as well as scheduling."}
{"id": "2512.24701", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2512.24701", "abs": "https://arxiv.org/abs/2512.24701", "authors": ["Youngjo Lee"], "title": "Reformulating Confidence as Extended Likelihood", "comment": null, "summary": "Fisher's fiducial probability has recently received renewed attention under the name confidence. In this paper, we reformulate it within an extended-likelihood framework, a representation that helps to resolve many long-standing controversies. The proposed formulation accommodates multi-dimensional parameters and shows how higher-order approximations can be used to refine standard asymptotic confidence statements."}
{"id": "2512.24599", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.24599", "abs": "https://arxiv.org/abs/2512.24599", "authors": ["Hung D. Nguyen", "Kihoon Seong"], "title": "Polynomial mixing for the stochastic Schrödinger equation with large damping in the whole space", "comment": null, "summary": "We study the long-time mixing behavior of the stochastic nonlinear Schrödinger equation in $\\mathbb{R}^d$, $d\\le 3$. It is well known that, under a sufficiently strong damping force, the system admits unique ergodicity, although the rate of convergence toward equilibrium has remained unknown. In this work, we address the mixing property in the regime of large damping and establish that solutions are attracted toward the unique invariant probability measure at polynomial rates of arbitrary order. Our approach is based on a coupling strategy with pathwise Strichartz estimates."}
{"id": "2512.24523", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24523", "abs": "https://arxiv.org/abs/2512.24523", "authors": ["Kingsley Yeon", "Steven B. Damelin", "Michael Werman"], "title": "Exponential Convergence of Deep Composite Polynomial Approximation for Cusp-Type Functions", "comment": null, "summary": "We investigate deep composite polynomial approximations of continuous but non-differentiable functions with algebraic cusp singularities. The functions in focus consist of finitely many cusp terms of the form $|x-a_j|^{α_j}$ with rational exponents $α_j\\in(0,1)$ on a real-analytic background. We propose a constructive approximation scheme that combines a division-free polynomial iteration for fractional powers with an outer layer for the analytic polynomial fitting. Our main result shows that this composite structure achieves exponential convergence in the the number of scalar coefficients in the inner and outer polynomial layers. Specifically, the $L^p([-1,1])$ approximation error, decays exponentially with respect to the parameter budget, in contrast to the algebraic rates obtained by classical single-layer polynomial approximation for cusp-type functions. Numerical experiments for both single and multiple cusp configurations confirm the theoretical rates and demonstrate the parameter efficiency of deep composite polynomial constructions."}
{"id": "2512.24313", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24313", "abs": "https://arxiv.org/abs/2512.24313", "authors": ["Grégoire Lambrecht", "Mathieu Laurière"], "title": "Discrete-Time Mean Field Type Games: Probabilistic Setup", "comment": null, "summary": "We introduce a general probabilistic framework for discrete-time, infinite-horizon discounted Mean Field Type Games (MFTGs) with both global common noise and team-specific common noises. In our model, agents are allowed to use randomized actions, both at the individual level and at the team level. We formalize the concept of Mean Field Markov Games (MFMGs) and establish a connection between closed-loop policies in MFTGs and Markov policies in MFMGs through different layers of randomization. By leveraging recent results on infinite-horizon discounted games with infinite compact state-action spaces, we prove the existence of an optimal closed-loop policy for the original MFTG when the state spaces are at most countable and the action spaces are general Polish spaces. We also present an example satisfying our assumptions, called Mean Field Drift of Intentions, where the dynamics are strongly randomized, and we establish the existence of a Nash equilibrium using our theoretical results."}
{"id": "2512.24860", "categories": ["math.ST", "cs.CC", "cs.IT"], "pdf": "https://arxiv.org/pdf/2512.24860", "abs": "https://arxiv.org/abs/2512.24860", "authors": ["Deniz Akdemir"], "title": "Approximate Computation via Le Cam Simulability", "comment": null, "summary": "We propose a decision-theoretic framework for computational complexity, complementary to classical theory: moving from syntactic exactness (Turing / Shannon) to semantic simulability (Le Cam). While classical theory classifies problems by the cost of exact solution, modern computation often seeks only decision-valid approximations. We introduce a framework where \"computation\" is viewed as the efficient simulation of a target statistical experiment within a bounded risk distortion (Le Cam deficiency).\n  We formally define computational deficiency ($δ_{\\text{poly}}$) and use it to construct the complexity class LeCam-P (Decision-Robust Polynomial Time), characterizing problems that may be syntactically hard but semantically easy to approximate. We show that classical Karp reductions can be viewed as zero-deficiency simulations, and that approximate reductions correspond to bounded deficiency. Furthermore, we establish the No-Free-Transfer Inequality, showing that strictly invariant representations inevitably destroy decision-relevant information. This framework offers a statistical perspective on approximation theory, bridging the gap between algorithmic complexity and decision theory."}
{"id": "2512.24734", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24734", "abs": "https://arxiv.org/abs/2512.24734", "authors": ["Liping Li", "Zhangjie Wang"], "title": "From boundary random walks to Feller's Brownian Motions", "comment": null, "summary": "We establish an invariance principle connecting boundary random walks on $\\mathbb N$ with Feller's Brownian motions on $[0,\\infty)$. A Feller's Brownian motion is a Feller process on $[0,\\infty)$ whose excursions away from the boundary $0$ coincide with those of a killed Brownian motion, while its behavior at the boundary is characterized by a quadruple $(p_1,p_2,p_3,p_4)$. This class encompasses many classical models, including absorbed, reflected, elastic, and sticky Brownian motions, and further allows boundary jumps from $0$ governed by the measure $p_4$. For any Feller's Brownian motion that is not purely driven by jumps at the boundary, we construct a sequence of boundary random walks whose appropriately rescaled processes converge weakly to the given Feller's Brownian motion."}
{"id": "2512.24567", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24567", "abs": "https://arxiv.org/abs/2512.24567", "authors": ["Hannes Vandecasteele", "Nicholas Karris", "Alexander Cloninger", "Ioannis G. Kevrekidis"], "title": "Newton-Krylov Methods for Computing Steady States of Particle Timesteppers via Optimal Transport", "comment": null, "summary": "Timesteppers constitute a powerful tool in modern computational science and engineering. Although they are typically used to advance the system forward in time, they can also be viewed as nonlinear mappings that implicitly encode steady states and stability information. In this work, we present an extension of the matrix-free framework for calculating, via timesteppers, steady states of deterministic systems to stochastic particle simulations, where intrinsic randomness prevents direct steady state extraction. By formulating stochastic timesteppers in the language of optimal transport, we reinterpret them as operators acting on probability measures rather than on individual particle trajectories. This perspective enables the construction of smooth cumulative- and inverse-cumulative-distribution-function ((I)CDF) timesteppers that evolve distributions rather than particles. Combined with matrix-free Newton-Krylov solvers, these smooth timesteppers allow efficient computation of steady-state distributions even under high stochastic noise. We perform an error analysis quantifying how noise affects finite-difference Jacobian action approximations, and demonstrate that convergence can be obtained even in high noise regimes. Finally, we introduce higher-dimensional generalizations based on smooth CDF-related representations of particles and validate their performance on a non-trivial two-dimensional distribution. Together, these developments establish a unified variational framework for computing meaningful steady states of both deterministic and stochastic timesteppers."}
{"id": "2512.24335", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24335", "abs": "https://arxiv.org/abs/2512.24335", "authors": ["Manish Krishan Lal"], "title": "Backpropagation from KL Projections: Differential and Exact I-Projection Correspondences", "comment": null, "summary": "We establish two exact correspondences between reverse-mode automatic differentiation (backpropagation evaluated at a fixed forward pass) and compositions of projection maps in Kullback--Leibler (KL) geometry. In both settings, message passing defined by alternating KL projections enforces agreement and factorization constraints. In the first setting, backpropagation arises as the differential of a KL projection map on a delta-lifted factorization. In the second setting, on complete and decomposable sum--product networks, backpropagation coincides with exact probabilistic inference, and the backward values admit an interpretation as Lagrange multipliers of a KL I-projection problem."}
{"id": "2512.24999", "categories": ["math.ST", "cs.LG", "math.NA", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.24999", "abs": "https://arxiv.org/abs/2512.24999", "authors": ["Seunghoon Paik", "Kangjie Zhou", "Matus Telgarsky", "Ryan J. Tibshirani"], "title": "Basic Inequalities for First-Order Optimization with Applications to Statistical Risk Analysis", "comment": "47 pages, 3 figures (7 subfigures)", "summary": "We introduce \\textit{basic inequalities} for first-order iterative optimization algorithms, forming a simple and versatile framework that connects implicit and explicit regularization. While related inequalities appear in the literature, we isolate and highlight a specific form and develop it as a well-rounded tool for statistical analysis. Let $f$ denote the objective function to be optimized. Given a first-order iterative algorithm initialized at $θ_0$ with current iterate $θ_T$, the basic inequality upper bounds $f(θ_T)-f(z)$ for any reference point $z$ in terms of the accumulated step sizes and the distances between $θ_0$, $θ_T$, and $z$. The bound translates the number of iterations into an effective regularization coefficient in the loss function. We demonstrate this framework through analyses of training dynamics and prediction risk bounds. In addition to revisiting and refining known results on gradient descent, we provide new results for mirror descent with Bregman divergence projection, for generalized linear models trained by gradient descent and exponentiated gradient descent, and for randomized predictors. We illustrate and supplement these theoretical findings with experiments on generalized linear models."}
{"id": "2512.24779", "categories": ["math.PR", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2512.24779", "abs": "https://arxiv.org/abs/2512.24779", "authors": ["Jan Lukas Igelbrink", "Charline Smadi", "Anton Wakolbinger"], "title": "The tournament ratchet's clicktime process, and metastability in a Moran model", "comment": null, "summary": "Muller's ratchet, in its prototype version, models a haploid, asexual population whose size~$N$ is constant over the generations. Slightly deleterious mutations are acquired along the lineages at a constant rate, and individuals carrying less mutations have a selective advantage. In the classical variant, an individual's selective advantage is proportional to the difference between the population average and the individual's mutation load, whereas in the ratchet with {\\em tournament selection} only the signs of the differences of the individual mutation loads matter. In a parameter regime which leads to slow clicking (i.e. to a loss of the currently fittest class at a rate $\\ll 1/N$) we prove that the rescaled process of click times of the tournament ratchet converges as $N\\to \\infty$ to a Poisson process. Central ingredients in the proof are a thorough analysis of the metastable behaviour of a two-type Moran model with selection and deleterious mutation (which describes the size of the fittest class up to its extinction time) and a lower estimate on the size of the new fittest class at a clicktime."}
{"id": "2512.24647", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24647", "abs": "https://arxiv.org/abs/2512.24647", "authors": ["Qiling Gu", "Wenlong Zhang", "Zhidong Zhang"], "title": "Solving the inverse Source Problems for wave equation with final time measurements by a data driven approach", "comment": null, "summary": "This paper develops a discrete data-driven approach for solving the inverse source problem of the wave equation with final time measurements. Focusing on the $L^2$-Tikhonov regularization method, we analyze its convergence under two different noise models, using noisy discrete spatial observations. By exploiting the spectral decomposition of the forward operator and introducing a noise separation technique into the variational framework, we establish error bounds for the reconstructed solution $u$ and the source term $f$ without requiring classical source conditions. Moreover, an expected convergence rate for the source error is derived in a weaker topology. We also extend the analysis to the fully discrete case with finite element discretization, showing that the overall error depends only on the noise level, regularization parameter, time step size, and spatial mesh size. These estimates provide a basis for selecting the optimal regularization parameter in a data-driven manner, without a priori information. Numerical experiments validate the theoretical results and demonstrate the efficiency of the proposed algorithm."}
{"id": "2512.24483", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24483", "abs": "https://arxiv.org/abs/2512.24483", "authors": ["Liyuan Liang", "Yilong Song", "Kun Yuan"], "title": "Decentralized Optimization over Time-Varying Row-Stochastic Digraphs", "comment": null, "summary": "Decentralized optimization over directed graphs is essential for applications such as robotic swarms, sensor networks, and distributed learning. In many practical scenarios, the underlying network is a Time-Varying Broadcast Network (TVBN), where only row-stochastic mixing matrices can be constructed due to inaccessible out-degree information. Achieving exact convergence over TVBNs has remained a long-standing open question, as the limiting distribution of time-varying row-stochastic mixing matrices depends on unpredictable future graph realizations, rendering standard bias-correction techniques infeasible.\n  This paper resolves this open question by developing the first algorithm that achieves exact convergence using only time-varying row-stochastic matrices. We propose PULM (Pull-with-Memory), a gossip protocol that attains average consensus with exponential convergence by alternating between row-stochastic mixing and local adjustment. Building on PULM, we develop PULM-DGD, which converges to a stationary solution at $\\mathcal{O}(\\ln(T)/T)$ for smooth nonconvex objectives. Our results significantly extend decentralized optimization to highly dynamic communication environments."}
{"id": "2512.24807", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.24807", "abs": "https://arxiv.org/abs/2512.24807", "authors": ["Soobin Cho", "Panki Kim", "Renming Song", "Zoran Vondraček"], "title": "Heat kernel estimates for Markov processes with jump kernels blowing-up at the boundary", "comment": "51 pages", "summary": "In this paper, we study purely discontinuous symmetric Markov processes on closed subsets of ${\\mathbb R}^d$, $d\\ge 1$, with jump kernels of the form $J(x,y)=|x-y|^{-d-α}{\\mathcal B}(x,y)$, $α\\in (0,2)$, where the function ${\\mathcal B}(x,y)$ may blow up at the boundary of the state space. This extends the framework developed recently for conservative self-similar Markov processes on the upper half-space to a broader geometric setting. Examples of Markov processes that fall into our general framework include traces of isotropic $α$-stable processes in $C^{1,\\rm Dini}$ sets, processes in Lipschitz sets arising in connection with the nonlocal Neumann problem, and a large class of resurrected self-similar processes in the closed upper half-space.\n  We establish sharp two-sided heat kernel estimates for these Markov processes. A fundamental difficulty in accomplishing this task is that, in contrast to the existing literature on heat kernels for jump processes, the tails of the associated jump measures in our setting are not uniformly bounded. Thus, standard techniques in the existing literature used to study heat kernels are not applicable. To overcome this obstacle, we employ recently developed weighted functional inequalities specifically designed for jump kernels blowing up at the boundary."}
{"id": "2512.24714", "categories": ["math.NA", "math.PR", "q-fin.CP"], "pdf": "https://arxiv.org/pdf/2512.24714", "abs": "https://arxiv.org/abs/2512.24714", "authors": ["Xiang Gao", "Cody Hyndman"], "title": "Boundary error control for numerical solution of BSDEs by the convolution-FFT method", "comment": "15 pages, 3 figures, 1 table", "summary": "We first review the convolution fast-Fourier-transform (CFFT) approach for the numerical solution of backward stochastic differential equations (BSDEs) introduced in (Hyndman and Oyono Ngou, 2017). We then propose a method for improving the boundary errors obtained when valuing options using this approach. We modify the damping and shifting schemes used in the original formulation, which transforms the target function into a bounded periodic function so that Fourier transforms can be applied successfully. Time-dependent shifting reduces boundary error significantly. We present numerical results for our implementation and provide a detailed error analysis showing the improved accuracy and convergence of the modified convolution method."}
{"id": "2512.24623", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24623", "abs": "https://arxiv.org/abs/2512.24623", "authors": ["Naoki Ito"], "title": "A Study on the Algorithm and Implementation of SDPT3", "comment": "34 pages", "summary": "This technical report presents a comprehensive study of SDPT3, a widely used open-source MATLAB solver for semidefinite-quadratic-linear programming, which is based on the interior-point method. It includes a self-contained and consistent description of the algorithm, with mathematical notation carefully aligned with the implementation. The aim is to offer a clear and structured reference for researchers and developers seeking to understand or build upon the implementation of SDPT3."}
{"id": "2512.24910", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.24910", "abs": "https://arxiv.org/abs/2512.24910", "authors": ["Eric Cator", "Pablo A. Ferrari"], "title": "Gibbs conditioning principle for log-concave independent random variables", "comment": "14 pages", "summary": "Let $ν_1,ν_2,\\dots$ be a sequence of probabilities on the nonnegative integers, and $X=(X_1,X_2, \\dots)$ be a sequence of independent random variables $X_i$ with law $ν_i$. For $λ>0$ denote $Z^λ_i:= \\sum_x λ^xν_i(x)$ and $λ^{\\max}:= \\sup\\{λ>0: Z^λ_i<\\infty \\text{ for all }i\\}$, and assume $λ^{\\max}>1$. For $λ<λ^{\\max}$, define the tilted probability $ν_i^λ(x):= λ^xν_i(x)/Z^λ_i$, and let $X^λ$ be a sequence of independent variables $X^λ_i$ with law $ν^λ_i$, and denote $S^λ_n:= X^λ_1+\\dots+X^λ_n$, with $S_n=S^1_n$. Choose $λ^*\\in(1,λ^{\\max})$ and denote $R^*_n:= E (S^{λ^*}_n)$. The Gibbs Conditioning Principle (GCP) holds if $P(X\\in\\cdot|S_n>R^*_n)$ converges weakly to the law of $X^{λ^*}$, as $n\\to\\infty$. We prove the GCP for log-concave $ν_i$'s, meaning $ν_i(x+1)\\,ν_i(x-1) \\le ( ν_i(x))^2$, subject to a technical condition that prevents condensation. The canonical measures are the distributions of the first $n$ variables, conditioned on their sum being $k$. Efron's theorem states that for log-concave $ν_i$'s, the canonical measures are stochastically ordered with respect to $k$. This, in turn, leads to the ordering of the conditioned tilted measures $P(X^λ\\in\\cdot|S^λ_n>R^*_n)$ in terms of $λ$. This ordering is a fundamental component of our proof."}
{"id": "2512.24875", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24875", "abs": "https://arxiv.org/abs/2512.24875", "authors": ["Weizhu Bao", "Yifei Li", "Wenjun Ying", "Yulin Zhang"], "title": "A structure-preserving parametric approximation for anisotropic geometric flows via an $α$-surface energy matrix", "comment": null, "summary": "We propose a structure-preserving parametric approximation for geometric flows with general anisotropic effects. By introducing a hyperparameter $α$, we construct a unified surface energy matrix $\\hat{\\boldsymbol{G}}_k^α(θ)$ that encompasses all existing formulations of surface energy matrices, and apply it to anisotropic curvature flow. We prove that $α=-1$ is the unique choice achieving optimal energy stability under the necessary and sufficient condition $3\\hatγ(θ)\\geq\\hatγ(θ-π)$, while all other $α\\neq-1$ require strictly stronger conditions. The framework extends naturally to general anisotropic geometric flows through a unified velocity discretization that ensures energy stability. Numerical experiments validate the theoretical optimality of $α=-1$ and demonstrate the effectiveness and robustness."}
{"id": "2512.24640", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24640", "abs": "https://arxiv.org/abs/2512.24640", "authors": ["Xiaochi Wu"], "title": "A Differential Game with Symmetric Incomplete Information on Probabilistic Initial Condition and with Signal Revelation", "comment": null, "summary": "In this paper, we investigate the existence and characterization of the value for a two-player zero-sum differential game with symmetric incomplete information on a continuum of initial positions and with signal revelation. Before the game starts, the initial position is chosen randomly according to a probability measure with compact support, and neither player is informed of the chosen initial position. However, they observe a public signal revealing the current state as soon as the trajectory of the dynamics hits a target set. We prove that, under a suitable notion of signal-dependent strategies, the value of the game exists, and the extended value function of the game is the unique viscosity solution of an associated Hamilton-Jacobi-Isaacs equation that satisfies a boundary condition."}
{"id": "2512.25001", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.25001", "abs": "https://arxiv.org/abs/2512.25001", "authors": ["Ágnes Kúsz"], "title": "The local limit of weighted spanning trees on balanced networks", "comment": "39 pages; Section 3 supersedes and partly overlaps with some parts of arXiv:2410.18269v2", "summary": "We prove that the local limit of the weighted spanning trees on any simple connected high degree almost regular sequence of electric networks is the Poisson(1) branching process conditioned to survive forever, by generalizing [NP22] and closing a gap in their proof. We also study the local statistics of the WST's on high degree almost balanced sequences, which is interesting even for the uniform spanning trees.\n  Our motivation comes from studying an interpolation $\\{\\mathsf{WST}^β(G)\\}_{β\\in [0, \\infty)}$ between UST(G) and MST(G) by WST's on a one-parameter family of random environments. This model has recently been introduced in [MSS24, Kús24], and the phases of several properties have been determined on the complete graphs.\n  We show a phase transition of $\\mathsf{WST}^{β_n}(G_n)$ regarding the local limit and expected edge overlaps for high degree almost balanced graph sequences $G_n$, without any structural assumptions on the graphs; while the expected total length is sensitive to the global structure of the graphs. Our general framework results in a better understanding even in the case of complete graphs, where it narrows the window of the phase transition of [Mak24]."}
{"id": "2512.24879", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24879", "abs": "https://arxiv.org/abs/2512.24879", "authors": ["Maria Lukacova-Medvidova", "Simon Schneider"], "title": "Random compressible Euler flows", "comment": null, "summary": "We propose a finite volume stochastic collocation method for the random Euler system. We rigorously prove the convergence of random finite volume solutions under the assumption that the discrete differential quotients remain bounded in probability. Convergence analysis combines results on the convergence of a deterministic FV method with stochastic compactness arguments due to Skorokhod and Gyöngy-Krylov."}
{"id": "2512.24676", "categories": ["math.OC", "cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2512.24676", "abs": "https://arxiv.org/abs/2512.24676", "authors": ["Kuangyu Ding", "Marie Maros", "Gesualdo Scutari"], "title": "A New Decomposition Paradigm for Graph-structured Nonlinear Programs via Message Passing", "comment": "55 pages, 14 figures", "summary": "We study finite-sum nonlinear programs whose decision variables interact locally according to a graph or hypergraph. We propose MP-Jacobi (Message Passing-Jacobi), a graph-compliant decentralized framework that couples min-sum message passing with Jacobi block updates. The (hyper)graph is partitioned into tree clusters. At each iteration, agents update in parallel by solving a cluster subproblem whose objective decomposes into (i) an intra-cluster term evaluated by a single min-sum sweep on the cluster tree (cost-to-go messages) and (ii) inter-cluster couplings handled via a Jacobi correction using neighbors' latest iterates. This design uses only single-hop communication and yields a convergent message-passing method on loopy graphs.\n  For strongly convex objectives we establish global linear convergence and explicit rates that quantify how curvature, coupling strength, and the chosen partition affect scalability and provide guidance for clustering. To mitigate the computation and communication cost of exact message updates, we develop graph-compliant surrogates that preserve convergence while reducing per-iteration complexity. We further extend MP-Jacobi to hypergraphs; in heavily overlapping regimes, a surrogate-based hyperedge-splitting scheme restores finite-time intra-cluster message updates and maintains convergence. Experiments validate the theory and show consistent improvements over decentralized gradient baselines."}
{"id": "2512.25003", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.25003", "abs": "https://arxiv.org/abs/2512.25003", "authors": ["Lukas Anzeletti", "Oleg Butkovsky", "Máté Gerencsér", "Alexander Shaposhnikov"], "title": "Uniqueness for stochastic differential equations in Hilbert spaces with irregular drift", "comment": null, "summary": "We present a versatile framework to study strong existence and uniqueness for stochastic differential equations (SDEs) in Hilbert spaces with irregular drift. We consider an SDE in a separable Hilbert space $H$ \\begin{equation*} dX_t= (A X_t + b(X_t))dt +(-A)^{-γ/2}dW_t,\\quad X_0=x_0 \\in H, \\end{equation*} where $A$ is a self-adjoint negative definite operator with purely atomic spectrum, $W$ is a cylindrical Wiener process, $b$ is $α$-Hölder continuous function $H\\to H$, and a nonnegative parameter $γ$ such that the stochastic convolution takes values in $H$. We show that this equation has a unique strong solution provided that $α> 2γ/(1+γ)$. This substantially extends the seminal work of Da Prato and Flandoli (2010) as no structural assumption on $b$ is imposed. To obtain this result, we do not use infinite-dimensional Kolmogorov equations but instead develop a new technique combining Lê's theory of stochastic sewing in Hilbert spaces, Gaussian analysis, and a method of Lasry and Lions for approximation in Hilbert spaces."}
{"id": "2512.24928", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.24928", "abs": "https://arxiv.org/abs/2512.24928", "authors": ["Dominik Stantejsky"], "title": "A finite element approach for minimizing line and surface energies arising in the study of singularities in liquid crystals", "comment": "26 pages, 20 figures", "summary": "Motivated by a problem originating in the study of defect structures in nematic liquid crystals, we describe and study a numerical algorithm for the resolution of a Plateau-like problem. The energy contains the area of a two-dimensional surface $T$ and the length of its boundary $\\partial T$ reduced by a prescribed curve to make our problem non-trivial. We additionally include an obstacle $E$ for $T$ and pose a surface energy on $E$. We present an algorithm based on the Alternating Direction Method of Multipliers that minimizes a discretized version of the energy using finite elements, generalizing existing TV-minimization methods. We study different inclusion shapes demonstrating the rich structure of minimizing configurations and provide physical interpretation of our findings for colloidal particles in nematic liquid crystal."}
{"id": "2512.24717", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24717", "abs": "https://arxiv.org/abs/2512.24717", "authors": ["Nguyen Van Tuyen", "Minh N. Dao", "Tran Van Nghi"], "title": "A proximal subgradient algorithm for constrained multiobjective DC-type optimization", "comment": null, "summary": "In this paper, we consider a class of constrained multiobjective optimization problems, where each objective function can be expressed by adding a possibly nonsmooth nonconvex function and a differentiable function with Lipschitz continuous gradient, then subtracting a weakly convex function. This encompasses multiobjective optimization problems involving difference-of-convex (DC) functions, which are prevalent in various applications due to their ability to model nonconvex problems. We first establish necessary and sufficient optimality conditions for these problems, providing a theoretical foundation for algorithm development. Building on these conditions, we propose a proximal subgradient algorithm tailored to the structure of the objectives. Under mild assumptions, the sequence generated by the proposed algorithm is bounded and each of its cluster points is a stationary solution."}
{"id": "2512.25006", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.25006", "abs": "https://arxiv.org/abs/2512.25006", "authors": ["Jungeun Park", "Douglas Rizzolo"], "title": "Limit Theorems for Fixed Point Biased Pattern Avoiding Involutions", "comment": null, "summary": "We study fixed point biased involutions that avoid a pattern. For every pattern of length three we obtain limit theorems for the asymptotic distribution of the (appropriately centered and scaled) number of fixed points of a random fixed point biased involution avoiding that pattern. When the pattern being avoided is either $321$, $132$, or $213$, we find a phase transition depending on the strength of the bias. We also obtain a limit theorem for distribution of fixed points when the pattern is $123\\cdots k(k+1)$ for any $k$ and partial results when the pattern is $(k+1)k\\cdots 321$."}
{"id": "2512.24964", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.24964", "abs": "https://arxiv.org/abs/2512.24964", "authors": ["Alessia andò", "Giusy Bosco", "Dimitri Breda", "Davide Liessi"], "title": "Approximating evolution operators of linear delay equations: a general framework for the convergence analysis", "comment": null, "summary": "We consider the problem of discretizing evolution operators of linear delay equations with the aim of approximating their spectra, which is useful in investigating the stability properties of (nonlinear) equations via the principle of linearized stability. We develop a general convergence analysis based on a reformulation of the operators by means of a fixed-point equation, providing a list of hypotheses related to the regularization properties of the equation and the convergence of the chosen approximation techniques on suitable subspaces. This framework unifies the proofs for some methods based on pseudospectral discretization, which we present here in this new form. To exemplify the generality of the framework, we also apply it to a method of weighted residuals found in the literature, which was previously lacking a formal convergence analysis."}
{"id": "2512.24736", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24736", "abs": "https://arxiv.org/abs/2512.24736", "authors": ["Zhaolin Hu"], "title": "Some Studies on Stochastic Optimization based Quantitative Risk Management", "comment": null, "summary": "Risk management often plays an important role in decision making under uncertainty. In quantitative risk management, assessing and optimizing risk metrics requires efficient computing techniques and reliable theoretical guarantees. In this paper, we introduce several topics on quantitative risk management and review some of the recent studies and advancements on the topics. We consider several risk metrics and study decision models that involve the metrics, with a main focus on the related computing techniques and theoretical properties. We show that stochastic optimization, as a powerful tool, can be leveraged to effectively address these problems."}
{"id": "2512.25030", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2512.25030", "abs": "https://arxiv.org/abs/2512.25030", "authors": ["Manisha Dhillon", "Kuldeep Kumar Kataria", "Shyan Ghosh"], "title": "Multivariate Generalized Counting Process via Gamma Subordination", "comment": null, "summary": "In this paper, we study a multivariate gamma subordinator whose components are independent gamma processes subject to a random time governed by an independent negative binomial process. We derive the explicit expressions for its joint Laplace-Stieltjes transform, its probability density function and the associated governing differential equations. Also, we study a time-changed variant of the multivariate generalized counting process where the time is changed by an independent multivariate gamma subordinator. For this time-changed process, we obtain the corresponding Lévy measure and probability mass function. Later, we discuss an application of the time-changed multivariate generalized counting process to a shock model."}
{"id": "2512.25012", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2512.25012", "abs": "https://arxiv.org/abs/2512.25012", "authors": ["Nilima Nigam"], "title": "At the intersection of Numerical Analysis and Spectral Geometry", "comment": "20 pages, 5 figures, for Proceedings of the ICM, 2026", "summary": "How do the geometric properties of a domain impact the spectrum of an operator defined on it? How do we compute accurate and reliable approximations of these spectra? The former question is studied in spectral geometry, and the latter is a central concern in numerical analysis. In this short expository survey we revisit the process of eigenvalue approximation, from the perspective of computational spectral geometry. Over the years a multitude of methods -- for discretizing the operator and for the resultant discrete system -- have been developed and analyzed in the field of numerical analysis. High-accuracy and provably convergent discretization approaches can be used to examine the interplay between the spectrum of an operator and the geometric properties of the spatial domain or manifold it is defined on. While computations have been used to guide conjectures in spectral geometry, in recent years approximation-theoretic tools and validated computations are also being used as part of proof strategies in spectral geometry.\n  Given a particular spectral feature of interest, should we discretize the original problem, or seek a reformulation? Of the many possible approximation strategies, which should we choose? These choices are inextricably linked to the objective: on the one hand, rapid, specialized methods are often ideal for conjecture formulation (prioritizing efficiency and accuracy), whereas schemes with guaranteed, computable error bounds are needed when computation is incorporated into a proof strategy. We also review instances where the demanding requirements of spectral geometry -- the need for rigorous error control or the robust calculation of higher eigenvalues -- motivate new developments in numerical analysis."}
{"id": "2512.24785", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24785", "abs": "https://arxiv.org/abs/2512.24785", "authors": ["Roberto Baldacci", "Fabio Ciccarelli", "Stefano Coniglio", "Valerio Dose", "Fabio Furini"], "title": "A first approximation algorithm for the Bin Packing Problem with Setups", "comment": null, "summary": "We study constant-factor approximation algorithms for the Bin Packing Problem with Setups (BPPS). First, we show that adaptations of classical BPP heuristics can have arbitrarily poor worst-case performance on BPPS instances. Then, we propose a two-phase heuristic for the BPPS that applies an α-approximation algorithm for the BPP to the items of each class and then performs a merging phase on the open bins. We prove that this heuristic is a 2 α-approximation algorithm for the BPPS."}
{"id": "2512.23979", "categories": ["math.ST", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.23979", "abs": "https://arxiv.org/abs/2512.23979", "authors": ["Sarvesh Ravichandran Iyer", "Himadri Mandal", "Dhruman Gupta", "Rushil Gupta", "Agniv Bandhyopadhyay", "Achal Bassamboo", "Varun Gupta", "Sandeep Juneja"], "title": "Fundamental limits for weighted empirical approximations of tilted distributions", "comment": "84 pages, 6 figures", "summary": "Consider the task of generating samples from a tilted distribution of a random vector whose underlying distribution is unknown, but samples from it are available. This finds applications in fields such as finance and climate science, and in rare event simulation. In this article, we discuss the asymptotic efficiency of a self-normalized importance sampler of the tilted distribution. We provide a sharp characterization of its accuracy, given the number of samples and the degree of tilt. Our findings reveal a surprising dichotomy: while the number of samples needed to accurately tilt a bounded random vector increases polynomially in the tilt amount, it increases at a super polynomial rate for unbounded distributions."}
{"id": "2512.25017", "categories": ["math.NA", "cs.LG", "q-fin.CP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.25017", "abs": "https://arxiv.org/abs/2512.25017", "authors": ["Chenguang Liu", "Antonis Papapantoleon", "Jasper Rou"], "title": "Convergence of the generalization error for deep gradient flow methods for PDEs", "comment": "28 pages", "summary": "The aim of this article is to provide a firm mathematical foundation for the application of deep gradient flow methods (DGFMs) for the solution of (high-dimensional) partial differential equations (PDEs). We decompose the generalization error of DGFMs into an approximation and a training error. We first show that the solution of PDEs that satisfy reasonable and verifiable assumptions can be approximated by neural networks, thus the approximation error tends to zero as the number of neurons tends to infinity. Then, we derive the gradient flow that the training process follows in the ``wide network limit'' and analyze the limit of this flow as the training time tends to infinity. These results combined show that the generalization error of DGFMs tends to zero as the number of neurons and the training time tend to infinity."}
{"id": "2512.24872", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24872", "abs": "https://arxiv.org/abs/2512.24872", "authors": ["Haibin Chen", "Yixuan Chen", "Chunyan Wang", "Qi Fan"], "title": "Tensor Based Proximal Alternating Minimization Method for A Kind of Inhomogeneous Quartic Optimization Problem", "comment": null, "summary": "In this paper, we propose an efficient numerical approach for solving a specific type of quartic inhomogeneous polynomial optimization problem inspired by practical applications. The primary contribution of this work lies in establishing an inherent equivalence between the quartic inhomogeneous polynomial optimization problem and a multilinear optimization problem (MOP). This result extends the equivalence between fourth-order homogeneous polynomial optimization and multilinear optimization in the existing literature to the equivalence between fourth-order inhomogeneous polynomial optimization and multilinear optimization. By leveraging the multi-block structure embedded within the MOP, a tensor-based proximal alternating minimization algorithm is proposed to approximate the optimal value of the quartic problem. Under mild assumptions, the convergence of the algorithm is rigorously proven. Finally, the effectiveness of the proposed algorithm is demonstrated through preliminary computational results obtained using synthetic datasets."}
{"id": "2512.24527", "categories": ["math.ST", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24527", "abs": "https://arxiv.org/abs/2512.24527", "authors": ["Matieyendou Lamboni"], "title": "Dimension-free estimators of gradients of functions with(out) non-independent variables", "comment": null, "summary": "This study proposes a unified stochastic framework for approximating and computing the gradient of every smooth function evaluated at non-independent variables, using $\\ell_p$-spherical distributions on $\\R^d$ with $d, p\\geq 1$. The upper-bounds of the bias of the gradient surrogates do not suffer from the curse of dimensionality for any $p\\geq 1$. Also, the mean squared errors (MSEs) of the gradient estimators are bounded by $K_0 N^{-1} d$ for any $p \\in [1, 2]$, and by $K_1 N^{-1} d^{2/p}$ when $2 \\leq p \\ll d$ with $N$ the sample size and $K_0, K_1$ some constants. Taking $\\max\\left\\{2, \\log(d) \\right\\} < p \\ll d$ allows for achieving dimension-free upper-bounds of MSEs. In the case where $d\\ll p< +\\infty$, the upper-bound $K_2 N^{-1} d^{2-2/p}/ (d+2)^2$ is reached with $K_2$ a constant. Such results lead to dimension-free MSEs of the proposed estimators, which boil down to estimators of the traditional gradient when the variables are independent. Numerical comparisons show the efficiency of the proposed approach."}
{"id": "2512.23804", "categories": ["math.OC", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.23804", "abs": "https://arxiv.org/abs/2512.23804", "authors": ["Zhendong Li", "Akwum Onwunta", "Bedřich Sousedík"], "title": "Stochastic Galerkin Method and Hierarchical Preconditioning for PDE-constrained Optimization", "comment": null, "summary": "We develop efficient hierarchical preconditioners for optimal control problems governed by partial differential equations with uncertain coefficients. Adopting a discretize-then-optimize framework that integrates finite element discretization, stochastic Galerkin approximation, and advanced time-discretization schemes, the approach addresses the challenge of large-scale, ill-conditioned linear systems arising in uncertainty quantification. By exploiting the sparsity inherent in generalized polynomial chaos expansions, we derive hierarchical preconditioners based on truncated stochastic expansion that strike an effective balance between computational cost and preconditioning quality. Numerical experiments demonstrate that the proposed preconditioners significantly accelerate the convergence of iterative solvers compared to existing methods, providing robust and efficient solvers for both steady-state and time-dependent optimal control applications under uncertainty."}
{"id": "2512.24889", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24889", "abs": "https://arxiv.org/abs/2512.24889", "authors": ["Yifan He", "Griffin Kearney", "Makan Fardad"], "title": "Adaptive Clutter Suppression via Convex Optimization", "comment": null, "summary": "Passive and bistatic radar systems are often limited by strong clutter and direct-path interference that mask weak moving targets. Conventional cancellation methods such as the extensive cancellation algorithm require careful tuning and can distort the delay-Doppler response. This paper introduces a convex optimization framework that adaptively synthesizes per-cell delay-Doppler filters to suppress clutter while preserving the canonical cross-ambiguity function (CAF). The approach formulates a quadratic program that minimizes distortion of the CAF surface subject to linear clutter-suppression constraints, eliminating the need for a separate cancellation stage. Monte Carlo simulations using common communication waveforms demonstrate strong clutter suppression, accurate CFAR calibration, and major detection-rate gains over the classical CAF. The results highlight a scalable, CAF-faithful method for adaptive clutter mitigation in passive radar."}
{"id": "2512.24567", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24567", "abs": "https://arxiv.org/abs/2512.24567", "authors": ["Hannes Vandecasteele", "Nicholas Karris", "Alexander Cloninger", "Ioannis G. Kevrekidis"], "title": "Newton-Krylov Methods for Computing Steady States of Particle Timesteppers via Optimal Transport", "comment": null, "summary": "Timesteppers constitute a powerful tool in modern computational science and engineering. Although they are typically used to advance the system forward in time, they can also be viewed as nonlinear mappings that implicitly encode steady states and stability information. In this work, we present an extension of the matrix-free framework for calculating, via timesteppers, steady states of deterministic systems to stochastic particle simulations, where intrinsic randomness prevents direct steady state extraction. By formulating stochastic timesteppers in the language of optimal transport, we reinterpret them as operators acting on probability measures rather than on individual particle trajectories. This perspective enables the construction of smooth cumulative- and inverse-cumulative-distribution-function ((I)CDF) timesteppers that evolve distributions rather than particles. Combined with matrix-free Newton-Krylov solvers, these smooth timesteppers allow efficient computation of steady-state distributions even under high stochastic noise. We perform an error analysis quantifying how noise affects finite-difference Jacobian action approximations, and demonstrate that convergence can be obtained even in high noise regimes. Finally, we introduce higher-dimensional generalizations based on smooth CDF-related representations of particles and validate their performance on a non-trivial two-dimensional distribution. Together, these developments establish a unified variational framework for computing meaningful steady states of both deterministic and stochastic timesteppers."}
{"id": "2512.23843", "categories": ["math.OC", "math.DS", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.23843", "abs": "https://arxiv.org/abs/2512.23843", "authors": ["Manish Krishan Lal"], "title": "The Flow-Limit of Reflect-Reflect-Relax: Existence, Stability, and Discrete-Time Behavior", "comment": null, "summary": "We study the Reflect-Reflect-Relax (RRR) algorithm in its small-step (flow-limit) regime. In the smooth transversal setting, we show that the transverse dynamics form a hyperbolic sink, yielding exponential decay of a natural gap measure. Under uniform geometric assumptions, we construct a tubular neighborhood of the feasible manifold on which the squared gap defines a strict Lyapunov function, excluding recurrent dynamics and chaotic behavior within this basin.\n  In the discrete setting, the induced flow is piecewise constant on W-domains and supports Filippov sliding along convergent boundaries, leading to finite-time capture into a solution domain. We prove that small-step RRR is a forward-Euler discretization of this flow, so that solution times measured in rescaled units converge to a finite limit while iteration counts diverge, explaining the emergence of iteration-optimal relaxation parameters. Finally, we introduce a heuristic mesoscopic framework based on percolation and renormalization group to organize performance deterioration near the Douglas-Rachford limit."}
{"id": "2512.24897", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.24897", "abs": "https://arxiv.org/abs/2512.24897", "authors": ["Wuzhe Xu", "Jiequn Han", "Rongjie Lai"], "title": "Self-Supervised Amortized Neural Operators for Optimal Control: Scaling Laws and Applications", "comment": null, "summary": "Optimal control provides a principled framework for transforming dynamical system models into intelligent decision-making, yet classical computational approaches are often too expensive for real-time deployment in dynamic or uncertain environments. In this work, we propose a method based on self-supervised neural operators for open-loop optimal control problems. It offers a new paradigm by directly approximating the mapping from system conditions to optimal control strategies, enabling instantaneous inference across diverse scenarios once trained. We further extend this framework to more complex settings, including dynamic or partially observed environments, by integrating the learned solution operator with Model Predictive Control (MPC). This yields a solution-operator learning method for closed-loop control, in which the learned operator supplies rapid predictions that replace the potentially time-consuming optimization step in conventional MPC. This acceleration comes with a quantifiable price to pay. Theoretically, we derive scaling laws that relate generalization error and sample/model complexity to the intrinsic dimension of the problem and the regularity of the optimal control function. Numerically, case studies show efficient, accurate real-time performance in low-intrinsic-dimension regimes, while accuracy degrades as problem complexity increases. Together, these results provide a balanced perspective: neural operators are a powerful novel tool for high-performance control when hidden low-dimensional structure can be exploited, yet they remain fundamentally constrained by the intrinsic dimensional complexity in more challenging settings."}
{"id": "2512.24714", "categories": ["math.NA", "math.PR", "q-fin.CP"], "pdf": "https://arxiv.org/pdf/2512.24714", "abs": "https://arxiv.org/abs/2512.24714", "authors": ["Xiang Gao", "Cody Hyndman"], "title": "Boundary error control for numerical solution of BSDEs by the convolution-FFT method", "comment": "15 pages, 3 figures, 1 table", "summary": "We first review the convolution fast-Fourier-transform (CFFT) approach for the numerical solution of backward stochastic differential equations (BSDEs) introduced in (Hyndman and Oyono Ngou, 2017). We then propose a method for improving the boundary errors obtained when valuing options using this approach. We modify the damping and shifting schemes used in the original formulation, which transforms the target function into a bounded periodic function so that Fourier transforms can be applied successfully. Time-dependent shifting reduces boundary error significantly. We present numerical results for our implementation and provide a detailed error analysis showing the improved accuracy and convergence of the modified convolution method."}
{"id": "2512.24999", "categories": ["math.ST", "cs.LG", "math.NA", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.24999", "abs": "https://arxiv.org/abs/2512.24999", "authors": ["Seunghoon Paik", "Kangjie Zhou", "Matus Telgarsky", "Ryan J. Tibshirani"], "title": "Basic Inequalities for First-Order Optimization with Applications to Statistical Risk Analysis", "comment": "47 pages, 3 figures (7 subfigures)", "summary": "We introduce \\textit{basic inequalities} for first-order iterative optimization algorithms, forming a simple and versatile framework that connects implicit and explicit regularization. While related inequalities appear in the literature, we isolate and highlight a specific form and develop it as a well-rounded tool for statistical analysis. Let $f$ denote the objective function to be optimized. Given a first-order iterative algorithm initialized at $θ_0$ with current iterate $θ_T$, the basic inequality upper bounds $f(θ_T)-f(z)$ for any reference point $z$ in terms of the accumulated step sizes and the distances between $θ_0$, $θ_T$, and $z$. The bound translates the number of iterations into an effective regularization coefficient in the loss function. We demonstrate this framework through analyses of training dynamics and prediction risk bounds. In addition to revisiting and refining known results on gradient descent, we provide new results for mirror descent with Bregman divergence projection, for generalized linear models trained by gradient descent and exponentiated gradient descent, and for randomized predictors. We illustrate and supplement these theoretical findings with experiments on generalized linear models."}
{"id": "2512.24916", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24916", "abs": "https://arxiv.org/abs/2512.24916", "authors": ["Christian Bayer", "Saifeddine Ben naamia", "Erik von Schwerin", "Raul Tempone"], "title": "A Pontryagin Maximum Principle on the Belief Space for Continuous-Time Optimal Control with Discrete Observations", "comment": null, "summary": "We study a continuous time stochastic optimal control problem under partial observations that are available only at discrete time instants. This hybrid setting, with continuous dynamics and intermittent noisy measurements, arises in applications ranging from robotic exploration and target tracking to epidemic control. We formulate the problem on the space of beliefs (information states), treating the controller's posterior distribution of the state as the state variable for decision making. On this belief space we derive a Pontryagin maximum principle that provides necessary conditions for optimality. The analysis carefully tracks both the continuous evolution of the state between observation times and the Bayesian jump updates of the belief at observation instants.\n  A key insight is a relationship between the adjoint process in our maximum principle and the gradient of the value functional on the belief space, which links the optimality conditions to the dynamic programming approach on the space of probability measures. The resulting optimality system has a prediction and update structure that is closely related to the unnormalised Zakai equation and the normalised Kushner-Stratonovich equation in nonlinear filtering.\n  Building on this analysis, we design a particle based numerical scheme to approximate the coupled forward (filter) and backward (adjoint) system. The scheme uses particle filtering to represent the evolving belief and regression techniques to approximate the adjoint, which yields a practical algorithm for computing near optimal controls under partial information. The effectiveness of the approach is illustrated on both linear and nonlinear examples and highlights in particular the benefits of actively controlling the observation process."}
{"id": "2512.24879", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24879", "abs": "https://arxiv.org/abs/2512.24879", "authors": ["Maria Lukacova-Medvidova", "Simon Schneider"], "title": "Random compressible Euler flows", "comment": null, "summary": "We propose a finite volume stochastic collocation method for the random Euler system. We rigorously prove the convergence of random finite volume solutions under the assumption that the discrete differential quotients remain bounded in probability. Convergence analysis combines results on the convergence of a deterministic FV method with stochastic compactness arguments due to Skorokhod and Gyöngy-Krylov."}
{"id": "2512.25018", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2512.25018", "abs": "https://arxiv.org/abs/2512.25018", "authors": ["Lacy M. Greening", "Santanu S. Dey", "Alan L. Erera"], "title": "Strengthening Dual Bounds for Multicommodity Capacitated Network Design with Unsplittable Flow Constraints", "comment": null, "summary": "Multicommodity capacitated network design (MCND) models can be used to optimize the consolidation of shipments within e-commerce fulfillment networks. In practice, fulfillment networks require that shipments with the same origin and destination follow the same transfer path. This unsplittable flow requirement complicates the MCND problem, requiring integer programming (IP) formulations in which binary variables replace continuous flow variables. To enhance the solvability of this variant of the MCND problem for large-scale logistics networks, this work focuses on strengthening dual bounds. We investigate the polyhedra of arc-set relaxations, and we introduce two new classes of valid inequalities that can be implemented within solution approaches. We develop one approach that dynamically adds valid inequalities to the root node of a reformulation of the MCND IP with additional valid metric inequalities. We show the effectiveness of our ideas with a comprehensive computational study using path-based fulfillment instances, constructed from data provided by a large U.S.-based e-commerce company, and the well-known arc-based Canad instances. Experiments show that our best solution approach for a practical path-based model reduces the IP gap by an average of 26.5% and 22.5% for the two largest instance groups, compared to solving the reformulation alone, demonstrating its effectiveness in improving the dual bound. In addition, experiments using only the arc-based relaxation highlight the strength of our new valid inequalities relative to the linear programming relaxation (LPR), yielding an IP-gap reduction of more than 85%."}
{"id": "2512.24916", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24916", "abs": "https://arxiv.org/abs/2512.24916", "authors": ["Christian Bayer", "Saifeddine Ben naamia", "Erik von Schwerin", "Raul Tempone"], "title": "A Pontryagin Maximum Principle on the Belief Space for Continuous-Time Optimal Control with Discrete Observations", "comment": null, "summary": "We study a continuous time stochastic optimal control problem under partial observations that are available only at discrete time instants. This hybrid setting, with continuous dynamics and intermittent noisy measurements, arises in applications ranging from robotic exploration and target tracking to epidemic control. We formulate the problem on the space of beliefs (information states), treating the controller's posterior distribution of the state as the state variable for decision making. On this belief space we derive a Pontryagin maximum principle that provides necessary conditions for optimality. The analysis carefully tracks both the continuous evolution of the state between observation times and the Bayesian jump updates of the belief at observation instants.\n  A key insight is a relationship between the adjoint process in our maximum principle and the gradient of the value functional on the belief space, which links the optimality conditions to the dynamic programming approach on the space of probability measures. The resulting optimality system has a prediction and update structure that is closely related to the unnormalised Zakai equation and the normalised Kushner-Stratonovich equation in nonlinear filtering.\n  Building on this analysis, we design a particle based numerical scheme to approximate the coupled forward (filter) and backward (adjoint) system. The scheme uses particle filtering to represent the evolving belief and regression techniques to approximate the adjoint, which yields a practical algorithm for computing near optimal controls under partial information. The effectiveness of the approach is illustrated on both linear and nonlinear examples and highlights in particular the benefits of actively controlling the observation process."}
{"id": "2512.24527", "categories": ["math.ST", "math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.24527", "abs": "https://arxiv.org/abs/2512.24527", "authors": ["Matieyendou Lamboni"], "title": "Dimension-free estimators of gradients of functions with(out) non-independent variables", "comment": null, "summary": "This study proposes a unified stochastic framework for approximating and computing the gradient of every smooth function evaluated at non-independent variables, using $\\ell_p$-spherical distributions on $\\R^d$ with $d, p\\geq 1$. The upper-bounds of the bias of the gradient surrogates do not suffer from the curse of dimensionality for any $p\\geq 1$. Also, the mean squared errors (MSEs) of the gradient estimators are bounded by $K_0 N^{-1} d$ for any $p \\in [1, 2]$, and by $K_1 N^{-1} d^{2/p}$ when $2 \\leq p \\ll d$ with $N$ the sample size and $K_0, K_1$ some constants. Taking $\\max\\left\\{2, \\log(d) \\right\\} < p \\ll d$ allows for achieving dimension-free upper-bounds of MSEs. In the case where $d\\ll p< +\\infty$, the upper-bound $K_2 N^{-1} d^{2-2/p}/ (d+2)^2$ is reached with $K_2$ a constant. Such results lead to dimension-free MSEs of the proposed estimators, which boil down to estimators of the traditional gradient when the variables are independent. Numerical comparisons show the efficiency of the proposed approach."}
{"id": "2512.24999", "categories": ["math.ST", "cs.LG", "math.NA", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.24999", "abs": "https://arxiv.org/abs/2512.24999", "authors": ["Seunghoon Paik", "Kangjie Zhou", "Matus Telgarsky", "Ryan J. Tibshirani"], "title": "Basic Inequalities for First-Order Optimization with Applications to Statistical Risk Analysis", "comment": "47 pages, 3 figures (7 subfigures)", "summary": "We introduce \\textit{basic inequalities} for first-order iterative optimization algorithms, forming a simple and versatile framework that connects implicit and explicit regularization. While related inequalities appear in the literature, we isolate and highlight a specific form and develop it as a well-rounded tool for statistical analysis. Let $f$ denote the objective function to be optimized. Given a first-order iterative algorithm initialized at $θ_0$ with current iterate $θ_T$, the basic inequality upper bounds $f(θ_T)-f(z)$ for any reference point $z$ in terms of the accumulated step sizes and the distances between $θ_0$, $θ_T$, and $z$. The bound translates the number of iterations into an effective regularization coefficient in the loss function. We demonstrate this framework through analyses of training dynamics and prediction risk bounds. In addition to revisiting and refining known results on gradient descent, we provide new results for mirror descent with Bregman divergence projection, for generalized linear models trained by gradient descent and exponentiated gradient descent, and for randomized predictors. We illustrate and supplement these theoretical findings with experiments on generalized linear models."}
