{"id": "2602.13465", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.13465", "abs": "https://arxiv.org/abs/2602.13465", "authors": ["Diego Martinez-Taboada", "Aaditya Ramdas"], "title": "Intrinsic dimension concentration inequalities for self-adjoint operators", "comment": null, "summary": "We derive novel concentration inequalities for the operator norm of the sum of self-adjoint operators that do not explicitly depend on the underlying dimension of the operator, but rather an intrinsic notion of it. Our analysis leads to tighter results (in terms of constants) and simplified proofs. Our results unify the current intrinsic-dimension and ambient-dimension inequalities under independence, strictly improving both categories of bounds (such as by Tropp and Minsker). We present a general master theorem that we instantiate to obtain specific sub-Gaussian, Hoeffding, Bernstein, Bennett, and sub-exponential type inequalities. We also establish widely applicable concentration bounds under martingale dependence that provide tighter control than existing results."}
{"id": "2602.13565", "categories": ["math.ST", "math.NA", "math.PR", "stat.OT"], "pdf": "https://arxiv.org/pdf/2602.13565", "abs": "https://arxiv.org/abs/2602.13565", "authors": ["Paromita Banerjee", "Anirban Mondal"], "title": "An Improved Milstein Method for the Numerical Solution of Multidimensional Stochastic Differential Equations", "comment": null, "summary": "Stochastic differential equations (SDEs) offer powerful and accessible mathematical models for capturing both deterministic and probabilistic aspects of dynamic behavior across a wide range of physical, financial, and social systems. However, analytical solutions for many SDEs are often unavailable, necessitating the use of numerical approximation methods. The rate of convergence of such numerical methods is of great importance, as it directly influences both computational efficiency and accuracy. This paper presents a proposed theorem, along with its proof, that facilitates the numerical evaluation of the strong (and weak) order of convergence of a numerical scheme for an SDE when the analytical solution is unavailable. Additionally, we address the challenge of numerically computing the multiple stochastic integrals required by the Milstein method to achieve improved convergence rates for multidimensional SDEs. In this context, two newly proposed numerical techniques for computing these multiple stochastic integrals are introduced and compared with existing approaches in terms of efficiency and effectiveness. The methodologies are further illustrated through simulation studies and applications to widely used financial models."}
{"id": "2602.13729", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.13729", "abs": "https://arxiv.org/abs/2602.13729", "authors": ["Benedict M. Risebrow", "Thomas B. Berrett"], "title": "Semi-supervised linear regression with missing covariates", "comment": null, "summary": "Missing values in datasets are common in applied statistics. For regression problems, theoretical work thus far has largely considered the issue of missing covariates as distinct from missing responses. However, in practice, many datasets have both forms of missingness. Motivated by this gap, we study linear regression with a labelled dataset containing missing covariates, potentially alongside an unlabelled dataset. We consider both structured (blockwise-missing) and unstructured missingness patterns, along with sparse and non-sparse regression parameters. For the non-sparse case, we provide an estimator based on imputing the missing data combined with a reweighting step. For the high-dimensional sparse case, we use a modified version of the Dantzig selector. We provide non-asymptotic upper bounds on the risk of both procedures. These are matched by several new minimax lower bounds, demonstrating the rate optimality of our estimators. Notably, even when the linear model is well-specified, our results characterise substantial differences in the minimax rates when unlabelled data is present relative to the fully supervised setting. Particular consequences of our sparse and non-sparse results include the first matching upper and lower bounds on the minimax rate for the supervised setting when either unstructured or structured missingness is present. Our theory is coupled with extensive simulations and a semi-synthetic application to the California housing dataset."}
{"id": "2602.13871", "categories": ["math.ST", "cs.IT", "cs.LG", "math.OC", "stat.AP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.13871", "abs": "https://arxiv.org/abs/2602.13871", "authors": ["Sai Ravela", "Jae Deok Kim", "Kenneth Gee", "Xingjian Yan", "Samson Mercier", "Lubna Albarghouty", "Anamitra Saha"], "title": "Ensemble-Conditional Gaussian Processes (Ens-CGP): Representation, Geometry, and Inference", "comment": "20 pages. Technical manuscrupt on representational equivalence between conditional Gaussian inference, quadratic optimization, and RKHS geometry in finite dimensions", "summary": "We formulate Ensemble-Conditional Gaussian Processes (Ens-CGP), a finite-dimensional synthesis that centers ensemble-based inference on the conditional Gaussian law. Conditional Gaussian processes (CGP) arise directly from Gaussian processes under conditioning and, in linear-Gaussian settings, define the full posterior distribution for a Gaussian prior and linear observations. Classical Kalman filtering is a recursive algorithm that computes this same conditional law under dynamical assumptions; the conditional Gaussian law itself is therefore the underlying representational object, while the filter is one computational realization. In this sense, CGP provides the probabilistic foundation for Kalman-type methods as well as equivalent formulations as a strictly convex quadratic program (MAP estimation), RKHS-regularized regression, and classical regularization. Ens-CGP is the ensemble instantiation of this object, obtained by treating empirical ensemble moments as a (possibly low-rank) Gaussian prior and performing exact conditioning. By separating representation (GP -> CGP -> Ens-CGP) from computation (Kalman filters, EnKF variants, and iterative ensemble schemes), the framework links an earlier-established representational foundation for inference to ensemble-derived priors and clarifies the relationships among probabilistic, variational, and ensemble perspectives."}
{"id": "2602.13786", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.13786", "abs": "https://arxiv.org/abs/2602.13786", "authors": ["Mukul Dwivedi", "Andreas Rupp"], "title": "A hybridizable discontinuous Galerkin method for the Ostrovsky equation", "comment": null, "summary": "This paper develops the hybridizable discontinuous Galerkin (HDG) method for the Ostrovsky equation, a nonlinear dispersive wave equation featuring both third-order dispersion and a nonlocal antiderivative term with Coriolis effect. On a bounded interval, the nonlocal operator $\\partial_x^{-1}$ is localized through an auxiliary variable $v$ satisfying $v_x=u$ together with an additional boundary constraint that ensures uniqueness. We employ a mixed first-order formulation to decompose the dispersive operator and to localize the nonlocal term, and we couple the resulting semi-discrete HDG scheme with a $θ$-time stepping method for $θ\\in [1/2,1]$. We prove $L^2$-stability for suitable stabilization parameters and derive an {\\it a priori} $L^2(Ω)$ error estimate for smooth solutions that explicitly accounts for the nonlinear convective flux.\n  Numerical examples illustrate the convergence properties and demonstrate the scheme's capability to handle smooth and non-smooth solutions, including solitary wave propagation and peaked solitary wave (peakon) propagation in the zero dispersive limit regime."}
{"id": "2602.13474", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.13474", "abs": "https://arxiv.org/abs/2602.13474", "authors": ["Benedikt Jahnel", "Jonas Köppl", "Yannic Steenbeck", "Alexander Zass"], "title": "Reversible birth-and-death dynamics in continuum: a de Bruijn-type identity for free-energy dissipation", "comment": null, "summary": "We investigate free-energy dissipation in a continuous-time birth-and-death dynamics in $\\mathbb{R}^d$. For these Markov processes, the class of reversible measures coincides with the infinite-volume Gibbs point processes for some sufficiently nice Hamiltonian. For a wide class of initial distributions, we derive a de~Bruijn-type identity that relates the time evolution of the specific relative entropy along trajectories to the Fisher information, in particular establishing the thermodynamic limit of the latter. Along the way, we analyze some fine properties of the considered dynamics, such as the existence and regularity of local densities, obtain a spatial ergodic theorem for the entropy production per unit volume, and derive a small-time exponential series expansion of the dynamics."}
{"id": "2602.13208", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13208", "abs": "https://arxiv.org/abs/2602.13208", "authors": ["Mine Yurtoğlu", "Dilara Yapışkan", "Ebenezer Bonyah", "Beyza Billur İskender Eroğlu", "Derya Avcı", "Delfim F. M. Torres"], "title": "Dynamic Analysis and Optimal Prevention Strategies for Monkeypox Spread Modeled via the Mittag--Leffler Kernel", "comment": "This is a preprint of a paper published in 'Fractal Fract.' at [https://doi.org/10.3390/fractalfract10010044]", "summary": "Monkeypox is a viral disease belonging to the smallpox family. Although it has milder symptoms than smallpox in humans, it has become a global threat in recent years, especially in African countries. Initially, incidental immunity against monkeypox was provided by smallpox vaccines. However, the eradication of smallpox over time and thus the lack of vaccination has led to the widespread and clinical importance of monkeypox. Although mathematical epidemiology research on the disease is complementary to clinical studies, it has attracted attention in the last few years. The present study aims to discuss the indispensable effects of three control strategies such as vaccination, treatment, and quarantine to prevent the monkeypox epidemic modeled via the Atangana--Baleanu operator. The main purpose is to determine optimal control measures planned to reduce the rates of exposed and infected individuals at the minimum costs. For the controlled model, the existence-uniqueness of the solutions, stability, and sensitivity analysis, and numerical optimal solutions are exhibited. The optimal system is numerically solved using the Adams-type predictor--corrector method. In the numerical simulations, the efficacy of the vaccination, treatment, and quarantine controls is evaluated in separate analyzes as single-, double-, and triple-control strategies. The results demonstrate that the most effective strategy for achieving the aimed outcome is the simultaneous application of vaccination, treatment, and quarantine controls."}
{"id": "2602.14053", "categories": ["math.ST", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.14053", "abs": "https://arxiv.org/abs/2602.14053", "authors": ["Sourabh Bhattacharya"], "title": "Mean-Square Convergence of a New Parameterized Leapfrog Scheme for Hamiltonian Systems Driven by Gaussian Process Potentials", "comment": "Feedback welcome", "summary": "This paper establishes the mean-square convergence of a new stochastic, parameterized leapfrog scheme introduced in our companion paper Mazumder et al. (2026) for Hamiltonian systems with Gaussian process potentials. We consider a one-step numerical integrator and provide a complete, rigorous analysis under minimal regularity assumptions on the Gaussian potential. The key technical contribution is identifying and exploiting the symplectic structure ingrained in our stochastic, parameterized leapfrog method. Combined with local truncation error analysis, this leads to a global error bound of O(δt) in mean-square sense. Our results establish that although the spatio-temporal model of Mazumder et al. (2026) arises as the anticipated new stochastic leapfrog solution of a system of modified (parameterized) stochastic Hamiltonian equations, the new stochastic leapfrog actually solves the traditional stochastic Hamiltonian equations, driven by Gaussian process potential."}
{"id": "2602.13841", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.13841", "abs": "https://arxiv.org/abs/2602.13841", "authors": ["Nils Margenberg", "Markus Bause"], "title": "A Monolithic hp Space-Time Multigrid Preconditioned Newton-Krylov Solver for Space-Time FEM applied to the Incompressible Navier-Stokes Equations", "comment": "26 pages, 3 figures, 5 tables", "summary": "We present a monolithic hp space-time multigrid method (hp-STMG) for tensor-product space-time finite element discretizations of the incompressible Navier-Stokes equations. We employ mapped inf-sup stable pairs $\\mathbb Q_{r+1}/\\mathbb P_{r}^{\\mathrm{disc}}$ in space and a slabwise discontinuous Galerkin DG($k$) discretization in time. The resulting fully coupled nonlinear systems are solved by Newton-GMRES preconditioned with hp-STMG, combining geometric coarsening in space with polynomial coarsening in space and time. Our main contribution is an hp-robust and practically efficient extension of space-time multigrid to Navier-Stokes: matrix-free operator evaluation is retained via column-wise, state-dependent spatial kernels; the nonlinear convective term is handled by a reduced, order-preserving time quadrature. Robustness is ensured by an inexact space-time Vanka smoother based on patch models with single time point evaluation. The method is implemented in the matrix-free multigrid framework of deal.II and demonstrates h- and p-robust convergence with robust solver performance across a range of Reynolds numbers, as well as high throughput in large-scale MPI-parallel experiments."}
{"id": "2602.13938", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.13938", "abs": "https://arxiv.org/abs/2602.13938", "authors": ["Berhane Abebe", "Mikhail Chebunin", "Artyom Kovalevskii"], "title": "Limit theorems for a class of random outer measures in infinite urn schemes", "comment": null, "summary": "An urn scheme is a probabilistic model in which balls are placed into urns sequentially and independently of each other. All balls share the same probability distribution for hitting the urns. In the simplest case, there is a finite number of urns and the probabilities of hitting each urn are equal. In an infinite urn scheme, there is a countable number of urns, and the hitting probabilities form a probability mass function on the set of urn labels, so they depend on the urn number. The statistics of interest is the number of urns with at least k balls after throwing n balls. Thus, we assume that there is a countable family of urns, and we fix the probabilities for a ball to hit each urn (the same for all balls). For an arbitrary subset A of the unit interval [0, 1], we do not consider all ball indices from 1 to n, but only those that belong to the set nA, and we study the number of urns with at least k balls after throwing the balls with indices in nA. This number is non-negative, and if the set A is empty, this number is equal to zero. Moreover, if k=1, then it satisfies the property of countable subadditivity. Hence, the number of non-empty urns for ball indices in nA, where A is an arbitrary subset of the unit interval, satisfies all the axioms of an outer measure on the unit interval. We study the properties of the statistics of interest. Our main result is a functional central limit theorem for sets A consisting of finite unions of intervals and parameterized by their boundary points. We consider applications of this theorem to elementary probabilistic models of text."}
{"id": "2602.13510", "categories": ["math.OC", "cs.GT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.13510", "abs": "https://arxiv.org/abs/2602.13510", "authors": ["Pavel Dvurechensky", "Andrea Ebner", "Johannes Carl Schnebel", "Shimrit Shtern", "Mathias Staudigl"], "title": "Stochastic variance reduced extragradient methods for solving hierarchical variational inequalities", "comment": null, "summary": "We are concerned with optimization in a broad sense through the lens of solving variational inequalities (VIs) -- a class of problems that are so general that they cover as particular cases minimization of functions, saddle-point (minimax) problems, Nash equilibrium problems, and many others. The key challenges in our problem formulation are the two-level hierarchical structure and finite-sum representation of the smooth operators in each level. For this setting, we are the first to prove convergence rates and complexity statements for variance-reduced stochastic algorithms approaching the solution of hierarchical VIs in Euclidean and Bregman setups."}
{"id": "2602.14206", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.14206", "abs": "https://arxiv.org/abs/2602.14206", "authors": ["Mona Azadkia", "Holger Dette"], "title": "Kernel Estimation Of Chatterjee's Dependence Coefficient", "comment": null, "summary": "Dette, Siburg, and Stoimenov (2013) introduced a copula-based measure of dependence, which implies independence if it vanishes and is equal to 1 if one variable is a measurable function of the other. For continuous distributions, the dependence measure also appears as stochastic limit of Chatterjee's rank correlation (Chatterjee, 2021). They proved asymptotic normality of a corresponding kernel estimator with a parametric rate of convergence. In recent work Shi, Drton, and Han (2022) revealed empirically and theoretically that under independence the asymptotic variance degenerates. In this note, we derive the correct asymptotic distribution of the kernel estimator under the null hypothesis of independence. We show that after a suitable centering and rescaling at a rate larger than $\\sqrt{n}$ (where $n$ is the sample size), the estimator is asymptotically normal. The analysis relies on a refined central limit theorem for double-indexed linear permutation statistics and accounts for boundary effects that are asymptotically non-negligible. As a consequence, we obtain a valid basis for independence testing without relying on permutations and argue that tests based on the kernel estimator detect local alternatives converging to the null at a faster rate than those detectable by Chatterjee's rank correlation."}
{"id": "2602.13843", "categories": ["math.NA", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.13843", "abs": "https://arxiv.org/abs/2602.13843", "authors": ["Nils Margenberg", "Marius Paul Bruchhäuser", "Bernhard Endtmayer"], "title": "Anisotropic hp space-time adaptivity and goal-oriented error control for convection-dominated problems", "comment": "38 pages, 13 figures, 4 tables", "summary": "We present an anisotropic goal-oriented error estimator based on the Dual Weighted Residual (DWR) method for time-dependent convection-dominated problems. Using elementwise p-anisotropic finite element spaces, the estimator is elementwise separated with respect to the single directions in space and time. This naturally leads to adaptive, anisotropic hp-refinement (h-anisotropic refinement and elementwise anisotropic p-enrichment). We employ discontinuous elements in space and time, which are well suited for problems with high Peclet numbers. Efficiency and robustness of the underlying algorithm are demonstrated for different goal functionals. The directional error indicators quantify anisotropy of the solution with respect to the goal, and produce hp-refinements that efficiently capture sharp layers. Numerical examples in up to three spatial dimensions demonstrate the superior performance of the proposed method compared to isotropic h and hp adaptive refinement using established benchmarks for convection-dominated transport."}
{"id": "2602.14137", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14137", "abs": "https://arxiv.org/abs/2602.14137", "authors": ["Xue Zhang", "Renxing Li"], "title": "Some properties of G-SVIEs", "comment": null, "summary": "In this paper, we investigated the solvability of G-SVIEs under two cases: time-varying Lipschitz coefficients and integral-Lipschitz coefficients. Using the Picard iteration method, we established the existence and uniqueness of solutions to G-SVIEs under these two conditions. Additionally, we prove the continuity of the solution with respect to parameters in parameter-dependent G-SVIEs with Lipschitz coefficients."}
{"id": "2602.13513", "categories": ["math.OC", "cs.CE", "cs.LG", "math.DS", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.13513", "abs": "https://arxiv.org/abs/2602.13513", "authors": ["Grant Norman", "Conor Rowan", "Kurt Maute", "Alireza Doostan"], "title": "Learning Gradient Flow: Using Equation Discovery to Accelerate Engineering Optimization", "comment": "44 pages, 13 figures. To be submitted to CMAME", "summary": "In this work, we investigate the use of data-driven equation discovery for dynamical systems to model and forecast continuous-time dynamics of unconstrained optimization problems. To avoid expensive evaluations of the objective function and its gradient, we leverage trajectory data on the optimization variables to learn the continuous-time dynamics associated with gradient descent, Newton's method, and ADAM optimization. The discovered gradient flows are then solved as a surrogate for the original optimization problem. To this end, we introduce the Learned Gradient Flow (LGF) optimizer, which is equipped to build surrogate models of variable polynomial order in full- or reduced-dimensional spaces at user-defined intervals in the optimization process. We demonstrate the efficacy of this approach on several standard problems from engineering mechanics and scientific machine learning, including two inverse problems, structural topology optimization, and two forward solves with different discretizations. Our results suggest that the learned gradient flows can significantly expedite convergence by capturing critical features of the optimization trajectory while avoiding expensive evaluations of the objective and its gradient."}
{"id": "2602.14342", "categories": ["math.ST", "cs.DS", "cs.LG", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.14342", "abs": "https://arxiv.org/abs/2602.14342", "authors": ["Fan Chen", "Sinho Chewi", "Constantinos Daskalakis", "Alexander Rakhlin"], "title": "High-accuracy log-concave sampling with stochastic queries", "comment": null, "summary": "We show that high-accuracy guarantees for log-concave sampling -- that is, iteration and query complexities which scale as $\\mathrm{poly}\\log(1/δ)$, where $δ$ is the desired target accuracy -- are achievable using stochastic gradients with subexponential tails. Notably, this exhibits a separation with the problem of convex optimization, where stochasticity (even additive Gaussian noise) in the gradient oracle incurs $\\mathrm{poly}(1/δ)$ queries. We also give an information-theoretic argument that light-tailed stochastic gradients are necessary for high accuracy: for example, in the bounded variance case, we show that the minimax-optimal query complexity scales as $Θ(1/δ)$. Our framework also provides similar high accuracy guarantees under stochastic zeroth order (value) queries."}
{"id": "2602.14268", "categories": ["math.NA", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.14268", "abs": "https://arxiv.org/abs/2602.14268", "authors": ["L. Banas", "D. Breit", "A. Chaudhary", "A. Prohl"], "title": "A Higher Order Discretization for the Stochastic Navier--Stokes equations with additive Noise", "comment": null, "summary": "We propose a new higher-order time discretization scheme for the stochastic Navier--Stokes equations with additive noise, where its velocity and pressure approximates converge at strong rate $1.5$ in probability. The construction rests on its reformulation as a random PDE for the transform $y = u- ΦW$, and different higher order numerical quadrature rules for the diffusion and the drift part. The theoretical findings are supported by numerical simulations."}
{"id": "2602.14310", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14310", "abs": "https://arxiv.org/abs/2602.14310", "authors": ["Sharan Srinivasan", "Vijay Gupta", "Harsha Honnappa"], "title": "Robust Filtering of Lévy-driven Stochastic Models", "comment": "31 pages", "summary": "We study robust nonlinear filtering for stochastic models driven by Lévy processes, where the signal and observation processes are coupled through common Brownian and jump noise. Robustness, defined as the continuous dependence of the filter on the observation path, is essential whenever the observation process deviates from the idealized model, for instance when a path must be reconstructed from discrete-time samples. This question is well understood for continuous semimartingale systems but largely open in the presence of jumps.\n  We construct a version of the filter and establish its continuity in two regimes. For processes with finitely many jumps on compact intervals, we prove continuity in both the rough $p$-variation and $p$-variation topologies on cadlag path space, without requiring a separability condition on the jump coefficients. For processes with infinitely many jumps, we prove continuity in a modified rough $p$-variation topology adapted to cadlag geometric rough paths, under an additional separability assumption. In both cases, our approach relies on Stratonovich and Marcus flow decompositions rather than the Itô-based methods of recent work. The resulting geometric rough-path lifts yield pathwise convergence guarantees and can be constructed directly from discrete observations without knowledge of the underlying probability law."}
{"id": "2602.13514", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13514", "abs": "https://arxiv.org/abs/2602.13514", "authors": ["Henry Abrahamson", "Yongho Kim", "Seongha Park", "Ermin Wei"], "title": "Distributed Edge Computing Task Allocation with Network Effects", "comment": "8 pages, 6 figures", "summary": "Field-deployable edge computing nodes form a network and are used to complete scientific tasks for remote sensing and monitoring. The networked nodes collectively decide which scientific applications to run while they are constrained by various factors, such as differing hardware constraints from heterogeneous nodes and time-varying quality of service (QoS) requirements. We model the problem of task allocation as an optimization problem that maximizes the QoS, subject to the constraints. We solve the optimization problem using a dual-descent method, which can be easily implemented in a distributed way subject to the communication constraints of the network. Using a simulation that uses real-world data collected from Sage, a distributed sensor network, we analyze our policy's performance in dynamic situations where the required QoS and the nodes' capabilities change, and verify that it can adapt and return a feasible solution while accounting for those changes."}
{"id": "2602.14472", "categories": ["math.ST", "cs.LG", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.14472", "abs": "https://arxiv.org/abs/2602.14472", "authors": ["Somjit Roy", "Prateek Jaiswal", "Anirban Bhattacharya", "Debdeep Pati", "Bani K. Mallick"], "title": "Frequentist Regret Analysis of Gaussian Process Thompson Sampling via Fractional Posteriors", "comment": "34 pages, Submitted", "summary": "We study Gaussian Process Thompson Sampling (GP-TS) for sequential decision-making over compact, continuous action spaces and provide a frequentist regret analysis based on fractional Gaussian process posteriors, without relying on domain discretization as in prior work. We show that the variance inflation commonly assumed in existing analyses of GP-TS can be interpreted as Thompson Sampling with respect to a fractional posterior with tempering parameter $α\\in (0,1)$. We derive a kernel-agnostic regret bound expressed in terms of the information gain parameter $γ_t$ and the posterior contraction rate $ε_t$, and identify conditions on the Gaussian process prior under which $ε_t$ can be controlled. As special cases of our general bound, we recover regret of order $\\tilde{\\mathcal{O}}(T^{\\frac{1}{2}})$ for the squared exponential kernel, $\\tilde{\\mathcal{O}}(T^{\\frac{2ν+3d}{2(2ν+d)}} )$ for the Matérn-$ν$ kernel, and a bound of order $\\tilde{\\mathcal{O}}(T^{\\frac{2ν+3d}{2(2ν+d)}})$ for the rational quadratic kernel. Overall, our analysis provides a unified and discretization-free regret framework for GP-TS that applies broadly across kernel classes."}
{"id": "2602.14309", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14309", "abs": "https://arxiv.org/abs/2602.14309", "authors": ["Dibyendu Adak", "David Mora", "Alberth Silgado"], "title": "Nonconforming virtual element methods for fourth-order nonlinear reaction-diffusion systems: a unified framework and analysis", "comment": "38 pages, 4 figures, 4 tables", "summary": "We develop a unified framework for the design and analysis of high-order nonconforming virtual element methods for nonlinear fourth-order reaction--diffusion problems in two dimensions, with emphasis on clamped, Navier, and Cahn--Hilliard-type boundary conditions. Time discretization is performed using the backward Euler scheme, while the spatial approximation relies on nonconforming virtual element spaces of arbitrary order $k \\ge 2$, encompassing both $C^0$-nonconforming and Morley-type methods. A key contribution of this work is the development of a novel and rigorous unified error analysis for these numerical schemes, applicable to domains that are not necessarily convex, differing from the existing literature. By introducing a class of Companion operators, we construct novel Ritz-type projections and derive a new error equation that enables us to obtain optimal error estimates for the scheme under a minimal spatial regularity assumption on the weak solution. Finally, we present numerical experiments on polygonal meshes as applications of the proposed framework, including the extended Fisher--Kolmogorov equation, and a fourth-order model with Cahn--Hilliard-type boundary conditions, which validate the theoretical results and illustrate the performance of the method for the three classes of boundary conditions."}
{"id": "2602.14403", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14403", "abs": "https://arxiv.org/abs/2602.14403", "authors": ["Erhan Bayraktar", "Zhiyan Ding", "Ibrahim Ekren", "Hongyi Zhou"], "title": "Uniform-in-time propagation of chaos for consensus-based minimax algorithm", "comment": "KEYWORDS: Saddle point problem, Consensus-based algorithm, Propagation of chaos, Coupling method", "summary": "We study the large-population convergence of a consensus-based algorithm for the saddle point problem proposed by ArXiv: 2212.12334, establishing the uniform-in-time propagation of chaos using a coupling method. Our work shows that the $L^2$-deviation has order $O(N_1^{-1} + N_2^{-1})$ uniformly in time, where $N_1$ and $N_2$ denote the numbers of particles corresponding to the two competing players.\n  It demonstrates the convergence of the particles to some location near a saddle point of the given objective function, which confirms the computational feasibility of the algorithm.\n  The main idea behind the proofs is the exponential decay and the concentration of the variances of the particle system."}
{"id": "2602.13615", "categories": ["math.OC", "eess.SY", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.13615", "abs": "https://arxiv.org/abs/2602.13615", "authors": ["Iasson Karafyllis", "Miroslav Krstic"], "title": "On the Existence of Periodic Solutions with Applications to Extremum-Seeking", "comment": "27 pages", "summary": "This paper provides two results that are useful in the study of the existence and the stability properties of a periodic solution for a given dynamical system. The first result deals with scalar time-periodic systems and establishes the equivalence of the existence of a periodic solution and the existence of a bounded solution. The second result provides sufficient conditions for the existence and the stability of a periodic solution for a time-periodic dynamical system. Both results are applied to extremum seeking problems for a static output map with no plant dynamics and novel non-local results are provided without the use of averaging theorems and singular perturbation arguments."}
{"id": "2602.14861", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.14861", "abs": "https://arxiv.org/abs/2602.14861", "authors": ["Roberto Vila", "Helton Saulo"], "title": "Bias analysis of a linear order-statistic inequality index estimator: Unbiasedness under gamma populations", "comment": "14 pages", "summary": "This paper studies a class of rank-based inequality measures built from linear combinations of expected order statistics. The proposed framework unifies several well-known indices, including the classical Gini coefficient, the $m$th Gini index, extended $m$th Gini index and $S$-Gini index, and also connects to spectral inequality measures through an integral representation. We investigate the finite-sample behavior of a natural U-statistic-type estimator that averages weighted order-statistic contrasts over all subsamples of fixed size and normalizes by the sample mean. A general bias decomposition is derived in terms of components that isolate the effect of random normalization on each rank level, yielding analytical expressions that can be evaluated under broad non-negative distributions via Laplace-transform methods. Under mild moment conditions, the estimator is shown to be asymptotically unbiased. Moreover, we prove exact unbiasedness under gamma populations for any sample size, extending earlier unbiasedness results for Gini-type estimators. A Monte Carlo study is performed to numerically check that the theoretical unbiasednes under gamma populations."}
{"id": "2602.14369", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14369", "abs": "https://arxiv.org/abs/2602.14369", "authors": ["Sigal Gottlieb", "Zachary J. Grant", "Cesar Herrera"], "title": "Mixed precision and mixed accuracy explicit two-derivative Runge--Kutta methods", "comment": null, "summary": "Mixed precision Runge--Kutta methods have been recently developed and used for the time-evolution of partial differential equations. Two-derivative Runge--Kutta schemes may offer enhanced stability and accuracy properties compared to classical one-derivative methods, making them attractive in a wide variety of problems. However, their computational cost can be significant, motivating the use of a mixed-precision paradigm that employs different floating-point precisions for different function evaluations to balance efficiency and accuracy. To ensure that the perturbations introduced by the low precision computations do not destroy the accuracy of the solution, we need to understand how these perturbation errors propagate. We extend the numerical analysis mixed precision framework previously developed for Runge--Kutta methods to characterize the propagation of the perturbation errors arising from mixed precision computations in explicit and implicit two-derivative Runge--Kutta methods. We use this framework for analyzing the order of the perturbation errors, and for designing new methods that are less sensitive to the effect of the low precision computations. Numerical experiments on linear and nonlinear representative PDEs, demonstrate that appropriately designed mixed-precision two-derivative Runge--Kutta methods achieve the predicted accuracy."}
{"id": "2602.14479", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.14479", "abs": "https://arxiv.org/abs/2602.14479", "authors": ["Samaneh Sojudi", "Mahdieh Tahmasebi"], "title": "Conditional Expectation expression in mean-field SDEs and its applications", "comment": null, "summary": "This study developed a novel formulation of conditional expectations within the framework of a jump-diffusion mean-field stochastic differential equation. We introduce an integrated approach that combines unconditioned expectations with rigorously defined weighting factors, employing Malliavin calculus on Poisson space and directional derivatives to enhance estimation accuracy. \\noindent The proposed method is applied to the numerical pricing of American put options in a jump-diffusion mean-field setting, addressing the challenges proposed by early-exercise features. Comprehensive numerical experiments demonstrate substantial improvements in pricing accuracy compared with conventional techniques."}
{"id": "2602.13620", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.13620", "abs": "https://arxiv.org/abs/2602.13620", "authors": ["Xiaozhe Hu", "Sara Pollock", "Zhongqin Xue", "Yunrong Zhu"], "title": "An adaptive framework for first-order gradient methods", "comment": null, "summary": "Gradient methods are widely used in optimization problems. In practice, while the smoothness parameter can be estimated utilizing techniques such as backtracking, estimating the strong convexity parameter remains a challenge; moreover, even with the optimal parameter choice, convergence can be slow. In this work, we propose a framework for dynamically adapting the step size and momentum parameters in first-order gradient methods for the optimization problem, without prior knowledge of the strong convexity parameter. The main idea is to use the geometric average of the ratios of successive residual norms as an empirical estimate of the upper bound on the convergence rate, which in turn allows us to adaptively update the algorithm parameters. The resulting algorithms are simple to implement, yet efficient in practice, requiring only a few additional computations on existing information. The proposed adaptive gradient methods are shown to converge at least as fast as gradient descent for quadratic optimization problems. Numerical experiments on both quadratic and nonlinear problems validate the effectiveness of the proposed adaptive algorithms. The results show that the adaptive algorithms are comparable to their counterparts using optimal parameters, and in some cases, they capture local information and exhibit improved performance."}
{"id": "2602.14969", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.14969", "abs": "https://arxiv.org/abs/2602.14969", "authors": ["Andrea Montanari", "Basil Saeed"], "title": "Topological trivialization in non-convex empirical risk minimization", "comment": "33 pages; 16 pdf figures", "summary": "Given data $\\{({\\boldsymbol x}_i,y_i): i\\le n\\}$, with ${\\boldsymbol x}_i$ standard $d$-dimensional Gaussian feature vectors, and $y_i\\in{\\mathbb R}$ response variables, we study the general problem of learning a model parametrized by ${\\boldsymbol θ}\\in{\\mathbb R}^d$, by minimizing a loss function that depends on ${\\boldsymbol θ}$ via the one-dimensional projections ${\\boldsymbol θ}^{\\sf T}{\\boldsymbol x}_i$. While previous work mostly dealt with convex losses, our approach assumes general (non-convex) losses hence covering classical, yet poorly understood examples such as the perceptron and non-convex robust regression. We use the Kac-Rice formula to control the asymptotics of the expected number of local minima of the empirical risk, under the proportional asymptotics $n,d\\to\\infty$, $n/d\\toα>1$. Specifically, we prove a finite dimensional variational formula for the exponential growth rate of the expected number of local minima. Further we provide sufficient conditions under which the exponential growth rate vanishes and all empirical risk minimizers have the same asymptotic properties (in fact, we expect the minimizer to be unique in these circumstances). We refer to this phenomenon as `rate trivialization.' If the population risk has a unique minimizer, our sufficient condition for rate trivialization is typically verified when the samples/parameters ratio $α$ is larger than a suitable constant $α_{\\star}$. Previous general results of this type required $n\\ge Cd \\log d$. We illustrate our results in the case of non-convex robust regression. Based on heuristic arguments and numerical simulations, we present a conjecture for the exact location of the trivialization phase transition $α_{\\text{tr}}$."}
{"id": "2602.14392", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14392", "abs": "https://arxiv.org/abs/2602.14392", "authors": ["Thomas Izgin", "Andreas Meister", "Chi-Wang Shu", "Davide Torlo"], "title": "Flux-Balanced Patankar-type Schemes for the Compressible Euler Equations", "comment": null, "summary": "Positivity preservation of key physical quantities in the context of fluid flows, such as density and internal energy, is an essential property of a numerical scheme as otherwise the solution lacks physical relevance and has a not well-defined equation of state. One time integration technique that is capable of preserving the positivity of quantities for every time step size is the Patankar-trick and its variants. However, in the context of the Euler equations of gas dynamics, we wonder whether the Patankar-trick should be applied to the density and total energy equations or only to one of them. In this work, we discuss one drawback of the schemes when blindly applied to every positive conserved variable and additionally point out how to overcome the issue by balancing the involved numerical fluxes correctly. To illustrate our findings, we investigate modified Patankar--Runge--Kutta (MPRK) schemes in the context of the compressible Euler equations with and without stiff source terms. We discover that it is beneficial to only apply the Patankar-trick in the density equation and to balance the remaining numerical fluxes consistently rather than applying the trick also to the energy equation. This leads also to the preservation of contact discontinuities. We perform numerical experiments to demonstrate that the accuracy of the methods is maintained while the performance of our approach is superior to the traditional application of MPRK schemes."}
{"id": "2602.14487", "categories": ["math.PR", "math.HO"], "pdf": "https://arxiv.org/pdf/2602.14487", "abs": "https://arxiv.org/abs/2602.14487", "authors": ["Jim Propp"], "title": "Estimating $π$ with a Coin", "comment": "3 pages", "summary": "We describe a simple Monte Carlo method for estimating $π$ by tossing a coin. Although the underlying Catalan-number series identities appear implicitly in the probability theory literature, the probabilistic interpretation of $\\fracπ{4}$ presented here seems to be new."}
{"id": "2602.13646", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13646", "abs": "https://arxiv.org/abs/2602.13646", "authors": ["Jun Chen", "Tianyi Zhu", "Haishan Ye", "Lina Liu", "Guang Dai", "Yong Liu", "Yunliang Jiang", "Ivor W. Tsang"], "title": "Riemannian Momentum Tracking: Distributed Optimization with Momentum on Compact Submanifolds", "comment": null, "summary": "Gradient descent with momentum has been widely applied in various signal processing and machine learning tasks, demonstrating a notable empirical advantage over standard gradient descent. However, momentum-based distributed Riemannian algorithms have been only scarcely explored. In this paper, we propose Riemannian Momentum Tracking (RMTracking), a decentralized optimization algorithm with momentum over a compact submanifold. Given the non-convex nature of compact submanifolds, the objective function, composed of a finite sum of smooth (possibly non-convex) local functions, is minimized across agents in an undirected and connected network graph. With a constant step-size, we establish an $\\mathcal{O}(\\frac{1-β}{K})$ convergence rate of the Riemannian gradient average for any momentum weight $β\\in [0,1)$. Especially, RMTracking can achieve a convergence rate of $\\mathcal{O}(\\frac{1-β}{K})$ to a stationary point when the step-size is sufficiently small. To best of our knowledge, RMTracking is the first decentralized algorithm to achieve exact convergence that is $\\frac{1}{1-β}$ times faster than other related algorithms. Finally, we verify these theoretical claims through numerical experiments on eigenvalue problems."}
{"id": "2602.14998", "categories": ["math.PR", "cs.IT", "cs.SI", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.14998", "abs": "https://arxiv.org/abs/2602.14998", "authors": ["Cheng Mao", "Yihong Wu", "Jiaming Xu"], "title": "Random geometric graphs with smooth kernels: sharp detection threshold and a spectral conjecture", "comment": null, "summary": "A random geometric graph (RGG) with kernel $K$ is constructed by first sampling latent points $x_1,\\ldots,x_n$ independently and uniformly from the $d$-dimensional unit sphere, then connecting each pair $(i,j)$ with probability $K(\\langle x_i,x_j\\rangle)$. We study the sharp detection threshold, namely the highest dimension at which an RGG can be distinguished from its Erdős--Rényi counterpart with the same edge density.\n  For dense graphs, we show that for smooth kernels the critical scaling is $d = n^{3/4}$, substantially lower than the threshold $d = n^3$ known for the hard RGG with step-function kernels \\cite{bubeck2016testing}. We further extend our results to kernels whose signal-to-noise ratio scales with $n$, and formulate a unifying conjecture that the critical dimension is determined by $n^3 \\mathop{\\rm tr}^2(κ^3) = 1$, where $κ$ is the standardized kernel operator on the sphere.\n  Departing from the prevailing approach of bounding the Kullback-Leibler divergence by successively exposing latent points, which breaks down in the sublinear regime of $d=o(n)$, our key technical contribution is a careful analysis of the posterior distribution of the latent points given the observed graph, in particular, the overlap between two independent posterior samples. As a by-product, we establish that $d=\\sqrt{n}$ is the critical dimension for non-trivial estimation of the latent vectors up to a global rotation."}
{"id": "2602.14405", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14405", "abs": "https://arxiv.org/abs/2602.14405", "authors": ["Tiantian Huang", "Buyang Li", "Rong Tang"], "title": "A convergent finite element method with minimal deformation rate for mean curvature flow", "comment": "77 pages", "summary": "We propose and analyze a fully discrete parametric finite element method with minimal deformation rate (MDR) for simulating the mean curvature flow of general closed surfaces in three dimensions. The method is formulated from a coupled system that enforces the mean curvature flow law for the normal velocity while introducing an artificial tangential velocity that minimizes the deformation-rate energy, thereby preserving mesh quality without requiring remeshing or reparametrization. An $L^{2}$-projected averaged normal vector is used in the scheme to facilitate a rigorous convergence analysis. Within the projected--distance framework, we establish the first complete convergence proof for a parametric finite element method that incorporates the MDR tangential motion without relying on evolution equations for the mean curvature or the normal vector, achieving optimal-order error estimates for finite elements of degree $k \\ge 3$. Numerical experiments corroborate the theoretical results and demonstrate that the proposed MDR method maintains mesh quality comparable to the Barrett--Garcke--Nürnberg method, for which convergence has not yet been established."}
{"id": "2602.14497", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14497", "abs": "https://arxiv.org/abs/2602.14497", "authors": ["Tobias Schmidt", "Mark Sellke"], "title": "On Anti-Confinement Estimates for Self-Repelling Random Walks", "comment": "23 pages", "summary": "We study a class of $d$-dimensional random walks, including the two-dimensional simple random walk, reweighted by a self-repelling Gibbsian pair potential. We prove lower bounds on the diffusion constant for short-range interactions, and superdiffusive behavior in case the interaction is sufficiently long-range. Finally, we show that in the superdiffusive regime, faster temporal decay can be compensated by stronger spatial repulsion and vice-versa. Our technique combines GKS-based correlation inequalities on path space with recursive multi-scale estimates."}
{"id": "2602.13654", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.13654", "abs": "https://arxiv.org/abs/2602.13654", "authors": ["Henk J. van Waarde", "Jeremy Coulson", "Alberto Padoan"], "title": "From time series to dissipativity of linear systems with dynamic supply rates", "comment": null, "summary": "This paper studies the problem of verifying dissipativity of linear time-invariant (LTI) systems using input-output data. We leverage behavioral systems theory to express dissipativity in terms of quadratic difference forms (QDFs), allowing the study of general dynamic quadratic supply rates. We work under the assumptions that the data-generating system is controllable, and an upper bound is given on its lag. As our main results, we provide sufficient conditions for the data to be informative for dissipativity. We also show that for a specific class of static supply rates, these conditions are both necessary and sufficient. For the latter supply rates, it turns out that certification of dissipativity is only possible from data that enable unique system identification. As auxiliary results, we highlight some properties of QDFs, such as upper bounds on the degree of storage functions."}
{"id": "2602.14449", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14449", "abs": "https://arxiv.org/abs/2602.14449", "authors": ["Zhuang-Ao He", "Meiyue Shao"], "title": "On Two-Stage Householder Orthogonalization", "comment": null, "summary": "Two-stage orthogonalization is essential in numerical algorithms such as Krylov subspace methods. For this task we need to orthogonalize a matrix $A$ against another matrix $V$ with orthonormal columns. A common approach is to employ the block Gram--Schmidt algorithm. However, its stability largely depends on the condition number of $[V,A]$. While performing a Householder orthogonalization on $[V,A]$ is unconditionally stable, it does not utilize the knowledge that $V$ has orthonormal columns. To address these issues, we propose a two-stage Householder orthogonalization algorithm based on the generalized Householder transformation. Instead of explicitly orthogonalizing the entire $V$, our algorithm only needs to orthogonalizes a square submatrix of $V$. Theoretical analysis and numerical experiments demonstrate that our method is also unconditionally stable."}
{"id": "2602.14532", "categories": ["math.PR", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.14532", "abs": "https://arxiv.org/abs/2602.14532", "authors": ["Akihito Hora"], "title": "Jucys--Murphy Elements for Wreath Products and Their Application to Dynamical Random Multi-Diagrams", "comment": "28 pages, 5 figures", "summary": "The equivalence classes of irreducible representations of wreath product $\\mathfrak{S}_n(T) = T^n \\rtimes \\mathfrak{S}_n$ of finite group $T$ with respect to symmetric group $\\mathfrak{S}_n$ are parametrized by $\\mathbb{Y}_n(\\widehat{T})$, the $\\lvert \\widehat{T}\\rvert$-tuple Young diagrams with total size $n$. We show a formula connecting the Kerov transition measures of these Young diagrams with the Jucys--Murphy elements of $\\mathfrak{S}_n(T)$. This formula is due to Biane in the case of symmetric groups. The formula enables us to investigate asymptotic property of the shapes of multi-diagrams through combinatorial analysis for the Jucys--Murphy elements. On the other hand, a Markov chain is introduced on $\\mathbb{Y}_n(\\widehat{T})$, canonically reflecting the branching rule for the tower of wreath product groups. We have a continuous time stochastic process on $\\mathbb{Y}_n(\\widehat{T})$ from this chain by replacing the discrete time by a counting process. Our project is to specify the deterministic limit shape of multi-diagrams at each macroscopic time through appropriate space-time scaling limit, and to describe evolution of related quantities characterizing the shape. Especially, we derive dynamical concentrated limit shapes in the case of abelian $T$ by using free probability tools under the assumption of approximate factorization property for initial ensembles with an additional property of a pausing time distribution."}
{"id": "2602.13856", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13856", "abs": "https://arxiv.org/abs/2602.13856", "authors": ["Gengchen Li", "Depeng Gao", "Wenliang Yin", "Hongwei Lin"], "title": "Persistent homology-based explicit topological control for 2D topology optimization with MMA", "comment": null, "summary": "Controlling structural complexity, particularly the number of holes, remains a fundamental challenge in topology optimization, with significant implications for both theoretical analysis and manufacturability. Most existing approaches rely on indirect strategies, such as filtering techniques, minimum length-scale control, or specific level-set initializations, which influence topology only implicitly and do not allow precise regulation of topological features. In this work, we propose an explicit and differentiable topology-control framework by integrating persistent homology into the classical minimum-compliance topology optimization problem. The design domain and density field are represented using non-uniform rational B-splines (NURBS), while persistence diagrams are employed to rigorously and quantitatively characterize topological features. Given a prescribed number of holes, a differentiable topology-aware objective is constructed from the persistence pairs and incorporated into the compliance objective, leading to a unified optimization formulation. The resulting problem is efficiently solved using the method of moving asymptotes (MMA).Numerical experiments demonstrate that the proposed approach enables explicit control over structural connectivity and the number of holes, thereby providing a systematic and mathematically grounded strategy for topology regulation."}
{"id": "2602.14504", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14504", "abs": "https://arxiv.org/abs/2602.14504", "authors": ["Naveed Ahmed", "Abhinav Jha"], "title": "Adaptive Finite Elements with Algebraic Stabilization for Convection-Dominated Transport", "comment": null, "summary": "We present a numerical investigation of residual-based a posteriori error estimation for finite element discretizations of convection--diffusion equations stabilized by algebraic flux correction and related algebraic stabilization techniques. In particular, we consider AFC schemes employing the BJK and Monolithic Convex (MC) limiters and algebraically stabilized methods including MUAS, SMUAS, and the BBK approach. The performance of the estimators and limiters are studied on adaptively refined meshes for several two-dimensional test problems, including boundary layers, interior layers, and a nonlinear convection problem with solution-dependent transport.\n  The experiments assess accuracy, preservation of the discrete maximum principle, adaptive mesh behaviour, and computational efficiency. The results show that the interaction between stabilization and a posteriori error estimation depends strongly on mesh alignment and on the character of the convection field. In particular, for problems with moving or curved layers, the behaviour of the limiters differs significantly: strongly upwind-biased limiters provide the most accurate solutions, while smoother algebraic stabilizations lead to more efficient nonlinear iterations. The study also indicates that residual-based estimators remain reliable for both linear and nonlinear problems but may react to changes in limiter activation during adaptive refinement.\n  Overall, the numerical results clarify the practical behaviour of several widely used stabilization techniques within an adaptive framework and highlight aspects that are not yet fully explained by the current theory, particularly for nonlinear transport problems."}
{"id": "2602.14562", "categories": ["math.PR", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2602.14562", "abs": "https://arxiv.org/abs/2602.14562", "authors": ["Simone Baldassarri", "Peter Braunsteins", "Frank den Hollander", "Michel Mandjes"], "title": "Infection models on dense dynamic random graphs", "comment": "29 pages,", "summary": "We consider Susceptible-Infected-Recovered (SIR) models on dense dynamic random graphs, in which the joint dynamics of vertices and edges are co-evolutionary, i.e., they influence each other bidirectionally. In particular, edges appear and disappear over time depending on the states of the two connected vertices, on how long they have been infected, and on the total density of susceptible and infected vertices. Our main results establish functional laws of large numbers for the densities of susceptible, infected, and recovered vertices, jointly with the underlying evolving random graphs in the graphon space. Our results are supported by simulations, which characterize the limiting size of the epidemics, i.e., the limiting density of susceptible vertices, and how the peak of the epidemics depends on the rate of the evolution of the underlying graph.\n  The proofs of our main results rely on the careful construction of a mimicking process, obtained by approximating the two-way feedback interaction between vertex and edge dynamics with a mean-field type interaction, acting only as one-way feedback, that remains sufficiently close to the original co-evolutionary process. To treat the more general setting in which edge dynamics are affected by the proportions of susceptible and infected individuals, we introduce a methodological extension of existing techniques. We thus show that our model exhibits multiple epidemic peaks -- a phenomenon observed in real-world epidemics -- which can emerge in models that incorporate mutual feedback between vertex and edge dynamics."}
{"id": "2602.13965", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13965", "abs": "https://arxiv.org/abs/2602.13965", "authors": ["Tien-Son Pham"], "title": "The local minimality of differentiable functions", "comment": null, "summary": "In this paper we present necessary and sufficient conditions (in terms of Łojasiewicz inequalities) for the stability of local minimum points in smooth unconstrained optimization. In particular, we derive a sufficient condition for which the local minimum property of a given function is determined by its Taylor polynomial of a certain degree."}
{"id": "2602.14588", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14588", "abs": "https://arxiv.org/abs/2602.14588", "authors": ["Alexander Freiszlinger", "Dirk Pauly", "Dirk Praetorius", "Michael Schomburg"], "title": "New a posteriori error estimates for full-space transmission problems", "comment": null, "summary": "In the present work, we derive functional upper bounds for the potential error arising from finite-element boundary-element coupling formulations for a nonlinear Poisson-type transmission problem. The proposed a posteriori error estimates are independent of the precise discretization scheme and provide guaranteed upper bounds for the potential error. The computation of these upper bounds is based on the solutions of local auxiliary finite element problems on patches in the interior domain and in a strip domain along the coupling boundary. Numerical experiments illustrate the performance of the proposed error estimation strategy for a related adaptive mesh-refinement strategy."}
{"id": "2602.14617", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14617", "abs": "https://arxiv.org/abs/2602.14617", "authors": ["Atef Lechiheb"], "title": "Stochastic Burgers equation driven by multiplicative Rosenblatt noise: local existence, uniqueness and regularity", "comment": null, "summary": "We study the stochastic Burgers equation driven by a multiplicative Rosenblatt noise with Hurst parameter $H \\in (1/2,1)$. Using a fixed-point argument in a Malliavin--Sobolev space that controls the solution and its first two Malliavin derivatives, we prove local existence and uniqueness of a mild solution. We establish uniform moment bounds of all orders and prove Hölder regularity: spatial Hölder exponent $γ< 1/2$ and temporal Hölder exponent $α< H-1/2$, which are shown to be sharp by a lower bound for the linearized equation. The proof relies on sharp estimates of the heat kernel in the reproducing kernel Hilbert space $\\cH$ of the Rosenblatt process, on Meyer's inequalities for moment bounds, and on a careful analysis of the Skorohod integral with respect to the Rosenblatt process. These results provide a rigorous foundation for the study of nonlinear SPDEs driven by non-Gaussian long-memory noise."}
{"id": "2602.14058", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14058", "abs": "https://arxiv.org/abs/2602.14058", "authors": ["Jia-Hao Chen", "Zi Xu", "Hui-Ling Zhang"], "title": "A Homogeneous Second-Order Descent Ascent Algorithm for Nonconvex-Strongly Concave Minimax Problems", "comment": null, "summary": "This paper introduces a novel Homogeneous Second-order Descent Ascent (HSDA) algorithm for nonconvex-strongly concave minimax optimization problems. At each iteration, HSDA uniquely computes a search direction by solving a homogenized eigenvalue subproblem built from the gradient and Hessian of the objective function. This formulation guarantees a descent direction with sufficient negative curvature even in near-positive-semidefinite Hessian regimes--a key feature that enhances escape from saddle points. We prove that HSDA finds an $\\mathcal{O}(\\varepsilon,\\sqrt{\\varepsilon})$-second-order stationary point within $\\tilde{\\mathcal{O}}(\\varepsilon^{-3/2})$ iterations, matching the optimal $\\varepsilon$-order iteration complexity among second-order methods for this problem class. To address large-scale applications, we further design an inexact variant (IHSDA) that preserves the single-loop structure while solving the subproblem approximately via a Lanczos procedure. With high probability, IHSDA achieves the same $\\tilde{\\mathcal{O}}(\\varepsilon^{-3/2})$ iteration complexity and attains an $\\mathcal{O}(\\varepsilon, \\sqrt{\\varepsilon})$-second-order stationary point, with the total Hessian-vector product cost bounded by $\\tilde{\\mathcal{O}}(\\varepsilon^{-7/4})$. Experiments on synthetic minimax problems and adversarial training tasks confirm the practical effectiveness and robustness of the proposed algorithms."}
{"id": "2602.14609", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14609", "abs": "https://arxiv.org/abs/2602.14609", "authors": ["Paola Boito", "Dario Fasino", "Beatrice Meini"], "title": "Advances on the recovery of (perturbed) Cauchy matrices", "comment": null, "summary": "Given a (possibly approximate) Cauchy matrix, how can we efficiently compute its generators? Expanding on previous work by Liesen and Luce [Linear Algebra Appl. 493 (2016) 261--280], we present a general family of algorithms for Cauchy parameter recovery, together with new error estimates. We also introduce a displacement-based approximation, which leads to a new algorithm for Cauchy parameter recovery. Numerical experiments show that the algorithm based on the displacement approximation is generally more accurate than the other algorithms."}
{"id": "2602.14618", "categories": ["math.PR", "math-ph", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.14618", "abs": "https://arxiv.org/abs/2602.14618", "authors": ["J. -R. Chazottes", "S. Gallo", "D. Takahashi"], "title": "Finitary coding and Gaussian concentration for random fields", "comment": "44 pages, 1 figure", "summary": "We study Gaussian concentration inequalities for random fields obtained as finitary codings of i.i.d.\\ processes, establishing a natural bridge between finitary codings and concentration inequalities. A finitary coding formalizes how a random field with nontrivial dependence, such as the Ising model, can be generated from an i.i.d.\\ source by a shift-equivariant map that determines each output spin from a finite, configuration-dependent window of the input. Gaussian concentration yields uniform sub-Gaussian fluctuation bounds for all local observables.\n  Our main abstract result shows that Gaussian concentration is preserved under finitary codings of i.i.d.\\ fields provided the coding volume has finite second moment. The proof relies on a refinement of the classical worst-case bounded-differences inequality of Talagrand and Marton, allowing us to exploit configuration-dependent bounds. Under an additional structural condition that we call the short-range factorization property, satisfied in particular by codings constructed via coupling-from-the-past algorithms, finite first moment of the coding volume already suffices. These moment conditions are sharp.\n  Applications include Gibbs measures and Markov random fields on $\\mathbb Z^d$, probabilistic cellular automata, and one-dimensional stochastic processes. For classical lattice models such as the Ising, Potts, and random-cluster models, we obtain sharp criteria for Gaussian concentration coinciding with uniqueness regimes. For countable-state Markov chains, we derive equivalent characterizations, including geometric ergodicity, exponential return-time tails, and the existence of finitary i.i.d.\\ codings with exponential tails."}
{"id": "2602.14136", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14136", "abs": "https://arxiv.org/abs/2602.14136", "authors": ["Ata Keskin"], "title": "Comparative Evaluation of SDP, SOCP, and QC Convex Relaxations for Large-Scale Market-Based AC Optimal Power Flow", "comment": null, "summary": "The alternating current optimal power flow (ACOPF) problem is central to modern power system operations, determining how electricity is generated and transmitted to maximize social welfare while respecting physical and operational constraints. However, the nonlinear and non-convex nature of AC power flow equations makes finding globally optimal solutions computationally intractable for large networks. Convex relaxations - including semidefinite programming (SDP), second-order cone programming (SOCP), and quadratic convex (QC) formulations - provide tractable alternatives that can yield provably optimal or near-optimal solutions under appropriate conditions. This paper presents a comprehensive comparative study of multiple ACOPF relaxations applied to market-based welfare maximization. We implement DCOPF, Shor's SDP relaxation (complex and real-valued forms), chordal SDP, Jabr's SOCP relaxation, and QC relaxations in a unified, solver-native framework using the MOSEK Fusion API, eliminating modeling overhead present in high-level frameworks such as CVXPY. To address the practical challenge of missing or overly conservative angle difference bounds required by QC relaxations, we employ quasi-Monte Carlo sampling with Sobol sequences to empirically estimate tighter bounds. We evaluate these relaxations on subnetworks of varying sizes derived from the ARPA-E dataset, systematically comparing solution quality, runtime, and memory consumption. Our results demonstrate the trade-offs between relaxation tightness and computational efficiency, providing practical guidance for selecting appropriate formulations based on network scale and solution requirements."}
{"id": "2602.14757", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.14757", "abs": "https://arxiv.org/abs/2602.14757", "authors": ["Erik Burman", "Mats G. Larson", "Karl Larsson", "Jonatan Vallin"], "title": "Solving Inverse Parametrized Problems via Finite Elements and Extreme Learning Networks", "comment": null, "summary": "We develop an interpolation-based reduced-order modeling framework for parameter-dependent partial differential equations arising in control, inverse problems, and uncertainty quantification. The solution is discretized in the physical domain using finite element methods, while the dependence on a finite-dimensional parameter is approximated separately. We establish existence, uniqueness, and regularity of the parametric solution and derive rigorous error estimates that explicitly quantify the interplay between spatial discretization and parameter approximation.\n  In low-dimensional parameter spaces, classical interpolation schemes yield algebraic convergence rates based on Sobolev regularity in the parameter variable. In higher-dimensional parameter spaces, we replace classical interpolation by extreme learning machine (ELM) surrogates and obtain error bounds under explicit approximation and stability assumptions. The proposed framework is applied to inverse problems in quantitative photoacoustic tomography, where we derive potential and parameter reconstruction error estimates and demonstrate substantial computational savings compared to standard approaches, without sacrificing accuracy."}
{"id": "2602.14719", "categories": ["math.PR", "math-ph", "math.CA"], "pdf": "https://arxiv.org/pdf/2602.14719", "abs": "https://arxiv.org/abs/2602.14719", "authors": ["Martin Auer", "Michael Voit"], "title": "Hua-Pickrell diffusions and differential equations related with pseudo-Jacobi polynomials", "comment": null, "summary": "Following Assiotis (2020), we study general $β$-Hua-Pickrell diffusions of $N$ particles on $\\mathbb R$ as solutions of the stochastic differential equations (SDEs) $$dX_{j,t}=\\sqrt{2(1+X_{j,t}^2)}\\,dB_{j,t}+β\\left[b-a X_{j,t}+\\sum_{l=1,\\ldots, N; \\> l\\neq j}\\frac{X_{j,t}X_{l,t}+1}{X_{j,t}-X_{l,t}}\\right]dt\\,,\\;\\; (j=1,\\ldots,N)$$ with $β\\ge 1,\\> a,b\\in\\mathbb R$. These processes form a subclass of the Pearson diffusions which are defined as solutions of algebraic SDEs where the moments of the empirical distributions $μ_t^N:=\\frac{1}{N}\\sum_{j=1}^N δ_{X_{j,t}}$ can be computed inductively. This Pearson class also contains other well known diffusions like Dyson Brownian motions, and multivariate Laguerre and Jacobi processes After the time normalization $t\\mapsto t/β$, the SDEs above degenerate in the frozen case for $β=\\infty$ into ordinary differential equations which are related to pseudo-Jacobi polynomials. For $N\\to\\infty$ and under suitable initial conditions, the empirical distributions $μ_t^N$ converge weakly almost surely for $t>0$ to some limit which is independent from $β\\in[1,\\infty]$. For $a=-N, b=0$, we describe the limit explicitly via free convolutions. Moreover, if $a=cN$ for some $c>0$, the solutions of our SDEs converge for $t\\to\\infty$ to stationary distributions, which are Hua-Pickrell (or Cauchy) measures. We thus obtain connections between known results for the empirical distributions of these ensembles and the zeros of the pseudo-Jacobi polynomials. Furthermore, we derive a freezing central limit theorem for $β\\to\\infty$ for the Hua-Pickrell ensembles which is related to these zeros."}
{"id": "2602.14139", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14139", "abs": "https://arxiv.org/abs/2602.14139", "authors": ["Zhihan Zhu", "Yanhao Zhang", "Yong Xia"], "title": "Subgradient Gliding Method for Nonsmooth Convex Optimization", "comment": "40 pages, 9 figures", "summary": "We identify and analyze a fundamental limitation of the classical projected subgradient method in nonsmooth convex optimization: the inevitable failure caused by the absence of valid subgradients at boundary points. We show that, under standard step sizes for both convex and strongly convex objectives, the method can fail after a single iteration with probability arbitrarily close to one, even on simple problem instances. To overcome this limitation, we propose a novel alternative termed the \\textit{subgradient gliding method}, which remains well defined without boundary subgradients and avoids premature termination. Beyond resolving this foundational issue, the proposed framework encompasses the classical projected subgradient method as a special case and substantially enlarges its admissible step-size design space, providing greater flexibility for algorithmic design. We establish optimal ergodic convergence rates, $\\mathcal{O}(1/\\sqrt{t})$ for convex problems and $\\mathcal{O}(1/t)$ for strongly convex problems, and further extend the framework to stochastic settings. Notably, our analysis does not rely on global Lipschitz continuity of the objective function, requiring only mild control on subgradient growth. Numerical experiments demonstrate that, in scenarios where the classical projected subgradient method fails completely, the proposed method converges reliably with a $100\\%$ success rate and achieves orders-of-magnitude improvements in accuracy and convergence speed. These results substantially expand the scope of subgradient-based optimization methods to non-Lipschitz nonsmooth convex problems."}
{"id": "2602.14786", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14786", "abs": "https://arxiv.org/abs/2602.14786", "authors": ["Achraf Badahmane", "Xian-Ming GU"], "title": "New Randomized Global Generalized Minimum Residual (RGl-GMRES) method", "comment": null, "summary": "In this paper, we develop a new Randomized Global Generalized Minimum Residual (RGlGMRES) algorithm for efficiently computing solutions to large scale linear systems with multiple right hand sides.The proposed method builds on a recently developed randomized global Gram Schmidt process, in which sketched Frobenius inner products are employed to approximate the exact Frobenius inner products of high-dimensional matrices. We give some new convergence results of the randomized global GMRES method for multiple linear systems. In the case where the coefficient matrix A is diagonalizable, we derive new upper bounds for the randomized Frobenius norm of the residual. In this paper, we study how to introduce matrix sketching in this algorithm. It allows us to reduce the dimension of the problem in one of the main steps of the algorithm. To validate the effectiveness and practicality of this approach, we conduct several numerical experiments, which demonstrate that our RGl-GMRES method is competitive with the GlGMRES method for solving large scale problems with multiple right-hand sides."}
{"id": "2602.14741", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14741", "abs": "https://arxiv.org/abs/2602.14741", "authors": ["Christian Mönch"], "title": "Monotonicity of depth constants in general preferential attachment trees", "comment": "31 pages", "summary": "We study insertion depth and tree height in preferential-attachment (PA) trees driven by a general attachment function $f:\\mathbb{N}_0\\to(0,\\infty)$. Our main result is a monotonicity principle for the $\\log n$-order constant of either functional: if $f$ dominates $g$ in ``growth-ratio'' order (a variant of the hazard ratio order of probability densities) then the typical depth constant for $f$ is no larger than for $g$, i.e. stronger reinforcement yields a shallower tree. The proofs use a one-parameter interpolation together with a gauge normalisation that removes a global derivative term, reducing the sign to a weighted correlation inequality for monotone sequences. Equivalently, the results can be phrased as monotonicity theorems for the corresponding branching process functionals arising from the standard embedding of the PA tree into a Crump--Mode--Jagers process."}
{"id": "2602.14156", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14156", "abs": "https://arxiv.org/abs/2602.14156", "authors": ["Arkadiusz Misztela", "Sławomir Plaskacz"], "title": "Stable representations of Hamilton-Jacobi-Bellman equations with infinite horizon", "comment": null, "summary": "In this paper, for the Hamilton-Jacobi-Bellman equation with an infinite horizon and state constraints, we construct a suitably regular representation. This allows us to reduce the problem of existence and uniqueness of solutions to the Frankowska and Basco theorem from (2019). Furthermore, we demonstrate that our representations are stable. The obtained results are illustrated with examples."}
{"id": "2602.14854", "categories": ["math.NA", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.14854", "abs": "https://arxiv.org/abs/2602.14854", "authors": ["Stefan Brunner", "Lukas Einkemmer", "Terry Haut"], "title": "Domain decomposition dynamical low-rank for multi-dimensional radiative transfer equations", "comment": null, "summary": "In this paper, we propose a domain decomposition dynamical low-rank method to solve high-dimensional radiative transfer problems and similar kinetic equations. The algorithm uses a separate low-rank approximation on each spatial subdomain, which means that, for a given accuracy, we can often use a smaller overall rank compared to classic dynamical low-rank methods. In particular, we can solve problems with point sources efficiently, that for classic algorithms require almost full rank. Our algorithm only transfers boundary data between subdomains and is thus very attractive for distributed memory parallelization, where classic dynamical low-rank algorithms suffer from global data dependency. We demonstrate the efficiency of our algorithm by a number of challenging test examples that have both very optical thin and thick regions."}
{"id": "2602.14817", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.14817", "abs": "https://arxiv.org/abs/2602.14817", "authors": ["Arnaud Rousselle", "Ercan Sönmez"], "title": "Peaks over Threshold in Scale-Free Random Graphs", "comment": null, "summary": "We explore extreme value phenomena in spatial scale-free random graphs in a continuum setting based on a homogeneous Poisson point process in $\\mathbb{R}^d$. Vertices carry i.i.d. weights $(W_x)$ and, conditionally on the vertex set and the weights, edges are present independently with probability $p_{xy}=1-\\exp\\{-λW_xW_y/|x-y|^α\\}$. Assuming Pareto-type weight tails with index $β>0$ and working in parameter ranges where degrees are almost surely finite, we study extremes and peaks over thresholds (POT) of edge lengths in a growing observation window. Our focus is the precise impact of the presence of (large) weights on edge lengths, captured through explicit scaling regimes and conditional POT limit theorems. Our main results identify a three-phase behavior governed by the weight-tail parameter $β$. We both deduce Fréchet-type limits for the maximum edge length itself and we reveal POT structures under a hub conditioning by proving a POT limit theorem. In the finite-mean regime $β>1$, the leading scaling agrees with the unweighted model up to a constant. By contrast, for $β\\le 1$ the weights have a macroscopic effect on extreme edge lengths: for $β< 1$ the scaling changes, and the borderline case $β=1$ exhibits additional logarithmic corrections. The proofs combine Stein-type Poisson approximation via a Palm-coupling approach with a refined treatment of the dependence created by the conditioning event."}
{"id": "2602.14185", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14185", "abs": "https://arxiv.org/abs/2602.14185", "authors": ["Jiajin Li", "Mahesh Nagarajan", "Siyu Pan", "Nanxi Zhang"], "title": "Smoothing Meets Perturbation: Unified and Tight Analysis for Nonconvex-Concave Minimax Optimization", "comment": null, "summary": "In this paper, we investigate smooth nonconvex-concave minimax optimization problems and analyze two widely used acceleration mechanisms -- perturbation and smoothing. Perturbation augments the dual objective with a small quadratic regularization term, whereas smoothing employs an auxiliary primal sequence to approximate a proximal-point update of the value function. While both techniques are known to improve convergence guarantees, their respective roles and relative strengths remain unclear. We develop a unified analytical framework that disentangles and quantifies the respective roles of smoothing and perturbation. With this analytical framework, we design new first-order methods that improve the state-of-the-art iteration complexity bounds for both single-loop and double-loop schemes, for achieving both approximate game stationary (GS) and optimization stationary (OS) points. We also establish matching lower bounds based on carefully constructed hard instances, showing that the resulting complexity bounds are tight. Taken together, these results reveal a fundamental difference between approximate GS and OS in terms of their intrinsic complexity behavior and the following understanding: smoothing and perturbation play fundamentally different yet complementary roles in achieving approximate GS. Their combination creates a synergistic effect that yields strictly faster convergence speed than either mechanism alone, whereas perturbation by itself is insufficient for OS."}
{"id": "2602.14912", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14912", "abs": "https://arxiv.org/abs/2602.14912", "authors": ["A. K. Dond", "D. Gallistl", "S. Nayak", "M. Schedensack"], "title": "A posteriori error estimates for a modified Morley FEM", "comment": null, "summary": "Residual-based a~posteriori error estimators are derived for the modified Morley FEM, proposed by Wang, Xu, Hu [J. Comput. Math, 24(2), 2006], for the singularly perturbed biharmonic equation and the nonlinear von Kármán equations. The error estimators are proven to be reliable and efficient. Moreover, an adaptive algorithm driven by these error estimators is investigated in numerical experiments."}
{"id": "2602.14842", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.14842", "abs": "https://arxiv.org/abs/2602.14842", "authors": ["Cecchin Alekos", "Dianetti Jodi"], "title": "Convergence for linear quadratic potential mean field games", "comment": null, "summary": "This paper studies the limits of empirical means of open-loop Nash equilibria of linear-quadratic stochastic differential games as the number of players goes to infinity, when the corresponding mean field game is of potential type and may have multiple equilibria. Via weak compactness arguments, the limit points are characterized as optimal trajectories of the related deterministic control problem, thus ruling out some of the mean field equilibria. Our result is obtained by first connecting the finite player game to a suitable control problem, whose optimal trajectories are the empirical means of Nash equilibria of the game, and in which the number of players $N$ becomes a parameter. True convergence to the unique minimizer of the limit control problem then holds for almost every initial mean. In cases of multiple optimizers, we focus on examples to show that some symmetry of the data ensures that the sequence admits a random limit which is distributes uniformly among the minimizers of the potential. Multidimensional examples of the convergence result appear here for the first time, which show the flexibility of our method. We also establish a similar convergence results for the corresponding linear-quadratic potential mean field games with common noise, as the noise vanishes."}
{"id": "2602.14480", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14480", "abs": "https://arxiv.org/abs/2602.14480", "authors": ["Meixia Lin", "Ziyang Zeng", "Yangjing Zhang"], "title": "Graph-Guided Fused Regularization for Single- and Multi-Task Regression on Spatiotemporal Data", "comment": null, "summary": "Spatiotemporal matrix-valued data arise frequently in modern applications, yet performing effective regression analysis remains challenging due to complex, dimension-specific dependencies. In this work, we propose a regularized framework for spatiotemporal matrix regression that characterizes temporal and spatial dependencies through tailored penalties. Specifically, the model incorporates a fused penalty to capture smooth temporal evolution and a graph-guided penalty to promote spatial similarity. The framework also extends to the multi-task setting, enabling joint estimation across related tasks. We provide a comprehensive analysis of the framework from both theoretical and computational perspectives. Theoretically, we establish the statistical consistency of the proposed estimators. Computationally, we develop an efficient solver based on the Halpern Peaceman-Rachford method for the resulting composite convex optimization problem. The proposed algorithm achieves a fast global non-ergodic $\\mathcal{O}(1/k)$ convergence rate with low per-iteration complexity. Extensive numerical experiments demonstrate that our method significantly outperforms state-of-the-art approaches in terms of predictive accuracy and estimation error, while also exhibiting superior computational efficiency and scalability."}
{"id": "2602.14921", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14921", "abs": "https://arxiv.org/abs/2602.14921", "authors": ["Pedro Morin", "Cornelia Schneider", "Nick Schneider"], "title": "Approximation classes for the anisotropic space-time finite element method. An almost characterization", "comment": null, "summary": "We study the approximation of $L_p$-functions, $p\\in (0,\\infty]$, on cylindrical space-time domains $Ω_T:=[0,T]\\times Ω$, $0<T<\\infty$, $Ω\\subset \\R^d$ Lipschitz, $d\\in \\mathbb{N}$, with respect to continuous anisotropic space-time finite elements on prismatic meshes. In particular, we propose a suitable refinement technique which creates (locally refined) prismatic meshes with sufficient smoothness and the desired anisotropy, and prove complexity estimates. Furthermore, we define a (quasi-)interpolation operator on this type of meshes and use it to characterize the corresponding approximation classes by showing direct and inverse estimates in terms of anisotropic Besov norms."}
{"id": "2602.14998", "categories": ["math.PR", "cs.IT", "cs.SI", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.14998", "abs": "https://arxiv.org/abs/2602.14998", "authors": ["Cheng Mao", "Yihong Wu", "Jiaming Xu"], "title": "Random geometric graphs with smooth kernels: sharp detection threshold and a spectral conjecture", "comment": null, "summary": "A random geometric graph (RGG) with kernel $K$ is constructed by first sampling latent points $x_1,\\ldots,x_n$ independently and uniformly from the $d$-dimensional unit sphere, then connecting each pair $(i,j)$ with probability $K(\\langle x_i,x_j\\rangle)$. We study the sharp detection threshold, namely the highest dimension at which an RGG can be distinguished from its Erdős--Rényi counterpart with the same edge density.\n  For dense graphs, we show that for smooth kernels the critical scaling is $d = n^{3/4}$, substantially lower than the threshold $d = n^3$ known for the hard RGG with step-function kernels \\cite{bubeck2016testing}. We further extend our results to kernels whose signal-to-noise ratio scales with $n$, and formulate a unifying conjecture that the critical dimension is determined by $n^3 \\mathop{\\rm tr}^2(κ^3) = 1$, where $κ$ is the standardized kernel operator on the sphere.\n  Departing from the prevailing approach of bounding the Kullback-Leibler divergence by successively exposing latent points, which breaks down in the sublinear regime of $d=o(n)$, our key technical contribution is a careful analysis of the posterior distribution of the latent points given the observed graph, in particular, the overlap between two independent posterior samples. As a by-product, we establish that $d=\\sqrt{n}$ is the critical dimension for non-trivial estimation of the latent vectors up to a global rotation."}
{"id": "2602.14537", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.14537", "abs": "https://arxiv.org/abs/2602.14537", "authors": ["Xu Shang", "Masih Haseli", "Jorge Cortés", "Yang Zheng"], "title": "On the Existence of Koopman Linear Embeddings for Controlled Nonlinear Systems", "comment": null, "summary": "Koopman linear representations have become a popular tool for control design of nonlinear systems, yet it remains unclear when such representations are exact. In this paper, we establish sufficient and necessary conditions under which a controlled nonlinear system admits an exact finite-dimensional Koopman linear representation, which we term Koopman linear embedding. We show that such a system must be transformable into a special control-affine preserved (CAP) structure, which enforces affine dependence of the state on the control input and isolates all nonlinearities into an autonomous subsystem. We further prove that this autonomous subsystem must itself admit a finite-dimensional Koopman linear model with a sufficiently-rich Koopman invariant subspace. Finally, we introduce a symbolic procedure to determine whether a given controlled nonlinear system admits the CAP structure, thereby elucidating whether Koopman approximation errors arise from intrinsic system dynamics or from the choice of lifting functions."}
{"id": "2602.14967", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.14967", "abs": "https://arxiv.org/abs/2602.14967", "authors": ["Guosheng Fu", "Brendan Keith", "Dohyun Kim", "Rami Masri", "Will Pazner"], "title": "The proximal Galerkin method for non-symmetric variational inequalities", "comment": null, "summary": "We introduce the proximal Galerkin (PG) method for non-symmetric variational inequalities. The proposed approach is asymptotically mesh-independent and yields constraint-preserving approximations. We present both a conforming PG formulation and a hybrid mixed first-order system variant (FOSPG). We establish optimal a priori error estimates for each variant, which are verified numerically. We conclude by applying the method to American option pricing, free boundary problems in porous media, advection-diffusion with a semipermeable boundary, and the enforcement of discrete maximum principles."}
{"id": "2602.13565", "categories": ["math.ST", "math.NA", "math.PR", "stat.OT"], "pdf": "https://arxiv.org/pdf/2602.13565", "abs": "https://arxiv.org/abs/2602.13565", "authors": ["Paromita Banerjee", "Anirban Mondal"], "title": "An Improved Milstein Method for the Numerical Solution of Multidimensional Stochastic Differential Equations", "comment": null, "summary": "Stochastic differential equations (SDEs) offer powerful and accessible mathematical models for capturing both deterministic and probabilistic aspects of dynamic behavior across a wide range of physical, financial, and social systems. However, analytical solutions for many SDEs are often unavailable, necessitating the use of numerical approximation methods. The rate of convergence of such numerical methods is of great importance, as it directly influences both computational efficiency and accuracy. This paper presents a proposed theorem, along with its proof, that facilitates the numerical evaluation of the strong (and weak) order of convergence of a numerical scheme for an SDE when the analytical solution is unavailable. Additionally, we address the challenge of numerically computing the multiple stochastic integrals required by the Milstein method to achieve improved convergence rates for multidimensional SDEs. In this context, two newly proposed numerical techniques for computing these multiple stochastic integrals are introduced and compared with existing approaches in terms of efficiency and effectiveness. The methodologies are further illustrated through simulation studies and applications to widely used financial models."}
{"id": "2602.14621", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14621", "abs": "https://arxiv.org/abs/2602.14621", "authors": ["Charles Meynard"], "title": "Extragradient methods for mean field games of controls and mean field type FBSDEs", "comment": null, "summary": "In this paper we present a numerical scheme to solve coupled mean field forward-backward stochastic differential equations driven by monotone vector fields. This is based on an adaptation of so called extragradient methods by characterizing solutions as zeros of monotone variational inequalities in a Hilbert space. We first introduce the procedure in the context of mean field games of controls and highlight its connection to the fictitious play. Under sufficiently strong monotonicity assumptions, we demonstrate that the sequence of approximate solutions converges exponentially fast. Then we extend the method and main results to general forward backward systems of stochastic differential equations that do not necessarily stem from optimal control."}
{"id": "2602.13513", "categories": ["math.OC", "cs.CE", "cs.LG", "math.DS", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.13513", "abs": "https://arxiv.org/abs/2602.13513", "authors": ["Grant Norman", "Conor Rowan", "Kurt Maute", "Alireza Doostan"], "title": "Learning Gradient Flow: Using Equation Discovery to Accelerate Engineering Optimization", "comment": "44 pages, 13 figures. To be submitted to CMAME", "summary": "In this work, we investigate the use of data-driven equation discovery for dynamical systems to model and forecast continuous-time dynamics of unconstrained optimization problems. To avoid expensive evaluations of the objective function and its gradient, we leverage trajectory data on the optimization variables to learn the continuous-time dynamics associated with gradient descent, Newton's method, and ADAM optimization. The discovered gradient flows are then solved as a surrogate for the original optimization problem. To this end, we introduce the Learned Gradient Flow (LGF) optimizer, which is equipped to build surrogate models of variable polynomial order in full- or reduced-dimensional spaces at user-defined intervals in the optimization process. We demonstrate the efficacy of this approach on several standard problems from engineering mechanics and scientific machine learning, including two inverse problems, structural topology optimization, and two forward solves with different discretizations. Our results suggest that the learned gradient flows can significantly expedite convergence by capturing critical features of the optimization trajectory while avoiding expensive evaluations of the objective and its gradient."}
{"id": "2602.14268", "categories": ["math.NA", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.14268", "abs": "https://arxiv.org/abs/2602.14268", "authors": ["L. Banas", "D. Breit", "A. Chaudhary", "A. Prohl"], "title": "A Higher Order Discretization for the Stochastic Navier--Stokes equations with additive Noise", "comment": null, "summary": "We propose a new higher-order time discretization scheme for the stochastic Navier--Stokes equations with additive noise, where its velocity and pressure approximates converge at strong rate $1.5$ in probability. The construction rests on its reformulation as a random PDE for the transform $y = u- ΦW$, and different higher order numerical quadrature rules for the diffusion and the drift part. The theoretical findings are supported by numerical simulations."}
{"id": "2602.14624", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14624", "abs": "https://arxiv.org/abs/2602.14624", "authors": ["Neil D. Dizon", "Bethany I. Caldwell", "Vaithilingam Jeyakumar", "Guoyin Li"], "title": "Interwoven SDP in Primal-Dual Proximal Splitting Methods for Adjustable Robust Convex Optimisation with SOS-Convex Polynomial Constraints", "comment": null, "summary": "We propose a novel methodology for solving a two-stage adjustable robust convex optimisation problem with a general (proximable) convex objective function and constraints defined by sum-of-squares (SOS) convex polynomials. These problems appear in many decision-making applications. However, they are challenging to solve and typically cannot be reformulated as numerically tractable convex optimisation models, such as conic linear programs, that can be solved directly using existing software. We show that the robust problem admits an equivalent representation as a convex composite unconstrained optimisation model that preserves the same objective values, under quadratic decision rules on the adjustable decision variables. Building on this reformulation, we develop a tailored first-order primal-dual proximal splitting method. By leveraging semidefinite programming (SDP) techniques as well as tools from convex analysis and real algebraic geometry, we establish its theoretical properties, including computable SDP-based formulas for projections onto closed convex sets, specified by SOS-convex polynomial inequalities. Numerical experiments on a two-stage lot-sizing model with both linear as well as SOS-convex polynomial storage costs under demand uncertainty demonstrate the effectiveness and applicability of the proposed approach. Our approach enables the incorporation of SDP techniques into a primal-dual proximal splitting framework, thereby broadening the class of problems to which these methods can be effectively applied."}
{"id": "2602.13565", "categories": ["math.ST", "math.NA", "math.PR", "stat.OT"], "pdf": "https://arxiv.org/pdf/2602.13565", "abs": "https://arxiv.org/abs/2602.13565", "authors": ["Paromita Banerjee", "Anirban Mondal"], "title": "An Improved Milstein Method for the Numerical Solution of Multidimensional Stochastic Differential Equations", "comment": null, "summary": "Stochastic differential equations (SDEs) offer powerful and accessible mathematical models for capturing both deterministic and probabilistic aspects of dynamic behavior across a wide range of physical, financial, and social systems. However, analytical solutions for many SDEs are often unavailable, necessitating the use of numerical approximation methods. The rate of convergence of such numerical methods is of great importance, as it directly influences both computational efficiency and accuracy. This paper presents a proposed theorem, along with its proof, that facilitates the numerical evaluation of the strong (and weak) order of convergence of a numerical scheme for an SDE when the analytical solution is unavailable. Additionally, we address the challenge of numerically computing the multiple stochastic integrals required by the Milstein method to achieve improved convergence rates for multidimensional SDEs. In this context, two newly proposed numerical techniques for computing these multiple stochastic integrals are introduced and compared with existing approaches in terms of efficiency and effectiveness. The methodologies are further illustrated through simulation studies and applications to widely used financial models."}
{"id": "2602.14342", "categories": ["math.ST", "cs.DS", "cs.LG", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.14342", "abs": "https://arxiv.org/abs/2602.14342", "authors": ["Fan Chen", "Sinho Chewi", "Constantinos Daskalakis", "Alexander Rakhlin"], "title": "High-accuracy log-concave sampling with stochastic queries", "comment": null, "summary": "We show that high-accuracy guarantees for log-concave sampling -- that is, iteration and query complexities which scale as $\\mathrm{poly}\\log(1/δ)$, where $δ$ is the desired target accuracy -- are achievable using stochastic gradients with subexponential tails. Notably, this exhibits a separation with the problem of convex optimization, where stochasticity (even additive Gaussian noise) in the gradient oracle incurs $\\mathrm{poly}(1/δ)$ queries. We also give an information-theoretic argument that light-tailed stochastic gradients are necessary for high accuracy: for example, in the bounded variance case, we show that the minimax-optimal query complexity scales as $Θ(1/δ)$. Our framework also provides similar high accuracy guarantees under stochastic zeroth order (value) queries."}
{"id": "2602.14632", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14632", "abs": "https://arxiv.org/abs/2602.14632", "authors": ["Gerd Wachsmuth"], "title": "Second-order conditions for bang-bang control of elliptic equations in arbitrary dimensions", "comment": null, "summary": "We consider an optimal control problem governed by a semilinear PDE in cases where the optimal control is of bang-bang type. By utilizing the theory of Bessel potential space, we characterize quadratic growth of the objective via a second-order optimality condition. In contrast to previous contributions, our method of proof works in arbitrary spatial dimensions."}
{"id": "2602.13620", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.13620", "abs": "https://arxiv.org/abs/2602.13620", "authors": ["Xiaozhe Hu", "Sara Pollock", "Zhongqin Xue", "Yunrong Zhu"], "title": "An adaptive framework for first-order gradient methods", "comment": null, "summary": "Gradient methods are widely used in optimization problems. In practice, while the smoothness parameter can be estimated utilizing techniques such as backtracking, estimating the strong convexity parameter remains a challenge; moreover, even with the optimal parameter choice, convergence can be slow. In this work, we propose a framework for dynamically adapting the step size and momentum parameters in first-order gradient methods for the optimization problem, without prior knowledge of the strong convexity parameter. The main idea is to use the geometric average of the ratios of successive residual norms as an empirical estimate of the upper bound on the convergence rate, which in turn allows us to adaptively update the algorithm parameters. The resulting algorithms are simple to implement, yet efficient in practice, requiring only a few additional computations on existing information. The proposed adaptive gradient methods are shown to converge at least as fast as gradient descent for quadratic optimization problems. Numerical experiments on both quadratic and nonlinear problems validate the effectiveness of the proposed adaptive algorithms. The results show that the adaptive algorithms are comparable to their counterparts using optimal parameters, and in some cases, they capture local information and exhibit improved performance."}
{"id": "2602.14776", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.14776", "abs": "https://arxiv.org/abs/2602.14776", "authors": ["Julio Backhoff", "Xin Zhang"], "title": "Reciprocal Specific Relative Entropy between Continuous Martingales", "comment": null, "summary": "We introduce a novel notion of divergence between continuous martingales; the reciprocal specific relative entropy. First, we motivate this definition from multiple perspectives. Thereafter, we solve the reciprocal specific relative entropy minimization problem over the set of win-martingales (used as models for prediction markets Aldous (2013)). Surprisingly, we show that the optimizer is the renowned neutral Wright-Fisher diffusion. We also justify that this diffusion is in a sense the most salient win-martingale, since it is uniquely selected when we suitably perturb the degenerate martingale optimal transport problem of variance minimization."}
{"id": "2602.14652", "categories": ["math.OC", "cs.SI", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.14652", "abs": "https://arxiv.org/abs/2602.14652", "authors": ["Anqi Dong", "Karl H. Johansson", "Johan Karlsson"], "title": "Temporally Flexible Transport Scheduling on Networks with Departure-Arrival Constriction and Nodal Capacity Limits", "comment": "29 pages, 9 figures", "summary": "We investigate the optimal transport (OT) problem over networks, wherein supply and demand are conceptualized as temporal marginals governing departure rates of particles from source nodes and arrival rates at sink nodes. This setting extends the classical OT framework, where all mass is conventionally assumed to depart at $t = 0$ and arrive at $t = t_f$. Our generalization accommodates departures and arrivals at specified times, referred as departure--arrival(DA) constraints. In particular, we impose nodal-temporal flux constraints at source and sink nodes, characterizing two distinct scenarios: (i) Independent DA constraints, where departure and arrival rates are prescribed independently, and (ii) Coupled DA constraints, where each particle's transportation time span is explicitly specified. We establish that OT with independent DA constraints admits a multi-marginal optimal transport formulation, while the coupled DA case aligns with the unequal-dimensional OT framework. For line graphs, we analyze the existence and uniqueness of the solution path. For general graphs, we use a constructive path-based reduction and optimize over a prescribed set of paths. From a computational perspective, we consider entropic regularization of the original problem to efficiently provide solutions based on multi-marginal Sinkhorn method, making use of the graphical structure of the cost to further improve scalability. Our numerical simulation further illustrates the linear convergence rate in terms of marginal violation."}
{"id": "2602.14053", "categories": ["math.ST", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.14053", "abs": "https://arxiv.org/abs/2602.14053", "authors": ["Sourabh Bhattacharya"], "title": "Mean-Square Convergence of a New Parameterized Leapfrog Scheme for Hamiltonian Systems Driven by Gaussian Process Potentials", "comment": "Feedback welcome", "summary": "This paper establishes the mean-square convergence of a new stochastic, parameterized leapfrog scheme introduced in our companion paper Mazumder et al. (2026) for Hamiltonian systems with Gaussian process potentials. We consider a one-step numerical integrator and provide a complete, rigorous analysis under minimal regularity assumptions on the Gaussian potential. The key technical contribution is identifying and exploiting the symplectic structure ingrained in our stochastic, parameterized leapfrog method. Combined with local truncation error analysis, this leads to a global error bound of O(δt) in mean-square sense. Our results establish that although the spatio-temporal model of Mazumder et al. (2026) arises as the anticipated new stochastic leapfrog solution of a system of modified (parameterized) stochastic Hamiltonian equations, the new stochastic leapfrog actually solves the traditional stochastic Hamiltonian equations, driven by Gaussian process potential."}
{"id": "2602.14683", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.14683", "abs": "https://arxiv.org/abs/2602.14683", "authors": ["Valentin Leplat"], "title": "Joint Majorization-Minimization for Nonnegative CP and Tucker Decompositions under $β$-Divergences: Unfolding-Free Updates", "comment": null, "summary": "We study majorization-minimization methods for nonnegative tensor decompositions under the $β$-divergence family, focusing on nonnegative CP and Tucker models. Our aim is to avoid explicit mode unfoldings and large auxiliary matrices by deriving separable surrogates whose multiplicative updates can be implemented using only tensor contractions (einsum-style operations). We present both classical block-MM updates in contraction-only form and a joint majorization strategy, inspired by joint MM for matrix $β$-NMF, that reuses cached reference quantities across inexpensive inner updates. We prove tightness of the proposed majorizers, establish monotonic decrease of the objective, and show convergence of the sequence of objective values; we also discuss how BSUM theory applies to the block-MM scheme for analyzing limit points. Finally, experiments on synthetic tensors and the Uber spatiotemporal count tensor demonstrate substantial speedups over unfolding-based baselines and a recent einsum-factorization framework."}
{"id": "2602.14479", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.14479", "abs": "https://arxiv.org/abs/2602.14479", "authors": ["Samaneh Sojudi", "Mahdieh Tahmasebi"], "title": "Conditional Expectation expression in mean-field SDEs and its applications", "comment": null, "summary": "This study developed a novel formulation of conditional expectations within the framework of a jump-diffusion mean-field stochastic differential equation. We introduce an integrated approach that combines unconditioned expectations with rigorously defined weighting factors, employing Malliavin calculus on Poisson space and directional derivatives to enhance estimation accuracy. \\noindent The proposed method is applied to the numerical pricing of American put options in a jump-diffusion mean-field setting, addressing the challenges proposed by early-exercise features. Comprehensive numerical experiments demonstrate substantial improvements in pricing accuracy compared with conventional techniques."}
{"id": "2602.14714", "categories": ["math.OC", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.14714", "abs": "https://arxiv.org/abs/2602.14714", "authors": ["Navid Noroozi"], "title": "Distributed Multi-Step Model Predictive Control for Consensus", "comment": null, "summary": "This paper studies consensus of discrete-time multi-agent systems under time-varying directed communication, state and input constraints using a distributed multi-step model predictive control (MPC) framework. Consensus is recast as stabilization of the agreement set, and a geometric viewpoint based on convex-hull invariance and strict interiority is adopted. Building on an existing geometric necessary and sufficient condition for agreement, we show that enforcing terminal inclusion in local neighbor convex hulls guarantees hull invariance but does not, in general, imply the strict relative-interior property required for convergence. An explicit counterexample demonstrates that strictness cannot be deduced from feasibility and contraction constraints alone.\n  To resolve this issue without shrinking feasible sets or altering primary performance objectives, a lexicographic tie-breaking mechanism is introduced. Among optimal (or near-optimal) MPC solutions, the proposed secondary criterion selects trajectories maximizing an interiority measure with respect to the neighbor hull. It is shown that whenever an interior feasible terminal state exists, this selection rule enforces the strictness condition required for asymptotic consensus. Explicit horizon conditions are derived for single- and double-integrator agents with bounded inputs, ensuring feasibility and automatic existence of interior feasible terminal points. The resulting scheme provides a distributed and implementable route to consensus via finite-step set-Lyapunov contraction. Numerical simulations with distributed inter-process communication illustrate monotone diameter decay and report per-agent computational complexity."}
{"id": "2602.14683", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.14683", "abs": "https://arxiv.org/abs/2602.14683", "authors": ["Valentin Leplat"], "title": "Joint Majorization-Minimization for Nonnegative CP and Tucker Decompositions under $β$-Divergences: Unfolding-Free Updates", "comment": null, "summary": "We study majorization-minimization methods for nonnegative tensor decompositions under the $β$-divergence family, focusing on nonnegative CP and Tucker models. Our aim is to avoid explicit mode unfoldings and large auxiliary matrices by deriving separable surrogates whose multiplicative updates can be implemented using only tensor contractions (einsum-style operations). We present both classical block-MM updates in contraction-only form and a joint majorization strategy, inspired by joint MM for matrix $β$-NMF, that reuses cached reference quantities across inexpensive inner updates. We prove tightness of the proposed majorizers, establish monotonic decrease of the objective, and show convergence of the sequence of objective values; we also discuss how BSUM theory applies to the block-MM scheme for analyzing limit points. Finally, experiments on synthetic tensors and the Uber spatiotemporal count tensor demonstrate substantial speedups over unfolding-based baselines and a recent einsum-factorization framework."}
{"id": "2602.14758", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14758", "abs": "https://arxiv.org/abs/2602.14758", "authors": ["Candy Sonveaux", "Morgane Dumont", "Mirko Fiacchini", "Mohamad Ajami"], "title": "An Age-Structured Vaccination Strategy for Epidemic Containment: A Model Predictive Control Approach", "comment": null, "summary": "This work presents a novel Model Predictive Control (MPC) approach to develop an optimal age-structured vaccination strategy for the containment of COVID-19 in Wallonia, Belgium. The proposed MPC framework is designed to minimize deaths, achieve early disease eradication, and adhere to operational constraints. By incorporating an age-structured Susceptible-Infected-Recovered-Deceased (SIRD) model with an additional term for vaccination, the MPC strategy dynamically adapts to the evolving epidemic state. A detailed proof of the asymptotic stability and recursive feasibility of the proposed MPC algorithm is provided. This ensures that the optimal cost at each step provides an upper bound on the minimal number obtainable of deaths at the end of the pandemic. Moreover, simulations demonstrate that the proposed MPC approach outperforms the decreasing age vaccination strategy adopted by the Belgian government during the first wave of vaccinations. The results highlight the potential of MPC-based vaccination strategies to reduce the total number of deaths, accelerate disease eradication, and optimize vaccine administration."}
{"id": "2602.14776", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.14776", "abs": "https://arxiv.org/abs/2602.14776", "authors": ["Julio Backhoff", "Xin Zhang"], "title": "Reciprocal Specific Relative Entropy between Continuous Martingales", "comment": null, "summary": "We introduce a novel notion of divergence between continuous martingales; the reciprocal specific relative entropy. First, we motivate this definition from multiple perspectives. Thereafter, we solve the reciprocal specific relative entropy minimization problem over the set of win-martingales (used as models for prediction markets Aldous (2013)). Surprisingly, we show that the optimizer is the renowned neutral Wright-Fisher diffusion. We also justify that this diffusion is in a sense the most salient win-martingale, since it is uniquely selected when we suitably perturb the degenerate martingale optimal transport problem of variance minimization."}
{"id": "2602.14820", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14820", "abs": "https://arxiv.org/abs/2602.14820", "authors": ["Claude Le Bris", "Frédéric Legoll", "Simon Ruget"], "title": "Effective approximations of solutions to highly oscillatory diffusion equations from coarse measurements", "comment": null, "summary": "We approximate a diffusion equation with highly oscillatory coefficients with a diffusion equation with constant coefficients. The approach is put in action in contexts where only partial information (namely the global energy stored in the physical system) is available. While the reconstruction of the microstructure is known to be an ill-posed problem, we show that the reconstruction of effective coefficients is possible and this even with only some coarse information. The strategy we present takes the form of a non-convex optimization problem. Homogenization theory provides elements for a rigorous foundation of the approach. Some algorithmic aspects are discussed in details. We provide a comprehensive set of numerical illustrations that demonstrate the practical interest of our strategy. The present work improves on the earlier works [C. Le Bris, F. Legoll and S. Lemaire, COCV 2018; C. Le Bris, F. Legoll and K. Li, CRAS 2013]."}
{"id": "2602.14830", "categories": ["math.OC", "eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.14830", "abs": "https://arxiv.org/abs/2602.14830", "authors": ["Souvik Das", "Luca Schenato", "Subhrakanti Dey"], "title": "On Convergence Analysis of Network-GIANT: An approximate Hessian-based fully distributed optimization algorithm", "comment": "11 pages, 9 figures", "summary": "In this paper, we present a detailed convergence analysis of a recently developed approximate Newton-type fully distributed optimization method for smooth, strongly convex local loss functions, called Network-GIANT, which has been empirically illustrated to show faster linear convergence properties while having the same communication complexity (per iteration) as its first order distributed counterparts. By using consensus based parameter updates, and a local Hessian based descent direction at the individual nodes with gradient tracking, we first explicitly characterize a global linear convergence rate for Network-GIANT, which can be computed as the spectral radius of a $3 \\times 3$ matrix dependent on the Lipschitz continuity ($L$) and strong convexity ($μ$) parameters of the objective functions, and the spectral norm ($σ$) of the underlying undirected graph represented by a doubly stochastic consensus matrix. We provide an explicit bound on the step size parameter $η$, below which this spectral radius is guaranteed to be less than $1$. Furthermore, we derive a mixed linear-quadratic inequality based upper bound for the optimality gap norm, which allows us to conclude that, under small step size values, asymptotically, as the algorithm approaches the global optimum, it achieves a locally linear convergence rate of $1-η(1 -\\fracγμ)$ for Network-GIANT, provided the Hessian approximation error $γ$ (between the harmonic mean of the local Hessians and the global hessian (the arithmetic mean of the local Hessians) is smaller than $μ$. This asymptotically linear convergence rate of $\\approx 1-η$ explains the faster convergence rate of Network-GIANT for the first time. Numerical experiments are carried out with a reduced CovType dataset for binary logistic regression over a variety of graphs to illustrate the above theoretical results."}
{"id": "2602.14881", "categories": ["math.OC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2602.14881", "abs": "https://arxiv.org/abs/2602.14881", "authors": ["Eloi Martinet", "Ilias Ftouhi"], "title": "Numerical exploration of the range of shape functionals using neural networks", "comment": "21 pages, 8 figures", "summary": "We introduce a novel numerical framework for the exploration of Blaschke--Santaló diagrams, which are efficient tools characterizing the possible inequalities relating some given shape functionals. We introduce a parametrization of convex bodies in arbitrary dimensions using a specific invertible neural network architecture based on gauge functions, allowing an intrinsic conservation of the convexity of the sets during the shape optimization process. To achieve a uniform sampling inside the diagram, and thus a satisfying description of it, we introduce an interacting particle system that minimizes a Riesz energy functional via automatic differentiation in PyTorch. The effectiveness of the method is demonstrated on several diagrams involving both geometric and PDE-type functionals for convex bodies of $\\mathbb{R}^2$ and $\\mathbb{R}^3$, namely, the volume, the perimeter, the moment of inertia, the torsional rigidity, the Willmore energy, and the first two Neumann eigenvalues of the Laplacian."}
{"id": "2602.14944", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14944", "abs": "https://arxiv.org/abs/2602.14944", "authors": ["Matteo Della Rossa", "Thiago Alves Lima", "Lorenzo Freddi"], "title": "Pattern preservation in finite to infinite-horizon optimal control problems for dissipative systems", "comment": null, "summary": "This paper focuses on infinite-horizon optimal control problems for dissipative systems and the relations to their finite-horizon formulations. We show that, for a large class of problems, dissipativity of the state equation, when a coercive storage function exists, implies that infinite-horizon optimal controls can be obtained as limits of the corresponding finite-horizon ones. This property is referred to as pattern preservation, or pattern-preserving property.\n  Our analysis establishes a formal link between dissipativity theory and the variational convergence framework in optimal control, thus providing a concrete and numerically tractable condition for verifying pattern preservation. Numerical examples illustrate the effectiveness and limitations of the proposed sufficient conditions."}
{"id": "2602.14949", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.14949", "abs": "https://arxiv.org/abs/2602.14949", "authors": ["Sarah Yini Gao", "Xindong Tang", "Yancheng Yuan"], "title": "Max-Min Bilinear Completely Positive Programs: A Semidefinite Relaxation with Tightness Guarantees", "comment": "44 pages, 2 figures", "summary": "Max-min bilinear optimization models, where one agent maximizes and an adversary minimizes a common bilinear objective, serve as canonical saddle-point formulations in optimization theory. They capture, among others, two-player zero-sum games, robust and distributionally robust optimization, and adversarial machine learning. This study focuses on the subclass whose variables lie in the completely positive (CP) cone, capturing a broad family of mixed-binary quadratic max-min problems through the modelling power of completely positive programming. We show that such problems admit an equivalent single-stage linear reformulation over the COP-CP cone, defined as the Cartesian product of the copositive (COP) and CP cones. Because testing membership in COP cones is co-NP-complete, the resulting COP-CP program inherits NP-hardness. To address this challenge, we develop a hierarchy of semidefinite relaxations based on moment and sum-of-squares representations of the COP and CP cones, and flat truncation conditions are applied to certify the tightness. We show that the tightness of the hierarchy is guaranteed under mild conditions. The framework extends existing CP/COP approaches for distributionally robust optimization and polynomial games. We apply the framework to the cyclic Colonel Blotto game, an extension of Borel's classic allocation contest. Across multiple instances, the semidefinite relaxation meets the flat-truncation conditions and solves the exact mixed-strategy equilibrium."}
{"id": "2602.15000", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.15000", "abs": "https://arxiv.org/abs/2602.15000", "authors": ["Uijeong Jang", "Kaizhao Sun", "Wotao Yin", "Ernest K Ryu"], "title": "ALiA: Adaptive Linearized ADMM", "comment": "41 pages", "summary": "We propose ALiA, a novel adaptive variant of the alternating direction method of multipliers (ADMM). Specifically, ALiA is a variant of function-linearized proximal ADMM (FLiP ADMM), which generalizes the classical ADMM by leveraging the differentiable structure of the objective function, making it highly versatile. Notably, ALiA features an adaptive stepsize selection scheme that eliminates the need for backtracking linesearch. Motivated by recent advances in adaptive gradient and proximal methods, we establish point convergence of ALiA for convex and differentiable objectives. Furthermore, by introducing negligible computational overhead, we develop an alternative stepsize selection scheme for ALiA that improves the convergence speed both theoretically and empirically. Extensive numerical experiments on practical datasets confirm the accelerated performance of ALiA compared to standard FLiP ADMM. Additionally, we demonstrate that ALiA either outperforms or matches the practical performance of existing adaptive methods across problem classes where it is applicable."}
{"id": "2602.13871", "categories": ["math.ST", "cs.IT", "cs.LG", "math.OC", "stat.AP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.13871", "abs": "https://arxiv.org/abs/2602.13871", "authors": ["Sai Ravela", "Jae Deok Kim", "Kenneth Gee", "Xingjian Yan", "Samson Mercier", "Lubna Albarghouty", "Anamitra Saha"], "title": "Ensemble-Conditional Gaussian Processes (Ens-CGP): Representation, Geometry, and Inference", "comment": "20 pages. Technical manuscrupt on representational equivalence between conditional Gaussian inference, quadratic optimization, and RKHS geometry in finite dimensions", "summary": "We formulate Ensemble-Conditional Gaussian Processes (Ens-CGP), a finite-dimensional synthesis that centers ensemble-based inference on the conditional Gaussian law. Conditional Gaussian processes (CGP) arise directly from Gaussian processes under conditioning and, in linear-Gaussian settings, define the full posterior distribution for a Gaussian prior and linear observations. Classical Kalman filtering is a recursive algorithm that computes this same conditional law under dynamical assumptions; the conditional Gaussian law itself is therefore the underlying representational object, while the filter is one computational realization. In this sense, CGP provides the probabilistic foundation for Kalman-type methods as well as equivalent formulations as a strictly convex quadratic program (MAP estimation), RKHS-regularized regression, and classical regularization. Ens-CGP is the ensemble instantiation of this object, obtained by treating empirical ensemble moments as a (possibly low-rank) Gaussian prior and performing exact conditioning. By separating representation (GP -> CGP -> Ens-CGP) from computation (Kalman filters, EnKF variants, and iterative ensemble schemes), the framework links an earlier-established representational foundation for inference to ensemble-derived priors and clarifies the relationships among probabilistic, variational, and ensemble perspectives."}
{"id": "2602.14472", "categories": ["math.ST", "cs.LG", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.14472", "abs": "https://arxiv.org/abs/2602.14472", "authors": ["Somjit Roy", "Prateek Jaiswal", "Anirban Bhattacharya", "Debdeep Pati", "Bani K. Mallick"], "title": "Frequentist Regret Analysis of Gaussian Process Thompson Sampling via Fractional Posteriors", "comment": "34 pages, Submitted", "summary": "We study Gaussian Process Thompson Sampling (GP-TS) for sequential decision-making over compact, continuous action spaces and provide a frequentist regret analysis based on fractional Gaussian process posteriors, without relying on domain discretization as in prior work. We show that the variance inflation commonly assumed in existing analyses of GP-TS can be interpreted as Thompson Sampling with respect to a fractional posterior with tempering parameter $α\\in (0,1)$. We derive a kernel-agnostic regret bound expressed in terms of the information gain parameter $γ_t$ and the posterior contraction rate $ε_t$, and identify conditions on the Gaussian process prior under which $ε_t$ can be controlled. As special cases of our general bound, we recover regret of order $\\tilde{\\mathcal{O}}(T^{\\frac{1}{2}})$ for the squared exponential kernel, $\\tilde{\\mathcal{O}}(T^{\\frac{2ν+3d}{2(2ν+d)}} )$ for the Matérn-$ν$ kernel, and a bound of order $\\tilde{\\mathcal{O}}(T^{\\frac{2ν+3d}{2(2ν+d)}})$ for the rational quadratic kernel. Overall, our analysis provides a unified and discretization-free regret framework for GP-TS that applies broadly across kernel classes."}
{"id": "2602.14842", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.14842", "abs": "https://arxiv.org/abs/2602.14842", "authors": ["Cecchin Alekos", "Dianetti Jodi"], "title": "Convergence for linear quadratic potential mean field games", "comment": null, "summary": "This paper studies the limits of empirical means of open-loop Nash equilibria of linear-quadratic stochastic differential games as the number of players goes to infinity, when the corresponding mean field game is of potential type and may have multiple equilibria. Via weak compactness arguments, the limit points are characterized as optimal trajectories of the related deterministic control problem, thus ruling out some of the mean field equilibria. Our result is obtained by first connecting the finite player game to a suitable control problem, whose optimal trajectories are the empirical means of Nash equilibria of the game, and in which the number of players $N$ becomes a parameter. True convergence to the unique minimizer of the limit control problem then holds for almost every initial mean. In cases of multiple optimizers, we focus on examples to show that some symmetry of the data ensures that the sequence admits a random limit which is distributes uniformly among the minimizers of the potential. Multidimensional examples of the convergence result appear here for the first time, which show the flexibility of our method. We also establish a similar convergence results for the corresponding linear-quadratic potential mean field games with common noise, as the noise vanishes."}
