{"id": "2602.10256", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.10256", "abs": "https://arxiv.org/abs/2602.10256", "authors": ["Victor-Emmanuel Brunel"], "title": "Bernstein-von Mises theorem for log-concave posteriors", "comment": null, "summary": "We prove new, general versions of Bernstein-von Mises theorem for both well-specified and misspecified models when the log-likelihood is concave in the parameter and the prior distribution is log-concave. Unlike classical versions of Bernstein-von Mises theorem, our versions do not require technical smoothness assumptions, and they solely rely on convex analysis."}
{"id": "2602.10274", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.10274", "abs": "https://arxiv.org/abs/2602.10274", "authors": ["Moritz Jirak", "Alexander Meister", "Angelika Rohde"], "title": "Asymptotic equivalence for nonparametric additive regression", "comment": null, "summary": "We prove asymptotic equivalence of nonparametric additive regression and an appropriate Gaussian white noise experiment in which a multidimensional shifted Wiener process is observed, whose dimension equals the number of additive components. The shift depends on the additive components of the regression function and solely the one- and two-dimensional marginal distributions of the covariates via an explicitly specified bounded but non-compact linear operator~$Γ$. The number of additive components $d$ is allowed to increase moderately with respect to the sample size. In the special case of pairwise independent components of the covariates, the white noise model decomposes into $d$ independent univariate processes. Moreover, we study approximation in some semiparametric setting where $Γ$ splits into a multiplication operator and an asymptotically negligible Hilbert-Schmidt operator."}
{"id": "2602.10464", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.10464", "abs": "https://arxiv.org/abs/2602.10464", "authors": ["Shirong Xu", "Will Wei Sun"], "title": "Do More Predictions Improve Statistical Inference? Filtered Prediction-Powered Inference", "comment": null, "summary": "Recent advances in artificial intelligence have enabled the generation of large-scale, low-cost predictions with increasingly high fidelity. As a result, the primary challenge in statistical inference has shifted from data scarcity to data reliability. Prediction-powered inference methods seek to exploit such predictions to improve efficiency when labeled data are limited. However, existing approaches implicitly adopt a use-all philosophy, under which incorporating more predictions is presumed to improve inference. When prediction quality is heterogeneous, this assumption can fail, and indiscriminate use of unlabeled data may dilute informative signals and degrade inferential accuracy. In this paper, we propose Filtered Prediction-Powered Inference (FPPI), a framework that selectively incorporates predictions by identifying a data-adaptive filtered region in which predictions are informative for inference. We show that this region can be consistently estimated under a margin condition, achieving fast rates of convergence. By restricting the prediction-powered correction to the estimated filtered region, FPPI adaptively mitigates the impact of biased or noisy predictions. We establish that FPPI attains strictly improved asymptotic efficiency compared with existing prediction-powered inference methods. Numerical studies and a real-data application to large language model evaluation demonstrate that FPPI substantially reduces reliance on expensive labels by selectively leveraging reliable predictions, yielding accurate inference even in the presence of heterogeneous prediction quality."}
{"id": "2602.10566", "categories": ["math.ST", "math.CO", "math.RA", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.10566", "abs": "https://arxiv.org/abs/2602.10566", "authors": ["Chandrasekhar Gokavarapu", "Sekhar Babu Gosala", "Vamis Pasalapudi", "Tarakarama Kapakayala"], "title": "Finite-sample confidence regions for spectral clustering and graph centrality", "comment": null, "summary": "Let a graph be observed through a finite random sampling mechanism. Spectral methods are routinely applied to such graphs, yet their outputs are treated as deterministic objects. This paper develops finite-sample inference for spectral graph procedures.\n  The primary result constructs explicit confidence regions for latent eigenspaces of graph operators under an explicit sampling model. These regions propagate to confidence regions for spectral clustering assignments and for smooth graph centrality functionals. All bounds are nonasymptotic and depend explicitly on the sample size, noise level, and spectral gap.\n  The analysis isolates a failure of common practice: asymptotic perturbation arguments are often invoked without a finite-sample spectral gap, leading to invalid uncertainty claims. Under verifiable gap and concentration conditions, the present framework yields coverage guarantees and certified stability regions. Several corollaries address fairness-constrained post-processing and topological summaries derived from spectral embeddings."}
{"id": "2602.10342", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.10342", "abs": "https://arxiv.org/abs/2602.10342", "authors": ["Stephanie Caro", "Rafael Correa", "Abderrahim Hantoute"], "title": "Normal cones to sublevel sets of convex and quasi-convex supremum functions", "comment": null, "summary": "We provide sharp and explicit characterizations of the normal cone to sublevel sets of suprema of arbitrary functions, expressed exclusively in terms of subdifferentials of the data functions. In the convex case, the resulting formulas involve the approximate subdifferential of the individual data functions at the nominal point. In contrast, the quasi-convex framework requires the use of the Fréchet subdifferential of these data functions but evaluated at nearby points. These results are applied to derive optimality conditions for infinite convex and quasi-convex optimization problems."}
{"id": "2602.10247", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10247", "abs": "https://arxiv.org/abs/2602.10247", "authors": ["Daniela Calvetti", "Erkki Somersalo"], "title": "Discretization-free Bayesian inverse problems in distribution spaces", "comment": null, "summary": "The Bayesian approach to inverse problems provides a practical way to solve ill-posed problems by augmenting the observation model with prior information. Due to the measure-theoretic underpinnings, the approach has raised theoretical interest, leading to a rather comprehensive description in infinite-dimensional function spaces. The goal of this article is to bridge the infinite-dimensional theory for linear inverse problems in distribution spaces and associated computational inverse problems without resorting to a discrete approximation of the forward model. We will shown that under certain assumptions, discretization of the unknown of interest is not necessary for the numerical treatment of the problem, the only approximations required being numerical quadratures that are independent of any discrete representation of the unknown. An analysis of the connection between the proposed approach and discretization-based ones is also provided."}
{"id": "2602.10264", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.10264", "abs": "https://arxiv.org/abs/2602.10264", "authors": ["Lucas Benigni", "Simon Coste", "Guillaume Dubach"], "title": "The delocalization of eigenvectors of real elliptic matrices", "comment": "20 pages, 4 figures", "summary": "We investigate delocalization phenomena for eigenvectors of real random matrices that are invariant by orthogonal transformations. A specific phenomenon with these ensembles is that an eigenvector is typically more localized when its eigenvalue is closer to the real axis while for unitarily invariant ensembles, all eigenvectors are delocalized at the same level. More precisely, we measure the delocalization level of a vector $x\\in \\mathbb{C}^N$ using the Inverse Participation Ratio $\\mathrm{IPR}(x) = N|x|_4^4 / |x|_2^4 \\geqslant 1$. A higher IPR means a more localized vector. Using the exact distribution of the Schur decomposition of some paradigmatic rotation-invariant matrix models, we prove that conditionally on having an eigenvalue $λ$ with $|\\mathfrak{Im}(λ)| = y / \\sqrt{N}$, the IPR of the associated eigenvector converges in distribution towards a random variable $\\ell_y$ with an explicit density depending only on $y$. We then prove that $\\ell_y \\to 3$ when $y \\to 0$ and $\\ell_y \\to 2$ when $y\\to +\\infty$, coherently with the observed phenomenon.\n  This result is explicitly proved for higher-order IPRs and for the real Elliptic Ginibre ensemble at every non-symmetry parameter $τ\\in [0,1[$, including the classical real Ginibre ensemble ($τ=0$)."}
{"id": "2602.10760", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.10760", "abs": "https://arxiv.org/abs/2602.10760", "authors": ["Zhang Li-Xin"], "title": "Covariate-Adaptive Randomization in Clinical Trials Without Inflated Variances", "comment": "28 pages", "summary": "Covariate adaptive randomization (CAR) procedures are extensively used to reduce the likelihood of covariate imbalances occurring in clinical trials. In literatures, a lot of CAR procedures have been proposed so that the specified covariates are balanced well between treatments. However, the variance of the imbalance of the unspecified covariates may be inflated comparing to the one under the simple randomization. The inflation of the variance causes the usual test of treatment effects being not valid and adjusting the test being not an easy work. In this paper, we propose a new kind covariate adaptive randomization procedures to balance covariates between two treatments with a ratio $ρ:(1-ρ)$. Under this kind of CAR procedures, the convergence rate of the imbalance of the specified covariates is $o(n^{1/2})$, and at the same time the asymptotic variance of the imbalance of any unspecified (observed or unobserved) covariates does not exceed the one under the simple randomization. The ``shift problem'' found by Liu, Hu, and Ma (2025) will not appear under the new CAR procedures."}
{"id": "2602.10374", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.10374", "abs": "https://arxiv.org/abs/2602.10374", "authors": ["Yiwen Chen"], "title": "Relationships between full-space and subspace quadratic interpolation models and simplex derivatives", "comment": null, "summary": "Quadratic interpolation models and simplex derivatives are fundamental tools in numerical optimization, particularly in derivative-free optimization. When constructed in suitably chosen affine subspaces, these tools have been shown to be especially effective for high-dimensional derivative-free optimization problems, where full-space model construction is often impractical. In this paper, we analyze the relationships between full-space and subspace formulations of these tools. In particular, we derive explicit conversion formulas between full-space and subspace models, including minimum-norm models, minimum Frobenius norm models, least Frobenius norm updating models, as well as models constructed via generalized simplex gradients and Hessians. We show that the full-space and subspace models coincide on the affine subspace and, in general, along directions in the orthogonal complement. Overall, our results provide a theoretical framework for understanding subspace approximation techniques and offer insight into the design and analysis of derivative-free optimization methods."}
{"id": "2602.10248", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10248", "abs": "https://arxiv.org/abs/2602.10248", "authors": ["Jiawen Lyu", "Maria Han Veiga"], "title": "Low-rank approximation of Rippa method for RBF interpolation", "comment": "19 pages, 20 figures", "summary": "We study the problem of selecting the shape parameter in Radial Basis function (RBF) interpolation using leave-one-out-cross-validation (LOOCV). Since the classical LOOCV formula requires repeated solves with a dense $N \\times N$ kernel matrix, we combine a Nyström approximation with the Woodbury identity to obtain an efficient surrogate objective that avoids large matrix inversions. Based on this reduced form, we compare a grid-based search with a gradient descent strategy and examine their behavior across different dimensions. Numerical experiments are performed in 1D, 2D, and 3D using the Inverse Multiquadratic RBF to illustrate the computational advantages of the approximation as well as the situations in which it may introduce additional sensitivity. These results show that the proposed acceleration makes LOOCV-based parameter tuning practical for larger datasets while preserving the qualitative behavior of the full method."}
{"id": "2602.10448", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.10448", "abs": "https://arxiv.org/abs/2602.10448", "authors": ["Shiping Cao", "Zhen-Qing Chen"], "title": "Heat kernel for reflected jump diffusion on Ahlfors regular domains", "comment": null, "summary": "We study reflected jump diffusions on Ahlfors regular domains in general metric measure spaces. Under the condition that the Dirichlet form on the ambient space satisfies a capacity upper bound estimate, we construct an extension operator from the reflected Dirichlet space to the ambient Dirichlet space, with a scale-invariant local bound. Second, we establish the mixed stable-like heat kernel estimates for the reflected jump diffusion, assuming that the process on the ambient space satisfies the same type of heat kernel estimates."}
{"id": "2602.10774", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.10774", "abs": "https://arxiv.org/abs/2602.10774", "authors": ["Ilaria Nadin", "Tatyana Krivobokova", "Farida Enikeeva"], "title": "Nonparametric two sample test of spectral densities", "comment": null, "summary": "A novel nonparametric test for the equality of the covariance matrices of two Gaussian stationary processes, possibly of different lengths, is proposed. The test translates to testing the equality of two spectral densities and is shown to be minimax rate-optimal. Test performance is validated in a simulation study, and the practical utility is demonstrated in the analysis of real electroencephalography data. The test is implemented in the R-package sdf.test."}
{"id": "2602.10436", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.10436", "abs": "https://arxiv.org/abs/2602.10436", "authors": ["Mateo Díaz", "Pedro Izquierdo Lehmann", "Haihao Lu", "Jinwen Yang"], "title": "Active set identification and rapid convergence for degenerate primal-dual problems", "comment": "45 pages, 8 figures", "summary": "Primal-dual methods for solving convex optimization problems with functional constraints often exhibit a distinct two-stage behavior. Initially, they converge towards a solution at a sublinear rate. Then, after a certain point, the method identifies the set of active constraints and the convergence enters a faster local linear regime. Theory characterizing this phenomenon spans over three decades. However, most existing work only guarantees eventual identification of the active set and relies heavily on nondegeneracy conditions, such as strict complementarity, which often fail to hold in practice. We characterize mild conditions on the problem geometry and the algorithm under which this phenomenon provably occurs. Our guarantees are entirely nonasymptotic and, importantly, do not rely on strict complementarity. Our framework encompasses several widely-used algorithms, including the proximal point method, the primal-dual hybrid gradient method, the alternating direction method of multipliers, and the extragradient method."}
{"id": "2602.10268", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10268", "abs": "https://arxiv.org/abs/2602.10268", "authors": ["Haifeng Wang", "Xiaoming Wang", "Min Zhang"], "title": "Unconditionally Long-Time Stable Variable-Step Second-Order Exponential Time-Differencing Schemes for the Incompressible NSE", "comment": null, "summary": "We develop an efficient, unconditionally stable, variable step second order exponential time differencing scheme for the incompressible Navier Stokes equations in two and three spatial dimensions under periodic boundary conditions, together with an embedded adaptive time stepping variant. The scheme is unconditionally uniform in time stable in the sense that the numerical solution admits a time uniform bound in Linfinity over time with values in L2 to the power d whenever the external forcing term is uniformly bounded in time in L2, for all Reynolds numbers and for arbitrary choices of time step sizes.\n  At each time step, the method requires the solution of two time dependent Stokes problems, which can be evaluated explicitly in the periodic setting using Fourier techniques, along with the solution of a single scalar cubic algebraic equation. Beyond the standard exponential time differencing framework, the proposed scheme incorporates two recently developed ingredients. The first is a dynamic second order scalar auxiliary variable correction, which is essential for achieving second order temporal accuracy. The second is a mean reverting scalar auxiliary variable multistep formulation, which plays a central role in ensuring long time stability.\n  The proposed methods overcome key limitations of existing approaches for the Navier Stokes equations. Classical Runge Kutta schemes generally lack provable long time stability, while IMEX and scalar auxiliary variable based BDF methods typically do not admit unconditional stability guarantees in the variable step setting. Numerical experiments in two spatial dimensions confirm second order temporal accuracy, uniform long time stability, and effective error control provided by the adaptive strategy. Rigorous convergence analysis and a systematic investigation of long time statistical properties will be pursued in future work."}
{"id": "2602.10628", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.10628", "abs": "https://arxiv.org/abs/2602.10628", "authors": ["Eliezer Fuentes-Quezada", "Jamol Pender"], "title": "Queues with Rechargeable Servers", "comment": "50 pages, 6 figures", "summary": "Drone delivery systems violate a core assumption in classical queueing models: server capacity is not fixed. Drones (servers) periodically must recharge, creating random fluctuations in service availability. We introduce an Erlang--S$^{*}$ queue that incorporates charging dynamics (probability of charging after service completion $p$ and charging return rate $γ$) together with abandonment. We derive fluid and diffusion limits, yielding closed-form steady-state means, variances, and covariances for the joint queue--server process $(Q,S)$. The diffusion limits allow us to derive new staffing rules for the probability of delay and the probability of abandonment targets. A key insight is that server stochasticity induces systematic capacity loss relative to fixed--server systems, leading to a regime--dependent staffing adjustment: additive shifts in underloaded regimes and multiplicative scaling in overloaded regimes. Our simulation experiments confirm both the accuracy of the limit theorems and the performance of the staffing schedule's ability to achieve their targets."}
{"id": "2602.10989", "categories": ["math.ST", "cs.IT", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.10989", "abs": "https://arxiv.org/abs/2602.10989", "authors": ["Yifan Chen", "Eric Vanden-Eijnden"], "title": "Variational Optimality of Föllmer Processes in Generative Diffusions", "comment": null, "summary": "We construct and analyze generative diffusions that transport a point mass to a prescribed target distribution over a finite time horizon using the stochastic interpolant framework. The drift is expressed as a conditional expectation that can be estimated from independent samples without simulating stochastic processes. We show that the diffusion coefficient can be tuned \\emph{a~posteriori} without changing the time-marginal distributions. Among all such tunings, we prove that minimizing the impact of estimation error on the path-space Kullback--Leibler divergence selects, in closed form, a Föllmer process -- a diffusion whose path measure minimizes relative entropy with respect to a reference process determined by the interpolation schedules alone. This yields a new variational characterization of Föllmer processes, complementing classical formulations via Schrödinger bridges and stochastic control. We further establish that, under this optimal diffusion coefficient, the path-space Kullback--Leibler divergence becomes independent of the interpolation schedule, rendering different schedules statistically equivalent in this variational sense."}
{"id": "2602.10452", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.10452", "abs": "https://arxiv.org/abs/2602.10452", "authors": ["Zhaoye Pan", "Haozhe Lei", "Fan Zuo", "Zilin Bian", "Tao Li"], "title": "Distributed Online Convex Optimization with Nonseparable Costs and Constraints", "comment": null, "summary": "This paper studies distributed online convex optimization with time-varying coupled constraints, motivated by distributed online control in network systems. Most prior work assumes a separability condition: the global objective and coupled constraint functions are sums of local costs and individual constraints. In contrast, we study a group of agents, networked via a communication graph, that collectively select actions to minimize a sequence of nonseparable global cost functions and to stratify nonseparable long-term constraints based on full-information feedback and intra-agent communication. We propose a distributed online primal-dual belief consensus algorithm, where each agent maintains and updates a local belief of the global collective decisions, which are repeatedly exchanged with neighboring agents. Unlike the previous consensus primal-dual algorithms under separability that ask agents to only communicate their local decisions, our belief-sharing protocol eliminates coupling between the primal consensus disagreement and the dual constraint violation, yielding sublinear regret and cumulative constraint violation (CCV) bounds, both in $O({T}^{1/2})$, where $T$ denotes the time horizon. Such a result breaks the long-standing $O(T^{3/4})$ barrier for CCV and matches the lower bound of online constrained convex optimization, indicating the online learning efficiency at the cost of communication overhead."}
{"id": "2602.10277", "categories": ["math.NA", "physics.optics"], "pdf": "https://arxiv.org/pdf/2602.10277", "abs": "https://arxiv.org/abs/2602.10277", "authors": ["Randy Bartels", "Olivier Pinaud"], "title": "Blind source separation for imaging", "comment": null, "summary": "This work is concerned with the problem of blind source separation and its applications to imaging. We first establish a theoretical result that we stated in our previous article on imaging in diffusive environments. This result is a generalization of separability criteria found in the literature to arbitrary correlated complex-valued sources with additive noise. In a second step, we verify these separability conditions in two propagation regimes frequently encountered in imaging: the speckle regime and the random geometrical optics regime. Finally, we propose a new imaging method based on the blind source separation problem that improves on images obtained with the classical decomposition of the time reversal operator method."}
{"id": "2602.10672", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.10672", "abs": "https://arxiv.org/abs/2602.10672", "authors": ["Xiaochen Ma", "Panpan Ren"], "title": "Extrinsic derivatives for SDEs and SPDEs with distribution dependent noise", "comment": null, "summary": "The Bismut formula is a crucial tool characterizing regularities of stochastic systems, and has been extensively studied for various models. However it is not yet available for SDEs with distribution dependent noise. In this paper, we first establish a Bismut type formula for the extrinsic derivative of McKean-Vlasov SDEs driven by distribution dependent noise, then make an extension to a class of distribution dependent SPDEs."}
{"id": "2602.11132", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.11132", "abs": "https://arxiv.org/abs/2602.11132", "authors": ["Jyotishka Datta", "Nicholas G. Polson", "Vadim Sokolov", "Daniel Zantedeschi"], "title": "A New Look at Bayesian Testing", "comment": null, "summary": "We develop a unified framework for Bayesian hypothesis testing through the theory of moderate deviations, providing explicit asymptotic expansions for Bayes risk and optimal test statistics. Our analysis reveals that Bayesian test cutoffs operate on the moderate deviation scale $\\sqrt{\\log n/n}$, in sharp contrast to the sample-size-invariant calibrations of classical testing. This fundamental difference explains the Lindley paradox and establishes the risk-theoretic superiority of Bayesian procedures over fixed-$α$ Neyman-Pearson tests. We extend the seminal Rubin (1965) program to contemporary settings including high-dimensional sparse inference, goodness-of-fit testing, and model selection. The framework unifies several classical results: Jeffreys' $\\sqrt{\\log n}$ threshold, the BIC penalty $(d/2)\\log n$, and the Chernoff-Stein error exponents all emerge naturally from moderate deviation analysis of Bayes risk. Our results provide theoretical foundations for adaptive significance levels and connect Bayesian testing to information theory through gambling-based interpretations."}
{"id": "2602.10461", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.10461", "abs": "https://arxiv.org/abs/2602.10461", "authors": ["Christian Pehle", "Jean-Jacques Slotine"], "title": "Unlocked Backpropagation using Wave Scattering", "comment": "8 pages", "summary": "Both the backpropagation algorithm in machine learning and the maximum principle in optimal control theory are posed as a two-point boundary problem, resulting in a \"forward-backward\" lock. We derive a reformulation of the maximum principle in optimal control theory as a hyperbolic initial value problem by introducing an additional \"optimization time\" dimension. We introduce counter-propagating wave variables with finite propagation speed and recast the optimization problem in terms of scattering relationships between them. This relaxation of the original problem can be interpreted as a physical system that equilibrates and changes its physical properties in order to minimize reflections. We discretize this continuum theory to derive a family of fully unlocked algorithms suitable for training neural networks. Different parameter dynamics, including gradient descent, can be derived by demanding dissipation and minimization of reflections at parameter ports. These results also imply that any physical substrate that supports the scattering and dissipation of waves can be interpreted as solving an optimization problem."}
{"id": "2602.10301", "categories": ["math.NA", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2602.10301", "abs": "https://arxiv.org/abs/2602.10301", "authors": ["Alaa Ahmed"], "title": "Impact of Separation Distance on the Performance and Annual Energy Production of a Dual-Flap Oscillating Surge Wave Energy Converter", "comment": null, "summary": "Among the different concepts for wave energy conversion, oscillating surge wave energy converters have been shown to have a high capture width ratio. The primary wave capture structure consists of a flap hinged at the seabed or to a floating platform. Different flap configurations, including single and dual-flap, have been investigated. The separation distance between the oscillating surge wave energy converters can have an impact on their response when deployed in arrays. We consider the case of a dual-flap oscillating surge wave energy converter and investigate the impact of the separation distance between them on the performance of each flap. We estimate the absorbed wave energy and the annual energy production by the two flaps when deployed at the PacWave South site. Inviscid numerical simulations were conducted to predict the response of the oscillating surge wave energy converters. The simulations are validated with experimental measurements of a 1:10 scaled model in a wave tank. The results show that for a short separation distance, the interaction between the oscillating surge wave energy converters has a destructive and constructive effect depending on the wave frequency. However, these effects tend to balance each other out when considering the broad range of wave excitations. For longer separation distances, the interaction always results in a constructive effect. The results reveal that the separation distance has an insignificant impact on annual energy production when considering all wave frequencies and amplitudes."}
{"id": "2602.10721", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.10721", "abs": "https://arxiv.org/abs/2602.10721", "authors": ["Zechun Hu", "Ting Ma", "Renming Song", "Li Wang"], "title": "The range of once-reinforced random walk on the half-line", "comment": "11 pages", "summary": "In this paper, we consider a once-reinforced random walk on the half-line, and give the limiting behaviors of all the moments of its range."}
{"id": "2602.11129", "categories": ["math.PR", "cs.IT", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.11129", "abs": "https://arxiv.org/abs/2602.11129", "authors": ["Andreas Göbel", "Marcus Pappik", "Leon Schiller"], "title": "Information-Theoretic Thresholds for Bipartite Latent-Space Graphs Under Noisy Observations", "comment": null, "summary": "We study information-theoretic phase transitions for the detectability of latent geometry in bipartite random geometric graphs RGGs with Gaussian d-dimensional latent vectors while only a subset of edges carries latent information determined by a random mask with i.i.d. Bern(q) entries. For any fixed edge density p in (0,1) we determine essentially tight thresholds for this problem as a function of d and q. Our results show that the detection problem is substantially easier if the mask is known upfront compared to the case where the mask is hidden.\n  Our analysis is built upon a novel Fourier-analytic framework for bounding signed subgraph counts in Gaussian random geometric graphs that exploits cancellations which arise after approximating characteristic functions by an appropriate power series. The resulting bounds are applicable to much larger subgraphs than considered in previous work which enables tight information-theoretic bounds, while the bounds considered in previous works only lead to lower bounds from the lens of low-degree polynomials. As a consequence we identify the optimal information-theoretic thresholds and rule out computational-statistical gaps. Our bounds further improve upon the bounds on Fourier coefficients of random geometric graphs recently given by Bangachev and Bresler [STOC'24] in the dense, bipartite case. The techniques also extend to sparser and non-bipartite settings, at least if the considered subgraphs are sufficiently small. We furhter believe that they might help resolve open questions for related detection problems."}
{"id": "2602.10470", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.10470", "abs": "https://arxiv.org/abs/2602.10470", "authors": ["Ching-pei Lee", "Stephen J. Wright"], "title": "Revisiting Superlinear Convergence of Proximal Newton-Like Methods to Degenerate Solutions", "comment": null, "summary": "We describe inexact proximal Newton-like methods for solving degenerate regularized optimization problems and for the broader problem of\n  finding a zero of a generalized equation that is the sum of a continuous map and a maximal monotone operator. Superlinear convergence for both the distance to the solution set and a certain measure of first-order optimality can be achieved under a Hölderian error bound condition, including for problems in which the continuous map is nonmonotone, with Jacobian singular at the solution and not Lipschitz. Superlinear convergence is attainable even when the Jacobian is merely uniformly continuous, relaxing the standard Lipschitz assumption to its theoretical limit. For convex regularized optimization problems, we introduce a novel globalization strategy that ensures strict objective decrease and avoids the Maratos effect, attaining local $Q$-superlinear convergence without prior knowledge of problem parameters. Unit step size acceptance in our line search strategy does not rely on continuity or even existence of the Hessian of the smooth term in the objective, making the framework compatible with other potential candidates for superlinearly convergent updates."}
{"id": "2602.10424", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10424", "abs": "https://arxiv.org/abs/2602.10424", "authors": ["Zhongxiao Jia", "Xinyuan Wan"], "title": "A Numerical Analysis of Sketched Linear Squares Problems and Stopping Criteria for Iterative Solvers", "comment": "26 pages, 15 figures", "summary": "Randomized subspace embedding methods have had a great impact on the solution of a linear least squares (LS) problem by reducing its row dimension, leading to a randomized or sketched LS (sLS) problem, and use the solution of the sLS problem as an approximate solution of the LS problem. This work makes a numerical analysis on the sLS problem, establishes its numerous theoretical properties, and show their crucial roles on the most effective and efficient use of iterative solvers. We first establish a compact bound on the norm of the residual difference between the solutions of the LS and sLS problems, which is the first key result towards understanding the rationale of the sLS problem. Then from the perspective of backward errors, we prove that the solution of the sLS problem is the one of a certain perturbed LS problem with minimal backward error, and quantify how the embedded quality affects the residuals, solution errors, and the relative residual norms of normal equations of the LS and sLS problems. These theoretical results enable us to propose new novel and reliable general-purpose stopping criteria for iterative solvers for the sLS problem, which dynamically monitor stabilization patterns of iterative solvers for the LS problem itself and terminate them at the earliest iteration. Numerical experiments justify the theoretical bounds and demonstrate that the new stopping criteria work reliably and result in a tremendous reduction in computational cost without sacrificing attainable accuracy."}
{"id": "2602.10782", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.10782", "abs": "https://arxiv.org/abs/2602.10782", "authors": ["Piotr Śniady"], "title": "Exact determinant formulas for coalescing particle systems", "comment": "31 pages, 13 figures", "summary": "When particles on a line collide, they may coalesce into one. Such systems model diverse phenomena, from voter dynamics and opinion formation to ancestral lineages in population genetics. Computing exact coalescence probabilities has been difficult because collisions reduce the particle count, while classical determinantal methods require a fixed count throughout. We introduce ghost particles: when two particles merge, the discarded trajectory continues as an invisible walker. Ghosts restore the missing dimension, enabling an exact determinantal formula. We prove that the probability of any specified coalescence pattern is given by a determinant. Integrating out ghost positions yields a closed-form ghost-free formula for the surviving particles. The framework applies to discrete lattice paths, birth-death chains, and continuous diffusions including Brownian motion."}
{"id": "2602.10580", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.10580", "abs": "https://arxiv.org/abs/2602.10580", "authors": ["Quang Dinh Thien Nguyen", "Duc Anh Nguyen", "Hoang Huy Nguyen", "Siva Theja Maguluri"], "title": "Almost Sure Convergence of Nonlinear Stochastic Approximation: An Interplay of Noise and Step Size", "comment": "29 pages, 2 figures", "summary": "We study the almost sure convergence of the Stochastic Approximation algorithm to the fixed point $x^\\star$ of a nonlinear operator under a negative drift condition and a general noise sequence with finite $p$-th moment for some $p > 1$. Classical almost sure convergence results of Stochastic Approximation are mostly analyzed for the square-integrable noise setting, and it is shown that any non-summable but square-summable step size sequence is sufficient to obtain almost sure convergence. However, such a limitation prevents wider algorithmic application. In particular, many applications in Machine Learning and Operations Research admit heavy-tailed noise with infinite variance, rendering such guarantees inapplicable. On the other hand, when a stronger condition on the noise is available, such guarantees on the step size would be too conservative, as practitioners would like to pick a larger step size for a more preferable convergence behavior. To this end, we show that any non-summable but $p$-th power summable step size sequence is sufficient to guarantee almost sure convergence, covering the gap in the literature.\n  Our guarantees are obtained using a universal Lyapunov drift argument. For the regime $p \\in (1, 2)$, we show that using the Lyapunov function $\\norm{x-x^\\star}^p$ and applying a Taylor-like bound suffice. For $p > 2$, such an approach is no longer applicable, and therefore, we introduce a novel iterate projection technique to control the nonlinear terms produced by high-moment bounds and multiplicative noise. We believe our proof techniques and their implications could be of independent interest and pave the way for finite-time analysis of Stochastic Approximation under a general noise condition."}
{"id": "2602.10440", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10440", "abs": "https://arxiv.org/abs/2602.10440", "authors": ["Zhiwei Yang", "Yikan Liu"], "title": "Identifying the source term in a viscoelastic membrane with a Riemann-Liouville time derivative by the partial interior observation", "comment": "16 pages, 2 figures, 3 tables", "summary": "This paper studies an inverse source problem for a viscoelastic membrane, where the material's memory effect is characterized by the Riemann-Liouville fractional derivative. The problem is to recover the unknown source term from the limited interior observation data. We propose an optimal control framework to address this ill-posed inverse problem. The first-order optimality condition leads to a coupled system of forward and backward fractional partial differential equations. A numerical algorithm combining the finite element method and a conjugate gradient iterative scheme is then developed for the reconstruction of the source term. Several numerical examples are provided to demonstrate the effectiveness and robustness of the proposed method."}
{"id": "2602.10783", "categories": ["math.PR", "math.AC"], "pdf": "https://arxiv.org/pdf/2602.10783", "abs": "https://arxiv.org/abs/2602.10783", "authors": ["Ayat Ababneh", "Matthew Kahle"], "title": "Random chain complexes of real vector spaces", "comment": "15 pages", "summary": "We introduce a natural class of models of random chain complexes of real vector spaces that some classical ensembles of random matrices, the length $1$ case. We are interested here in the homological properties of these random complexes. For chain complexes of length $1$ or $2$, we characterize the Betti numbers almost surely, in terms of the dimensions of the vector spaces. We further examine complexes of length $3$ with some constraints on dimensions, as well as complexes of arbitrary finite length in which all vector spaces have equal dimension. Across all these settings, we show that the sum of the Betti numbers is almost surely as small as possible, attaining a trivial lower bound $|χ|$ dictated by the dimensions of the underlying vector spaces and the Euler formula. These results suggest an underlying algebraic heuristic for a phenomenon frequently observed in stochastic topology, that nontrivial homology rarely appears unless forced to."}
{"id": "2602.10697", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.10697", "abs": "https://arxiv.org/abs/2602.10697", "authors": ["Ferdinand Genans"], "title": "Fast and Large-Scale Unbalanced Optimal Transport via its Semi-Dual and Adaptive Gradient Methods", "comment": null, "summary": "Unbalanced Optimal Transport (UOT) has emerged as a robust relaxation of standard Optimal Transport, particularly effective for handling outliers and mass variations. However, scalable algorithms for UOT, specifically those based on Gradient Descent (SGD), remain largely underexplored. In this work, we address this gap by analyzing the semi-dual formulation of Entropic UOT and demonstrating its suitability for adaptive gradient methods. While the semi-dual is a standard tool for large-scale balanced OT, its geometry in the unbalanced setting appears ill-conditioned under standard analysis. Specifically, worst-case bounds on the marginal penalties using $χ^2$ divergence suggest a condition number scaling with $n/\\varepsilon$, implying poor scalability. In contrast, we show that the local condition number actually scales as $\\mathcal{O}(1/\\varepsilon)$, effectively removing the ill-conditioned dependence on $n$. Exploiting this property, we prove that SGD methods adapt to this local curvature, achieving a convergence rate of $\\mathcal{O}(n/\\varepsilon T)$ in the stochastic and online regimes, making it suitable for large-scale and semi-discrete applications. Finally, for the full batch discrete setting, we derive a nearly tight upper bound on local smoothness depending solely on the gradient. Using it to adapt step sizes, we propose a modified Adaptive Nesterov Accelerated Gradient (ANAG) method on the semi-dual functional and prove that it achieves a local complexity of $\\mathcal{O}(n^2\\sqrt{1/\\varepsilon}\\ln(1/δ))$."}
{"id": "2602.10541", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.10541", "abs": "https://arxiv.org/abs/2602.10541", "authors": ["Antonin Sulc"], "title": "Solving PDEs in One Shot via Fourier Features with Exact Analytical Derivatives", "comment": "9 pages, 1 figure, ICLR 2026 Workshop on AI and Partial Differential Equations", "summary": "Recent random feature methods for solving partial differential equations (PDEs) reduce computational cost compared to physics-informed neural networks (PINNs) but still rely on iterative optimization or expensive derivative computation. We observe that sinusoidal random Fourier features possess a cyclic derivative structure: the derivative of any order of $\\sin(\\mathbf{W}\\cdot\\mathbf{x}+b)$ is a single sinusoid with a monomial prefactor, computable in $O(1)$ operations. Alternative activations such as $\\tanh$, used in prior one-shot methods like PIELM, lack this property: their higher-order derivatives grow as $O(2^n)$ terms, requiring automatic differentiation for operator assembly. We propose FastLSQ, which combines frozen random Fourier features with analytical operator assembly to solve linear PDEs via a single least-squares call, and extend it to nonlinear PDEs via Newton--Raphson iteration where each linearized step is a FastLSQ solve. On a benchmark of 17 PDEs spanning 1 to 6 dimensions, FastLSQ achieves relative $L^2$ errors of $10^{-7}$ in 0.07\\,s on linear problems, three orders of magnitude more accurate and significantly faster than state-of-the-art iterative PINN solvers, and $10^{-8}$ to $10^{-9}$ on nonlinear problems via Newton iteration in under 9s."}
{"id": "2602.10841", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.10841", "abs": "https://arxiv.org/abs/2602.10841", "authors": ["Xing Huang", "Panpan Ren", "Feng-Yu Wang"], "title": "Regularities for McKean-Vlasov SDEs with Local Distributional Interactions", "comment": "37 pages", "summary": "Let $ \\tilde W^{-δ,k}$ be the local negative Sobolev space on $\\mathbb{R}^d$ with indexes $δ\\in [0,\\infty)$ and $k\\in [1,\\infty].$ We study McKean-Vlasov SDEs with interaction kernels in $\\tilde W^{-δ,k}.$ By developing a time-shift argument which allows the singular interactions vanishing at time $0$, the global well-posedness is proved for regular enough initial distributions and any singular indexes $(δ,k)\\in [0,\\infty)\\times [1,\\infty],$ and for any initial distributions provided $δ+\\frac{d}{k} < 1$. Moreover, the relative entropy and the $\\|\\cdot\\|_{δ,k*}$-distance induced by $\\tilde W^{-δ,k}$ are estimated for the time-marginal distributions of solutions by using the Wasserstein distance of initial distributions, which describe the regularity of the solution in initial distribution. In particular, the main results apply to Nemytskii-type SDEs which point-wisely depend on the density function and its derivatives, as well as McKean-Vlasov SDEs with interactions more singular than Riesz kernels."}
{"id": "2602.10838", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.10838", "abs": "https://arxiv.org/abs/2602.10838", "authors": ["Denis Zorba", "David Šiška", "Lukasz Szpruch"], "title": "Mirror descent actor-critic methods for entropy regularised MDPs in general spaces: stability and convergence", "comment": "27 pages", "summary": "We provide theoretical guarantees for convergence of discrete-time policy mirror descent with inexact advantage functions updated using temporal difference (TD) learning for entropy regularised MDPs in Polish state and action spaces. We rigorously derive sufficient conditions under which the single-loop actor-critic scheme is stable and convergent. To weaken these conditions, we introduce a variant that performs multiple TD steps per policy update and derive an explicit lower bound on the number of TD steps required to ensure stability. Finally, we establish sub-linear convergence when the number of TD steps grows logarithmically with the number of policy updates, and linear convergence when it grows linearly under a concentrability assumption."}
{"id": "2602.10550", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10550", "abs": "https://arxiv.org/abs/2602.10550", "authors": ["Huangxin Chen", "Yuxiang Chen", "Jisheng Kou", "Shuyu Sun"], "title": "An Energy-Stable, Bound-Preserving and Locally Conservative Numerical Framework for Multicomponent Gas Flow in Poroelastic Media", "comment": null, "summary": "In this paper, we propose a robust and efficient numerical framework for simulating multicomponent gas flow in poroelastic media, with a focus on preserving fundamental thermodynamic principles and ensuring computational reliability. The model captures the complex nonlinear coupling between multicomponent transport and solid deformation, while addressing critical numerical challenges such as mass conservation, energy stability, and molar density boundedness. To achieve this, we develop a stabilized discretization approach that guarantees the preservation of the original energy dissipation law and ensures the boundedness of each gas component's molar density. Furthermore, the proposed method incorporates an adaptive time-stepping strategy that dynamically adjusts the time step size based on the system's dynamics, significantly enhancing computational efficiency without compromising stability or accuracy. For spatial discretization, a mixed finite element method combined with an upwind scheme is employed for the flow and transport equations to ensure local mass conservation, while a discontinuous Galerkin (DG) method is utilized for discretizing the momentum equation of poroelasticity to effectively overcome numerical locking phenomena. Numerical experiments are presented to demonstrate the performance, robustness, and applicability of the method in simulating multicomponent gas flow under various scenarios."}
{"id": "2602.10857", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.10857", "abs": "https://arxiv.org/abs/2602.10857", "authors": ["Arvind Ayyer", "Saham Sil"], "title": "Factorised stationary states for a long range misanthrope process", "comment": "31 pages, 3 figures", "summary": "The misanthrope process is an interacting particle system where particles move between neighbouring sites with hop rates depending only on the number of particles at the departure and arrival sites. Motivated by a discretised version of the Hammersley--Aldous--Diaconis process, we introduce a partially asymmetric long range misanthrope process (PALRMP) on a finite one-dimensional lattice with periodic boundary conditions where particles can move between sites that are not necessarily neighbours, as long as there are no particles in between the departure and arrival sites. In this model, each site $\\ell$ has an inhomogeneous rate parameter $x_\\ell$ associated to it, and the hop rate of a particle moving from site $k$ to site $\\ell$ depends upon the parameter associated to the target site $x_\\ell$, the direction the particle moves, and the number of particles at sites $k$ and $\\ell$. We also consider the homogeneous PALRMP, where all the $x_\\ell$'s are 1. We find necessary and sufficient conditions on the hop rates under which the stationary distribution is of factorised form for both the PALRMP and the homogeneous PALRMP, as well as the extreme variants, namely the ones where the particle motion is totally asymmetric (TALRMP) and symmetric (SLRMP). As an illustrative example, we study in detail the discrete Hammersley--Aldous--Diaconis process."}
{"id": "2602.10866", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.10866", "abs": "https://arxiv.org/abs/2602.10866", "authors": ["Léo Baty", "Axel Parmentier"], "title": "Managing delay in tail assignment: from minimum turn time to stochastic routing at Air France", "comment": "28 pages", "summary": "On-time performance is a critical challenge in the airline industry, leading to large operational and customer dissatisfaction costs. The tail assignment problem builds the sequences of flights or routes followed by individual airplanes. While airlines cannot avoid some sources of delay, choosing routes wisely limits propagation along these. This paper addresses the stochastic tail assignment problem at Air France. We propose a column generation approach for this problem. The key ingredient is the pricing algorithm, which is a stochastic shortest path problem. We use dedicated bounds to discard paths in an enumeration algorithm, and introduce new bounds based on a lattice ordering of the set of piecewise linear convex functions to strike a balance between bounds quality and computational cost. A diving heuristic enables us to retrieve integer solutions. Numerical experiments on real-world Air France instances demonstrate that our algorithms lead to an average 0.28% optimality gap on instances with up to 600 flight legs in a few hours of computing time. The resulting solutions effectively balance operational costs and delay resilience, outperforming previous approaches based on minimum turn time."}
{"id": "2602.10590", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10590", "abs": "https://arxiv.org/abs/2602.10590", "authors": ["Diana Al Zareef", "Ahmad El Hajj", "Antoine Zurek"], "title": "Convergence of a scheme for a two dimensional nonlocal system of transport equations", "comment": null, "summary": "In this paper, we numerically study a two-dimensional system modeling the dynamics of dislocation densities. This system is hyperbolic, but not strictly hyperbolic, and couples two non-local transport equations. It is characterized by weak regularity in both the velocity and the initial data. We propose a semi-explicit finite difference (IMEX) numerical scheme for the discretization of this system, after regularizing the singular velocity using a Fejér kernel. We show that this scheme preserves, at the discrete level, an entropy estimate on the gradient, which then allows us to establish the convergence of the discrete solution to the continuous solution. To our knowledge, this is the first convergence result obtained for this type of system. We conclude with some numerical illustrations highlighting the performance of the proposed scheme."}
{"id": "2602.10974", "categories": ["math.PR", "math.MG"], "pdf": "https://arxiv.org/pdf/2602.10974", "abs": "https://arxiv.org/abs/2602.10974", "authors": ["Hugo Panzo"], "title": "Expected area of the star hull of planar Brownian motion and bridge", "comment": "26 pages", "summary": "We study the star hull of planar Brownian motion and bridge. Roughly speaking, this is the smallest starshaped set (with respect to the origin) that contains the trace of the path. In particular, we prove that the expected areas of the star hulls are $\\frac{3π}{8}$ and $\\fracπ{4}$ for planar Brownian motion and bridge, respectively. Our proofs rely on a detailed analysis of the first hitting time and place of a horizontal ray $\\mathcal{R}_ρ: = [ρ,\\infty)\\times\\{0\\}$ by planar Brownian motion starting at the origin. After deriving a remarkably simple Laplace transform of this joint law, we uncover via a probabilistic argument a surprising conditional structure: conditionally on the first hitting place being the point $(x,0)\\in \\mathcal{R}_ρ$, the hitting time is distributed as the first passage time to the level $x$ of one-dimensional Brownian motion starting at $0$."}
{"id": "2602.10920", "categories": ["math.OC", "math.AP", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.10920", "abs": "https://arxiv.org/abs/2602.10920", "authors": ["Benedikt Kaltenbach", "Christian Aarset", "Tram Thi Ngoc Nguyen"], "title": "Data assimilation via model reference adaptation for linear and nonlinear dynamical systems", "comment": null, "summary": "We address data assimilation for linear and nonlinear dynamical systems via the so-called \\emph{model reference adaptive system}. Continuing our theoretical developments in \\cite{Tram_Kaltenbacher_2021}, we deliver the first practical implementation of this approach for online parameter identification with time series data. Our semi-implicit scheme couples a modified state equation with a parameter evolution law that is driven by model-data residuals. We demonstrate four benchmark problems of increasing complexity: the Darcy flow, the Fisher-KPP equation, a nonlinear potential equation and finally, an Allen-Cahn type equation. Across all cases, explicit model reference adaptive system construction, verified assumptions and numerically stable reconstructions underline our proposed method as a reliable, versatile tool for data assimilation and real-time inversion."}
{"id": "2602.10605", "categories": ["math.NA", "cs.SE"], "pdf": "https://arxiv.org/pdf/2602.10605", "abs": "https://arxiv.org/abs/2602.10605", "authors": ["Peichen Xie"], "title": "Evaluating Numerical Accuracy in Mixed-Precision Computing by Dual-Delta Testing", "comment": null, "summary": "Mixed-precision computing has become increasingly important in modern high-performance computing and machine learning applications. When implementing custom mixed-precision functions -- such as fused operators, optimized GPU kernels, or quantized inference paths -- it is critical to verify their numerical accuracy. Traditional approaches typically compare the custom implementation against a reference using a single error metric. However, this single-delta approach provides limited insight into whether the observed errors are inherent to the precision level or specific to the implementation. This paper introduces \\textit{Dual-Delta Testing}, a systematic methodology that evaluates two error distributions against a high-precision oracle, enabling rigorous comparison between a custom implementation and a baseline reference. We present the mathematical framework, algorithmic formulation, statistical analysis techniques, and practical examples demonstrating the methodology's effectiveness in evaluating numerical accuracy."}
{"id": "2602.11032", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.11032", "abs": "https://arxiv.org/abs/2602.11032", "authors": ["Emmanuel Gnabeyeu", "Gilles Pagès", "Mathieu Rosenbaum"], "title": "Fake stationary rough Heston volatility: Microstructure-inspired foundations", "comment": "35 pages", "summary": "This paper investigates the asymptotic behavior of suitably time-modulated Hawkes processes with heavy-tailed kernels in a nearly unstable regime. We show that, under appropriate scaling, both the intensity processes and the rescaled Hawkes processes converge to a mean-reverting, time-inhomogeneous rough fractional square-root process and its integrated counterpart, respectively. In particular, when the original Hawkes process has a stationary first moment (constant marginal mean), the limiting process takes the form of a time-inhomogeneous rough fractional Cox-Ingersoll-Ross (CIR) equation with a constant mean-reversion parameter and a time-dependent diffusion coefficient. This class of equations is particularly appealing from a practical perspective, especially for the so-called $\\textit{fake stationary rough Heston}$ model. We further investigate the properties of such limiting scaled time-inhomogeneous Volterra equations, including moment bounds, path regularity and maximal inequality in the $L^p$ setting for every $p>0$."}
{"id": "2602.11048", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11048", "abs": "https://arxiv.org/abs/2602.11048", "authors": ["David Banks", "Elvan Ceyhan", "Leah Johnson", "Li Zhou"], "title": "Adversarial Graph Traversal", "comment": "10 pages, 4 figures. Simulation study included", "summary": "Suppose a Bayesian agent seeks to traverse a graph. Each time she crosses an edge, she pays a price. The first time she reaches a node, there is a payoff. She has an opponent who can reduce the payoffs. This paper uses adversarial risk analysis to find a solution to her route selection problem. It shows how the traveler is advantaged by having an accurate subjective distribution over the costs/payoffs and by having a Bayesian prior for her opponent's strategic choices. The results are relevant to military convoy routing, corporate competition, and certain games."}
{"id": "2602.10689", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10689", "abs": "https://arxiv.org/abs/2602.10689", "authors": ["Changjian Xie", "Yingxi Miao", "Haocheng Yang"], "title": "An Efficient Energy Stable Structure Preserving Method for The Landau-Lifshitz Equation", "comment": null, "summary": "One of the main difficulties in micromagnetics simulation is the norm preserving constraints $\\|\\mathbf{m}\\|=1$ at the continuous or the discrete level. Another difficulty is the stability with the time step constraint. Using standard explicit integrators leads to a physical time step of sub-pico seconds, which is often two orders of magnitude smaller than the fastest physical time scales. Direct implicit integrators require solving complicated, coupled systems. Another major difficulty with the projection method in this field is the lack of rigorous theoretical guarantees regarding its stability of the projection step. In this paper, we introduce a first order method. Such a method is structure preserving based on a combination of a Gauss-Seidel iteration, a double diffusion iteration and a Crank-Nicolson iteration to preserve the norm constraints."}
{"id": "2602.11036", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.11036", "abs": "https://arxiv.org/abs/2602.11036", "authors": ["Wei-Kuo Chen", "Te-Lun Lu", "Arnab Sen"], "title": "Complexity of the p-spin Hamiltonian with a Non-Rotationally Invariant Potential", "comment": "54 pages", "summary": "We investigate the complexity of the Hamiltonian in the pure $p$-spin spin glass model accompanied with a polynomial-type potential on $\\mathbb{R}^N$. In this Hamiltonian, the Gaussian field is anisotropic, and the potential lacks rotational invariance. Our main result derives the logarithmic limit for the expected number of critical points in terms of a variational formula. As a consequence, by identifying the critical location of the phase transition from our representation, we provide an upper bound for the ground state energy of the model."}
{"id": "2602.10773", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10773", "abs": "https://arxiv.org/abs/2602.10773", "authors": ["Tomás Caraballo", "Macarena Gómez-Mármol", "Ignacio Roldán"], "title": "The Stochastic TR-BDF2 Scheme of Order 2", "comment": null, "summary": "Our main objective in this paper is to develop a second-order stochastic numerical method which generalizes the well-known deterministic TR-BDF2 scheme. Since most stochastic techniques used for approximating the solution of a stochastic differential equation may have lower order compared to the deterministic case, we have elaborated a scheme which not only preserves the second-order accuracy of the original scheme in the stochastic framework, but also its $A$-stability. Once we obtain the scheme and prove its second-order accuracy and $A$-stability, which is not a trivial task, we also state a result concerning its $MS$-stability. This concept is also analyzed for different parameter ranges in our scheme and the It{ô}--Taylor approximation of order 2, revealing scenarios where, for certain time step sizes, the developed method is $MS$-stable while the It{ô}--Taylor one is not. This concept is really useful to tackle slow-fast problems such as stiff ones, which we aim to explore further in future work. Finally, we validate the theoretical results with some academic test cases."}
{"id": "2602.11051", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.11051", "abs": "https://arxiv.org/abs/2602.11051", "authors": ["Itai Benjamini", "Justin Salez"], "title": "How fast does the range of simple random walk grow?", "comment": "8 pages and 1 figure; comments welcome!", "summary": "Consider a discrete-time simple random walk $(X_t)_{t\\ge 0}$ on an infinite, connected, locally finite graph $G$. Let $R_t := |\\{X_0,\\dots,X_t\\}|$ denote its range at time $t$, and $T_n:=\\inf\\{t\\ge 0: R_t\\ge n\\}$ the $n-$th discovery time. We establish a general estimate on $\\mathbb E[T_n]$ in terms of two coarse geometric parameters of $G$, and deduce the universal bounds $\\mathbb E[T_n]\\le 4n^3\\log n$ and $\\mathbb E[R_t]\\gtrsim (t/\\log t)^{1/3}$. Moreover, we show that this is essentially sharp by constructing a multi-scale version of Feige's Lollipop graph satisfying $\\mathbb E[T_n]\\gtrsim n^{3}$ for all dyadic integers $n$. In light of this example, we ask whether the existence of \\emph{trapping phases} where the range grows sub-diffusively necessarily implies the existence of \\emph{expanding phases} where it grows super-diffusively. Finally, we provide a simple \\emph{uniform transience} condition under which the expected range grows linearly, and conjecture that all vertex-nonamenable graphs exhibit linear range."}
{"id": "2602.10786", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10786", "abs": "https://arxiv.org/abs/2602.10786", "authors": ["Jan Glaubitz", "Armin Iske", "Joshua Lampert", "Philipp Öffner"], "title": "Why summation by parts is not enough", "comment": null, "summary": "We investigate the construction and performance of summation-by-parts (SBP) operators, which offer a powerful framework for the systematic development of structure-preserving numerical discretizations of partial differential equations. Previous approaches for the construction of SBP operators have usually relied on either local methods or sparse differentiation matrices, as commonly used in finite difference schemes. However, these methods often impose implicit requirements that are not part of the formal SBP definition. We demonstrate that adherence to the SBP definition alone does not guarantee the desired accuracy, and we identify conditions for SBP operators to achieve both accuracy and stability. Specifically, we analyze the error minimization for an augmented basis, discuss the role of sparsity, and examine the importance of nullspace consistency in the construction of SBP operators. Furthermore, we show how these design criteria can be integrated into a recently proposed optimization-based construction procedure for function space SBP (FSBP) operators on arbitrary grids. Our findings are supported by numerical experiments that illustrate the improved accuracy for the numerical solution using the proposed SBP operators."}
{"id": "2602.11078", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.11078", "abs": "https://arxiv.org/abs/2602.11078", "authors": ["David Dereudre", "Christopher Renaud-Chan"], "title": "First-order phase transition for Gibbs point processes with saturated interactions", "comment": "32 pages", "summary": "We study first-order phase transitions in continuum Gibbs point processes with saturated interactions. These interactions form a broad class of Hamiltonians in which the local energy in regions of high particle density depends only on the number of points. Building on ideas of Pirogov-Sinai-Zahradnik theory and its adaptations to the continuum, we develop a general method for establishing the existence of two distinct infinite-volume Gibbs measures with different intensities in this setting, demonstrating a first-order phase transition. Our approach extends previous results obtained for the Quermass model and applies in particular to a new class of diluted pairwise interactions introduced in this work."}
{"id": "2602.10803", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10803", "abs": "https://arxiv.org/abs/2602.10803", "authors": ["Huangxin Chen", "Yuxiang Chen", "Jisheng Kou", "Shuyu Sun"], "title": "bound-preserving Adaptive Time-Stepping Method with Energy Stability for Simulating Compressible Gas Flow in Poroelastic Media", "comment": null, "summary": "In this paper, we present an efficient numerical method to address a thermodynamically consistent gas flow model in porous media involving compressible gas and deformable rock. The accurate modeling of gas flow in porous media often poses significant challenges due to their inherent nonlinearity, the coupling between gas and rock dynamics, and the need to preserve physical principles such as mass conservation, energy dissipation and molar density boundedness. The system is further complicated by the need to balance computational efficiency with the accuracy and stability of the numerical scheme. To tackle these challenges, we adopt a stabilization approach that is able to preserve the original energy dissipation while achieving linear energy-stable numerical schemes. We also prove the convergence of the adopted linear iterative method. At each time step, the stabilization parameter is adaptively updated using a simple and explicit formula to ensure compliance with the original energy dissipation law. The proposed method uses adaptive time stepping to improve computational efficiency while maintaining solution accuracy and boundedness. The adaptive time step size is calculated explicitly at each iteration, ensuring stability and allowing for efficient handling of highly dynamic scenarios. A mixed finite element method combined with an upwind scheme is employed as spatial discretization to ensure mass conservation and stability. Finally, we conduct a series of numerical experiments to validate the performance and robustness of the proposed numerical method."}
{"id": "2602.11129", "categories": ["math.PR", "cs.IT", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.11129", "abs": "https://arxiv.org/abs/2602.11129", "authors": ["Andreas Göbel", "Marcus Pappik", "Leon Schiller"], "title": "Information-Theoretic Thresholds for Bipartite Latent-Space Graphs Under Noisy Observations", "comment": null, "summary": "We study information-theoretic phase transitions for the detectability of latent geometry in bipartite random geometric graphs RGGs with Gaussian d-dimensional latent vectors while only a subset of edges carries latent information determined by a random mask with i.i.d. Bern(q) entries. For any fixed edge density p in (0,1) we determine essentially tight thresholds for this problem as a function of d and q. Our results show that the detection problem is substantially easier if the mask is known upfront compared to the case where the mask is hidden.\n  Our analysis is built upon a novel Fourier-analytic framework for bounding signed subgraph counts in Gaussian random geometric graphs that exploits cancellations which arise after approximating characteristic functions by an appropriate power series. The resulting bounds are applicable to much larger subgraphs than considered in previous work which enables tight information-theoretic bounds, while the bounds considered in previous works only lead to lower bounds from the lens of low-degree polynomials. As a consequence we identify the optimal information-theoretic thresholds and rule out computational-statistical gaps. Our bounds further improve upon the bounds on Fourier coefficients of random geometric graphs recently given by Bangachev and Bresler [STOC'24] in the dense, bipartite case. The techniques also extend to sparser and non-bipartite settings, at least if the considered subgraphs are sufficiently small. We furhter believe that they might help resolve open questions for related detection problems."}
{"id": "2602.10890", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.10890", "abs": "https://arxiv.org/abs/2602.10890", "authors": ["Daniele Di Pietro", "Aurelio Spadotto"], "title": "Hybrid Methods for Friedrichs Systems with Application to Scalar and Vector Diffusion-Advection Problems", "comment": null, "summary": "In this work we study arbitrary-order hybrid discretizations of Friedrichs systems. Friedrichs systems provide a framework that goes beyond the standard classification of partial differential equations into hyperbolic or elliptic, and are thus particularly suited for problems that include both diffusive and advective terms. The family of numerical schemes proposed in this work hinge on hybrid spaces with unknowns located at elements and faces. They support general meshes, are locally conservative and, compared with traditional Discontinuous Galerkin discretizations, lead to smaller algebraic systems once static condensation has been applied. We carry out a complete stability and convergence analysis, which appears to be the first of its kind. The performance of the method is illustrated on scalar and vector three-dimensional diffusion-advection-reaction problems."}
{"id": "2602.10580", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.10580", "abs": "https://arxiv.org/abs/2602.10580", "authors": ["Quang Dinh Thien Nguyen", "Duc Anh Nguyen", "Hoang Huy Nguyen", "Siva Theja Maguluri"], "title": "Almost Sure Convergence of Nonlinear Stochastic Approximation: An Interplay of Noise and Step Size", "comment": "29 pages, 2 figures", "summary": "We study the almost sure convergence of the Stochastic Approximation algorithm to the fixed point $x^\\star$ of a nonlinear operator under a negative drift condition and a general noise sequence with finite $p$-th moment for some $p > 1$. Classical almost sure convergence results of Stochastic Approximation are mostly analyzed for the square-integrable noise setting, and it is shown that any non-summable but square-summable step size sequence is sufficient to obtain almost sure convergence. However, such a limitation prevents wider algorithmic application. In particular, many applications in Machine Learning and Operations Research admit heavy-tailed noise with infinite variance, rendering such guarantees inapplicable. On the other hand, when a stronger condition on the noise is available, such guarantees on the step size would be too conservative, as practitioners would like to pick a larger step size for a more preferable convergence behavior. To this end, we show that any non-summable but $p$-th power summable step size sequence is sufficient to guarantee almost sure convergence, covering the gap in the literature.\n  Our guarantees are obtained using a universal Lyapunov drift argument. For the regime $p \\in (1, 2)$, we show that using the Lyapunov function $\\norm{x-x^\\star}^p$ and applying a Taylor-like bound suffice. For $p > 2$, such an approach is no longer applicable, and therefore, we introduce a novel iterate projection technique to control the nonlinear terms produced by high-moment bounds and multiplicative noise. We believe our proof techniques and their implications could be of independent interest and pave the way for finite-time analysis of Stochastic Approximation under a general noise condition."}
{"id": "2602.11109", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.11109", "abs": "https://arxiv.org/abs/2602.11109", "authors": ["Xiao Qi", "Yue Wu", "Yubin Yan"], "title": "Drift-Randomized Milstein-Galerkin Finite Element Method for Semilinear Stochastic Evolution Equations", "comment": null, "summary": "Kruse and Wu [Math. Comp. 88 (2019) 2793--2825] proposed a fully discrete randomized Galerkin finite element method for semilinear stochastic evolution equations (SEEs) driven by additive noise and showed that this method attains a temporal strong convergence rate exceeding order $\\frac{1}{2}$ without imposing any differentiability assumptions on the drift nonlinearity. They further discussed a potential extension of the randomized method to SEEs with multiplicative noise and introduced the so-called drift-randomized Milstein-Galerkin finite element fully discrete scheme, but without providing a corresponding strong convergence analysis.\n  This paper aims to fill this gap by rigorously analyzing the strong convergence behavior of the drift-randomized Milstein-Galerkin finite element scheme. By avoiding the use of differentiability assumptions on the nonlinear drift term, we establish strong convergence rates in both space and time for the proposed method. The obtained temporal convergence rate is $O(Δt^{1-\\varepsilon_0})$, where $Δt$ denotes the time step size and $\\varepsilon_0$ is an arbitrarily small positive number. Numerical experiments are reported to validate the theoretical findings."}
{"id": "2602.10989", "categories": ["math.ST", "cs.IT", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.10989", "abs": "https://arxiv.org/abs/2602.10989", "authors": ["Yifan Chen", "Eric Vanden-Eijnden"], "title": "Variational Optimality of Föllmer Processes in Generative Diffusions", "comment": null, "summary": "We construct and analyze generative diffusions that transport a point mass to a prescribed target distribution over a finite time horizon using the stochastic interpolant framework. The drift is expressed as a conditional expectation that can be estimated from independent samples without simulating stochastic processes. We show that the diffusion coefficient can be tuned \\emph{a~posteriori} without changing the time-marginal distributions. Among all such tunings, we prove that minimizing the impact of estimation error on the path-space Kullback--Leibler divergence selects, in closed form, a Föllmer process -- a diffusion whose path measure minimizes relative entropy with respect to a reference process determined by the interpolation schedules alone. This yields a new variational characterization of Föllmer processes, complementing classical formulations via Schrödinger bridges and stochastic control. We further establish that, under this optimal diffusion coefficient, the path-space Kullback--Leibler divergence becomes independent of the interpolation schedule, rendering different schedules statistically equivalent in this variational sense."}
{"id": "2602.10374", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.10374", "abs": "https://arxiv.org/abs/2602.10374", "authors": ["Yiwen Chen"], "title": "Relationships between full-space and subspace quadratic interpolation models and simplex derivatives", "comment": null, "summary": "Quadratic interpolation models and simplex derivatives are fundamental tools in numerical optimization, particularly in derivative-free optimization. When constructed in suitably chosen affine subspaces, these tools have been shown to be especially effective for high-dimensional derivative-free optimization problems, where full-space model construction is often impractical. In this paper, we analyze the relationships between full-space and subspace formulations of these tools. In particular, we derive explicit conversion formulas between full-space and subspace models, including minimum-norm models, minimum Frobenius norm models, least Frobenius norm updating models, as well as models constructed via generalized simplex gradients and Hessians. We show that the full-space and subspace models coincide on the affine subspace and, in general, along directions in the orthogonal complement. Overall, our results provide a theoretical framework for understanding subspace approximation techniques and offer insight into the design and analysis of derivative-free optimization methods."}
{"id": "2602.11109", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.11109", "abs": "https://arxiv.org/abs/2602.11109", "authors": ["Xiao Qi", "Yue Wu", "Yubin Yan"], "title": "Drift-Randomized Milstein-Galerkin Finite Element Method for Semilinear Stochastic Evolution Equations", "comment": null, "summary": "Kruse and Wu [Math. Comp. 88 (2019) 2793--2825] proposed a fully discrete randomized Galerkin finite element method for semilinear stochastic evolution equations (SEEs) driven by additive noise and showed that this method attains a temporal strong convergence rate exceeding order $\\frac{1}{2}$ without imposing any differentiability assumptions on the drift nonlinearity. They further discussed a potential extension of the randomized method to SEEs with multiplicative noise and introduced the so-called drift-randomized Milstein-Galerkin finite element fully discrete scheme, but without providing a corresponding strong convergence analysis.\n  This paper aims to fill this gap by rigorously analyzing the strong convergence behavior of the drift-randomized Milstein-Galerkin finite element scheme. By avoiding the use of differentiability assumptions on the nonlinear drift term, we establish strong convergence rates in both space and time for the proposed method. The obtained temporal convergence rate is $O(Δt^{1-\\varepsilon_0})$, where $Δt$ denotes the time step size and $\\varepsilon_0$ is an arbitrarily small positive number. Numerical experiments are reported to validate the theoretical findings."}
