{"id": "2601.06383", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.06383", "abs": "https://arxiv.org/abs/2601.06383", "authors": ["Hélène Guérin", "Nathalie Krell"], "title": "Well-posedness of state-dependent rank-based interacting systems", "comment": "21 pages, 2 figures", "summary": "We study the existence and uniqueness of rank-based interacting systems of stochastic differential equations. These systems can be seen as modifications with state-dependent coefficients of the Atlas model in mathematical finance. The coefficients of the underlying SDEs are possibly discontinuous. We first establish strong well-posedness for a planar system with rank-dependent drift coefficients, and non-rank-dependent and non-uniformly elliptic diffusion coefficients. We then state weak well-posedness for two classes of high-dimensional rank-based interacting SDEs with elliptic diffusion coefficients. Finally, we address the positivity of solutions in the case where the diffusion coefficients vanish at zero."}
{"id": "2601.06399", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.06399", "abs": "https://arxiv.org/abs/2601.06399", "authors": ["Xinru Liu", "Danyu Yang"], "title": "Integration of branched rough paths", "comment": null, "summary": "When the one-form is $Lip\\left(γ-1\\right) $ with $γ>p\\geq 1$, we construct the integral of a branched $p$-rough path, which defines another branched $p$-rough path. We derive a quantitative bound for this integral and prove that it depends continuously on the driving branched rough path in rough path metric. Moreover, we prove that the first level branched rough integral coincides with a first level integral of the associated $Π$-rough path."}
{"id": "2601.06538", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.06538", "abs": "https://arxiv.org/abs/2601.06538", "authors": ["Kazimierz Musial"], "title": "Splitting of Liftings in Product Spaces II", "comment": null, "summary": "Let $(X, \\mfA,P)$ and $(Y, \\mfB,Q)$ be two probability spaces, $R$ be their skew product on the product $σ$-algebra $\\mfA\\otimes\\mfB$ and $\\{(\\mfA_y,S_y)\\colon y\\in{Y}\\}$ be a $Q$-disintegration of $R$. Then let $\\mfA\\dd\\mfB$ be the $σ$-algebra generated $\\mfA\\otimes\\mfB$ and by the family $\\mcM:=\\{E\\subset{X\\times{Y}}\\colon \\exists\\;N\\in\\mfB_0\\;\\forall\\;y\\notin{N}\\;\\wh{S_y}(E^y)=0\\}$ and $\\wh{R_{\\dd}}$ be the extension of $R$ such that $\\mcM$ becomes the family of $\\wh{R_*}$-zero sets ($\\wh{S_y}$ is the completion of $S_y$ and $\\mfB_0=\\{B\\in\\mfB: Q(B)=0\\}$). We prove that there exist a lifting $π$ on $\\mcL^{\\infty}(\\wh{R_{\\dd}})$ and liftings $σ_y$ on $\\mcL^{\\infty}(\\wh{S_y})$ , $y\\in Y$, such that \\[ [π(f)]^y= σ_y\\Bigl([π(f)]^y\\Bigr) \\qquad\\mbox{for every} \\quad y\\in Y\\quad\\mbox{and every}\\quad f\\in\\mcL^{\\infty}(\\wh{R_{\\dd}}). \\] In case of a separable $P$ and in case when $R\\ll{P}\\times{Q}$ a characterization of stochastic processes possessing an equivalent measurable version is presented. The theorem is a generalization and correction of \\cite[Theorem 3.8]{mu25}."}
{"id": "2601.06698", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.06698", "abs": "https://arxiv.org/abs/2601.06698", "authors": ["Z. Brzeźniak", "A. Ndongmo Ngana", "T. Tachim Medjo"], "title": "On a stochastic Cahn-Hilliard-Brinkman model", "comment": null, "summary": "In this paper, we consider a stochastic version of the Cahn-Hilliard-Brinkman model in a smooth two- or three-dimensional domain with dynamical boundary conditions. The system describes creeping two-phase flows and is basically a coupling of the Brinkman equation for the velocity field that governs the flow through the porous media coupled with convective Cahn-Hilliard equations for the phase field, both with two independent sources of randomness given by general multiplicative-type Wiener noises in the Cahn-Hilliard equations. The existence of a weak solution, both in the probabilistic and PDEs sense, is proved. Our construction of a solution is based on the classical Faedo-Galerkin approximation, the Yosida approximation and uses a compactness method. Our paper is the first attempt to generalize the paper \\cite{Colli+Knopf+Schimperna+Signor_2024} to a stochastic setting."}
{"id": "2601.06317", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.06317", "abs": "https://arxiv.org/abs/2601.06317", "authors": ["Yang Lu"], "title": "Estimation of the intercept parameter in integrated Galton-Watson processes", "comment": null, "summary": "We study estimation of the intercept parameter in an integrated Galton-Watson process, a basic building-block for many count-valued time series models. In this unit root setting, the ordinary least squares estimator is inconsistent, whereas an existing weighted least squares (WLS) estimator is consistent only in the case where the process is transient, a condition that depends on the unknown intercept parameter . We propose an alternative WLS estimator based on the new weight function of $1/t$, and show that it is consistent regardless of whether the process is transient or null recurrent, with a convergence rate of $\\sqrt{\\ln n}$."}
{"id": "2601.06321", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.06321", "abs": "https://arxiv.org/abs/2601.06321", "authors": ["Xavier Lebeuf", "Stéphane Alarie", "Charles Audet", "Miguel Diago", "Sébastien Le Digabel"], "title": "Multi-fidelity constraints in blackbox optimization", "comment": "27 pages, 9 figures, paper submitted to the EURO Journal on Computational Optimization", "summary": "This work studies constrained blackbox optimization problems that cannot be solved in reasonable time due to prohibitive computational costs. This challenge is especially prevalent in industrial applications, where blackbox evaluations are costly. However, constraints can be evaluated at various fidelities at a lower computational cost. More specifically, this work targets situations in which the infeasibility of each individual constraint can be detected at lower fidelities, and where a large discrete number of fidelities are available. Moreover, highly discontinuous problems which may fail to evaluate are considered, such that direct search methods are preferred to model-based ones. To this effect, the Interruptible Direct Search (IDS) and the Dynamic Interruptible Direct Search (DIDS) algorithms are proposed to leverage feasibility assessments from various fidelity levels to avoid high cost evaluations. The results show highly increased performances from NOMAD when it is paired with IDS or DIDS."}
{"id": "2601.06294", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.06294", "abs": "https://arxiv.org/abs/2601.06294", "authors": ["Weiwei Hu", "Ziqian Li", "Yubiao Zhang", "Enrique Zuazua"], "title": "A Structure-Preserving Numerical Scheme for Optimal Control and Design of Mixing in Incompressible Flows", "comment": null, "summary": "We develop a structure-preserving computational framework for optimal mixing control in incompressible flows. Our approach exactly conserves the continuous system's key invariants (mass and $L^2$-energy), while also maintaining discrete state-adjoint duality at every time step. These properties are achieved by integrating a centered finite-volume discretization in space with a time-symmetric Crank-Nicolson integrator for both the forward advection and its adjoint, all inside a gradient-based optimization loop. The result is a numerical solver that is faithful to the continuous optimality conditions and efficiently computes mixing-enhancing controls. In our numerical tests, the optimized time-dependent stirring produces a nearly exponential decay of a chosen mix-norm, achieving orders-of-magnitude faster mixing than any single steady flow. To our knowledge, this work provides the first evidence that enforcing physical structure at the discrete level can lead to both exact conservation and highly effective mixing outcomes in optimal flow design."}
{"id": "2601.06808", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.06808", "abs": "https://arxiv.org/abs/2601.06808", "authors": ["Reetendra Singh", "Aditya Maheshwari"], "title": "Generalized Space-Fractional Poisson Process via Variable-Order Stable Subordinator", "comment": "9 pages", "summary": "This paper introduces a variable-order stable subordinator (VOSS) $S^{α(t)}(t)$ with index $α(t)\\in(0,1)$, where $α(t)$ is a right-continuous piecewise constant function. We drive the Generalized Space-Fractional Poisson Process via Variable-Order Stable Subordinator (GSFPP-VO) defined by $\\{N(S^{α(t)}(t))\\}_{t \\geq 0}$, obtained by time-changing a homogeneous Poisson process $\\{N(t,λ)\\}_{t\\geq 0}$ with rate parameter $λ>0$ by an independent VOSS. Explicit expressions for the Laplace transform, probability generating function, probability mass function, and moment generating function of the GSFPP-VO are derived, and these quantities are shown to satisfy partial differential equations. Finally, we establish the associated generalized distributions, analyze the hitting-time properties, and characterize the Lévy measures of the GSFPP-VO."}
{"id": "2601.06674", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.06674", "abs": "https://arxiv.org/abs/2601.06674", "authors": ["Christophe Gallesco", "Caio Teodore Genovese Huss Oliveira", "Daniel Yasumasa Takahashi"], "title": "Reduction and classification of higher-order Markov chains for categorical data", "comment": "7 pages, 5 figures", "summary": "Categorical time series models are powerful tools for understanding natural phenomena. Most available models can be formulated as special cases of $m$-th order Markov chains, for $m\\geq 1$. Despite their broad applicability, theoretical research has largely focused on first-order Markov chains, mainly because many properties of higher-order chains can be analyzed by reducing them to first-order chains on an enlarged alphabet. However, the resulting first-order representation is sparse and possesses a highly structured transition kernel, a feature that has not been fully exploited.\n  In this work, we study finite-alphabet Markov chains with arbitrary memory length and introduce a new reduction framework for their structural classification. We define the skeleton of a transition kernel, an object that captures the intrinsic pattern of transition probability constraints in a higher-order Markov chain.\n  We show that the class structure of a binary matrix associated with the skeleton completely determines the recurrent classes and their periods in the original chain. We also provide an explicit algorithm for efficiently extracting the skeleton, which in many cases yields substantial computational savings. Applications include simple criteria for irreducibility and essential irreducibility of higher-order Markov chains and a concrete illustration based on a 10th-order Markov chain."}
{"id": "2601.06434", "categories": ["math.OC", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.06434", "abs": "https://arxiv.org/abs/2601.06434", "authors": ["Abhinav Raghuvanshi", "Mayank Baranwal", "Debasish Chatterjee"], "title": "On a Gradient Approach to Chebyshev Center Problems with Applications to Function Learning", "comment": "Accepted to TMLR", "summary": "We introduce $\\textsf{gradOL}$, the first gradient-based optimization framework for solving Chebyshev center problems, a fundamental challenge in optimal function learning and geometric optimization. $\\textsf{gradOL}$ hinges on reformulating the semi-infinite problem as a finitary max-min optimization, making it amenable to gradient-based techniques. By leveraging automatic differentiation for precise numerical gradient computation, $\\textsf{gradOL}$ ensures numerical stability and scalability, making it suitable for large-scale settings. Under strong convexity of the ambient norm, $\\textsf{gradOL}$ provably recovers optimal Chebyshev centers while directly computing the associated radius. This addresses a key bottleneck in constructing stable optimal interpolants. Empirically, $\\textsf{gradOL}$ achieves significant improvements in accuracy and efficiency on 34 benchmark Chebyshev center problems from a benchmark $\\textsf{CSIP}$ library. Moreover, we extend $\\textsf{gradOL}$ to general convex semi-infinite programming (CSIP), attaining up to $4000\\times$ speedups over the state-of-the-art $\\texttt{SIPAMPL}$ solver tested on the indicated $\\textsf{CSIP}$ library containing 67 benchmark problems. Furthermore, we provide the first theoretical foundation for applying gradient-based methods to Chebyshev center problems, bridging rigorous analysis with practical algorithms. $\\textsf{gradOL}$ thus offers a unified solution framework for Chebyshev centers and broader CSIPs."}
{"id": "2601.06388", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.06388", "abs": "https://arxiv.org/abs/2601.06388", "authors": ["Zakaria Baba", "Alexandre M. Bayen", "Alexi Canesse", "Maria Laura Delle Monache", "Martin Drieux", "Zhe Fu", "Nathan Lichtlé", "Zihe Liu", "Hossein Nick Zinat Matin", "Benedetto Piccoli"], "title": "Supervised and Unsupervised Neural Network Solver for First Order Hyperbolic Nonlinear PDEs", "comment": null, "summary": "We present a neural network-based method for learning scalar hyperbolic conservation laws. Our method replaces the traditional numerical flux in finite volume schemes with a trainable neural network while preserving the conservative structure of the scheme. The model can be trained both in a supervised setting with efficiently generated synthetic data or in an unsupervised manner, leveraging the weak formulation of the partial differential equation. We provide theoretical results that our model can perform arbitrarily well, and provide associated upper bounds on neural network size. Extensive experiments demonstrate that our method often outperforms efficient schemes such as Godunov's scheme, WENO, and Discontinuous Galerkin for comparable computational budgets. Finally, we demonstrate the effectiveness of our method on a traffic prediction task, leveraging field experimental highway data from the Berkeley DeepDrive drone dataset."}
{"id": "2601.06850", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.06850", "abs": "https://arxiv.org/abs/2601.06850", "authors": ["Oleksii Galganov", "Andrii Ilienko"], "title": "Explosion and non-explosion in pure birth Crump--Mode--Jagers branching processes", "comment": "7 pages", "summary": "In this short note, we provide an explicit sufficient condition for non-explosion of Crump--Mode--Jagers branching processes with pure birth reproduction. It shows that the standard sufficient condition for explosion, namely the convergence of the series of reciprocals of the birth rates, is -- at least for rate sequences without excessive oscillations -- remarkably close to being necessary. At the same time, it is not necessary in full generality: we construct a counterexample which also yields a general preferential attachment tree without fitness with an infinite path and no vertices of infinite degree, thereby answering an open question previously raised in the literature."}
{"id": "2601.06715", "categories": ["math.ST", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.06715", "abs": "https://arxiv.org/abs/2601.06715", "authors": ["Yifeng Yu", "Lu Yu"], "title": "Diffusion Models with Heavy-Tailed Targets: Score Estimation and Sampling Guarantees", "comment": null, "summary": "Score-based diffusion models have become a powerful framework for generative modeling, with score estimation as a central statistical bottleneck. Existing guarantees for score estimation largely focus on light-tailed targets or rely on restrictive assumptions such as compact support, which are often violated by heavy-tailed data in practice. In this work, we study conventional (Gaussian) score-based diffusion models when the target distribution is heavy-tailed and belongs to a Sobolev class with smoothness parameter $β>0$. We consider both exponential and polynomial tail decay, indexed by a tail parameter $γ$. Using kernel density estimation, we derive sharp minimax rates for score estimation, revealing a qualitative dichotomy: under exponential tails, the rate matches the light-tailed case up to polylogarithmic factors, whereas under polynomial tails the rate depends explicitly on $γ$. We further provide sampling guarantees for the associated continuous reverse dynamics. In total variation, the generated distribution converges at the minimax optimal rate $n^{-β/(2β+d)}$ under exponential tails (up to logarithmic factors), and at a $γ$-dependent rate under polynomial tails. Whether the latter sampling rate is minimax optimal remains an open question. These results characterize the statistical limits of score estimation and the resulting sampling accuracy for heavy-tailed targets, extending diffusion theory beyond the light-tailed setting."}
{"id": "2601.06542", "categories": ["math.OC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.06542", "abs": "https://arxiv.org/abs/2601.06542", "authors": ["Corentin Juvigny", "Antonín Novák", "Jan Mandík", "Zdeněk Hanzálek"], "title": "Resource-constrained Project Scheduling with Time-of-Use Energy Tariffs and Machine States: A Logic-based Benders Decomposition Approach", "comment": null, "summary": "In this paper, we investigate the Resource-Constrained Project Scheduling Problem (RCPSP) with time-of-use energy tariffs (TOU) and machine states, a variant of RCPSP for production scheduling where energy price is part of the criteria and one machine is highly energy-demanding and can be in one of the following three states: proc, idle, or off. The problem involves scheduling all tasks, respecting precedence constraints and resource limitations, while minimizing the combination of the overall makespan and the total energy cost (TEC), which varies according to the TOU pricing, which can take negative values. We propose two novel approaches to solve it: a monolithic Constraint Programming (CP) approach and a Logic-Based Benders Decomposition (LBBD) approach. The latter combines a master problem dealing with energy cost solved using Integer Linear Programming (ILP) with a subproblem handling the RCPSP resolved using CP. Both approaches surpass the monolithic compact ILP approach, but the LBBD significantly outperforms the CP when the ratio of energy-intensive tasks over the overall tasks is moderate, allowing for solving instances with up to 1600 tasks in sparse instances. Finally, we put forth a way of generalizing our LBBD approach to other problems sharing similar characteristics, and we applied it to a problem based on an RCPSP problem with blocking times & total weighted tardiness criterion and a flexible job shop."}
{"id": "2601.06410", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.06410", "abs": "https://arxiv.org/abs/2601.06410", "authors": ["Ren-Cang Li", "Ding Lu", "Li Wang", "Lei-Hong Zhang"], "title": "An NPDo Approach for Principal Joint Block Diagonalization", "comment": null, "summary": "Matrix joint block-diagonalization (JBD) frequently arises from diverse applications such as independent component analysis, blind source separation, and common principal component analysis (CPCA), among others. Particularly, CPCA aims at joint diagonalization, i.e., each block size being $1$-by-$1$. This paper is concerned with {\\em principal joint block-diagonalization\\/} (\\pjbd), which aim to achieve two goals: 1)~partial joint block-diagonalization, and 2)~identification of dominant common block-diagonal parts for all involved matrices. This is in contrast to most existing methods, especially the popular ones based on Givens rotation, which focus on full joint diagonalization and quickly become impractical for matrices of even moderate size ($300$-by-$300$ or larger). An NPDo approach is proposed and it is built on a {\\em nonlinear polar decomposition with orthogonal polar factor dependency} that characterizes the solutions of the optimization problem designed to achieve \\pjbd, and it is shown the associated SCF iteration is globally convergent to a stationary point while the objective function increases monotonically during the iterative process. Numerical experiments are presented to illustrate the effectiveness of the NPDo approach and its superiority to Givens rotation-based methods."}
{"id": "2601.06863", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.06863", "abs": "https://arxiv.org/abs/2601.06863", "authors": ["John Bell", "Ana Djurdjevac", "Nicolas Perkowski"], "title": "Surface Dean--Kawasaki equations", "comment": null, "summary": "We consider stochastic particle dynamics on hypersurfaces represented in Monge gauge parametrization. Starting from the underlying Langevin system, we derive the surface Dean-Kawasaki (DK) equation and formulate it in the martingale sense. The resulting SPDE explicitly reflects the geometry of the hypersurface through the induced metric and its differential operators. Our framework accommodates both pairwise interactions and environmental potentials, and we extend the analysis to evolving hypersurfaces driven by an SDE that interacts with the particles, yielding the corresponding surface DK equation for the coupled surface-particle system. We establish a weak uniqueness result in the non-interacting case, and we develop a finite-volume discretization preserving the fluctuation-dissipation relation. Numerical experiments illustrate equilibrium properties and dynamical behavior influenced by surface geometry and external potentials."}
{"id": "2601.06760", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.06760", "abs": "https://arxiv.org/abs/2601.06760", "authors": ["M. Z. Anis"], "title": "A Note on NBUE and NWBUE Classes of Life Distributions", "comment": "15 pages", "summary": "Non-monotonic ageing notions are looked upon as an extension of the corresponding monotonic ageing notions in this work. In particular, the New Better than Used in Expectation (NBUE) and the corresponding non-monotonic analogue New Worse then Better than Used in Expectation (NWBUE) classes of life distributions is considered. Some additional results for the NBUE class are obtained. While many properties of the NBUE class carry over in an analogous way to the NWBUE class, it is shown by means of counterexamples that the moment bounds do not. Some corrective results with respect to popular notions of the NWBUE class are also presented."}
{"id": "2601.06622", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.06622", "abs": "https://arxiv.org/abs/2601.06622", "authors": ["P. D. Khanh", "V. V. H. Khoa", "B. S. Mordukhovich", "D. B. Tran", "N. V. Vo"], "title": "Inexact DC Algorithms in Hilbert Spaces with Applications to PDE-Constrained Optimization", "comment": null, "summary": "In this paper, we design and apply novel inexact adaptive algorithms to deal with minimizing difference-of-convex (DC) functions in Hilbert spaces. We first introduce I-ADCA, an inexact adaptive counterpart of the well-recognized DCA (difference-of-convex algorithm), that allows inexact subgradient evaluations and inexact solutions to convex subproblems while still guarantees global convergence to stationary points. Under a Polyak-Lojasiewicz type property for DC objectives, we obtain explicit convergence rates for the proposed algorithm. Our main application addresses elliptic optimal control problems with control constraints and nonconvex $L^{1-2}$ sparsity-enhanced regularizers admitting a DC decomposition. Employing I-ADCA and appropriate versions of finite element discretization leads us to an efficient procedure for solving such problems with establishing its well-posedness and error bound estimates confirmed by numerical experiments."}
{"id": "2601.06625", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.06625", "abs": "https://arxiv.org/abs/2601.06625", "authors": ["Torsten Linß", "Christos Xenophontos"], "title": "On traces of the derivatives of the $L^2$-projection error", "comment": null, "summary": "We provide derivative estimates for the $L^2$ projection of an $H^{k}$ function onto the space of polynomials of degree $\\leq p$. The bounds are explicit in the order of differentiation and the polynomial degree $p$."}
{"id": "2601.06893", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.06893", "abs": "https://arxiv.org/abs/2601.06893", "authors": ["Neil O'Connell"], "title": "Absorption times for discrete Whittaker processes and non-intersecting Brownian bridges", "comment": null, "summary": "We present evidence for a conjectural relationship between absorption times for discrete Whittaker processes and maximal heights of non-intersecting Brownian bridges."}
{"id": "2601.07228", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.07228", "abs": "https://arxiv.org/abs/2601.07228", "authors": ["Arash A. Amini", "Luciano Vinas"], "title": "Wasserstein Concentration of Empirical Measures for Dependent Data via the Method of Moments", "comment": null, "summary": "We establish a general concentration result for the 1-Wasserstein distance between the empirical measure of a sequence of random variables and its expectation. Unlike standard results that rely on independence (e.g., Sanov's theorem) or specific mixing conditions, our result requires only two conditions: (1) control over the variance of the empirical moments, and (2) a flexible tail condition we term $Ψ_{r_n}$-sub-Gaussianity. This approach allows for significant dependencies between variables, provided their algebraic moments behave predictably. The proof uses the method of moments combined with a polynomial approximation of Lipschitz functions via Jackson kernels, allowing us to translate moment concentration into topological concentration."}
{"id": "2601.06648", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.06648", "abs": "https://arxiv.org/abs/2601.06648", "authors": ["Lei Huang", "Lingling Xie"], "title": "A finite-termination algorithm for testing copositivity over the positive semidefinite cone", "comment": null, "summary": "This paper proposes an efficient algorithm for testing copositivity of homogeneous polynomials over the positive semidefinite cone. The algorithm is based on a novel matrix optimization reformulation and requires solving a hierarchy of semidefinite programs. Notably, it always terminates in finitely many iterations. If a homogeneous polynomial is copositive over the positive semidefinite cone, the algorithm provides a certificate; otherwise, it returns a vector that refutes copositivity. Building on a similar idea, we further propose an algorithm to test copositivity over the direct product of the positive semidefinite cone and the nonnegative orthant. Preliminary numerical experiments demonstrate the effectiveness of the proposed methods."}
{"id": "2601.06773", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.06773", "abs": "https://arxiv.org/abs/2601.06773", "authors": ["Wenlin Qiu", "Kexin Li", "Yiqun Li", "Hao Zhang"], "title": "The optimal error analysis of nonuniform L1 method for the variable-exponent subdiffusion model", "comment": null, "summary": "This work investigates the optimal error estimate of the fully discrete scheme for the variable-exponent subdiffusion model under the nonuniform temporal mesh. We apply the perturbation method to reformulate the original model into its equivalent form, and apply the L1 scheme as well as the interpolation quadrature rule to discretize the Caputo derivative term and the convolution term in the reformulated model, respectively. We then prove the temporal convergence rates $O(N^{-\\min\\{2-α(0), rα(0)\\}})$ under the nonuniform mesh, which improves the existing convergence results in [Zheng, CSIAM T. Appl. Math. 2025] for $r\\geq \\frac{2-α(0)}{α(0)}$. Numerical results are presented to substantiate the theoretical findings."}
{"id": "2601.07028", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.07028", "abs": "https://arxiv.org/abs/2601.07028", "authors": ["Erhan Bayraktar", "Hiroaki Horikawa"], "title": "Quantitative convergence rates for extended mean field games with volatility control", "comment": "Keywords and phrases: mean field games, interaction via controls, volatility control, quantitative convergence, linear-quadratic", "summary": "We investigate the convergence of symmetric stochastic differential games with interactions via control, where the volatility terms of both idiosyncratic and common noises are controlled. We apply the stochastic maximum principle, following the approach of Laurière and Tangpi, to reduce the convergence analysis to the study of forward-backward propagation of chaos. Under the standard monotonicity conditions, we derive quantitative convergence rates for open-loop Nash equilibria of $N$-player stochastic differential games toward the corresponding mean field equilibrium. As a prerequisite, we also establish the well-posedness of the conditional McKean--Vlasov forward-backward stochastic differential equations by the method of continuation. Moreover, we analyze a specific class of linear-quadratic settings to demonstrate the applicability of our main result."}
{"id": "2601.07503", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.07503", "abs": "https://arxiv.org/abs/2601.07503", "authors": ["Claire Lacour", "Pierre Vandekerkhove"], "title": "Gold standard process Markovian poisoning: a semiparametric approach", "comment": null, "summary": "We consider in this paper a stochastic process that mixes in time, according to a nonobserved stationary Markov selection process, two separate sources of randomness: i) a stationary process which distribution is accessible (gold standard); ii) a pure i.i.d. sequence which distribution is unknown (poisoning process). In this framework we propose to estimate, with two different approaches, the transition of the hidden Markov selection process along with the distribution, not supposed to belong to any parametric family, of the unknown i.i.d. sequence, under minimal (identifiability, stationarity and dependence in time) conditions. We show that both estimators provide consistent estimations of the Euclidean transition parameter, and also prove that one of them, which is $\\sqrt$ n-consistent, allows to establish a functional central limit theorem about the unknown poisoning sequence cumulative distribution function. The numerical performances of our estimators are illustrated through various challenging examples."}
{"id": "2601.06755", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.06755", "abs": "https://arxiv.org/abs/2601.06755", "authors": ["Sai Krishna Kanth Hari", "Russell Bent"], "title": "Water Demand Maximization: Quick Recovery of Nonlinear Physics Solutions", "comment": null, "summary": "Determining the maximum demand a water distribution network can satisfy is crucial for ensuring reliable supply and planning network expansion. This problem, typically formulated as a mixed-integer nonlinear program (MINLP), is computationally challenging. A common strategy to address this challenge is to solve mixed-integer linear program (MILP) relaxations derived by partitioning variable domains and constructing linear over- and under-estimators to nonlinear constraints over each partition. While MILP relaxations are easier to solve up to a modest level of partitioning, their solutions often violate nonlinear water flow physics. Thus, recovering feasible MINLP solutions from the MILP relaxations is crucial for enhancing MILP-based approaches. In this paper, we propose a robust solution recovery method that efficiently computes feasible MINLP solutions from MILP relaxations, regardless of partition granularity. Combined with iterative partition refinement, our method generates a sequence of feasible solutions that progressively approach the optimum. Through extensive numerical experiments, we demonstrate that our method outperforms baseline methods and direct MINLP solves by consistently recovering high-quality feasible solutions with significantly reduced computation times."}
{"id": "2601.06849", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.06849", "abs": "https://arxiv.org/abs/2601.06849", "authors": ["Ibrahim O. Sarumi"], "title": "Analysis and Efficient Sylvester-Based Implementation of a Dimension-Split ETD2RK Scheme for Multidimensional Reaction-Diffusion Equations", "comment": null, "summary": "We propose and analyze a second-order, dimension-split exponential time differencing Runge--Kutta scheme (ETD2RK-DS) for multidimensional reaction--diffusion equations in two and three spatial dimensions. Under mild assumptions on the nonlinear source term, we establish uniform stability bounds and prove second-order temporal convergence for the underlying dimension-split scheme.\n  To enable efficient implementation, we employ Padé approximations of the matrix exponential, converting each required matrix-exponential--vector product into the solution of a shifted linear system. A convergence analysis of the resulting Padé-based ETD2RK-DS formulation is provided. We derive explicit and reproducible tensor-slicing and reshaping algorithms that realize the dimension-splitting strategy, decomposing multidimensional systems into collections of independent one-dimensional problems. This leads to a reduction of the dominant per-time-step computational cost from $\\mathcal{O}(m^3)$ to $\\mathcal{O}(m^2)$ in two dimensions and from $\\mathcal{O}(m^5)$ to $\\mathcal{O}(m^3)$ in three dimensions when compared with banded LU solvers for the unsplit problem, where $m$ denotes the number of grid points per spatial direction.\n  Furthermore, we develop a Sylvester-equation reformulation of the resulting one-dimensional systems, enabling a highly efficient spectral implementation based on reusable eigendecompositions, matrix--vector multiplications, and Hadamard divisions. Numerical experiments in two and three dimensions, including a coupled FitzHugh--Nagumo system, confirm the second-order temporal accuracy, stability of the underlying scheme, and scalability of the proposed ETD2RK-DS framework, as well as the substantial computational advantages of the Sylvester-based implementation over classical LU-based solvers."}
{"id": "2601.07045", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.07045", "abs": "https://arxiv.org/abs/2601.07045", "authors": ["Nawaf Bou-Rabee", "Zichu Wang"], "title": "From Continuous to Discrete: a No-U-Turn Sampler for Permutations", "comment": null, "summary": "We introduce a discrete-space analogue of the No-U-Turn sampler on the symmetric group $S_n$, yielding a locally adaptive and reversible Markov chain Monte Carlo method for $\\mathrm{Mallows}(d,σ_0)$. Here $d:S_n\\times S_n\\to[0,\\infty)$ is any fixed distance on $S_n$, $σ_0\\in S_n$ is a fixed reference permutation, and the target distribution on $S_n$ has mass function $π(σ)\\propto e^{-βd(σ,σ_0)}$ where $β>0$ is the inverse temperature. The construction replaces Hamiltonian trajectories with measure-preserving group-orbit exploration. A randomized dyadic expansion is used to explore a one-dimensional orbit until a probabilistic \\emph{no-underrun} criterion is met, after which the next state is sampled from the explored orbit with probability proportional to the target weights. On the theory side, embedding this transition within the Gibbs self-tuning (GIST) framework provides a concise proof of reversibility. Moreover, we construct a \\emph{shift coupling} for orbit segments and prove an explicit edge-wise contraction in the Cayley distance under a mild Lipschitz condition on the energy $E(σ)=d(σ,σ_0)$. A path-coupling argument then yields an $O(n^2\\log n)$ total-variation mixing-time bound."}
{"id": "2601.07764", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.07764", "abs": "https://arxiv.org/abs/2601.07764", "authors": ["Abhinav Chakraborty", "Junu Lee", "Eugene Katsevich"], "title": "Comparing three learn-then-test paradigms in a multivariate normal means problem", "comment": null, "summary": "Many modern procedures use the data to learn a structure and then leverage it to test many hypotheses. If the entire data is used at both stages, analytical or computational corrections for selection bias are required to ensure validity (post-learning adjustment). Alternatively, one can learn and/or test on masked versions of the data to avoid selection bias, either via information splitting or null augmentation}. Choosing among these three learn-then-test paradigms, and how much masking to employ for the latter two, are critical decisions impacting power that currently lack theoretical guidance. In a multivariate normal means model, we derive asymptotic power formulas for prototypical methods from each paradigm -- variants of sample splitting, conformal-style null augmentation, and resampling-based post-learning adjustment -- quantifying the power losses incurred by masking at each stage. For these paradigm representatives, we find that post-learning adjustment is most powerful, followed by null augmentation, and then information splitting. Moreover, null augmentation can be nearly as powerful as post-learning adjustment, while avoiding its challenges: the power of the former approaches that of the latter if the number of nulls used for augmentation is a vanishing fraction of the number of hypotheses. We also prove for a tractable proxy that the optimal number of nulls scales as the square root of the number of hypotheses, challenging existing heuristics. Finally, we characterize optimal tuning for information splitting by identifying an optimal split fraction and tying it to the difficulty of the learning problem. These results establish a theoretical foundation for key decisions in the deployment of learn-then-test methods."}
{"id": "2601.06970", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.06970", "abs": "https://arxiv.org/abs/2601.06970", "authors": ["Jose de Brito", "Felipe Lara", "Tran Van Thang"], "title": "Splitting Proximal Point Algorithms for the Sum of Prox-Convex Functions", "comment": null, "summary": "This paper addresses the minimization of a finite sum of prox-convex functions under Lipschitz continuity of each component. We propose two variants of the splitting proximal point algorithms proposed in \\cite{Bacak,Bertsekas}: one deterministic with a fixed update order, and one stochastic with random sampling, and we extend them from convex to prox-convex functions. We prove global convergence for both methods under standard stepsize a\\-ssump\\-tions, with almost sure convergence for the stochastic variant via supermartingale theory. Numerical experiments with nonconvex quadratic functions illustrate the efficiency of the proposed methods and support the theoretical results."}
{"id": "2601.07017", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07017", "abs": "https://arxiv.org/abs/2601.07017", "authors": ["Andreas Langer"], "title": "The Ill-Posed Foundations of Physics-Informed Neural Networks and Their Finite-Difference Variants", "comment": null, "summary": "Physics-informed neural networks based on automatic differentiation (AD-PINNs) and their finite-difference counterparts (FD-PINNs) are widely used for solving partial differential equations (PDEs), yet their analytical properties remain poorly understood. This work provides a unified mathematical foundation for both formulations. Under mild regularity assumptions on the activation function and for sufficiently wide neural networks of depth at least two, we prove that both the AD- and FD-PINN optimization problems are ill-posed: whenever a minimizer exists, there are in fact infinitely many, and uniqueness fails regardless of the choice of collocation points or finite-difference stencil. Nevertheless, we establish two structural properties. First, whenever the underlying PDE or its finite-difference discretization admits a solution, the corresponding AD-PINN or FD-PINN loss also admits a minimizer, realizable by a neural network of finite width. Second, FD-PINNs are tightly coupled to the underlying finite-difference scheme: every FD-PINN minimizer agrees with a finite-difference minimizer on the grid, and in regimes where the discrete PDE solution is unique, all zero-loss FD-PINN minimizers coincide with the discrete PDE solution on the stencil. Numerical experiments illustrate these theoretical insights: FD-PINNs remain stable in representative forward and inverse problems, including settings where AD-PINNs may fail to converge. We also include an inverse problem with noisy data, demonstrating that FD-PINNs retain robustness in this setting as well. Taken together, our results clarify the analytical limitations of AD-PINNs and explain the structural reasons for the more stable behavior observed in FD-PINNs."}
{"id": "2601.07103", "categories": ["math.PR", "math.CO", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.07103", "abs": "https://arxiv.org/abs/2601.07103", "authors": ["Shannon Starr"], "title": "Large Deviations for the d'Arcais Numbers", "comment": "22 pages, 4 figures", "summary": "The d'Arcais polynomials $P_n(z)$ for $n\\in\\{0,1,\\dots\\}$ are defined as $\\sum_{n=0}^{\\infty} P_n(z) q^n = \\exp(-z\\ln((q;q)_{\\infty}))$ where the $q$-Pochhammer symbol is $(q;q)_{\\infty} = \\prod_{k=1}^{\\infty} (1-q^k)$ for $|q|<1$. Denoting the coefficients for $n \\in \\mathbb{N}$ by the formula $P_n(z) = \\sum_{k=1}^{n} A(2,n,k) z^k/n!$, we prove that $k_n! A(2,n,k_n)/n!$ satisfies a Bahadur-Rao type large deviation formula in the limit $n \\to \\infty$ with $k_n/n \\to κ\\in [0,1)$ as long as $k_n \\to \\infty$. The large deviation rate function is the Legendre-Fenchel transform $g^*(-κ)$ where $g(κ) = f^{-1}(κ)$ for the function $f : (0,\\infty) \\to \\mathbb{R}$ given by $f(y)= \\ln(-\\ln((e^{-y};e^{-y})_{\\infty}))$. We relate this fact to information about the abundancy index."}
{"id": "2601.07169", "categories": ["math.PR", "cond-mat.stat-mech", "cs.DM", "math.CO", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.07169", "abs": "https://arxiv.org/abs/2601.07169", "authors": ["Satyaki Mukherjee", "Vilas Winstein"], "title": "Approximate FKG inequalities for phase-bound spin systems", "comment": "28 pages, 1 figure", "summary": "The FKG inequality is an invaluable tool in monotone spin systems satisfying the FKG lattice condition, which provides positive correlations for all coordinate-wise increasing functions of spins. However, the FKG lattice condition is somewhat brittle and is not preserved when confining a spin system to a particular phase. For instance, consider the Curie-Weiss model, which is a model of a ferromagnet with two phases at low temperature corresponding to positive and negative overall magnetization. It is not a priori clear if each phase internally has positive correlations for increasing functions, or if the positive correlations in the model arise primarily from the global choice of positive or negative magnetization.\n  In this article, we show that the individual phases do indeed satisfy an approximate form of the FKG inequality in a class of generalized higher-order Curie-Weiss models (including the standard Curie-Weiss model as a special case), as well as in ferromagnetic exponential random graph models (ERGMs). To cover both of these settings, we present a general result which allows for the derivation of such approximate FKG inequalities in a straightforward manner from inputs related to metastable mixing; we expect that this general result will be widely applicable. In addition, we derive some consequences of the approximate FKG inequality, including a version of a useful covariance inequality originally due to Newman as well as Bulinski and Shabanovich. We use this to extend the proof of the central limit theorem for ERGMs within a phase at low temperatures, due to the second author, to the non-forest phase-coexistence regime, answering a question posed by Bianchi, Collet, and Magnanini for the edge-triangle model."}
{"id": "2601.06976", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.06976", "abs": "https://arxiv.org/abs/2601.06976", "authors": ["José Niño-Mora", "Ángel Pellitero García"], "title": "A belief-state restless bandit model for treatment adherence: Whittle indexability via partial conservation laws", "comment": "38 pages, 6 figures. Submitted: December 30, 2025", "summary": "We study capacity-constrained treatment-adherence outreach via a belief-state restless multi-armed bandit model where patients are a partially observed two-state (adherent/nonadherent) Markov processes and interventions induce reset-type belief dynamics. Using partial conservation laws (PCLs), we establish Whittle indexability of the single-patient problem and derive a closed-form Whittle (marginal productivity) index, together with closed-form reward/work performance metrics under threshold policies and an explicit optimal threshold map. This yields an analytic Lagrangian relaxation: the single-patient Lagrangian value is a piecewise-affine convex function of the intervention price, enabling efficient computation of multi-patient dual bounds and certified relative optimality gaps. We also analyze how the Whittle index depends on the lapse and spontaneous-recovery parameters, providing qualitative insights on intervention priorities. In a large-scale numerical study over heterogeneous two-type populations, we compare Whittle's index policy with a myopic index rule and simple baselines; while myopic is highly competitive on most instances, Whittle's policy yields substantial gains in tight-capacity regimes with a fragile minority, reaching up to about $26\\%$ higher reward and markedly smaller relative optimality gaps."}
{"id": "2601.07025", "categories": ["math.NA", "math.AP", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.07025", "abs": "https://arxiv.org/abs/2601.07025", "authors": ["Emine Celik", "Eric Olson"], "title": "A Relaxed Direct-insertion Downscaling Method For Discrete-in-time Data Assimilation", "comment": "33 pages, 7 figures", "summary": "This paper improves the spectrally-filtered direct-insertion downscaling method for discrete-in-time data assimilation by introducing a relaxation parameter that overcomes a constraint on the observation frequency. Numerical simulations demonstrate that taking the relaxation parameter proportional to the time between observations allows one to vary the observation frequency over a wide range while maintaining convergence of the approximating solution to the reference solution. Under the same assumptions we analytically prove that taking the observation frequency to infinity results in the continuous-in-time nudging method."}
{"id": "2601.07129", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.07129", "abs": "https://arxiv.org/abs/2601.07129", "authors": ["Xinxin Chen", "Haojie Hou"], "title": "Minimum and extremal process for a branching random walk outside the boundary case", "comment": "42 pages", "summary": "This work extends the studies on the minimum and extremal process of a supercritical branching random walk outside the boundary case which cannot be reduced to the boundary case. We study here the situation where the log-generating function explodes at $1$ and the random walk associated to the spine possesses a stretched exponential tail with exponent $b\\in(0,\\frac12)$. Under suitable conditions, we confirm the conjecture of Barral, Hu and Madaule [Bernoulli 24(2) 2018 801-841], and obtain the weak convergence for the minimum and the extremal process. We also establish an a.s. infimum result over all infinity rays of this system."}
{"id": "2601.07834", "categories": ["math.PR", "cs.LG", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.07834", "abs": "https://arxiv.org/abs/2601.07834", "authors": ["Samuel Duffield"], "title": "A Complete Decomposition of Stochastic Differential Equations", "comment": null, "summary": "We show that any stochastic differential equation with prescribed time-dependent marginal distributions admits a decomposition into three components: a unique scalar field governing marginal evolution, a symmetric positive-semidefinite diffusion matrix field and a skew-symmetric matrix field."}
{"id": "2601.06977", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.06977", "abs": "https://arxiv.org/abs/2601.06977", "authors": ["Zhengjie Xiong", "Yangyang Xu"], "title": "Alternating Direction Method of Multipliers for nonlinear constrained convex problems and applications to distributed resource allocation and constrained machine learning", "comment": null, "summary": "We study a class of structured convex optimization problems, which have a two-block separable objective and nonlinear functional constraints as well as affine constraints that couple the two block variables. Such problems naturally arise from distributed resource allocation and constrained machine learning. To achieve high communication efficiency for the distributed applications, we propose a nonlinear alternating direction method of multipliers (NL-ADMM) that preserves the classical splitting structure while accommodating general convex functional constraints. Unlike existing ADMM variants for nonconvex constrained problems, the proposed method does not require smoothness of the objective functions or differentiability of the constraint mapping, by leveraging convexity of the considered problem. We establish global convergence and an ergodic $O(1/k)$ convergence rate of NL-ADMM by assuming the existence of a KKT solution. The results extend those of ADMM for linearly constrained convex problems. Numerical experiments are conducted on two representative distributed tasks. The results on numerous instances demonstrate that NL-ADMM can achieve (in many cases) 100x higher communication efficiency than the classic augmented Lagrangian method and nearly 2x higher than the Douglas-Rachford operator splitting method, making the new method well suited for large-scale distributed learning systems."}
{"id": "2601.07082", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07082", "abs": "https://arxiv.org/abs/2601.07082", "authors": ["Valentin Nkana Ngan", "Giovanni Stabile", "Andrea Mola", "Gianluigi Rozza"], "title": "An efficient hyper reduced-order model for segregated solvers for geometrical parametrization problems", "comment": null, "summary": "We propose an efficient hyper-reduced order model (HROM) designed for segregated finite-volume solvers in geometrically parametrized problems. The method follows a discretize-then-project strategy: the full-order operators are first assembled using finite volume or finite element discretizations and then projected onto low-dimensional spaces using a small set of spatial sampling points, selected through hyper-reduction techniques such as DEIM. This approach removes the dependence of the online computational cost on the full mesh size. The method is assessed on three benchmark problems: a linear transport equation, a nonlinear Burgers equation, and the incompressible Navier--Stokes equations. The results show that the hyper-reduced models closely match full-order solutions while achieving substantial reductions in computational time. Since only a sparse subset of mesh cells is evaluated during the online phase, the method is naturally parallelizable and scalable to very large meshes. These findings demonstrate that hyper-reduction can be effectively combined with segregated solvers and geometric parametrization to enable fast and accurate CFD simulations."}
{"id": "2601.07169", "categories": ["math.PR", "cond-mat.stat-mech", "cs.DM", "math.CO", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.07169", "abs": "https://arxiv.org/abs/2601.07169", "authors": ["Satyaki Mukherjee", "Vilas Winstein"], "title": "Approximate FKG inequalities for phase-bound spin systems", "comment": "28 pages, 1 figure", "summary": "The FKG inequality is an invaluable tool in monotone spin systems satisfying the FKG lattice condition, which provides positive correlations for all coordinate-wise increasing functions of spins. However, the FKG lattice condition is somewhat brittle and is not preserved when confining a spin system to a particular phase. For instance, consider the Curie-Weiss model, which is a model of a ferromagnet with two phases at low temperature corresponding to positive and negative overall magnetization. It is not a priori clear if each phase internally has positive correlations for increasing functions, or if the positive correlations in the model arise primarily from the global choice of positive or negative magnetization.\n  In this article, we show that the individual phases do indeed satisfy an approximate form of the FKG inequality in a class of generalized higher-order Curie-Weiss models (including the standard Curie-Weiss model as a special case), as well as in ferromagnetic exponential random graph models (ERGMs). To cover both of these settings, we present a general result which allows for the derivation of such approximate FKG inequalities in a straightforward manner from inputs related to metastable mixing; we expect that this general result will be widely applicable. In addition, we derive some consequences of the approximate FKG inequality, including a version of a useful covariance inequality originally due to Newman as well as Bulinski and Shabanovich. We use this to extend the proof of the central limit theorem for ERGMs within a phase at low temperatures, due to the second author, to the non-forest phase-coexistence regime, answering a question posed by Bianchi, Collet, and Magnanini for the edge-triangle model."}
{"id": "2601.06998", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.06998", "abs": "https://arxiv.org/abs/2601.06998", "authors": ["Nicole Bäuerle", "Marcin Pitera", "Łukasz Stettner"], "title": "Policy stability and ultimate stationarity in discounted risk-sensitive stochastic control", "comment": null, "summary": "We study discrete-time Markov Decision Processes (MDPs) on finite state-action spaces and analyze the stability of optimal policies and value functions in the long-run discounted risk-sensitive objective setting. Our analysis addresses robustness with respect to perturbations of the risk-aversion parameter and the discount factor, the emergence of ultimate stationarity, and the interaction between discounted and averaged formulations under suitable mixing assumptions. We further investigate limiting regimes associated with vanishing discount and vanishing risk sensitivity, and discuss the role of Blackwell-type stability properties in the discounted setting. Finally, we provide numerical illustrations that highlight the intrinsic non-stationarity of optimal discounted risk-sensitive policies."}
{"id": "2601.07174", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07174", "abs": "https://arxiv.org/abs/2601.07174", "authors": ["Hongxing Rui", "Weijie Wang"], "title": "The MAC scheme for linear elasticity in displacement-stress formulation on non-uniform staggered grids", "comment": null, "summary": "A marker-and-cell finite difference method is developed for solving the two dimensional and three dimensional linear elasticity in the displacement-stress formulation on staggered grids. The method employs a staggered grid arrangement, where the displacement components are approximated on the midpoints of cell edges, the normal stresses are defined at the cell centers, and the shear stresses are defined at the grid points. This structure ensures local conservation properties and avoids spurious oscillations in stress approximation. A rigorous mathematical analysis is presented, establishing the stability of the scheme and proving the second-order L2-error super-convergence for both displacement and stress. The proposed method is locking-free with respect to the Lame constant, making it suitable for both compressible and nearly incompressible elastic materials. Numerical experiments demonstrate the efficiency and robustness of the finite difference scheme, and the computed results show excellent agreement with the theoretical predictions."}
{"id": "2601.07176", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.07176", "abs": "https://arxiv.org/abs/2601.07176", "authors": ["Guanglin Rang", "Ran Wang"], "title": "Local linearization for the nonlinear damped stochastic Klein-Gordon equation", "comment": "18 pages; Comments are welcome", "summary": "For the $1+1$ dimensional nonlinear damped stochastic Klein-Gordon equation driven by space-time white noise, we prove that the second-order increments of the solution can be approximated, after scaling with the diffusion coefficient, by those of the corresponding linearized stochastic Klein-Gordon equation. This extends the result of Huang et al. \\cite{HOO2024} for the stochastic wave equation. A key difficulty arises from the more complex structure of the Green function, which we overcome by means of subtle analytical estimates. As applications, we analyze the quadratic variation of the solution and construct a consistent estimator for the diffusion parameter."}
{"id": "2601.07002", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.07002", "abs": "https://arxiv.org/abs/2601.07002", "authors": ["Heinz H. Bauschke", "Tran Thanh Tung"], "title": "The Güntürk-Thao theorem revisited: polyhedral cones and limiting examples", "comment": "3 figures", "summary": "In 2023, Güntürk and Thao proved that the sequence $(x^{(n)})_{n\\in\\mathbb{N}}$ generated by random (relaxed) projections drawn from a finite collection of innately regular closed subspaces in a real Hilbert space satisfies $\\sum_{n\\in\\mathbb{N}} \\|x^{(n)}-x^{(n+1)}\\|^γ<+\\infty$ for all $γ>0$.\n  We extend their result to a finite collection of polyhedral cones. Moreover, we construct examples showing the tightness of our extension: indeed, the result fails for a line and a convex set in $\\mathbb{R}^2$, and for a plane and a non-polyhedral cone in $\\mathbb{R}^3$."}
{"id": "2601.07278", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07278", "abs": "https://arxiv.org/abs/2601.07278", "authors": ["Jiaming Guo", "Dunhui Xiao"], "title": "Parametric Probabilistic Manifold Decomposition for Nonlinear Model Reduction", "comment": "26 pages", "summary": "Probabilistic Manifold Decomposition (PMD)\\cite{doi:10.1137/25M1738863}, developed in our earlier work, provides a nonlinear model reduction by embedding high-dimensional dynamics onto low-dimensional probabilistic manifolds. The PMD has demonstrated strong performance for time-dependent systems. However, its formulation is for temporal dynamics and does not directly accommodate parametric variability, which limits its applicability to tasks such as design optimization, control, and uncertainty quantification. In order to address the limitations, a \\emph{Parametric Probabilistic Manifold Decomposition} (PPMD) is presented to deal with parametric problems. The central advantage of PPMD is its ability to construct continuous, high-fidelity parametric surrogates while retaining the transparency and non-intrusive workflow of PMD. By integrating probabilistic-manifold embeddings with parameter-aware latent learning, PPMD enables smooth predictions across unseen parameter values (such as different boundary or initial conditions). To validate the proposed method, a comprehensive convergence analysis is established for PPMD, covering the approximation of the linear principal subspace, the geometric recovery of the nonlinear solution manifold, and the statistical consistency of the kernel ridge regression used for latent learning. The framework is then numerically demonstrated on two classic flow configurations: flow past a cylinder and backward-facing step flow. Results confirm that PPMD achieves superior accuracy and generalization beyond the training parameter range compared to the conventional proper orthogonal decomposition with Gaussian process regression (POD+GPR) method."}
{"id": "2601.07502", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.07502", "abs": "https://arxiv.org/abs/2601.07502", "authors": ["Shyan Ghosh", "Manisha Dhillon", "Kuldeep Kumar Kataria"], "title": "On Limiting Behaviour of Moves in Multidimensional Elephant Random Walk with Stops", "comment": null, "summary": "In this paper, we discuss the number of moves in multidimensional elephant random walk with stops (MERWS). We obtain the conditional mean increments of the number of moves. Using this conditional result, a recursive relation for the expected number of moves of MERWS is derived and a multiplicative martingale is constructed. The asymptotic behaviour of the solution of this recursive relation is discussed. Later, we discuss several convergence results for the number of moves that include the law of large numbers and law of iterated logarithm."}
{"id": "2601.07076", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.07076", "abs": "https://arxiv.org/abs/2601.07076", "authors": ["Ewa Bednarczuk", "The Hung Tran"], "title": "Primal-Dual algorithms for Abstract convex functions with respect to quadratic functions", "comment": null, "summary": "We consider the saddle point problem where the objective functions are abstract convex with respect to the class of quadratic functions. We propose primal-dual algorithms using the corresponding abstract proximal operator and investigate the convergence under certain restrictions. We test our algorithms by several numerical examples."}
{"id": "2601.07455", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07455", "abs": "https://arxiv.org/abs/2601.07455", "authors": ["Kui Du", "Jia-Jun Fan"], "title": "TriCG with deflated restarting for symmetric quasi-definite linear systems", "comment": "23 pages, 4 figures", "summary": "TriCG is a short-recurrence iterative method recently introduced by Montoison and Orban [SIAM J. Sci. Comput., 43 (2021), pp. A2502--A2525] for solving symmetric quasi-definite (SQD) linear systems. TriCG takes advantage of the inherent block structure of SQD linear systems and performs substantially better than SYMMLQ. However, numerical experiments have revealed that the convergence of TriCG can be notably slow when the off-diagonal block contains a substantial number of large elliptic singular values. To address this limitation, we introduce a deflation strategy tailored for TriCG to improve its convergence behavior. Specifically, we develop a generalized Saunders--Simon--Yip process with deflated restarting to construct the deflation subspaces. Building upon this process, we propose a novel method termed TriCG with deflated restarting. The deflation subspaces can also be utilized to solve SQD linear systems with multiple right-hand sides. Numerical experiments are provided to illustrate the superior performance of the proposed methods."}
{"id": "2601.07759", "categories": ["math.PR", "cs.GT"], "pdf": "https://arxiv.org/pdf/2601.07759", "abs": "https://arxiv.org/abs/2601.07759", "authors": ["Romain Cosson", "Laurent Massoulié"], "title": "The value of random zero-sum games", "comment": null, "summary": "We study the value of a two-player zero-sum game on a random matrix $M\\in \\mathbb{R}^{n\\times m}$, defined by $v(M) = \\min_{x\\inΔ_n}\\max_{y\\in Δ_m}x^T M y$. In the setting where $n=m$ and $M$ has i.i.d. standard Gaussian entries, we prove that the standard deviation of $v(M)$ is of order $\\frac{1}{n}$. This confirms an experimental conjecture dating back to the 1980s. We also investigate the case where $M$ is a rectangular Gaussian matrix with $m = n+λ\\sqrt{n}$, showing that the expected value of the game is of order $\\fracλ{n}$, as well as the case where $M$ is a random orthogonal matrix. Our techniques are based on probabilistic arguments and convex geometry. We argue that the study of random games could shed new light on various problems in theoretical computer science."}
{"id": "2601.07079", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.07079", "abs": "https://arxiv.org/abs/2601.07079", "authors": ["Xuehui Ma", "Shiliang Zhang", "Zhiyong Sun", "Xiaohui Zhang", "Sabita Maharjan"], "title": "Adaptive Robust Control for Uncertain Systems with Ellipsoid-Set Learning", "comment": "This paper has been accepted by IEEE Transactions on Automatic Control. Copyright has been transferred to IEEE", "summary": "Despite the celebrated success of stochastic control approaches for uncertain systems, such approaches are limited in the ability to handle non-Gaussian uncertainties. This work presents an adaptive robust control for linear uncertain systems, whose process noise, observation noise, and system states are depicted by ellipsoid sets rather than Gaussian distributions. We design an ellipsoid-set learning method to estimate the boundaries of state sets, and incorporate the learned sets into the control law derivation to reduce conservativeness in robust control. Further, we consider the parametric uncertainties in state-space matrices. Particularly, we assign finite candidates for the uncertain parameters, and construct a bank of candidate-conditional robust control problems for each candidate. We derive the final control law by aggregating the candidate-conditional control laws. In this way, we separate the control scheme into parallel robust controls, decoupling the learning and control, which otherwise renders the control unattainable. We demonstrate the effectiveness of the proposed control in numerical simulations in the cases of linear quadratic regulation and tracking control."}
{"id": "2601.07479", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07479", "abs": "https://arxiv.org/abs/2601.07479", "authors": ["Håkon Noren Myhr", "Sølve Eidnes"], "title": "Derivative-free discrete gradient methods", "comment": "18 pages, 7 figures", "summary": "Discrete gradient methods are a class of numerical integrators producing solutions with exact preservation of first integrals of ordinary differential equations. In this paper, we apply order theory combined with the symmetrized Itoh--Abe discrete gradient and finite differences to construct an integral-preserving fourth-order method that is derivative-free. The numerical scheme is implicit and a convergence result for Newton's iterations is provided, taking into account how the error due to the finite difference approximations affects the convergence rate. Numerical experiments verify the order and show that the derivative-free method is significantly faster than obtaining derivatives by automatic differentiation. Finally, an experiment using topographic data as the potential function of a Hamiltonian oscillator demonstrates how this method allows the simulation of discrete-time dynamics from a Hamiltonian that is a combination of data and analytical expressions."}
{"id": "2601.07802", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.07802", "abs": "https://arxiv.org/abs/2601.07802", "authors": ["Subhajit Goswami", "Dipranjan Pal"], "title": "Critical level-set percolation on finite graphs and spectral gap", "comment": "34 pages + references", "summary": "We study the bond percolation on finite graphs induced by the level-sets of zero-average Gaussian free field on the associated metric graph above a given height (level) parameter $h \\in \\mathbb{R}$. We characterize the near- and off-critical phases of this model for any expanders family $\\mathcal{G}_n = (V_n, E_n)$ with uniformly bounded degrees. In particular, we show that the volume of the largest open cluster at level $h_n$ is of the order $|V_n|^{\\frac23}$ when $h_n$ lies in the corresponding critical window which we identify as $|h_n| = O(|V_n|^{-\\frac13})$. Outside this window, the volume starts to deviate from $Θ(|V_n|^{\\frac23})$ culminating into a linear order in the supercritical phase $h_n = h < 0$ (the giant component) and a logarithmic order in the subcritical phase $h_n = h > 0$. We deduce these from effective estimates on tail probabilities for the maximum volume of an open cluster at any level $h$ for a generic base graph $\\mathcal{G}$. The estimates depend on $\\mathcal{G}$ only through its size and upper and lower bounds on its degrees and spectral gap respectively. To the best of our knowledge, this is the first instance where a mean-field critical behavior is derived under such general setup for finite graphs. The generality of these estimates preclude any local approximation of $\\mathcal{G}$ by regular infinite trees -- a standard approach in the area. Instead, our methods rely on exploiting the connection between spectral gap of the graph $\\mathcal{G}$ and its connection to the level-sets of zero-average Gaussian free field mediated via a set function we call the zero-average capacity."}
{"id": "2601.07114", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.07114", "abs": "https://arxiv.org/abs/2601.07114", "authors": ["Fan Pu", "Zihao Li", "Sivakumar Rathinam", "Minghui Zheng", "Yang Zhou"], "title": "Cyclic Modulation Control of Multi-Conflict Connected Automated Traffic", "comment": null, "summary": "Multi-conflict traffic is ubiquitous. Connected Automated Vehicles (CAVs) offer unprecedented opportunities to enhance safety, reduce emissions, and increase throughput through precise coordination and automation. However, existing CAV strategies remain confined to specialized scenarios, such as highway on-ramp merging or single-lane roundabouts, and traditional traffic signals sacrifice efficiency for safety via rigid phasing and all-red intervals. In this paper, we present Cyclic Modulation Control of Multi-Conflict Connected Automated Traffic (CMAT), a unified, geometry-agnostic framework that embeds each conflict point into a repeating sequence of \"micro-phases\". Vehicles dynamically form platoons with demand-responsive sizes and negotiate time slots for occupying conflict points, enabling collision-free traversal and high intersection utilization. CMAT aims to minimize delay, guarantee safety, and accommodate arbitrary merging, diverging, and crossing patterns without manual retuning. We formalize CMAT as a mixed-integer linear programming model constructed on a directed graph abstracted from the physical intersection layout. The performance of CMAT is evaluated across a suite of multi-conflict tests, including simple two-way crossings, four-leg intersections, complex connected intersections. The results demonstrate substantial reductions in delay and significant throughput improvements compared with state-of-the-art CAV coordination methods and traditional signal timing strategies."}
{"id": "2601.07498", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07498", "abs": "https://arxiv.org/abs/2601.07498", "authors": ["Per Christian Hansen", "Michiel E. Hochstenbach"], "title": "On spectral properties and fast initial convergence of the Kaczmarz method", "comment": null, "summary": "The Kaczmarz method is successfully used for solving discretizations of linear inverse problems, especially in computed tomography where it is known as ART. Practitioners often observe and appreciate its fast convergence in the first few iterations, leading to the same favorable semi-convergence that we observe for simultaneous iterative reconstruction methods. While the latter methods have symmetric and positive definite iteration operators that facilitate their analysis, the operator in Kaczmarz's method is nonsymmetric and it has been an open question so far to understand this fast initial convergence. We perform a spectral analysis of Kaczmarz's method that gives new insight into its (often fast) initial behavior. We also carry out a statistical analysis of how the data noise enters the iteration vectors, which sheds new light on the semi-convergence. Our results are illustrated with several numerical examples."}
{"id": "2601.07808", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.07808", "abs": "https://arxiv.org/abs/2601.07808", "authors": ["Yago Moreno Alonso", "Julia Komjathy"], "title": "Supercritical long-range percolation on graphs of polynomial growth: the truncated one-arm exponent", "comment": "44 pages, 6 figures", "summary": "We consider supercritical long-range percolation on transitive graphs of polynomial growth. In this model, any two vertices $x$ and $y$ of the underlying graph $G$ connect by a direct edge with probability $1-\\exp(-βJ(x,y))$, where $J(x,y)$ is a function that is invariant under the automorphism group of $G$, and we assume that $J$ decays polynomially with the graph distance between $x$ and $y$. We give up-to-constant bounds on the decay of the radius of finite cluster for $β> β_c$. In the same setting, we also give upper and lower bounds on the tail volume of finite clusters. The upper and lower bounds are of matching order, conjecturally on sharp volume bounds for spheres in transitive graphs of polynomial growth. As a corollary, we obtain a lower bound on the anchored isoperimetric dimension of the infinite component."}
{"id": "2601.07256", "categories": ["math.OC", "cs.RO", "eess.SY", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.07256", "abs": "https://arxiv.org/abs/2601.07256", "authors": ["Siddhartha Ganguly", "Kenji Kashima"], "title": "Robust maximum hands-off optimal control: existence, maximum principle, and $L^{0}$-$L^1$ equivalence", "comment": "Revised version of a journal submission; comments are welcome", "summary": "This work advances the maximum hands-off sparse control framework by developing a robust counterpart for constrained linear systems with parametric uncertainties. The resulting optimal control problem minimizes an $L^{0}$ objective subject to an uncountable, compact family of constraints, and is therefore a nonconvex, nonsmooth robust optimization problem. To address this, we replace the $L^{0}$ objective with its convex $L^{1}$ surrogate and, using a nonsmooth variant of the robust Pontryagin maximum principle, show that the $L^{0}$ and $L^{1}$ formulations have identical sets of optimal solutions -- we call this the robust hands-off principle. Building on this equivalence, we propose an algorithmic framework -- drawing on numerically viable techniques from the semi-infinite robust optimization literature -- to solve the resulting problems. An illustrative example is provided to demonstrate the effectiveness of the approach."}
{"id": "2601.07508", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07508", "abs": "https://arxiv.org/abs/2601.07508", "authors": ["Jérémy Berthomieu", "Stef Graillat", "Dimitri Lesnoff", "Theo Mary"], "title": "Multiword matrix multiplication over large finite fields in floating-point arithmetic", "comment": null, "summary": "This article is concerned with the efficient computation of modular matrix multiplication C=AB mod p, a key kernel in computer algebra. We focus on floating-point arithmetic, which allows for using efficient matrix multiplication libraries. However, the existing approach is limited to primes p with bitsize at most half the mantissa size (e.g., 26 bits with double precision arithmetic), and becomes quite inefficient when p approaches this limit. We present a new approach that overcomes this limitation and can efficiently handle primes with larger bitsizes. The key idea is to use multiword decompositions, which represent A and B as scaled sums of u and v matrices (words) with smaller coefficients. We provide a rigorous analysis that proves the correctness of this approach for suitably chosen scaling parameters. Our analysis determines the maximum bitsize of p that can be handled for a given number of words; in particular, we show that decomposing in two words each input suffices to handle bitsizes almost equal to the full mantissa size (e.g., the 26 bits limit is raised to 52 bits in double precision arithmetic). Moreover, we show that (1,v) decompositions with v>1 are also of interest to handle intermediate bitsizes. We perform an extensive experimental analysis for various matrix shapes and prime bitsizes. Our performance benchmarks on both CPU and GPU architectures confirm the efficiency of the proposed approach, which can outperform the existing single word approach for bitsizes as low as 23, and can handle bitsizes as high as 52 while retaining high performance."}
{"id": "2601.07816", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.07816", "abs": "https://arxiv.org/abs/2601.07816", "authors": ["Christopher Hoffman", "Jacob Richey", "Hyojeong Son"], "title": "Local Density of Activated Random Walk on $\\mathbb{Z}$", "comment": "13 pages", "summary": "We consider one-dimensional activated random walk (ARW) on $\\mathbb{Z}$ started from a `point source' initial condition, with many particles at the origin and no other particles. We prove that, uniformly throughout a macroscopic window around the source, the probability that a site contains a sleeping particle after the configuration is stabilized is approximately the critical density. This represents a first step towards understanding the local structure of the critical stationary measure for ARW."}
{"id": "2601.07326", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.07326", "abs": "https://arxiv.org/abs/2601.07326", "authors": ["Huan Li", "Yiming Dong", "Zhouchen Lin"], "title": "Convergence Rate Analysis of the AdamW-Style Shampoo: Unifying One-sided and Two-Sided Preconditioning", "comment": null, "summary": "This paper studies the AdamW-style Shampoo optimizer, an effective implementation of classical Shampoo that notably won the external tuning track of the AlgoPerf neural network training algorithm competition. Our analysis unifies one-sided and two-sided preconditioning and establishes the convergence rate $\\frac{1}{K}\\sum_{k=1}^K E\\left[\\|\\nabla f(X_k)\\|_*\\right]\\leq O(\\frac{\\sqrt{m+n}C}{K^{1/4}})$ measured by nuclear norm, where $K$ represents the iteration number, $(m,n)$ denotes the size of matrix parameters, and $C$ matches the constant in the optimal convergence rate of SGD. Theoretically, we have $\\|\\nabla f(X)\\|_F\\leq \\|\\nabla f(X)\\|_*\\leq \\sqrt{m+n}\\|\\nabla f(X)\\|_F$, supporting that our convergence rate can be considered to be analogous to the optimal $\\frac{1}{K}\\sum_{k=1}^KE\\left[\\|\\nabla f(X_k)\\|_F\\right]\\leq O(\\frac{C}{K^{1/4}})$ convergence rate of SGD in the ideal case of $\\|\\nabla f(X)\\|_*= Θ(\\sqrt{m+n})\\|\\nabla f(X)\\|_F$."}
{"id": "2601.07586", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07586", "abs": "https://arxiv.org/abs/2601.07586", "authors": ["Jerome Droniou", "Raman Kumar", "Roland Masson", "Ritesh Singla"], "title": "A higher order polytopal method for contact mechanics with Tresca friction", "comment": null, "summary": "In this work, we design and analyze a Discrete de Rham (DDR) scheme for a contact mechanics problem involving fractures along which a model of Tresca friction is considered. Our approach is based on a mixed formulation involving a displacement field and a Lagrange multiplier, enforcing the contact conditions, representing tractions at fractures. The approximation space for the displacement is made of vectors values attached to each vertex, edge, face, and element, while the Lagrange multiplier space is approximated by piecewise constant vectors on each fracture face. The displacement degrees of freedom allow reconstruct piecewise quadratic approximations of this field. We prove a discrete Korn inequality that account for the fractures, as well as an inf-sup condition (in a non-standard $H^{-1/2}$-norm) between the discrete Lagrange multiplier space and the discrete displacement space. We provide an in-depth error analysis of the scheme and show that, contrary to usual low-order nodal-based schemes, our method is robust in the quasi-incompressible limit for the primal variable~(displacement). An extensive set of numerical experiments confirms the theoretical analysis and demonstrate the practical accuracy and robustness of the scheme."}
{"id": "2601.07834", "categories": ["math.PR", "cs.LG", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.07834", "abs": "https://arxiv.org/abs/2601.07834", "authors": ["Samuel Duffield"], "title": "A Complete Decomposition of Stochastic Differential Equations", "comment": null, "summary": "We show that any stochastic differential equation with prescribed time-dependent marginal distributions admits a decomposition into three components: a unique scalar field governing marginal evolution, a symmetric positive-semidefinite diffusion matrix field and a skew-symmetric matrix field."}
{"id": "2601.07397", "categories": ["math.OC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.07397", "abs": "https://arxiv.org/abs/2601.07397", "authors": ["Michael Hintermüller", "Michael Hinze", "Denis Korolev"], "title": "Layerwise goal-oriented adaptivity for neural ODEs: an optimal control perspective", "comment": null, "summary": "In this work, we propose a novel layerwise adaptive construction method for neural network architectures. Our approach is based on a goal--oriented dual-weighted residual technique for the optimal control of neural differential equations. This leads to an ordinary differential equation constrained optimization problem with controls acting as coefficients and a specific loss function. We implement our approach on the basis of a DG(0) Galerkin discretization of the neural ODE, leading to an explicit Euler time marching scheme. For the optimization we use steepest descent. Finally, we apply our method to the construction of neural networks for the classification of data sets, where we present results for a selection of well known examples from the literature."}
{"id": "2601.07704", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07704", "abs": "https://arxiv.org/abs/2601.07704", "authors": ["Armando Maria Monforte"], "title": "TMATDG: applying TDG methods to multiple scattering via T-matrix approximation", "comment": "12 pages, 5 figures", "summary": "We present a MATLAB package for the solution of multiple scattering problems, coupling Trefftz Discontinuos Galerkin methods for Helmholtz scattering with the T-matrix method. We rely on the TMATROM package to numerically approximate the T-matrices and deal with multiple scattering problem, providing a framework to handle scattering by polygonal obstacles."}
{"id": "2601.06674", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.06674", "abs": "https://arxiv.org/abs/2601.06674", "authors": ["Christophe Gallesco", "Caio Teodore Genovese Huss Oliveira", "Daniel Yasumasa Takahashi"], "title": "Reduction and classification of higher-order Markov chains for categorical data", "comment": "7 pages, 5 figures", "summary": "Categorical time series models are powerful tools for understanding natural phenomena. Most available models can be formulated as special cases of $m$-th order Markov chains, for $m\\geq 1$. Despite their broad applicability, theoretical research has largely focused on first-order Markov chains, mainly because many properties of higher-order chains can be analyzed by reducing them to first-order chains on an enlarged alphabet. However, the resulting first-order representation is sparse and possesses a highly structured transition kernel, a feature that has not been fully exploited.\n  In this work, we study finite-alphabet Markov chains with arbitrary memory length and introduce a new reduction framework for their structural classification. We define the skeleton of a transition kernel, an object that captures the intrinsic pattern of transition probability constraints in a higher-order Markov chain.\n  We show that the class structure of a binary matrix associated with the skeleton completely determines the recurrent classes and their periods in the original chain. We also provide an explicit algorithm for efficiently extracting the skeleton, which in many cases yields substantial computational savings. Applications include simple criteria for irreducibility and essential irreducibility of higher-order Markov chains and a concrete illustration based on a 10th-order Markov chain."}
{"id": "2601.07431", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.07431", "abs": "https://arxiv.org/abs/2601.07431", "authors": ["Andrea Cristofaro", "Luca Zaccarian"], "title": "Nonquadratic global asymptotic stability certificates for saturated linear feedbacks", "comment": null, "summary": "We establish sufficient conditions for positive (semi-)definiteness, with or without radial unboundedness, for nonquadratic Lyapunov function constructed as sign-indefinite quadratic forms involving the state and the deadzone of a suitable input. We then use these conditions to build weak nonquadratic Lyapunov functions establishing global asymptotic stability of linear systems in feedback through a saturation, leveraging invariance principles. Our results are shown to be non-conservative (necessary and sufficient) for a family of well known prototypical examples of linear SISO feedbacks that are not globally exponentially stabilizable (the so-called ANCBI plants). Our multi-input extension leads to convex stability analysis tests, formulated as linear matrix inequalities that are applicable to ANCBI non-globally-exponentially-stabilizable plants."}
{"id": "2601.07730", "categories": ["math.NA", "math-ph", "math.CV", "quant-ph"], "pdf": "https://arxiv.org/pdf/2601.07730", "abs": "https://arxiv.org/abs/2601.07730", "authors": ["Jithin D. George", "Julian Koellermeier", "Samuel Y. Jung", "Niall M. Mangan"], "title": "Explicit complex time integrators for stiff problems", "comment": null, "summary": "Most numerical methods for time integration use real-valued time steps. Complex time steps, however, can provide an additional degree of freedom, as we can select the magnitude of the time step in both the real and imaginary directions. We show that specific paths in the complex time plane lead to expanded stability regions, providing clear computational advantages for complex-valued systems. In particular, we highlight the Schrödinger equation, for which complex time integrators can be uniquely optimal. Furthermore, we demonstrate that these benefits extend to certain classes of real-valued stiff systems by coupling complex time steps with the Projective Integration method."}
{"id": "2601.06715", "categories": ["math.ST", "cs.LG", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.06715", "abs": "https://arxiv.org/abs/2601.06715", "authors": ["Yifeng Yu", "Lu Yu"], "title": "Diffusion Models with Heavy-Tailed Targets: Score Estimation and Sampling Guarantees", "comment": null, "summary": "Score-based diffusion models have become a powerful framework for generative modeling, with score estimation as a central statistical bottleneck. Existing guarantees for score estimation largely focus on light-tailed targets or rely on restrictive assumptions such as compact support, which are often violated by heavy-tailed data in practice. In this work, we study conventional (Gaussian) score-based diffusion models when the target distribution is heavy-tailed and belongs to a Sobolev class with smoothness parameter $β>0$. We consider both exponential and polynomial tail decay, indexed by a tail parameter $γ$. Using kernel density estimation, we derive sharp minimax rates for score estimation, revealing a qualitative dichotomy: under exponential tails, the rate matches the light-tailed case up to polylogarithmic factors, whereas under polynomial tails the rate depends explicitly on $γ$. We further provide sampling guarantees for the associated continuous reverse dynamics. In total variation, the generated distribution converges at the minimax optimal rate $n^{-β/(2β+d)}$ under exponential tails (up to logarithmic factors), and at a $γ$-dependent rate under polynomial tails. Whether the latter sampling rate is minimax optimal remains an open question. These results characterize the statistical limits of score estimation and the resulting sampling accuracy for heavy-tailed targets, extending diffusion theory beyond the light-tailed setting."}
{"id": "2601.07433", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.07433", "abs": "https://arxiv.org/abs/2601.07433", "authors": ["Arzu Ahmadova", "Agamirza E. Bashirov"], "title": "Design of Optimal Controls in Acausal LQG Problems", "comment": null, "summary": "In control theory, a system which has output depending only on the present and past values of the input is said to be causal (or nonanticipative). Respectively, a system is acausal (or non-causal) if its output depends on future inputs as well. Overall majority of literature in stochastic control theory discusses causal systems. Only a few sources indirectly concern acausal systems. In this paper, we systemize these results under main idea of acausality and present a background for designing optimal controls in acausal LQG problems."}
{"id": "2601.07757", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07757", "abs": "https://arxiv.org/abs/2601.07757", "authors": ["Mattia Corti", "Sergio Gómez"], "title": "On the Compact Discontinuous Galerkin method for polytopal meshes", "comment": null, "summary": "The Compact Discontinuous Galerkin method was introduced by Peraire and Persson in (SIAM J. Sci. Comput., 30, 1806--1824, 2008). In this work, we present the stability and convergence analysis for the $hp$-version of this method applied to elliptic problems on polytopal meshes. Moreover, we introduce fast and practical algorithms that allow the CDG, LDG, and BR2 methods to be implemented within a unified framework. Our numerical experiments show that the CDG method yields a compact stencil for the stiffness matrix, with faster assembly and solving times compared to the LDG and BR2 methods. We numerically study how coercivity depends on the method parameters for various mesh types, with particular focus on the number of facets per mesh element. Finally, we demonstrate the importance of choosing the correct directions for the numerical fluxes when using variable polynomial degrees."}
{"id": "2601.06998", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.06998", "abs": "https://arxiv.org/abs/2601.06998", "authors": ["Nicole Bäuerle", "Marcin Pitera", "Łukasz Stettner"], "title": "Policy stability and ultimate stationarity in discounted risk-sensitive stochastic control", "comment": null, "summary": "We study discrete-time Markov Decision Processes (MDPs) on finite state-action spaces and analyze the stability of optimal policies and value functions in the long-run discounted risk-sensitive objective setting. Our analysis addresses robustness with respect to perturbations of the risk-aversion parameter and the discount factor, the emergence of ultimate stationarity, and the interaction between discounted and averaged formulations under suitable mixing assumptions. We further investigate limiting regimes associated with vanishing discount and vanishing risk sensitivity, and discuss the role of Blackwell-type stability properties in the discounted setting. Finally, we provide numerical illustrations that highlight the intrinsic non-stationarity of optimal discounted risk-sensitive policies."}
{"id": "2601.07492", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.07492", "abs": "https://arxiv.org/abs/2601.07492", "authors": ["Bianca Marin Moreno", "Margaux Brégère", "Pierre Gaillard", "Nadia Oudjane"], "title": "Online Markov Decision Processes with Terminal Law Constraints", "comment": null, "summary": "Traditional reinforcement learning usually assumes either episodic interactions with resets or continuous operation to minimize average or cumulative loss. While episodic settings have many theoretical results, resets are often unrealistic in practice. The infinite-horizon setting avoids this issue but lacks non-asymptotic guarantees in online scenarios with unknown dynamics. In this work, we move towards closing this gap by introducing a reset-free framework called the periodic framework, where the goal is to find periodic policies: policies that not only minimize cumulative loss but also return the agents to their initial state distribution after a fixed number of steps. We formalize the problem of finding optimal periodic policies and identify sufficient conditions under which it is well-defined for tabular Markov decision processes. To evaluate algorithms in this framework, we introduce the periodic regret, a measure that balances cumulative loss with the terminal law constraint. We then propose the first algorithms for computing periodic policies in two multi-agent settings and show they achieve sublinear periodic regret of order $\\tilde O(T^{3/4})$. This provides the first non-asymptotic guarantees for reset-free learning in the setting of $M$ homogeneous agents, for $M > 1$."}
{"id": "2601.07791", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.07791", "abs": "https://arxiv.org/abs/2601.07791", "authors": ["Eric Darve"], "title": "Necessary and Sufficient Conditions for the Existence of an LU Factorization for General Rank Deficient Matrices", "comment": null, "summary": "We establish necessary and sufficient conditions for the existence of an LU factorization $A=LU$ for an arbitrary square matrix $A$, including singular and rank-deficient cases, without the use of row or column permutations. We prove that such a factorization exists if and only if the nullity of every leading principal submatrix is bounded by the sum of the nullities of the corresponding leading column and row blocks. While building upon the work of Okunev and Johnson, we present simpler, constructive proofs. Furthermore, we extend these results to characterize rank-revealing factorizations, providing explicit sparsity bounds for the factors $L$ and $U$. Finally, we derive analogous necessary and sufficient conditions for the existence of factorizations constrained to have unit lower or unit upper triangular factors."}
{"id": "2601.07514", "categories": ["math.OC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.07514", "abs": "https://arxiv.org/abs/2601.07514", "authors": ["Matteo Garbelli"], "title": "Data-Driven Stochastic VRP: Integration of Forecast Duration into Optimization for Utility Workforce Management", "comment": null, "summary": "This paper investigates the integration of machine learning forecasts of intervention durations into a stochastic variant of the Capacitated Vehicle Routing Problem with Time Windows (CVRPTW). In particular, we exploit tree-based gradient boosting (XGBoost) trained on eight years of gas meter maintenance data to produce point predictions and uncertainty estimates, which then drive a multi-objective evolutionary optimization routine. The methodology addresses uncertainty through sub-Gaussian concentration bounds for route-level risk buffers and explicitly accounts for competing operational KPIs through a multi-objective formulation. Empirical analysis of prediction residuals validates the sub-Gaussian assumption underlying the risk model. From an empirical point of view, our results report improvements around 20-25\\% in operator utilization and completion rates compared with plans computed using default durations. The integration of uncertainty quantification and risk-aware optimization provides a practical framework for handling stochastic service durations in real-world routing applications."}
{"id": "2601.06863", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.06863", "abs": "https://arxiv.org/abs/2601.06863", "authors": ["John Bell", "Ana Djurdjevac", "Nicolas Perkowski"], "title": "Surface Dean--Kawasaki equations", "comment": null, "summary": "We consider stochastic particle dynamics on hypersurfaces represented in Monge gauge parametrization. Starting from the underlying Langevin system, we derive the surface Dean-Kawasaki (DK) equation and formulate it in the martingale sense. The resulting SPDE explicitly reflects the geometry of the hypersurface through the induced metric and its differential operators. Our framework accommodates both pairwise interactions and environmental potentials, and we extend the analysis to evolving hypersurfaces driven by an SDE that interacts with the particles, yielding the corresponding surface DK equation for the coupled surface-particle system. We establish a weak uniqueness result in the non-interacting case, and we develop a finite-volume discretization preserving the fluctuation-dissipation relation. Numerical experiments illustrate equilibrium properties and dynamical behavior influenced by surface geometry and external potentials."}
{"id": "2601.07517", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.07517", "abs": "https://arxiv.org/abs/2601.07517", "authors": ["Marius Durea", "Elena-Cristina Stamate"], "title": "Dually cone-boundedness of a set and applications", "comment": null, "summary": "We introduce and study a generalized concept of boundedness of a subset of a normed vector space with respect to a cone, which is defined as lower boundedness of the images of the underlying set through all the positive functionals of the cone. We show that this is a weaker notion when compared to other similar ones and we explore several links with the existing literature. We subsequently demonstrate that this concept furnishes the properties required to obtain various generalizations of important results and techniques, including conic cancellation rules and the Rådström embedding procedure."}
{"id": "2601.07076", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.07076", "abs": "https://arxiv.org/abs/2601.07076", "authors": ["Ewa Bednarczuk", "The Hung Tran"], "title": "Primal-Dual algorithms for Abstract convex functions with respect to quadratic functions", "comment": null, "summary": "We consider the saddle point problem where the objective functions are abstract convex with respect to the class of quadratic functions. We propose primal-dual algorithms using the corresponding abstract proximal operator and investigate the convergence under certain restrictions. We test our algorithms by several numerical examples."}
{"id": "2601.07619", "categories": ["math.OC", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2601.07619", "abs": "https://arxiv.org/abs/2601.07619", "authors": ["Luisa Estrada", "Sasha Glendinning", "Andrew Nugent"], "title": "Speaking of Opinions: Comparing Approaches to Modelling Opinion Manipulation", "comment": null, "summary": "This review outlines the major approaches to modelling opinion formation and manipulation in mathematics and computer science. Key tools such as ordinary and partial differential equations, stochastic models, control theory, and interaction protocols are introduced and compared as methods for describing manipulation. The review is separated into those models using a continuous opinion space and those using discrete or binary opinions, with the advantages and disadvantages of each discussed. Finally, the authors provide an interdisciplinary perspective on the field of opinion dynamics and its social significance."}
{"id": "2601.07256", "categories": ["math.OC", "cs.RO", "eess.SY", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.07256", "abs": "https://arxiv.org/abs/2601.07256", "authors": ["Siddhartha Ganguly", "Kenji Kashima"], "title": "Robust maximum hands-off optimal control: existence, maximum principle, and $L^{0}$-$L^1$ equivalence", "comment": "Revised version of a journal submission; comments are welcome", "summary": "This work advances the maximum hands-off sparse control framework by developing a robust counterpart for constrained linear systems with parametric uncertainties. The resulting optimal control problem minimizes an $L^{0}$ objective subject to an uncountable, compact family of constraints, and is therefore a nonconvex, nonsmooth robust optimization problem. To address this, we replace the $L^{0}$ objective with its convex $L^{1}$ surrogate and, using a nonsmooth variant of the robust Pontryagin maximum principle, show that the $L^{0}$ and $L^{1}$ formulations have identical sets of optimal solutions -- we call this the robust hands-off principle. Building on this equivalence, we propose an algorithmic framework -- drawing on numerically viable techniques from the semi-infinite robust optimization literature -- to solve the resulting problems. An illustrative example is provided to demonstrate the effectiveness of the approach."}
{"id": "2601.07628", "categories": ["math.OC", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.07628", "abs": "https://arxiv.org/abs/2601.07628", "authors": ["Hongpei Li", "Yicheng Huang", "Huikang Liu", "Dongdong Ge", "Yinyu Ye"], "title": "Beyond Single-GPU: Scaling PDLP to Distributed Multi-GPU Systems", "comment": "Distributed PDLP For Improve PDLP Efficiency", "summary": "In this work, we present a distributed implementation of the Primal-Dual Hybrid Gradient (PDHG) algorithm for solving massive-scale linear programming (LP) problems. Although PDHG-based solvers have shown strong performance on single-node GPU architectures, their applicability to industrial-scale instances is often limited by GPU memory capacity and computational throughput. To overcome these challenges, we extend the PDHG framework to a distributed-memory setting via a practical two-dimensional grid partitioning of the constraint matrix, enabling scalable execution across multiple GPUs. Our implementation leverages the NCCL communication backend to efficiently synchronize primal-dual updates across devices. To improve load balance and computational efficiency, we introduce a block-wise random shuffling strategy combined with nonzero-aware data distribution, and further accelerate computation through fused CUDA kernels. By distributing both memory and computation, the proposed framework not only overcomes the single-GPU memory bottleneck but also achieves substantial speedups by exploiting multi-GPU parallelism with relatively low communication overhead. Extensive experiments on standard LP benchmarks, including MIPLIB and Hans' instances, as well as large-scale real-world datasets, show that our distributed implementation, built upon cuPDLPx, achieves strong scalability and high performance while preserving full FP64 numerical accuracy."}
{"id": "2601.07655", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.07655", "abs": "https://arxiv.org/abs/2601.07655", "authors": ["Lea Enzi", "Stefan Thonhauser"], "title": "To report or not to report: Optimal claim reporting in a bonus-malus system", "comment": null, "summary": "We study an optimal claim reporting problem in a bonus-malus setting. We assume, that the insurance contract consists of two regimes, where reporting a claim leads to a transition to a higher-premium regime, whereas remaining claim-free for a prespecified time period results in a shift to the lower premium regime. The insured can decide whether or not to report an occurred claim. We formulate this as an optimal control problem, where the policyholder follows a barrier-type reporting strategy, with the goal of maximizing the expected value of a function of their terminal wealth. We show that the associated value function is the unique viscosity solution to a system of Hamilton-Jacobi-Bellman equations. This characterization allows us to compute numerical approximations of the optimal barrier strategies."}
{"id": "2601.07815", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.07815", "abs": "https://arxiv.org/abs/2601.07815", "authors": ["Erhan Bayraktar", "Jiamin Jian"], "title": "Convergence and turnpike properties of linear-quadratic mean field control problems with common noise", "comment": null, "summary": "We investigate convergence and turnpike properties for linear-quadratic mean field control problems with common noise. Within a unified framework, we analyze a finite-horizon social optimization problem, its mean field control limit, and the corresponding ergodic mean field control problem. The finite-horizon problems are characterized by coupled Riccati differential equations, whereas the ergodic problem is addressed via a Bellman equation on the Wasserstein space, which reduces to a system of stabilizing algebraic Riccati equations. By deriving estimates for these Riccati systems, we establish a turnpike property for the finite-horizon mean field control problem and obtain quantitative convergence results from the social optimization problem to its mean field limit and the associated ergodic control problem."}
{"id": "2601.07028", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.07028", "abs": "https://arxiv.org/abs/2601.07028", "authors": ["Erhan Bayraktar", "Hiroaki Horikawa"], "title": "Quantitative convergence rates for extended mean field games with volatility control", "comment": "Keywords and phrases: mean field games, interaction via controls, volatility control, quantitative convergence, linear-quadratic", "summary": "We investigate the convergence of symmetric stochastic differential games with interactions via control, where the volatility terms of both idiosyncratic and common noises are controlled. We apply the stochastic maximum principle, following the approach of Laurière and Tangpi, to reduce the convergence analysis to the study of forward-backward propagation of chaos. Under the standard monotonicity conditions, we derive quantitative convergence rates for open-loop Nash equilibria of $N$-player stochastic differential games toward the corresponding mean field equilibrium. As a prerequisite, we also establish the well-posedness of the conditional McKean--Vlasov forward-backward stochastic differential equations by the method of continuation. Moreover, we analyze a specific class of linear-quadratic settings to demonstrate the applicability of our main result."}
