{"id": "2602.17896", "categories": ["math.ST", "stat.OT"], "pdf": "https://arxiv.org/pdf/2602.17896", "abs": "https://arxiv.org/abs/2602.17896", "authors": ["Mingao Yuan", "Md. Niamul Islam Sium"], "title": "Central limit theorem for the global clustering coefficient of random geometric graphs", "comment": null, "summary": "The global clustering coefficient serves as a powerful metric for the structural analysis and comparison of complex networks. Random geometric graphs offer a realistic framework for representing the spatial constraints and geometry often found in real-world network datasets. In this paper, we establish a central limit theorem for the global clustering coefficient of random geometric graphs. Our main result identifies the centering and scaling sequences required for convergence in law to the standard normal distribution. Our approach varies by regime: in the dense case, we employ the Lyapunov CLT; in the intermediate case, we utilize the asymptotic theory of $U$-statistics with sample-size-dependent kernels; and in the sparse regime, we use the method of moments to derive the asymptotic distribution. Notably, the convergence rates for non-uniform and uniform random geometric graphs diverge in the dense regime, yet they coincide in the sparse regime. In addition, we find that the global clustering coefficient for both uniform and non-uniform RGGs is asymptotically equal to $3/4$"}
{"id": "2602.17967", "categories": ["math.ST", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.17967", "abs": "https://arxiv.org/abs/2602.17967", "authors": ["Hanxiao Chen", "Debarghya Mukherjee"], "title": "Minimax optimal adaptive structured transfer learning through semi-parametric domain-varying coefficient model", "comment": "86 pages, 8 figures", "summary": "Transfer learning aims to improve inference in a target domain by leveraging information from related source domains, but its effectiveness critically depends on how cross-domain heterogeneity is modeled and controlled. When the conditional mechanism linking covariates and responses varies across domains, indiscriminate information pooling can lead to negative transfer, degrading performance relative to target-only estimation. We study a multi-source, single-target transfer learning problem under conditional distributional drift and propose a semiparametric domain-varying coefficient model (DVCM), in which domain-relatedness is encoded through an observable domain identifier. This framework generalizes classical varying-coefficient models to structured transfer learning and interpolates between invariant and fully heterogeneous regimes. Building on this model, we develop an adaptive transfer learning estimator that selectively borrows strength from informative source domains while provably safeguarding against negative transfer. Our estimator is computationally efficient and easy to implement; we also show that it is minimax rate-optimal and derive its asymptotic distribution, enabling valid uncertainty quantification and hypothesis testing despite data-adaptive pooling and shrinkage. Our results precisely characterize the interplay among domain heterogeneity, the smoothness of the underlying mean function, and the number of source domains and are corroborated by comprehensive numerical experiments and two real-data applications."}
{"id": "2602.18184", "categories": ["math.ST", "math.PR", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.18184", "abs": "https://arxiv.org/abs/2602.18184", "authors": ["Aristides V. Doumas", "S. Spektor"], "title": "Kolmogorov-Type Maximal Inequalities for Independent and Dependent Negative Binomial Random Variables: Sharp Bounds, Sub-Exponential Refinements, and Applications to Overdispersed Count Data", "comment": "11 pages, 8 figures, 2 tables", "summary": "This paper develops Kolmogorov-type maximal inequalities for sums of Negative Binomial random variables under both independence and dependence structures. For independent heterogeneous Negative Binomial variables we derive sharp Markov-type deviation inequalities and Kolmogorov-type bounds expressed in terms of Tweedie dispersion parameters, providing explicit control limits for NB2 generalized linear model monitoring. For dependent count data arising through a shared Gamma mixing variable, we establish a \\emph{sub-exponential Bernstein-type refinement} that exploits the Poisson-Gamma hierarchical structure to yield exponentially decaying tail probabilities -- this refinement is new in the literature. Through moment-matched Monte Carlo experiments ($n=20$, 2{,}000 replications), we document a 55\\% reduction in mean maximum deviation under appropriate dependence structures, a stabilization effect we explain analytically. A concrete epidemiological application with NB2 parameters calibrated from COVID-19 surveillance data demonstrates practical utility. These results materially advance the applicability of classical maximal inequalities to overdispersed and dependent count data prevalent in public health, insurance, and ecological modeling."}
{"id": "2602.18214", "categories": ["math.ST", "math-ph", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.18214", "abs": "https://arxiv.org/abs/2602.18214", "authors": ["Max Kämper", "Christoph Schumacher", "Fabian Schwarzenberger", "Ivan Veselic"], "title": "Quantitative concentration inequalities for the uniform approximation of the IDS", "comment": null, "summary": "The integrated density of states (IDS) is a fundamental spectral quantity for quantum Hamiltonians modeling condensed matter systems, describing how densely energy levels are distributed. It can be interpreted as a volume-averaged spectral distribution. Hence, there are two equivalent definitions of the IDS related by the Pastur-Shubin formula: an operator-theoretic trace formula and a limit of normalized eigenvalue counting functions on finite volumes. We study a discrete random Schrödinger operator with bounded random potentials of finite-range correlations and prove a quantitative concentration inequality ensuring, with explicit high probability, that the empirical IDS (normalized eigenvalue counting function) uniformly approximates the abstract IDS trace formula within a prescribed error, thereby implying confidence regions for the IDS."}
{"id": "2602.17782", "categories": ["math.OC", "math.DG"], "pdf": "https://arxiv.org/pdf/2602.17782", "abs": "https://arxiv.org/abs/2602.17782", "authors": ["Adriano Da Silva", "Lino Grama", "Douglas Duarte Novaes", "Margarita Quispe Tusco"], "title": "Maxwell Strata in the sub-Riemannian problem on solvable, nonnilpotent regular three-dimensional Lie groups", "comment": null, "summary": "In this paper, we study the sub-Riemannian problem associated with contact structures on connected, simply connected, solvable, non-nilpotent, regular three-dimensional Lie groups. For these groups, the vertical component of the Hamiltonian system takes the form of a perturbed pendulum. A qualitative phase-space analysis allows us to prove that this vertical component exhibits nontrivial symmetries. In particular, we are able to fully characterize the Maxwell set corresponding to these symmetries, and show that its first Maxwell time coincides with the period of the pendulum for almost all geodesics. This result yields an explicit upper bound for the cut time in terms of the period of the pendulum."}
{"id": "2602.17752", "categories": ["math.PR", "math.CO", "math.LO"], "pdf": "https://arxiv.org/pdf/2602.17752", "abs": "https://arxiv.org/abs/2602.17752", "authors": ["Michael Benedikt", "Maksim Zhukovskii"], "title": "A logical approach to concentration", "comment": null, "summary": "Concentration results say that a sequence of random variables becomes progressively concentrated around the mean. Such results are common in the study of functions of random graphs. We introduce a real-valued logic with various aggregate operators on graphs, including summation, and prove that every term in the language, seen as a random variable on random graphs within the classical Erdős-Rényi random graph model, is concentrated. We prove this for dense and sparse variants of Erdős-Rényi graphs. On the one hand, our results extend the line of work originating with Fagin and Glebskii et al. on zero-one laws for dense random graphs, as well as the zero-one law of Shelah and Spencer for sparse random graphs. On the other hand, they can be seen as a meta-theorem for inferring concentration results on random graphs, and we give examples of such applications."}
{"id": "2602.17776", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.17776", "abs": "https://arxiv.org/abs/2602.17776", "authors": ["Yuhe Wang", "Min Wang"], "title": "Solving and learning advective multiscale Darcian dynamics with the Neural Basis Method", "comment": null, "summary": "Physics-governed models are increasingly paired with machine learning for accelerated predictions, yet most \"physics--informed\" formulations treat the governing equations as a penalty loss whose scale and meaning are set by heuristic balancing. This blurs operator structure, thereby confounding solution approximation error with governing-equation enforcement error and making the solving and learning progress hard to interpret and control. Here we introduce the Neural Basis Method, a projection-based formulation that couples a predefined, physics-conforming neural basis space with an operator-induced residual metric to obtain a well-conditioned deterministic minimization. Stability and reliability then hinge on this metric: the residual is not merely an optimization objective but a computable certificate tied to approximation and enforcement, remaining stable under basis enrichment and yielding reduced coordinates that are learnable across parametric instances. We use advective multiscale Darcian dynamics as a concrete demonstration of this broader point. Our method produce accurate and robust solutions in single solves and enable fast and effective parametric inference with operator learning."}
{"id": "2602.17795", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17795", "abs": "https://arxiv.org/abs/2602.17795", "authors": ["Vsevolod Ivanov Ivanov"], "title": "Optimality conditions via exact penalty functions", "comment": "10 pages", "summary": "In this paper, we obtain optimality conditions for the problem with inequality, equality and closed set constraints in terms of the lower Hadamard derivative. The results are obtained applying exact penalty functions."}
{"id": "2602.17960", "categories": ["math.PR", "stat.AP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.17960", "abs": "https://arxiv.org/abs/2602.17960", "authors": ["Zhou Fan", "Renyuan Ma", "Elliot Paquette", "Zhichao Wang"], "title": "Anisotropic local law for non-separable sample covariance matrices", "comment": null, "summary": "We establish local laws for sample covariance matrices $K = N^{-1}\\sum_{i=1}^N \\g_i\\g_i^*$ where the random vectors $\\g_1, \\ldots, \\g_N \\in \\R^n$ are independent with common covariance $Σ$. Previous work has largely focused on the separable model $\\g = Σ^{1/2}\\w$ with $\\w$ having independent entries, but this structure is rarely present in statistical applications involving dependent or nonlinearly transformed data. Under a concentration assumption for quadratic forms $\\g^*A\\g$, we prove an optimal averaged local law showing that the Stieltjes transform of $K$ converges to its deterministic limit uniformly down to the optimal scale $η\\geq N^{-1+\\eps}$. Under an additional structural assumption on the cumulant tensors of $\\g$ -- which interpolates between the highly structured case of independent entries and generic dependence -- we establish the full anisotropic local law, providing entrywise control of the resolvent $(K-zI)^{-1}$ in arbitrary directions. We discuss several classes of non-separable examples satisfying our assumptions, including conditionally mean-zero distributions, the random features model $\\g = σ(X\\w)$ arising in machine learning, and Gaussian measures with nonlinear tilting. The proofs introduce a tensor network framework for analyzing fluctuation averaging in the presence of higher-order cumulant structure."}
{"id": "2602.17819", "categories": ["math.NA", "math.AP", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.17819", "abs": "https://arxiv.org/abs/2602.17819", "authors": ["Eric Lindström", "Larisa Beilina"], "title": "Variational optimization approach for reconstruction of dielectric permittivity and conductivity functions using partial boundary measurements", "comment": null, "summary": "We present a variational optimization approach for the solution of a coefficient inverse problem of simultaneous reconstruction of the dielectric permittivity and conductivity functions in time-dependent Maxwell's system using limited boundary observations of the electric field.\n  The variational optimization approach is based on constructing a weak form of a Lagrangian which allows to use finite element based reconstruction algorithms.\n  The optimality conditions for the Lagrangian and stability estimate for the adjoint problem are derived, as well as Frechét differentiability of it and of the regularized Tikhonov functional are also presented. Two- and three-dimensional numerical studies confirm our theoretical investigations."}
{"id": "2602.17823", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17823", "abs": "https://arxiv.org/abs/2602.17823", "authors": ["Peter Bank", "Filippo de Feo"], "title": "Duality methods in stochastic optimal control", "comment": null, "summary": "We prove two duality descriptions of the value function for a generic stochastic optimal problem. These descriptions also hold when the diffusion is controlled, a case left open by the literature so far."}
{"id": "2602.17992", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17992", "abs": "https://arxiv.org/abs/2602.17992", "authors": ["Xinyi Zhang"], "title": "Convergence of Half-Space Last Passage Percolation Away from the Boundary to the Directed Landscape", "comment": "Comments welcome", "summary": "In this note, we prove convergence of the half-space exponential last passage percolation (LPP) model, away from the boundary, to the directed landscape. Our approach couples the half-space and full-space LPP models and constructs two barrier events based on the monotonicity of last passage paths. Combining this coupling with moderate deviation estimates for both models and the known convergence of full-space LPP to the directed landscape, we establish the desired convergence."}
{"id": "2602.17843", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17843", "abs": "https://arxiv.org/abs/2602.17843", "authors": ["Sarah Nataj", "David C. Del Rey Fernández", "David Brown", "Rajeev Jaiman"], "title": "A finite-difference summation-by-parts, conditionally stable partitioned algorithm for conjugate heat transfer problems", "comment": null, "summary": "In this work, we design and analyze a novel, provably conditionally stable, weakly coupled partitioned scheme to solve the conjugate heat transfer (CHT) problem. We consider a model CHT problem consisting of linear advection-diffusion and heat equations, coupled at an interface through continuity of temperature and heat flux. We employ high-order summation-by-parts finite-difference operators in conjunction with simultaneous-approximation-terms (SATs) in curvilinear coordinates for spatial derivatives, combined with first- and second-order time discretizations and temporal extrapolation at the interface. Energy stability is maintained by carefully selecting SAT parameters at the interface. A range of coupling parameters are explored to identify those that yield a stable scheme, and a stepwise approach for choosing SAT parameters that ensure stability is given. The effectiveness of the method is demonstrated through numerical experiments in a two-dimensional model problem on a rectangular domain with curvilinear grids. The proposed approach enables the development of high-order, conditionally stable partitioned solvers suitable for general geometries."}
{"id": "2602.17828", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17828", "abs": "https://arxiv.org/abs/2602.17828", "authors": ["Oliver Mason"], "title": "A note on diffusive solutions of the Lyapunov and Riccati inequalities for quasi-monotone (QM) mappings on cones", "comment": "Accepted for publication in Communications in Optimization Theory", "summary": "We consider three key properties of Metzler and nonnegative matrices and extensions of these to classes of self-dual proper convex cones. Specifically, we study mappings that are quasi-monotone (QM) with respect to a cone $K$ and discuss results extending D-stability, diagonal Lyapunov stability, and diagonal Riccati stability to this setting. Mappings that act diffusively with respect to the cone are used as generalisations of diagonal matrices. Relationships with recent results for symmetric cones obtained using Jordan algebraic methods are also discussed."}
{"id": "2602.18081", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.18081", "abs": "https://arxiv.org/abs/2602.18081", "authors": ["Denis Denisov", "Vitali Wachtel"], "title": "Fluctuations of Discrete-Time Random Walks", "comment": "71 pages", "summary": "These notes are devoted to fluctuations of one-dimensional random walks. We discuss various approaches to first-passage times and to the corresponding conditional distributions. After discussion of some classical methods, such as reflection principle for simple random walks and Wiener-Hopf factorisation, we proceed to the universality approach, which has been developed in recent past. Considering one-dimensional case allows us to avoid some technical obstacles and to present the core of this method in a more transparent way. It turns out that the universality method is much more robust than the Wiener-Hopf factorisation and allows one to consider walks with non-identically distributed or even dependent increments."}
{"id": "2602.17892", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17892", "abs": "https://arxiv.org/abs/2602.17892", "authors": ["Ryan Bentley", "Mirjeta Pasha", "Malena Sabaté Landman", "Luisa Yang", "Jeffery Zhang"], "title": "Hybrid ABBA-GMRES for Unmatched Backprojectors in Large Scale X-Ray Computerized Tomography", "comment": "10 pages, 5 figures, Code available at: https://github.com/rbentley5/Hybrid-ABBA-GMRES-Toolbox", "summary": "In large-scale X-ray computed tomography (CT), matrix-free iterative methods are essential due to the prohibitive cost of explicitly forming the system matrix. In practice, forward projectors and backprojectors are often implemented with different discretizations or accelerations, leading to unmatched projector pairs. This mismatch violates the adjointness assumptions underlying classical least-squares solvers, so the resulting iterations no longer correspond to a true least-squares problem and can exhibit non-symmetric or inconsistent behavior. Prior work has explored Krylov subspace solvers such as AB-GMRES and BA-GMRES to handle unmatched projector pairs, where these methods exhibit semi-convergent regularizing behavior. Under matched conditions, AB-GMRES and BA-GMRES reduce to LSQR and LSMR, respectively. However, in the presence of unmatched projectors, AB- and BA-GMRES have been observed to yield improved reconstruction quality compared to classical least-squares solvers. In this paper, we develop hybrid AB- and BA-GMRES methods that incorporate Tikhonov regularization directly into the Krylov subspace iterations. We also examine the relationship between the proposed methods and hybrid variants of LSQR and LSMR, considering both matched and unmatched backprojectors. We propose automatic strategies for selecting regularization parameters, including approaches based on the L-curve and generalized cross validation (GCV), and analyze their effect on convergence behavior and image quality. Numerical experiments on two-dimensional CT problems using GPU-accelerated projectors demonstrate that the proposed hybrid AB- and BA-GMRES methods mitigate semi-convergence, produce higher-quality reconstructions, and exhibit more stable stopping behavior than their non-hybrid counterparts."}
{"id": "2602.17845", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17845", "abs": "https://arxiv.org/abs/2602.17845", "authors": ["Bryce Christopherson", "Farhad Jafari"], "title": "A Refinement in Čech Cohomology of Coron's Necessary Condition", "comment": "12 pages", "summary": "Coron established a homological obstruction to continuous feedback stabilization of nonlinear control systems $\\dot{x}=f(x,u)$ with $f \\in C(Ω,\\mathbb{R}^n)$ and $f(0,0)=0$, showing that local asymptotic stabilizability implies the induced homomorphism $f_*$ satisfies $f_*\\big(H_{n-1}(Σ_ε)\\big)=H_{n-1}(S^{n-1})$, where $Σ_ε:=\\Big(\\big(\\mathbb{B}_ε^{\\mathbb{R}^n}(0)\\times\\mathbb{B}_ε^{\\mathbb{R}^m}(0)\\big)\\cap Ω\\Big)\\setminus f^{-1}(0)$. In this paper, we refine Coron's necessary condition using Čech cohomology and the Vietoris-Begle mapping theorem. Specifically, we prove that the closed version of $Σ_ε$ must be a Čech cohomology $(n-1)$-sphere and that the restriction of $f$ to this subset induces an isomorphism on its Čech cohomology groups in all degrees. This strengthens Coron's condition from a constraint on the top class to a full cohomological rigidity statement."}
{"id": "2602.18120", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.18120", "abs": "https://arxiv.org/abs/2602.18120", "authors": ["Denis Denisov", "Alexander Tarasov", "Vitali Wachtel"], "title": "Corrected diffusion approximation for random walks conditioned to stay positive", "comment": "22 pages", "summary": "Let $S_n$ be a random walk with i.i.d. increments which have zero mean and finite variance. For every $x\\ge0$ we define the stopping time $τ_x:=\\inf\\{n\\ge1:x+S_n\\le0\\}$ and consider the probabilities $\\mathbb{P}(x+S_n\\ge y,τ_x>n)$. We study the quality of the normal approximation for these probabilities and derive a Berry-Esseen-type inequality for $\\mathbb{P}(x+S_n\\ge y|τ_x>n)$. Our Theorem 1 is an extension of the results in our previous paper (arXiv:2412.08502) where we have considered the special case $x=0$. It is also worth mentioning that Theorem 1 complements the results of Siegmund and Yuh (1982) on the corrected diffusion approximation."}
{"id": "2602.17936", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17936", "abs": "https://arxiv.org/abs/2602.17936", "authors": ["Changhui Yao", "Yunpan Ma", "Lingxiao Li"], "title": "Optimal error estimate of an isoparametric upwind discontinuous Galerkin method for radiation transport equation on curved domains", "comment": null, "summary": "This work investigates the isoparametric upwind discontinuous Galerkin method for solving the radiation transport equation defined on a bounded domain $D$ with a piecewise $C^{k+1}$ smooth curved boundary. An auxiliary mapping is constructed to approximate the original curved domain. The analysis delineates a high-order optimal convergence rate under the DG norm, which comprehensively balances the errors stemming from the numerical discretization and the geometric approximation. Two- and three-dimensional numerical experiments validate the theoretical results."}
{"id": "2602.17847", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17847", "abs": "https://arxiv.org/abs/2602.17847", "authors": ["Bryce Christopherson", "Farhad Jafari"], "title": "Stabilization of Nonlinear Systems by Gain-Limited Feedback Laws", "comment": "18 pages, 1 figure", "summary": "We study local stabilization of nonlinear control systems under explicit gain constraints on the feedback law. Using a quantitative refinement of Brockett's openness condition, we introduce the notion of a maximal continuous openness rate for the system vector field near equilibrium. Combining this with a local-section characterization of stabilizability, we derive a general necessary condition for the existence of gain-limited stabilizing feedback. This condition yields sharp no-go results for broad classes of nonlinear systems, including systems that are stabilizable only by nonsmooth feedback. Several examples illustrate how openness rates impose fundamental lower bounds on stabilizing feedback growth near an equilibrium point."}
{"id": "2602.18175", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.18175", "abs": "https://arxiv.org/abs/2602.18175", "authors": ["Nyanga Honda Masasila", "István Fazekas"], "title": "Strong law of large numbers for $\\varphi$-sub-Gaussian random variables under sub-linear expectation spaces", "comment": null, "summary": "We introduce the notions of sub Gaussian random variables in sub-linear expectation spaces. To avoid the problem caused by the existence of two different expectations, i.e., the upper expectation and the lower expectation, we divide the definition of the sub-Gaussian property into an upper part and a lower part. It turns out that this approach fits well to the sub-linear setting; it provides a proper framework for extending Zajkowski's general result to sublinear expectation spaces. Within our framework, we establish a strong law of large numbers for sub-Gaussian sequences. We present an example showing the usefulness of our results."}
{"id": "2602.17950", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17950", "abs": "https://arxiv.org/abs/2602.17950", "authors": ["Jing Wang", "Wei Yang", "Yongjun Yuan", "Yong Zhang"], "title": "Mathematical and numerical study on the ground states of rotating spin-orbit coupled spin-1 Bose-Einstein condensates", "comment": "25 pages, 6 figures", "summary": "In this article, we study mathematically and numerically the ground states of three-component rotating spin-orbit coupled (SOC) spin-1 Bose-Einstein condensates modeled by the coupled Gross-Pitaevskii equations (CGPEs). Firstly, we rigorously prove existence result of the ground state and derive some analytical properties, including the virial identity and negativity of SOC energy. Secondly, we propose an efficient and accurate preconditioned nonlinear conjugate gradient (PCG) algorithm to compute the ground states. We truncate the whole space into a bounded rectangular domain and readily apply the Fourier spectral method to approximate the wave function. The PCG method is successfully adapted with appropriate modifications to the adaptive step size control strategy for the one-parameter energy minimization problem and to the choice of preconditioners, achieving great performance in terms of accuracy and efficiency. Lastly, we carry out extensive numerical experiments to verify the existence and property results of the ground states, confirm the spatial spectral accuracy by traversing the most commonly-used initial guesses for each component thanks to its great efficiency, which is also attributed to a utilization of cascadic multigrid and discrete Fast Fourier Transform (FFT). Moreover, we investigate the effects of local interaction, rotation and spin-orbit coupling and external trapping potential on the ground state, and unveil some interesting physical phenomena, such as giant vortex and U-shape vortex line."}
{"id": "2602.17878", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17878", "abs": "https://arxiv.org/abs/2602.17878", "authors": ["Matthew X. Burns", "Jiaming Liang"], "title": "Improved Analysis of Restarted Accelerated Gradient and Augmented Lagrangian Methods via Inexact Proximal Point Frameworks", "comment": "53 pages, 4 figures", "summary": "This paper studies a class of double-loop (inner-outer) algorithms for convex composite optimization. For unconstrained problems, we develop a restarted accelerated composite gradient method that attains the optimal first-order complexity in both the convex and strongly convex settings. For linearly constrained problems, we introduce inexact augmented Lagrangian methods, including a basic method and an outer-accelerated variant, and establish near-optimal first-order complexity for both methods. The established complexity bounds follow from a unified analysis based on new inexact proximal point frameworks that accommodate relative and absolute inexactness, acceleration, and strongly convex objectives. Numerical experiments on LASSO and linearly constrained quadratic programs demonstrate the practical efficiency of the proposed methods."}
{"id": "2602.18234", "categories": ["math.PR", "q-fin.CP"], "pdf": "https://arxiv.org/pdf/2602.18234", "abs": "https://arxiv.org/abs/2602.18234", "authors": ["Aurélien Alfonsi", "Ahmed Kebaier"], "title": "Weak error approximation for rough and Gaussian mean-reverting stochastic volatility models", "comment": null, "summary": "For a class of stochastic models with Gaussian and rough mean-reverting volatility that embeds the genuine rough Stein-Stein model, we study the weak approximation rate when using a Euler type scheme with integrated kernels. Our first result is a weak convergence rate for the discretised rough Ornstein-Uhlenbeck process, that is essentially in $\\min(3α-1,1)$, where $\\frac{t^{α-1}}{Γ(α)} $ is the fractional convolution kernel with $α\\in (1/2,1)$. Then, our main result is to obtain the same convergence rate for the corresponding stochastic rough volatility model with polynomial test functions."}
{"id": "2602.18021", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.18021", "abs": "https://arxiv.org/abs/2602.18021", "authors": ["Agus L. Soenjaya"], "title": "Strong convergence of finite element schemes for the stochastic Landau--Lifshitz--Bloch equation", "comment": null, "summary": "The dynamics of magnetisation in a bounded ferromagnet in $\\mathbb{R}^d$ ($d=1,2$) at high temperatures can be described by the stochastic Landau--Lifshitz--Bloch (sLLB) equation, which is a vector-valued quasilinear stochastic partial differential equation. In this paper, assuming adequate regularity of the initial data, we establish strong convergence in $L^2(Ω)$ of several semi-implicit and implicit fully discrete finite element schemes for the sLLB equation, together with explicit convergence rates. The analysis relies on localised error estimates and new exponential moment bounds for the exact solution. As a by-product, these moment bounds yield mean-square exponential stability of solutions and uniqueness of the invariant measure in one spatial dimension under a small noise assumption. We also sharpen existing convergence-in-probability results for the numerical schemes. Numerical experiments are presented to illustrate and support the theoretical findings."}
{"id": "2602.17879", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17879", "abs": "https://arxiv.org/abs/2602.17879", "authors": ["Andreas Sojmark", "Zeng Zhang"], "title": "The mean-field control problem for heterogeneous forward-backward systems", "comment": "28 pages", "summary": "We study the problem of mean-field control when the state dynamics are given by general systems of forward-backward stochastic differential equations (FBSDEs) with heterogeneous mean-field interactions. Firstly, we introduce a novel methodology for reducing the well-posedness of such systems to that of a single randomized mean-field FBSDE. As a consequence, we show that, in the fully coupled case, smallness conditions yield existence and uniqueness for both the system itself and the associated variational and adjoint systems. Secondly, we derive a stochastic maximum principle and a verification for the mean-field control problem. This provides necessary and sufficient conditions for optimality."}
{"id": "2602.18251", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.18251", "abs": "https://arxiv.org/abs/2602.18251", "authors": ["Susanna Dehò", "Francesco C. De Vecchi", "Paola Morando", "Stefania Ugolini"], "title": "Invariance properties of Brownian motion via Lie's symmetries", "comment": null, "summary": "The invariance properties of Brownian motion are investigated and revisited within a recent Lie symmetry approach to stochastic differential equations. Some notable properties of the process can be recovered by a related integration by parts formula developed in the same research area."}
{"id": "2602.18134", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.18134", "abs": "https://arxiv.org/abs/2602.18134", "authors": ["Zhengbo Zhou", "Françoise Tisseur", "Marcus Webb"], "title": "Computing accurate singular values using a mixed-precision one-sided Jacobi algorithm", "comment": "22 pages", "summary": "We present a relative forward error analysis of a mixed-precision preconditioned one-sided Jacobi algorithm, analogous to a two-sided version introduced in [N. J. Higham, F. Tisseur, M. Webb and Z. Zhou, SIAM J. Matrix Anal. Appl. 46 (2025), pp. 2423-2448], which uses low precision to compute the preconditioner, applies it in high precision, and computes the singular value decomposition using the one-sided Jacobi algorithm at working precision. Our analysis yields smaller relative forward error bounds for the computed singular values than those of standard SVD algorithms. We present and analyse two approaches for constructing effective preconditioners. Our numerical experiments support the theoretical results and demonstrate that our algorithm achieves smaller relative forward errors than the LAPACK routines $\\texttt{DGESVJ}$ and $\\texttt{DGEJSV}$, as well as the MATLAB function $\\texttt{svd}$, particularly for ill-conditioned matrices. Timing tests show that our approach accelerates the convergence of the Jacobi iterations and that the dominant cost arises from a single high-precision matrix-matrix multiplication. With improved software or hardware support for this bottleneck, our algorithm would be faster than the LAPACK one-sided Jacobi algorithm $\\texttt{DGESVJ}$ and comparable in speed to the state-of-the-art preconditioned one-sided Jacobi algorithm $\\texttt{DGEJSV}$, but much more accurate."}
{"id": "2602.17885", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17885", "abs": "https://arxiv.org/abs/2602.17885", "authors": ["Christina Frederick", "Haomin Zhou"], "title": "Multi-agent path-planning in a moving medium via Wasserstein Hamiltonian Flow", "comment": null, "summary": "We present a finite dimensional variational model for multi-agent path-planning in which a group of agents traverses from initial positions to a target distribution in a moving medium. The model is derived using the agent-based formulation of the Wasserstein Hamiltonian flows that transport between probability distributions while optimizing a running cost. The objective is the mismatch between their final positions and the target distribution. The constraints are a system of Hamiltonian equations that provide the trajectories of the agents. The free variables on which the optimization is defined form a finite vector of the initial velocities for the agents. The model is solved numerically by the L-BFGS method in conjunction with a shooting strategy. Several simulation examples, including a time-dependent moving medium, are presented to illustrate the performance of the model."}
{"id": "2602.18411", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.18411", "abs": "https://arxiv.org/abs/2602.18411", "authors": ["Zimo Hao", "Khoa Lê", "Chengcheng Ling"], "title": "Weak approximation of kinetic SDEs: closing the criticality gap", "comment": "This paper contains the weak convergence results announced earlier in arXiv:2409.05706. The current preprint is significantly revised to improve clarity", "summary": "We study the weak convergence of a generic tamed Euler-Maruyama scheme for kinetic stochastic differential equations (SDEs) with integrable drifts. We show that the marginal density of the considered scheme converges at rate 1/2 to the corresponding marginal density of the SDE. The convergence rate is independent from the criticality gap, which is new compared to previous results."}
{"id": "2602.18159", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.18159", "abs": "https://arxiv.org/abs/2602.18159", "authors": ["Arisa Kawase", "Kensuke Aihara"], "title": "Theoretical insights on the residual transformation from bi-conjugate gradient into bi-conjugate residual via a smoothing scheme", "comment": "11 pages, 1 figure", "summary": "Bi-conjugate gradient (Bi-CG) and bi-conjugate residual (Bi-CR) methods are underlying iterative solvers for linear systems with nonsymmetric matrices. Residual smoothing is a standard technique for obtaining smooth convergence behavior of residual norms; additionally, it represents the transformation between iterative methods. For example, the residuals of the CR method can be obtained by applying a smoothing scheme to those of the CG method for symmetric linear systems. Based on this relationship, the transformation from Bi-CG residuals to Bi-CR residuals using a smoothing scheme was examined in our previous study [Kawase, A., Aihara, K.: Transformation from Bi-CG into Bi-CR Using a Residual Smoothing-like Scheme. AIP Conference Proceedings (2026)]; however, we only provided heuristic and experimental observations. In the present study, we provide a detailed discussion on the theoretical aspects of these transformations. Specifically, we prove that the resulting algorithm transformed from the Bi-CG method using the residual smoothing technique has the same bi-orthogonal properties as those of the original Bi-CR method. We also present a more concise transformation algorithm and its numerical example. These analyses complement our previous study and provide theoretical validity of the residual transformation between the Bi-CG and Bi-CR methods."}
{"id": "2602.17968", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17968", "abs": "https://arxiv.org/abs/2602.17968", "authors": ["Robert Parker", "Manuel Garcia", "Russell Bent"], "title": "Exploiting block triangular submatrices in KKT systems", "comment": null, "summary": "We propose a method for solving Karush-Kuhn-Tucker (KKT) systems that exploits block triangular submatrices by first using a Schur complement decomposition to isolate the block triangular submatrices then performing a block backsolve where only diagonal blocks of the block triangular form need to be factorized. We show that factorizing reducible symmetric-indefinite matrices with standard 1$\\times$1 or 2$\\times$2 pivots yields fill-in outside the diagonal blocks of the block triangular form, in contrast to our proposed method. While exploiting a block triangular submatrix has limited fill-in, unsymmetric matrix factorization methods do not reveal inertia, which is required by interior point methods for nonconvex optimization. We show that our target matrix has inertia that is known \\textit{a priori}, letting us compute inertia of the KKT matrix by Sylvester's law. Finally, we demonstrate the computational advantage of this method on KKT systems from optimization problems with neural network surrogates in their constraints. Our method achieves up to 15$\\times$ speedups over state-of-the-art symmetric indefinite matrix factorization methods MA57 and MA86 in a constant-hardware comparison."}
{"id": "2602.18433", "categories": ["math.PR", "math.DG", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.18433", "abs": "https://arxiv.org/abs/2602.18433", "authors": ["Miklos Abert", "Adam Arras", "Jaelin Kim"], "title": "Quenched path limits and periodization stability for tilted Brownian motion in Poissonian potentials on $\\mathbb{H}^d$", "comment": null, "summary": "We analyze the existence of Brownian motion tilted by a potential of full support on hyperbolic spaces $\\mathbb{H}^d$. On compact spaces, it is classical that these path limits, called Q-processes, exist and can be directly defined using the ground state of the corresponding Schrödinger operator. On non-compact spaces like $\\mathbb{H}^d$, the existence fails in general.\n  We show that for \\emph{stationary random} potentials on $\\mathbb{H}^d$ with suitable spectral and sup norm bounds, the Q-processes exist a.s. For potentials that are factors of a Poisson point process, the method works up to sup norm $(d-1)^2/8$. In this case, we also show that the path limit can be approximated by periodic potentials.\n  As a tool, we use the foliated space defined by the point process. It turns out that the global ground state of this foliated space serves as a substitute for the non-existing $L^2$ ground states on the leaves of the foliation. Restricting the global ground state to a leaf gives a generalized eigenwave that can be plugged into the usual machinery to get the Q-process."}
{"id": "2602.18226", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.18226", "abs": "https://arxiv.org/abs/2602.18226", "authors": ["Tokuhiro Eto", "Harald Garcke", "Robert Nürnberg"], "title": "A Parametric Finite Element Approach for an Anisotropic Multi-Phase Mullins-Sekerka Problem with Kinetic Undercooling", "comment": "22 pages, 16 figures", "summary": "We consider a sharp interface formulation for an anisotropic multi-phase Mullins-Sekerka problem with kinetic undercooling. The flow is characterized by a cluster of surfaces evolving such that the total surface energy plus a weighted sum of the volumes of the enclosed phases decreases in time. Upon deriving a suitable variational formulation, we introduce a fully discrete unfitted finite element method. In this approach, the approximations of the moving interfaces are independent of the triangulations used for the equations in the bulk. Our method can be shown to be unconditionally stable. Several numerical examples demonstrate the capabilities of the introduced method. In particular, it is demonstrated that the evolution of multiple ice crystals with junctions can be modeled using the proposed approach."}
{"id": "2602.18003", "categories": ["math.OC", "cs.CC"], "pdf": "https://arxiv.org/pdf/2602.18003", "abs": "https://arxiv.org/abs/2602.18003", "authors": ["Jongmin Lee", "Ernest K. Ryu"], "title": "Policy Gradient Algorithms in Average-Reward Multichain MDPs", "comment": "arXiv admin note: text overlap with arXiv:2510.18340", "summary": "While there is an extensive body of research analyzing policy gradient methods for discounted cumulative-reward MDPs, prior work on policy gradient methods for average-reward MDPs has been limited, with most existing results restricted to ergodic or unichain settings. In this work, we first establish a policy gradient theorem for average-reward multichain MDPs based on the invariance of the classification of recurrent and transient states. Building on this foundation, we develop refined analyses and obtain a collection of convergence and sample-complexity results that advance the understanding of this setting. In particular, we show that the proposed $α$-clipped policy mirror ascent algorithm attains an $ε$-optimal policy with respect to positive policies."}
{"id": "2602.17823", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17823", "abs": "https://arxiv.org/abs/2602.17823", "authors": ["Peter Bank", "Filippo de Feo"], "title": "Duality methods in stochastic optimal control", "comment": null, "summary": "We prove two duality descriptions of the value function for a generic stochastic optimal problem. These descriptions also hold when the diffusion is controlled, a case left open by the literature so far."}
{"id": "2602.18404", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.18404", "abs": "https://arxiv.org/abs/2602.18404", "authors": ["Sebastian Franz", "Natalia Kopteva"], "title": "Well-posedness and time stepping adaptivity for a class of collocation discretisations of time-fractional subdiffusion equations", "comment": "23 pages, 9 figures", "summary": "Time-fractional parabolic equations with a Caputo time derivative of order $α\\in(0,1)$ are discretised in time using collocation methods, which assume that the Caputo derivative of the computed solution is piecewise-polynomial. For such discretisations of any order $m\\ge 0$, with any choice of collocation points, we give sufficient conditions for existence and uniqueness of collocation solutions. Furthermore, we investigate the applicability and performance of such schemes in the context of the a-posteriori error estimation and adaptive time stepping algorithms."}
{"id": "2602.18293", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.18293", "abs": "https://arxiv.org/abs/2602.18293", "authors": ["Camilla Brizzi", "Lorenzo Portinale"], "title": "On the $q$-integrability of $p$-Wasserstein barycenters", "comment": null, "summary": "We study the $L^q$-regularity of the density of barycenters of $N$ probability measures on $\\mathbb{R}^d$ with respect to the $p$-Wasserstein metric ($1<p<\\infty$). According to a previous result by the first author and collaborators, if one marginal is absolutely continuous, so is the $W_p$-barycenter. The next natural question is whether the $L^q$- regularity on the marginals is also preserved for any $q > 1$, as in the classical case ($p=2$) of Agueh--Carlier, or for $W_p$-geodesics ($N=2$). Here we prove that this is the case if one marginal belongs to $L^q$ and the supports of all the marginals satisfy suitable geometric assumptions. However, we show that, as soon as $N>2$, it is possible to find examples of $W_p$-barycenters which are not $q$-integrable, even if one marginal is compactly supported and bounded, thus highlighting the role played by the geometry of the supports. Furthermore, we provide a general estimate of the $L^q$-norm, including a detailed study of the sources of singularities, and a characterization of the $W_p$-barycenters à la Agueh--Carlier in terms of the associated Kantorovich potentials. Finally, we explicitly compute the $W_p$-barycenters of measures obtained as push-forward of special affine transformations. In this case, regularity holds without any additional requirement on the supports."}
{"id": "2602.17879", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17879", "abs": "https://arxiv.org/abs/2602.17879", "authors": ["Andreas Sojmark", "Zeng Zhang"], "title": "The mean-field control problem for heterogeneous forward-backward systems", "comment": "28 pages", "summary": "We study the problem of mean-field control when the state dynamics are given by general systems of forward-backward stochastic differential equations (FBSDEs) with heterogeneous mean-field interactions. Firstly, we introduce a novel methodology for reducing the well-posedness of such systems to that of a single randomized mean-field FBSDE. As a consequence, we show that, in the fully coupled case, smallness conditions yield existence and uniqueness for both the system itself and the associated variational and adjoint systems. Secondly, we derive a stochastic maximum principle and a verification for the mean-field control problem. This provides necessary and sufficient conditions for optimality."}
{"id": "2602.17819", "categories": ["math.NA", "math.AP", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.17819", "abs": "https://arxiv.org/abs/2602.17819", "authors": ["Eric Lindström", "Larisa Beilina"], "title": "Variational optimization approach for reconstruction of dielectric permittivity and conductivity functions using partial boundary measurements", "comment": null, "summary": "We present a variational optimization approach for the solution of a coefficient inverse problem of simultaneous reconstruction of the dielectric permittivity and conductivity functions in time-dependent Maxwell's system using limited boundary observations of the electric field.\n  The variational optimization approach is based on constructing a weak form of a Lagrangian which allows to use finite element based reconstruction algorithms.\n  The optimality conditions for the Lagrangian and stability estimate for the adjoint problem are derived, as well as Frechét differentiability of it and of the regularized Tikhonov functional are also presented. Two- and three-dimensional numerical studies confirm our theoretical investigations."}
{"id": "2602.18184", "categories": ["math.ST", "math.PR", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.18184", "abs": "https://arxiv.org/abs/2602.18184", "authors": ["Aristides V. Doumas", "S. Spektor"], "title": "Kolmogorov-Type Maximal Inequalities for Independent and Dependent Negative Binomial Random Variables: Sharp Bounds, Sub-Exponential Refinements, and Applications to Overdispersed Count Data", "comment": "11 pages, 8 figures, 2 tables", "summary": "This paper develops Kolmogorov-type maximal inequalities for sums of Negative Binomial random variables under both independence and dependence structures. For independent heterogeneous Negative Binomial variables we derive sharp Markov-type deviation inequalities and Kolmogorov-type bounds expressed in terms of Tweedie dispersion parameters, providing explicit control limits for NB2 generalized linear model monitoring. For dependent count data arising through a shared Gamma mixing variable, we establish a \\emph{sub-exponential Bernstein-type refinement} that exploits the Poisson-Gamma hierarchical structure to yield exponentially decaying tail probabilities -- this refinement is new in the literature. Through moment-matched Monte Carlo experiments ($n=20$, 2{,}000 replications), we document a 55\\% reduction in mean maximum deviation under appropriate dependence structures, a stabilization effect we explain analytically. A concrete epidemiological application with NB2 parameters calibrated from COVID-19 surveillance data demonstrates practical utility. These results materially advance the applicability of classical maximal inequalities to overdispersed and dependent count data prevalent in public health, insurance, and ecological modeling."}
{"id": "2602.18293", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.18293", "abs": "https://arxiv.org/abs/2602.18293", "authors": ["Camilla Brizzi", "Lorenzo Portinale"], "title": "On the $q$-integrability of $p$-Wasserstein barycenters", "comment": null, "summary": "We study the $L^q$-regularity of the density of barycenters of $N$ probability measures on $\\mathbb{R}^d$ with respect to the $p$-Wasserstein metric ($1<p<\\infty$). According to a previous result by the first author and collaborators, if one marginal is absolutely continuous, so is the $W_p$-barycenter. The next natural question is whether the $L^q$- regularity on the marginals is also preserved for any $q > 1$, as in the classical case ($p=2$) of Agueh--Carlier, or for $W_p$-geodesics ($N=2$). Here we prove that this is the case if one marginal belongs to $L^q$ and the supports of all the marginals satisfy suitable geometric assumptions. However, we show that, as soon as $N>2$, it is possible to find examples of $W_p$-barycenters which are not $q$-integrable, even if one marginal is compactly supported and bounded, thus highlighting the role played by the geometry of the supports. Furthermore, we provide a general estimate of the $L^q$-norm, including a detailed study of the sources of singularities, and a characterization of the $W_p$-barycenters à la Agueh--Carlier in terms of the associated Kantorovich potentials. Finally, we explicitly compute the $W_p$-barycenters of measures obtained as push-forward of special affine transformations. In this case, regularity holds without any additional requirement on the supports."}
