{"id": "2601.14332", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.14332", "abs": "https://arxiv.org/abs/2601.14332", "authors": ["Fumiya Okazaki", "Takayuki Yamada"], "title": "Topology optimization concerning the mass distribution via filtered gradient flows on the Wasserstein space", "comment": "25 pages, 54 figures", "summary": "In this article, we formulate topology optimization problems concerning the mass distribution as minimization problems for functionals on the Wasserstein space. We relax optimization problems regarding non-convex objective functions on the Wasserstein space by using the Neumann heat semigroup and prove the existence of minimizers of relaxed problems. Furthermore, we introduce the filtered Wasserstein gradient flow and derive the error estimate between the original Wasserstein gradient flow and the filtered one in terms of the Wasserstein distance. We also construct a candidate for the optimal mass distribution for a given fixed total mass and simultaneously obtain the shape of the material by the numerical calculation of filtered Wasserstein gradient flows."}
{"id": "2601.14414", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14414", "abs": "https://arxiv.org/abs/2601.14414", "authors": ["Liang Wu", "Bo Yang", "Xu Yang", "Yilin Mo", "Yang Shi", "Ján Drgoňa"], "title": "$π$MPC: A Parallel-in-horizon and Construction-free NMPC Solver", "comment": "8 pages", "summary": "The alternating direction method of multipliers (ADMM) has gained increasing popularity in embedded model predictive control (MPC) due to its code simplicity and pain-free parameter selection. However, existing ADMM solvers either target general quadratic programming (QP) problems or exploit sparse MPC formulations via Riccati recursions, which are inherently sequential and therefore difficult to parallelize for long prediction horizons. This technical note proposes a novel \\textit{parallel-in-horizon} and \\textit{construction-free} nonlinear MPC algorithm, termed $π$MPC, which combines a new variable-splitting scheme with a velocity-based system representation in the ADMM framework, enabling horizon-wise parallel execution while operating directly on system matrices without explicit MPC-to-QP construction. Numerical experiments and accompanying code are provided to validate the effectiveness of the proposed method."}
{"id": "2601.14416", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14416", "abs": "https://arxiv.org/abs/2601.14416", "authors": ["Victor Hugo Pereira Rodrigues", "Tiago Roux Oliveira", "Miroslav Krstic", "Paulo Tabuada"], "title": "Event-Triggered Newton Extremum Seeking for Multivariable Optimization", "comment": null, "summary": "This paper presents a static event-triggered control strategy for multivariable Newton-based extremum seeking. The proposed method integrates event-triggered actuation into the Newton-based optimization framework to reduce control updates while maintaining rapid convergence to the extremum. Unlike traditional gradient-based extremum seeking, where the convergence rate depends on the unknown Hessian of the cost function, the proposed approach employs a dynamic estimator of the Hessian inverse, formulated as a Riccati equation, enabling user-assignable convergence rates. The event-triggering mechanism is designed to minimize unnecessary actuation updates while preserving stability and performance. Using averaging theory, we establish local stability results and exponential convergence to a neighborhood of the unknown extremum point. Additionally, numerical simulations illustrate the benefits of the proposed approach over gradient-based and continuously actuated Newton-based extremum seeking, showing improved convergence rates and reduced control update frequency, leading to more efficient implementation in real-time optimization scenarios."}
{"id": "2601.14451", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.14451", "abs": "https://arxiv.org/abs/2601.14451", "authors": ["Pablo Barros", "Vincent Guigues", "Roger Behling", "Luiz-Rafael Santos"], "title": "New operator designs for Halpern iterations with explicit rates under Hölder error bounds", "comment": null, "summary": "We investigate the asymptotic behavior of Halpern-type iterations applied to quasi-nonexpansive operators arising in best approximation problems over the intersection of finitely many closed convex sets in $\\mathbb{R}^n$. Assuming a local decrease condition for the underlying operator and standard requirements on the stepsizes $(α_k) \\subset (0,1)$, we first prove strong convergence of the Halpern sequence $x_{k+1} = α_k x_0 + (1-α_k) T x_k$ to the best approximation point $x^\\star$ in the intersection set, that is, the metric projection of $x_0$ onto that set. Under the additional assumption that the intersection satisfies a Hölder-type error bound with exponent $γ\\in (0,1]$, we then derive explicit convergence rates for both feasibility and norm error: the distance from $x_k$ to the intersection set decays like $\\mathcal O(α_k^{γ/(2-γ)})$, while the norm error $\\|x_k - x^\\star\\|$ decays like $\\mathcal O(α_k^{γ/(4-2γ)})$. These results apply to most projection-type operators used in convex feasibility problems (including MAP, CRM/SCCRM, Cimmino and 3PM/A3PM) and extend classical convergence analyses of the Halpern-type iterations by providing explicit, geometry-dependent rates governed by Hölder-type error bounds. Our numerical experiments show that Halpern-type iterations combined with most of these projection-type operators are quicker than Dykstra's algorithm to find the projection of a point in an intersection of ellipsoids or in an intersection of polyhedrons."}
{"id": "2601.14320", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14320", "abs": "https://arxiv.org/abs/2601.14320", "authors": ["Stefan Schoder"], "title": "Convergence of finite element right-hand-side computation from finite difference data", "comment": null, "summary": "This work presents two integration methods for field transfer in computational aeroacoustics and in coupled field problems, using the finite element method to solve the acoustic field. Firstly, a high-order Gaussian quadrature computes the finite element right-hand side. In contrast, the (flow) field provided by the finite difference mesh is mapped by higher-order B-Splines or a Lagrangian function. Secondly, the cut-cell or supermesh integration with geometric clipping. For each method, the accuracy, performance characteristics, and computational complexity are analyzed. As a reference, the trapezoidal integration rule was computed from the finite difference results. The high-order quadrature converges as the B-Spline interpolation order increases, and the finite difference results and mesh resolutions are consistent. The supermesh approach eliminates interpolation and approximation errors at the grid-to-mesh level and improves accuracy. This behaviour is universal for smooth or strongly oscillating field quantities, which will be shown in a comparative study between the Lighthill-like source term and the source term of the perturbed convective wave equation for subsonic flows."}
{"id": "2601.14586", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.14586", "abs": "https://arxiv.org/abs/2601.14586", "authors": ["Dan Cheng", "John Ginos"], "title": "Cluster size distributions of discrete random fields", "comment": null, "summary": "We study discrete random fields $\\{X_t: t\\in \\mathbb{Z}^d\\}$ parameterized on the $d$-dimensional integer lattice $\\mathbb{Z}^d$. For a fixed threshold $u$, the excursion set $\\{t \\in \\mathbb{Z}^d : X_t > u\\}$ decomposes into connected components or clusters, whose size, defined as the number of lattice points they contain, are random. This paper investigates the probability distribution of these cluster sizes. For stationary random fields, we derive exact expressions for the cluster size distribution. To address nonstationary settings, we introduce a peak-based cluster size distribution, which characterizes the distribution of cluster sizes conditional on the presence of a local maximum above $u$. This formulation provides a tractable alternative when exact cluster size distributions are analytically inaccessible. The proposed framework applies broadly to Gaussian and non-Gaussian random fields, relying only on their joint dependence structure. Our results provide a theoretical foundation for quantifying spatial extent in discretely sampled data, with applications to medical imaging, geoscience, environmental monitoring, and other scientific areas where thresholded random fields naturally arise."}
{"id": "2601.14312", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.14312", "abs": "https://arxiv.org/abs/2601.14312", "authors": ["Koléhè Coulibaly-Pasquier", "Magalie Bénéfice"], "title": "Cutoff in separation for compact harmonic manifold", "comment": null, "summary": "We show that cutoff in separation occurs for Brownian motion in some families of compact harmonic manifolds. We compute the cutoff time and windows in four families of compact harmonic manifold namely S n , CP n , HP n and RP n (the first three families are the only families of compact simply connected harmonic manifolds, see [19]). The proof is based on sharp strong stationary times and sufficiently accurate asymptotic expansions of their means and variances."}
{"id": "2601.14629", "categories": ["math.OC", "cs.DS", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14629", "abs": "https://arxiv.org/abs/2601.14629", "authors": ["Yuze Chen", "Yuan Zhou", "Baichuan Mo", "Jie Ying", "Yufei Ruan", "Zhou Ye"], "title": "Online Linear Programming with Replenishment", "comment": "63 pages, 12 figures", "summary": "We study an online linear programming (OLP) model in which inventory is not provided upfront but instead arrives gradually through an exogenous stochastic replenishment process. This replenishment-based formulation captures operational settings, such as e-commerce fulfillment, perishable supply chains, and renewable-powered systems, where resources are accumulated gradually and initial inventories are small or zero. The introduction of dispersed, uncertain replenishment fundamentally alters the structure of classical OLPs, creating persistent stockout risk and eliminating advance knowledge of the total budget.\n  We develop new algorithms and regret analyses for three major distributional regimes studied in the OLP literature: bounded distributions, finite-support distributions, and continuous-support distributions with a non-degeneracy condition. For bounded distributions, we design an algorithm that achieves $\\widetilde{\\mathcal{O}}(\\sqrt{T})$ regret. For finite-support distributions with a non-degenerate induced LP, we obtain $\\mathcal{O}(\\log T)$ regret, and we establish an $Ω(\\sqrt{T})$ lower bound for degenerate instances, demonstrating a sharp separation from the classical setting where $\\mathcal{O}(1)$ regret is achievable. For continuous-support, non-degenerate distributions, we develop a two-stage accumulate-then-convert algorithm that achieves $\\mathcal{O}(\\log^2 T)$ regret, comparable to the $\\mathcal{O}(\\log T)$ regret in classical OLPs. Together, these results provide a near-complete characterization of the optimal regret achievable in OLP with replenishment. Finally, we empirically evaluate our algorithms and demonstrate their advantages over natural adaptations of classical OLP methods in the replenishment setting."}
{"id": "2601.14405", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14405", "abs": "https://arxiv.org/abs/2601.14405", "authors": ["Mathias Dauphin", "Daniele A. Di Pietro", "Jérôme Droniou", "Alexandros Skouras"], "title": "A low-order hybrid method for the variable-density incompressible Navier-Stokes equations", "comment": null, "summary": "In this work we introduce and analyse a new low-order method for the variable-density incompressible Navier-Stokes equations. The main novelty of the proposed method lies in the support of general meshes, possibly including polygonal or polyhedral elements as well as non-matching interfaces. We carry out a complete analysis, showing stability, existence and uniqueness of a discrete solution, and convergence of the latter to a suitably defined weak solution of the continuous problem. Numerical tests validate the theoretical results."}
{"id": "2601.14872", "categories": ["math.ST", "cs.LG", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.14872", "abs": "https://arxiv.org/abs/2601.14872", "authors": ["Hirofumi Ota", "Masaaki Imaizumi"], "title": "Finite-Sample Inference for Sparsely Permuted Linear Regression", "comment": null, "summary": "We study a noisy linear observation model with an unknown permutation called permuted/shuffled linear regression, where responses and covariates are mismatched and the permutation forms a discrete, factorial-size parameter. This unknown permutation is a key component of the data-generating process, yet its statistical investigation remains challenging due to its discrete nature. In this study, we develop a general statistical inference framework on the permutation and regression coefficients. First, we introduce a localization step that reduces the permutation space to a small candidate set building on recent advances in the repro samples method, whose miscoverage decays polynomially with the number of Monte Carlo samples. Then, based on this localized set, we provide statistical inference procedures: a conditional Monte Carlo test of permutation structures with valid finite-sample Type-I error control. We also develop coefficient inference that remains valid under alignment uncertainty of permutations. For computational purposes, we develop a linear assignment problem computable in polynomial time complexity and demonstrate that its solution asymptotically converges to that of the conventional least squares problem with large computational cost. Extensions to partially permuted designs and ridge regularization are also discussed. Extensive simulations and an application to Beijing air-quality data corroborate finite-sample validity, strong power to detect mismatches, and practical scalability."}
{"id": "2601.14600", "categories": ["math.PR", "math.AP", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.14600", "abs": "https://arxiv.org/abs/2601.14600", "authors": ["Illya M. Karabash"], "title": "Sobolev multipliers and fractional Gaussian fields on Lipschitz boundaries with applications to deterministic and random acoustic systems", "comment": "41 pages", "summary": "Motivated by Applied Physics and Photonics studies of random resonators, we study in the stochastic part of this paper random acoustic operators in non-smooth bounded domains $G \\subset \\mathbb{R}^d$ and introduce m-dissipative impedance boundary conditions containing fractional Gaussian fields (FGFs). The deterministic part of the paper constructs and studies the spaces of pointwise multipliers on Lipschitz continuous boundaries $\\partial G$, as well as the spaces of Sobolev (distribution-type) multipliers on boundaries $\\partial G$ of better regularity. These multipliers are used as generalized impedance coefficients $ζ(x)$, $x \\in \\partial G$, in impedance boundary conditions accompanying the first order acoustic system. The main efforts are aimed on the m-dissipativity of associated acoustic operators and the discreteness of the related spectra under weakest possible assumptions on the regularity of $ζ$. In order to connect the deterministic results with the randomization, we introduce FGFs on Lipschitz boundaries $\\partial G$ and study their regularity. To this end, we prove that a rough Weyl-type asymptotics takes place for the Laplace-Beltrami eigenvalues on arbitrary compact boundary $\\partial G$ of $C^{0,1}$-regularity."}
{"id": "2601.14647", "categories": ["math.OC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.14647", "abs": "https://arxiv.org/abs/2601.14647", "authors": ["Yuchen Fang", "Xinshou Zheng", "Javad Lavaei"], "title": "TRSVR: An Adaptive Stochastic Trust-Region Method with Variance Reduction", "comment": "22 pages", "summary": "We propose a stochastic trust-region method for unconstrained nonconvex optimization that incorporates stochastic variance-reduced gradients (SVRG) to accelerate convergence. Unlike classical trust-region methods, the proposed algorithm relies solely on stochastic gradient information and does not require function value evaluations. The trust-region radius is adaptively adjusted based on a radius-control parameter and the stochastic gradient estimate. Under mild assumptions, we establish that the algorithm converges in expectation to a first-order stationary point. Moreover, the method achieves iteration and sample complexity bounds that match those of SVRG-based first-order methods, while allowing stochastic and potentially gradient-dependent second-order information. Extensive numerical experiments demonstrate that incorporating SVRG accelerates convergence, and that the use of trust-region methods and Hessian information further improves performance. We also highlight the impact of batch size and inner-loop length on efficiency, and show that the proposed method outperforms SGD and Adam on several machine learning tasks."}
{"id": "2601.14461", "categories": ["math.NA", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.14461", "abs": "https://arxiv.org/abs/2601.14461", "authors": ["Lukas Netterdon", "Veronica Montanaro", "Manuel Torrilhon", "Hossein Gorji"], "title": "Variance Reduction in the Fokker-Planck Particle Method for Rarefied Gases using Quasi-Random Numbers", "comment": null, "summary": "The Fokker-Planck (FP) particle method accelerates rarefied-gas simulations by replacing the binary collisions of the commonly used Direct Simulation Monte Carlo (DSMC) method with a drift=diffusion process. Like all particle methods, the FP method is inherently stochastic, which leads to statistical fluctuations in macroscopic quantities and necessitates large particle numbers for accurate results. In this work, we investigate the use of quasi-random numbers, which sample distributions more evenly and thereby reduce the variance. To preserve the low-discrepancy structure across time steps, we employ the Array Randomized Quasi-Monte Carlo (Array-RQMC) technique. We combine the FP method with Array-RQMC and compare it in homogeneous and inhomogeneous problems with other commonly used variance-reduction techniques. The proposed FP-Array-RQMC approach achieves improved convergence rates compared with pseudo-random sampling and yields smaller estimator errors for sufficiently large particle numbers."}
{"id": "2601.14947", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.14947", "abs": "https://arxiv.org/abs/2601.14947", "authors": ["Giacomo Francisci", "Claudio Agostinelli"], "title": "Central subspace data depth", "comment": "25+34 pages, 7+4 figures", "summary": "Statistical data depth plays an important role in the analysis of multivariate data sets. The main outcome is a center-outward ordering of the observations that can be used both to highlight features of the underlying distribution of the data and as input to further statistical analysis. An important property of data depth is related to symmetric distributions as the point with the highest depth value, the center, coincides with the point of symmetry. However, there are applications in which it is more natural to consider symmetry with respect to a subspace of a certain dimension rather than to a point, i.e. a subspace of dimension zero. We provide a general framework to construct statistical data depths which attain maximum value in a subspace, providing a center-outward ordering from that subspace. We refer to these data depths as central subspace data depths. Moreover, if the distribution is symmetric with respect to a subspace, then the depth is maximized at that subspace. We introduce general notions of symmetry about a subspace for distributions, study the properties of central subspace data depths and provide asymptotic convergence for the corresponding sample versions. Additionally, we discuss connections with projection pursuit and dimension reduction. An application based on custom data fraud detection shows the importance of the proposed approach and strengthens its potential."}
{"id": "2601.14646", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.14646", "abs": "https://arxiv.org/abs/2601.14646", "authors": ["James Tian"], "title": "Boundary Disintegration for Weighted Residual Energy Trees", "comment": null, "summary": "We study iterated weighted residual (WR) splittings generated by a positive operator $R_{0}\\in B\\left(H\\right)_{+}$ and a finite family of contractions $C_{1},\\dots,C_{m}$ in $B\\left(H\\right)$. The associated residual update $R\\mapsto R^{1/2}(I-C^{*}_{j}C_{j})R^{1/2}$ produces an $m$-ary energy tree of residuals $\\left\\{ R_{w}\\right\\} $ and dissipated pieces $\\left\\{ D_{w,j}\\right\\} $ indexed by finite words. From this tree we construct intrinsic path measures on the path space by biasing transitions either by a fixed quadratic form $x\\mapsto\\left\\langle x,D_{w,j}x\\right\\rangle $ (defining the measures $ν_{x}$) or, in the trace-class setting, by ${\\rm tr}\\left(D_{w,j}\\right)$ (yielding a reference measure $ν_{\\mathrm{tr}}$). When $R_{0}\\in S_{1}\\left(H\\right)_{+}$, we show that $ν_{\\mathrm{tr}}$ dominates the family $\\left\\{ ν_{x}\\right\\} $ and identify $dν_{x}/dν_{\\mathrm{tr}}$ as a canonical martingale limit of cylinder likelihood ratios. Along $ν_{\\mathrm{tr}}$-almost every branch the residuals decrease to a terminal trace-class random variable $R_{\\infty}$, which we interpret as the WR boundary variable. We then disintegrate $ν_{\\mathrm{tr}}$ over $σ\\left(R_{\\infty}\\right)$, obtaining a boundary law $μ_{\\mathrm{tr}}=\\left(R_{\\infty}\\right)_{\\#}ν_{\\mathrm{tr}}$ and conditional path measures $\\left\\{ ν^{T}_{\\mathrm{tr}}\\right\\} $. Finally, we show that each $ν_{x}$ admits a boundary representation as a mixture of $\\left\\{ ν^{T}_{\\mathrm{tr}}\\right\\} $ with an explicit boundary density $h_{x}=dμ_{x}/dμ_{\\mathrm{tr}}$, thereby organizing the family of intrinsic WR path measures by a single trace-biased boundary disintegration."}
{"id": "2601.14680", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.14680", "abs": "https://arxiv.org/abs/2601.14680", "authors": ["Zhenwei Lin", "Zhe Zhang"], "title": "Optimal Methods for Unknown Piecewise Smooth Problems I: Convex Optimization", "comment": "37 pages, 6 figures", "summary": "We introduce an optimal and nearly parameter-free algorithm for minimizing piecewise smooth (PWS) convex functions under the quadratic growth (QG) condition, where the locations and structure of the smooth regions are entirely \\textit{unknown}. Our algorithm, \\apex{} (Accelerated Prox-Level method for Exploring Piecewise Smoothness), is an accelerated bundle-level method designed to adaptively exploit the underlying PWS structure. APEX enjoys optimal theoretical guarantees, achieving a tight oracle complexity bound that matches the lower bound established in this work for convex PWS optimization. Furthermore, APEX generates a verifiable and accurate termination certificate, enabling a robust, almost parameter-free implementation. To the best of our knowledge, APEX is the first algorithm to simultaneously achieve the optimal convergence rate for PWS optimization and provide certificate guarantees."}
{"id": "2601.14488", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14488", "abs": "https://arxiv.org/abs/2601.14488", "authors": ["Moustapha Diallo", "Zelalem Arega Worku"], "title": "High-Order Symmetric Positive Interior Quadrature Rules on Two and Three Dimensional Domains", "comment": "27 pages, 17 figures", "summary": "Fully symmetric positive interior (f-SPI) quadrature rules are key building blocks for high-order discretizations of partial differential equations, yet high-degree rules with few nodes remain scarce on reference elements commonly used in mesh generation. We construct new f-SPI rules on the square, cube, prism, and pyramid by coupling a variable parameterization that enforces positivity and interiority with an efficient Levenberg-Marquardt optimization and a symmetry-aware node-reduction strategy that eliminates and collapses orbits, allowing transitions between symmetry types. The resulting rules achieve degrees up to 77 on the square, 45 on the cube, and 30 on the prism and pyramid, and for most degrees use fewer nodes than previously published f-SPI quadrature rules. Verification tests demonstrate comparable accuracy to existing rules. Complete node and weight data are also provided."}
{"id": "2601.14655", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.14655", "abs": "https://arxiv.org/abs/2601.14655", "authors": ["Jiangrui Tan"], "title": "Limit theorems for a supercritical multi-type branching process with immigration in a random environment", "comment": null, "summary": "Let $\\{Z_n^i = (Z_n^i(r))_{1 \\le r \\le d}: n \\ge 0\\}$ be a supercritical $d$-type branching process in an i.i.d. environment $ξ= (ξ_0, ξ_1, \\dots)$, starting from a single particle of type $i$. The offspring distribution at generation $n$ depends on the environment $ξ_n$, and we denote by $M_n = (M_n(i,j))_{1 \\le i,j \\le d}$ the corresponding (random) mean matrix. Recently, Grama et al. (Ann. Appl. Probab. \\textbf{33}(2023) 1213-1251) extended the famous Kesten--Stigum theorem to the random environment case with $d>1$. They improved upon previous work by innovatively constructing a new normalized population process $(\\tilde{W}^i_n)$. Under several simple assumptions, they proved that $\\tilde{W}^i_n$ converges almost surely to a limit $\\tilde{W}^i$, and that $\\tilde{W}^i$ is non-degenerate if and only if a $\\mbb{E}X\\log^+ X<\\infty$ type condition holds.\n  In this paper, we study the situation where an immigrant vector $Y_n$ joins the population $Z_n^i$ at each generation $n \\ge 0$; the distribution of $Y_n$ also depends on the environment $ξ_n$. Following the approach of Grama et al., we construct a normalized process $(W^i_n)$ for the model with immigration, establishing a Kesten--Stigum type theorem that characterizes the non-degeneracy of its almost sure limit. Moreover, we provide complete $L^p$-convergence criteria for $(W^i_n)$, treating separately the cases $1 < p < \\infty$ and $0 < p < 1$. As an important byproduct, a sufficient condition for the boundedness of the maximal function $\\sup_n \\tilde{W}_n^i$ is also obtained. Our results show that, under a mild restriction on the number of immigrants, the inclusion of immigration does not affect the almost sure convergence property of the original normalized process, but it does have an impact on the criterion for $L^p$ convergence."}
{"id": "2601.14819", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.14819", "abs": "https://arxiv.org/abs/2601.14819", "authors": ["José Niño-Mora"], "title": "A fast-pivoting algorithm for Whittle's restless bandit index", "comment": "23 pages", "summary": "The Whittle index for restless bandits (two-action semi-Markov decision processes) provides an intuitively appealing optimal policy for controlling a single generic project that can be active (engaged) or passive (rested) at each decision epoch, and which can change state while passive. It further provides a practical heuristic priority-index policy for the computationally intractable multi-armed restless bandit problem, which has been widely applied over the last three decades in multifarious settings, yet mostly restricted to project models with a one-dimensional state. This is due in part to the difficulty of establishing indexability (existence of the index) and of computing the index for projects with large state spaces. This paper draws on the author's prior results on sufficient indexability conditions and an adaptive-greedy algorithmic scheme for restless bandits to obtain a new fast-pivoting algorithm that computes the $n$ Whittle index values of an $n$-state restless bandit by performing, after an initialization stage, $n$ steps that entail $(2/3) n^3 + O(n^2)$ arithmetic operations. This algorithm also draws on the parametric simplex method, and is based on elucidating the pattern of parametric simplex tableaux, which allows to exploit special structure to substantially simplify and reduce the complexity of simplex pivoting steps. A numerical study demonstrates substantial runtime speed-ups versus alternative algorithms."}
{"id": "2601.14508", "categories": ["math.NA", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2601.14508", "abs": "https://arxiv.org/abs/2601.14508", "authors": ["Mustafa Aggul", "Manaure Francisquez", "Daniel R. Reynolds", "Sylvia Amihere"], "title": "Super Time Stepping Methods for Diffusion using Discontinuous-Galerkin Spatial Discretizations", "comment": null, "summary": "Super-time-stepping (STS) methods provide an attractive approach for enabling explicit time integration of parabolic operators, particularly in large-scale, higher-dimensional kinetic simulations where fully implicit schemes are impractical. In this work, we present an explicit STS framework tailored for diffusion operators in gyrokinetic models, motivated by the fact that constructing and storing a Jacobian is often infeasible due to strong nonlocal couplings, high dimensionality, and memory constraints. We investigate the performance of several STS methods, including Runge-Kutta-Chebyshev (RKC) and Runge-Kutta-Legendre (RKL) schemes, applied to a diffusion equation discretized using both discontinuous Galerkin (DG) and finite-difference methods. To support time adaptivity, we introduce a novel error norm designed to more accurately track temporal error arising from DG spatial discretizations, in which degrees of freedom contribute unevenly to the solution error. Finally, we assess the performance of an automatic eigenvalue estimation algorithm for determining the required number of STS stages and compare it against an analytical estimation formula."}
{"id": "2601.14748", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.14748", "abs": "https://arxiv.org/abs/2601.14748", "authors": ["Danijel Grahovac", "Péter Kevei", "Dominik Mihalčić"], "title": "Marcinkiewicz--Zygmund-type SLLN for mixed moving average processes", "comment": "52 pages", "summary": "The Marcinkiewicz--Zygmund theorem is a fundamental result in probability theory that establishes rates of convergence in the strong law of large numbers (SLLN). Although numerous extensions have been developed for dependent sequences, many classes of processes, particularly those exhibiting strong dependence, remain unexplored. In this paper, we present a Marcinkiewicz--Zygmund-type SLLN for a class of mixed moving average processes, which form a large and flexible class of stationary infinitely divisible processes. In contrast to the classical case, where moments determine the asymptotic behavior, the present setting additionally involves key objects that characterize both dependence and marginal distributions."}
{"id": "2601.14828", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.14828", "abs": "https://arxiv.org/abs/2601.14828", "authors": ["Deniz Tuncer", "Burak Kocuk"], "title": "MIQCP and MISOCP-Based Solution Methods for the Multi-Layer Thin Films Problem", "comment": null, "summary": "The Multi-Layer Thin Films Problem is a materials science problem that aims to enhance the reflectance of a metallic substrate by designing multi-layer coatings composed of different dielectric materials and thicknesses. While previous studies on the problem mostly rely on heuristic approaches and are designed for single wavelength applications, this work addresses the problem using global optimization techniques for multiple wavelengths. We develop an exact nonconvex mixed-integer quadratically constrained programming (MIQCP) model to solve this problem. We also develop a mixed-integer second-order cone programming relaxation that has computational advantage over the MIQCP model. Our numerical experiments yield solutions that have average reflectance of 99% over the visible spectrum (380-770 nm) and 95% over the broad spectrum (300-3000 nm)."}
{"id": "2601.14548", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14548", "abs": "https://arxiv.org/abs/2601.14548", "authors": ["Timo Sprekeler"], "title": "A Cordes framework for stationary Fokker--Planck--Kolmogorov equations", "comment": "17 pages", "summary": "We first review the Cordes condition for nondivergence-form differential operators through the lens of Campanato's theory of near operators. We then survey a recently proposed Cordes framework that guarantees the existence and uniqueness of $L^2$ solutions to stationary Fokker--Planck--Kolmogorov equations subject to periodic boundary conditions, and that allows for the construction of a simple finite element method for its numerical approximation. Finally, we propose a Cordes framework for stationary Fokker--Planck--Kolmogorov-type equations subject to a homogeneous Dirichlet boundary condition."}
{"id": "2601.14909", "categories": ["math.PR", "math.CO", "math.CV", "math.DG", "math.GT"], "pdf": "https://arxiv.org/pdf/2601.14909", "abs": "https://arxiv.org/abs/2601.14909", "authors": ["Huabin Ge", "Yangxiang Lu", "Chuwen Wang", "Tian Zhou"], "title": "Random infinite ideal angled graphs and ideal hyperbolic polyhedra", "comment": null, "summary": "This article aims to develop the uniformization and boundary theory of random infinite ideal hyperbolic polyhedra (abbr. IHP) and their dual 1-skeleton, i.e., ideal angled graphs (abbr. IAG) from multiple perspectives, including combinatorics, geometry, analysis and random walks. For unimodular random IAG, we establish an ICP analog of the dichotomy theorem of Angel-Hutchcroft-Nachmias-Ray [4,5]. Specifically, the character $T(ρ):=\\sum_{e\\niρ}Θ_e$ of an IAG, introduced in [40], determines its ICP type: the graph is a.s. ICP-parabolic if and only if $\\mathbb{E}[T(ρ)]=2π$. In the ICP-hyperbolic case, the simple random walk converges a.s. to $\\partial\\mathbb{D}$ with positive hyperbolic speed. Moreover, the geometric, Poisson, Martin, and Gromov boundaries coincide, extending the boundary theory of Angel-Barlow-Gurevich-Nachmias [3] and Hutchcroft-Peres [37] beyond triangulations to cellular decompositions. As a corollary of the aforementioned IHP/IAG duality, we obtain the systematic characterizations of the random IHP. To develop our theory, we strengthen and refine the Ring Lemma of Ge-Yu-Zhou [27] for ICP, which provides quantitative local control of the packing geometry. This key estimate makes it possible to extend the boundary theory beyond triangulations."}
{"id": "2601.14839", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.14839", "abs": "https://arxiv.org/abs/2601.14839", "authors": ["Daizhan Cheng"], "title": "On Dimension Varying Control Systems: A Universal State Space Approach", "comment": null, "summary": "A cross-dimensional Euclidian space ($Ω$) is proposed for the state space of dimension varying (control) systems. It is shown that the topological structure of $Ω$ is consistent with all $\\mathbb{R}^n$, which are the state spaces of each component modes of a dimension varying system. Using the universal metric from $Ω$, the switching laws are assumed to be Lipschitz. Some reasonable conventional switching laws are proposed. Under the topology deduced by the metric on $Ω$ some fundamental properties of dimension varying dynamic systems, such as stability and robustness, are investigated. Then some control problems of dimension varying control systems, including controllability, observability, stabilization, disturbance decoupling, etc. are investigated. Finally, an aggregation approach for large scale hierarchical dimension varying networks is proposed."}
{"id": "2601.14740", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14740", "abs": "https://arxiv.org/abs/2601.14740", "authors": ["Xinjie Fang", "Jianhua Huang", "Fang Su", "Jun Ouyang"], "title": "Finite-dimensional approximations of random attractor for stochastic discrete complex Ginzburg-Landau equations", "comment": null, "summary": "In this paper, we apply an implicit Euler scheme to discretize the complex Ginzburg-Landau equation and prove the existence of a numerical attractor for the discrete Ginzburg-Landau system. We establish the upper semicontinuity of the numerical attractor with respect to the global attractor as the time step tends to zero. Furthermore, we provide finite-dimensional approximations for three types of attractors (global, numerical, and random), and demonstrate the existence of truncated attractors along with their convergence as the dimension of the state space tends to infinity. Finally, we prove the existence of a random attractor and establish the upper semi-continuity both of the global random attractor and the truncated random attractor."}
{"id": "2601.15194", "categories": ["math.PR", "cond-mat.stat-mech", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.15194", "abs": "https://arxiv.org/abs/2601.15194", "authors": ["Oliver Baker", "Carl P. Dettmann"], "title": "Entropy of Soft Random Geometric Graphs in General Geometries", "comment": "27 pages, 7 figures", "summary": "We study the effect of the choice of embedding geometry on the entropy of random geometric graph ensembles with soft connection functions. First we show that when the connection range is small, the entropy is dependent only on the dimension of the geometry and not the shape, but for large connection ranges the boundaries of the domain matter. Next, we formulate the problem of estimating entropy as a problem of estimating the average degree of a graph with the binary entropy function as its connection function. We use this formulation to study the effect of boundaries on the entropy, and to estimate the entropy of soft random geometric graphs in complicated geometries where a closed form pair distance density is not available."}
{"id": "2601.14882", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14882", "abs": "https://arxiv.org/abs/2601.14882", "authors": ["Mehdi Golestani", "Yongduan Song", "Weizhen Liu", "Guangren Duan", "He Kong"], "title": "Practical prescribed-time prescribed performance control with asymptotic convergence -- A vanishing sigma-modification approach", "comment": null, "summary": "In this paper, we present a method capable of ensuring practical prescribed-time control with guaranteed performance for a class of nonlinear systems in the presence of time-varying parametric and dynamic uncertainties, and uncertain control coefficients. Our design consists of two key steps. First, we construct a performance-rate function that freezes at and after a user-specified time T, playing a crucial role in achieving desired precision within prescribed time T and dealing with unmodeled dynamics. Next, based on this function and a sigma-modification strategy in which the leakage term starts to vanish at t > T, we develop an adaptive dynamic surface control framework to reduce control complexity, deal with uncertainties, ensure prescribed performance, practical prescribed-time convergence to a specific region, and ultimately achieve asymptotic convergence. The effectiveness of the proposed control method is validated through numerical simulations."}
{"id": "2601.14794", "categories": ["math.NA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14794", "abs": "https://arxiv.org/abs/2601.14794", "authors": ["Dimitrios G. Patsatzis", "Alessandro Della Pia", "Lucia Russo", "Constantinos Siettos"], "title": "RANDSMAPs: Random-Feature/multi-Scale Neural Decoders with Mass Preservation", "comment": "47 pages (23 in main text, 24 in Appendix), 19 figures (4 in main text, 15 in Appendix), 10 Tables (in Appendix)", "summary": "We introduce RANDSMAPs (Random-feature/multi-scale neural decoders with Mass Preservation), numerical analysis-informed, explainable neural decoders designed to explicitly respect conservation laws when solving the challenging ill-posed pre-image problem in manifold learning. We start by proving the equivalence of vanilla random Fourier feature neural networks to Radial Basis Function interpolation and the double Diffusion Maps (based on Geometric Harmonics) decoders in the deterministic limit. We then establish the theoretical foundations for RANDSMAP and introduce its multiscale variant to capture structures across multiple scales. We formulate and derive the closed-form solution of the corresponding constrained optimization problem and prove the mass preservation property. Numerically, we assess the performance of RANDSMAP on three benchmark problems/datasets with mass preservation obtained by the Lighthill-Whitham-Richards traffic flow PDE with shock waves, 2D rotated MRI brain images, and the Hughes crowd dynamics PDEs. We demonstrate that RANDSMAPs yield high reconstruction accuracy at low computational cost and maintain mass conservation at single-machine precision. In its vanilla formulation, the scheme remains applicable to the classical pre-image problem, i.e., when mass-preservation constraints are not imposed."}
{"id": "2601.15215", "categories": ["math.PR", "math.OA"], "pdf": "https://arxiv.org/pdf/2601.15215", "abs": "https://arxiv.org/abs/2601.15215", "authors": ["Nicolas Gilliers", "David Jekel"], "title": "Bigraph independence : a mixture of the five natural independences", "comment": null, "summary": "We introduce a notion of non-commutative joint independence for multiple algebras in a non-commutative probability space. The pairwise relationships between these algebras are encoded by a graph with two edge sets -- a combinatorial structure we call a bigraph -- and naturally encompass the five fundamental types of independence: tensor, free, (anti)monotone, and Boolean. It subsumes the BMT independence of Arizmendi--Mendoza--Vazquez-Becerra (when all pairwise relationships are Boolean, (anti)monotone, or tensor) and the $ε$ or $Λ$-independence of Mlotkowski (when the pairwise relationships are tensor and free). We present explicit combinatorial moment formulas, a Hilbert space construction, and natural associativity relations within this setting. Furthermore, we demonstrate that bigraph independence emerges in the asymptotic behavior of tensor product random matrix models with respect to a vector state, encompassing the Charlesworth--Collins model for $\\varepsilon$-independence as a special case and offering a random matrix perspective on BMT independence."}
{"id": "2601.14908", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.14908", "abs": "https://arxiv.org/abs/2601.14908", "authors": ["Haibin Chen", "Yixuan Chen", "Liqun Qi"], "title": "Biquadratic Cauchy Tensors and Spherical Biquadratic Polynomial Programming", "comment": null, "summary": "This paper addresses biquadratic polynomial programming (BPP), an NP-hard optimization problem closely related to biquadratic tensors. We first establish several necessary and sufficient conditions for the positive semi-definiteness and positive definiteness of biquadratic Cauchy tensors. Leveraging the structured properties of these tensors, we then prove that the BPP and its equivalent multilinear formulation share the same set of optimal solutions. This result allows us to establish the global sequence convergence of the proximal alternating minimization (PAM) algorithm via the Kurdyka- Lojasiewicz (KL) property, extending the analysis in [8]. Furthermore, by reformulating the equivalent multilinear problem as an unconstrained optimization model, we enable the analysis of its KL exponent and derive an explicit expression for the convergence rate of PAM. Finally, numerical experiments are conducted on both biquadratic Cauchy tensors and general biquadratic tensor instances to evaluate the efficiency, stability, and practical performance of the proposed algorithm."}
{"id": "2601.14858", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14858", "abs": "https://arxiv.org/abs/2601.14858", "authors": ["Rohit Sunil Kanchi", "Sicheng He"], "title": "Modal-Centric Field Inversion via Differentiable Proper Orthogonal Decomposition", "comment": null, "summary": "Inverse problems in computational physics often require matching high-dimensional spatio-temporal fields, leading to prohibitive computational costs and ill-conditioned optimizations. We introduce modal-centric field inversion (MCFI), a paradigm that reformulates inverse problems in the reduced space of proper orthogonal decomposition (POD) modes rather than the full physical state space. By targeting dominant flow structures instead of point-wise field values, MCFI provides a compact, physically meaningful objective that naturally regularizes the inversion and dramatically reduces computational burden. Central to this framework is the differentiable POD: an adjoint-based method that efficiently computes sensitivities of POD modes with respect to model parameters, enabling gradient-based optimization in the modal space. We demonstrate MCFI on a one and two-dimensional modified viscous Burger's equation, optimizing spatially varying coefficients to match target dynamics through mode-matching. The adjoint formulation achieves computational cost independent of parameter dimension, in contrast to finite-difference approaches that scale linearly. MCFI establishes a foundation for scalable inverse design and model calibration in unsteady, high-dimensional systems."}
{"id": "2601.15217", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.15217", "abs": "https://arxiv.org/abs/2601.15217", "authors": ["Kush Kinra"], "title": "Rate of convergence of random attractors towards deterministic singleton attractor for a class of non-Newtonian fluids of differential type", "comment": null, "summary": "In this article, we investigate the long-term dynamics of a class of two- and three-dimensional non-Newtonian fluids of differential type, known as third-grade fluids. We first show that when the external forcing is sufficiently small, the global attractor of the underlying system (which characterizes its asymptotic behavior) reduces to a single point. We then consider the system under stochastic perturbations, specifically infinite-dimensional additive white noise. In this random setting, we do not find conclusive evidence that the corresponding random attractor remains a single point, as in the deterministic case. However, we are able to estimate the rate at which the random attractor approaches the deterministic singleton attractor as the intensity of the stochastic noise tends to zero."}
{"id": "2601.15090", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15090", "abs": "https://arxiv.org/abs/2601.15090", "authors": ["Mehrnaz Anvari", "Marius Neuwirth", "Okan Akca", "Luna Lütz", "Simon Lukas Bussmann", "Tobias Fleiter", "Bernhard Klaassen"], "title": "From carbon management strategies to implementation: Modeling and physical simulation of CO2 pipeline infrastructure -- a case study for Germany", "comment": "35 pages, 9 figures, preprint submitted to a journal", "summary": "Carbon capture and storage or utilization (CCUS) will play an important role to achieve climate neutrality in many economies. Pipelines are widely regarded as the most efficient means of CO2 transport; however, they are currently non-existent. Policy-makers and companies need to develop large-scale infrastructure under substantial uncertainty. Methods and analyses are needed to support pipeline planning and strategy development. This paper presents an integrated method for designing CO2 pipeline networks by combining energy system scenarios with physical network simulation. Using Germany as a case study, we derive spatially highly resolved CO2 balances to develop a dense-phase CO2 pipeline topology that follows existing gas pipeline corridors. The analyzed system includes existing sites for cement and lime production, waste incineration, carbon users, four coastal CO2 hubs, and border crossing points. We then apply the multiphysical network simulator MYNTS to assess the technical feasibility of this network. We determine pipeline diameters, pump locations, and operating conditions that ensure stable dense-phase transport. The method explicitly accounts for elevation and possible impurities. The results indicate that a system of about 7000 km pipeline length and a mixed normed diameter of DN700 on main corridors and of DN500/DN400 on branches presents a feasible solution to connect most sites. Investment costs for the optimized pipeline system are calculated to be about 17 billion Euros. The method provides a reproducible framework and is transferable to other countries and to European scope."}
{"id": "2601.14911", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14911", "abs": "https://arxiv.org/abs/2601.14911", "authors": ["Paula Hilbert", "Ani Miraçi", "Dirk Praetorius"], "title": "Generalized preconditioned conjugate gradients for adaptive FEM with optimal complexity", "comment": null, "summary": "We consider adaptive finite element methods (AFEMs) with inexact algebraic solver for second-order symmetric linear elliptic diffusion problems. We formulate and analyze a non-linear and non-symmetric geometric multigrid preconditioner for the generalized preconditioned conjugate gradient method (GPCG) used to solve the arising finite element systems. Moreover, a linear and symmetric variant of the geometric multigrid preconditioner that is suitable for the (standard) preconditioned conjugate gradient method (PCG) is provided and analyzed. We show that both preconditioners are optimal in the sense that, first, the resulting algebraic solvers admit a contraction factor that is independent of the local mesh size h and the polynomial degree p, and, second, that they can be applied with linear computational complexity. Related to this, quasi-optimal computational cost of the overall adaptive finite element method is addressed. Numerical experiments underline the theoretical findings."}
{"id": "2601.15223", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.15223", "abs": "https://arxiv.org/abs/2601.15223", "authors": ["Kush Kinra"], "title": "Large time behaviour for a class of 2D and 3D stochastic non-Newtonian fluids of differential types: Attractors and invariant measures", "comment": null, "summary": "This study investigates a stochastic version of a class of non-Newtonian fluids governed by third-grade fluid equations, which exhibit complex and highly nonlinear dynamics. In particular, we address the random dynamics and asymptotic behavior of stochastic third-grade fluid equations (STGFEs) driven by a \\emph{linear multiplicative Itô-type white noise} on general domains $\\mathbb{Q}\\subseteq\\mathbb{R}^d$, $d\\in\\{2,3\\}$. We first prove that the non-autonomous STGFEs generate a continuous non-autonomous random dynamical system $Φ$, and we establish the existence of a pullback absorbing set. Using compact Sobolev embeddings on bounded domains and uniform tail estimates on unbounded domains, we show the pullback asymptotic compactness of $Φ$, which leads to the existence of pullback random attractors that are compact and attracting in $\\mathbb{L}^2(\\mathbb{Q})$. As a consequence, we demonstrate the existence of an invariant measure associated with the STGFEs and, exploiting the linear multiplicative structure of the noise along with the exponential stability of solutions, we prove uniqueness of the invariant measure in the case of zero external forcing. These results are entirely new for STGFEs on general domains, and, in particular, the existence of pullback random attractors with linear multiplicative noise is obtained here for the first time. We further note that, unlike Stratonovich noise, which is widely used in the literature to study random attractors, Itô noise is more appropriate for domains that do not satisfy the Poincaré inequality. Overall, this work resolves several open problems regarding random attractors, invariant measures, and ergodicity for stochastic third-grade fluids on general unbounded domains $\\mathbb{Q}\\subseteq\\mathbb{R}^d$, $d\\in\\{2,3\\}$."}
{"id": "2601.15092", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15092", "abs": "https://arxiv.org/abs/2601.15092", "authors": ["Sudkobfa Boontawee", "Mootta Prangprakhon", "Nimit Nimana"], "title": "Federated Incremental Subgradient Method for Convex Bilevel Optimization Problems", "comment": "6 pages", "summary": "In this letter, we consider a bilevel optimization problem in which the outer-level objective function is strongly convex, whereas the inner-level problem consists of a finite sum of convex functions. Bilevel optimization problems arise in situations where the inner-level problem does not have a unique solution. This has led to the idea of introducing an outer-level objective function to select a solution with the specific desired properties. We propose an iterative method that combines an incremental algorithm with a broadcast algorithm, both based on the principles of federated learning. Under appropriate assumptions, we establish the convergence results of the proposed algorithm. To demonstrate its performance, we present two numerical examples related to binary classification and a location problem."}
{"id": "2601.14933", "categories": ["math.NA", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14933", "abs": "https://arxiv.org/abs/2601.14933", "authors": ["Yogesh Darmwal", "Ketan Rajawat"], "title": "Rank-one Riemannian Subspace Descent for Nonlinear Matrix Equations", "comment": null, "summary": "We propose a rank-one Riemannian subspace descent algorithm for computing symmetric positive definite (SPD) solutions to nonlinear matrix equations arising in control theory, dynamic programming, and stochastic filtering. For solution matrices of size $n\\times n$, standard approaches for dense matrix equations typically incur $\\mathcal{O}(n^3)$ cost per-iteration, while the efficient $\\mathcal{O}(n^2)$ methods either rely on sparsity or low-rank solutions, or have iteration counts that scale poorly. The proposed method entails updating along the dominant eigen-component of a transformed Riemannian gradient, identified using at most $\\mathcal{O}(\\log(n))$ power iterations. The update structure also enables exact step-size selection in many cases at minimal additional cost. For objectives defined as compositions of standard matrix operations, each iteration can be implemented using only matrix--vector products, yielding $\\mathcal{O}(n^2)$ arithmetic cost. We prove an $\\mathcal{O}(n)$ iteration bound under standard smoothness assumptions, with improved bounds under geodesic strong convexity. Numerical experiments on large-scale CARE, DARE, and other nonlinear matrix equations show that the proposed algorithm solves instances (up to $n=10{,}000$ in our tests) for which the compared solvers, including MATLAB's \\texttt{icare}, structure-preserving doubling, and subspace-descent baselines fail to return a solution. These results demonstrate that rank-one manifold updates provide a practical approach for high-dimensional and dense SPD-constrained matrix equations. MATLAB code implementation is publicly available on GitHub : \\href{https://github.com/yogeshd-iitk/nonlinear_matrix_equation_R1RSD}{\\textcolor{blue}{https://github.com/yogeshd-iitk/nonlinear\\_matrix \\_equation\\_R1RSD}}"}
{"id": "2601.14586", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.14586", "abs": "https://arxiv.org/abs/2601.14586", "authors": ["Dan Cheng", "John Ginos"], "title": "Cluster size distributions of discrete random fields", "comment": null, "summary": "We study discrete random fields $\\{X_t: t\\in \\mathbb{Z}^d\\}$ parameterized on the $d$-dimensional integer lattice $\\mathbb{Z}^d$. For a fixed threshold $u$, the excursion set $\\{t \\in \\mathbb{Z}^d : X_t > u\\}$ decomposes into connected components or clusters, whose size, defined as the number of lattice points they contain, are random. This paper investigates the probability distribution of these cluster sizes. For stationary random fields, we derive exact expressions for the cluster size distribution. To address nonstationary settings, we introduce a peak-based cluster size distribution, which characterizes the distribution of cluster sizes conditional on the presence of a local maximum above $u$. This formulation provides a tractable alternative when exact cluster size distributions are analytically inaccessible. The proposed framework applies broadly to Gaussian and non-Gaussian random fields, relying only on their joint dependence structure. Our results provide a theoretical foundation for quantifying spatial extent in discretely sampled data, with applications to medical imaging, geoscience, environmental monitoring, and other scientific areas where thresholded random fields naturally arise."}
{"id": "2601.15168", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15168", "abs": "https://arxiv.org/abs/2601.15168", "authors": ["J. Nicholas Neuberger", "Alen Alexanderian", "Bart van Bloemen Waanders", "Ahmed Attia"], "title": "Path-OED for infinite-dimensional Bayesian linear inverse problems governed by PDEs", "comment": null, "summary": "We consider infinite-dimensional Bayesian linear inverse problems governed by time-dependent partial differential equations (PDEs) and develop a mathematical and computational framework for optimal design of mobile sensor paths in this setting. The proposed path optimal experimental design (path-OED) framework is established rigorously in a function space setting and elaborated for the case of Bayesian c-optimality, which quantifies the posterior variance in a linear functional of the inverse parameter. The latter is motivated by goal-oriented formulations, where we seek to minimize the uncertainty in a scalar prediction of interest. To facilitate computations, we complement the proposed infinite-dimensional framework with discretized formulations, in suitably weighted finite-dimensional inner product spaces, and derive efficient methods for finding optimal sensor paths. The resulting computational framework is flexible, scalable, and can be adapted to a broad range of linear inverse problems and design criteria. We also present extensive computational experiments, for a model inverse problem constrained by an advection-diffusion equation, to demonstrate the effectiveness of the proposed approach."}
{"id": "2601.14940", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.14940", "abs": "https://arxiv.org/abs/2601.14940", "authors": ["Inna K. Shingareva", "Andrei D. Polyanin"], "title": "Nonclassical symmetries of polynomial equations and test problems with parameters for computer algebra systems", "comment": "25 pages, 3 figures, 2 Tables", "summary": "Nonclassical symmetries and reductions of polynomial equations and systems of polynomial equations are considered. It is shown that specific polynomial equations having \"hidden\" symmetries can be reduced to classical symmetric systems of polynomial equations by introducing a new additional variable. It has been established that symmetric systems of polynomial equations of mixed type, consisting of symmetric and anti-symmetric polynomials, can be transformed into simpler systems. A method is presented for solving nonclassical symmetric systems of two polynomial equations that change places when the unknowns are permuted. We study polynomial equations containing the second iteration of a given polynomial, which are reduced to nonclassical symmetric systems of equations. New higher-degree polynomial equations containing free parameters that admit solutions in radicals are found. Three such equations of the sixth and ninth degrees are further used as test problems with parameters for analyzing the capabilities of two leading computer algebra systems. It is shown that currently, the Maple and Mathematica systems do not allow us to efficiently find analytical solutions (in radicals) of polynomial equations with free parameters, but they allow us to obtain numerical solutions of equations for fixed numerical values of the parameters. The results of this work and the proposed test problems with parameters can be used to further improve existing computer algebra systems."}
{"id": "2601.15184", "categories": ["math.OC", "math-ph", "quant-ph"], "pdf": "https://arxiv.org/pdf/2601.15184", "abs": "https://arxiv.org/abs/2601.15184", "authors": ["Julius A. Zeiss", "Gereon Koßmann", "René Schwonnek", "Martin Plávala"], "title": "Finite de Finetti for convex bodies and Polynomial Optimization", "comment": "36 + 13 pages; Julius A. Zeiss and Gereon Koßmann contributed equally to this work", "summary": "Leveraging a recently proposed notion of relative entropy in general probabilistic theories (GPT), we prove a finite de Finetti representation theorem for general convex bodies. We apply this result to address a fundamental question in polynomial optimization: the existence of a convergent outer hierarchy for problems with inequality constraints and analytical convergence guarantees. Our strategy generalizes a quantitative monogamy-of-entanglement argument from quantum theory to arbitrary convex bodies, establishing a uniform upper bound on mutual information in multipartite extensions. This leads to a finite de Finetti theorem and, subsequently, a convergent conic hierarchy for a wide class of polynomial optimization problems subject to both equality and inequality constraints. We further provide a constructive rounding scheme that yields certified interior points with controlled approximation error. As an application, we express the optimal GPT value of a two-player non-local game as a polynomial optimization problem, allowing our techniques to produce approximation schemes with finite convergence guarantees."}
{"id": "2601.15070", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.15070", "abs": "https://arxiv.org/abs/2601.15070", "authors": ["Gerardo Cicalese", "Gabriele Ciaramella", "Ilario Mazzieri", "Martin J. Gander"], "title": "Optimized Schwarz Waveform Relaxation for the Damped Wave Equation", "comment": null, "summary": "The performance of Schwarz Waveform Relaxation is critically dependent on the choice of transmission conditions. While classical absorbing conditions work well for wave propagation, they prove insufficient for damped wave equations, particularly in viscoelastic damping regimes where convergence becomes prohibitively slow. This paper addresses this limitation by introducing a more general transmission operator with two free parameters for the one-dimensional damped wave equation. Through frequency-domain analysis, we derive an explicit expression for the convergence factor governing the convergence rate. We propose and compare two optimization strategies (L-infinity and L-2 minimization) for determining optimal transmission parameters. Numerical experiments demonstrate that our optimized approach significantly accelerates convergence compared to standard absorbing conditions, especially for viscoelastic damping cases. The method provides a computationally efficient alternative to exhaustive parameter search while maintaining robust performance across different damping regimes."}
{"id": "2601.15208", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15208", "abs": "https://arxiv.org/abs/2601.15208", "authors": ["Samir Adly", "Juan José Maulén", "Emilio Vilches"], "title": "Penalty-Based Smoothing of Convex Nonsmooth Supremum Functions with Accelerated Inertial Dynamics", "comment": null, "summary": "We propose a penalty-based smoothing framework for convex nonsmooth functions with a supremum structure. The regularization yields a differentiable surrogate with controlled approximation error, a single-valued dual maximizer, and explicit gradient formulas. We then study an accelerated inertial dynamic with vanishing damping driven by a time-dependent regularized function whose parameter decreases to zero. Under mild integrability and boundedness conditions on the regularization schedule, we establish an accelerated $\\mathcal{O}(t^{-2})$ decay estimate for the regularized residual and, in the regime $α>3$, a sharper $o(t^{-2})$ decay together with weak convergence of trajectories to a minimizer of the original nonsmooth problem via an Opial-type argument. Applications to multiobjective optimization (through Chebyshev/max scalarization) and to distributionally robust optimization (via entropic regularization over ambiguity sets) illustrate the scope of the framework."}
{"id": "2601.15191", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.15191", "abs": "https://arxiv.org/abs/2601.15191", "authors": ["Iñigo Jimenez-Ciga", "Francisco Gaspar", "Kundan Kumar", "Florin A. Radu"], "title": "Parareal algorithm for coupled elliptic-parabolic problems", "comment": "25 pages, 6 figures", "summary": "We present a convergence analysis of the parallel-in-time integration method known as the Parareal algorithm for degenerate differential-algebraic systems arising from quasi-static Biot models, which govern coupled flow and deformation in porous media. The underlying system exhibits a saddle-point structure and degeneracy due to the quasi-static assumption. We extend the Parareal algorithm to this setting and propose three coarse propagators: monolithic, fixed-stress, and multirate fixed-stress schemes. For each, we derive sufficient conditions for convergence and establish explicit time step restrictions that guarantee contractivity of the iteration matrix. Numerical experiments show computational savings accrued by using a parareal solver in multiphysics simulations involving poroelasticity and other coupled systems."}
{"id": "2601.15218", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.15218", "abs": "https://arxiv.org/abs/2601.15218", "authors": ["Luigi De Pascale", "Igor Pinheiro"], "title": "Some reverse inequality in optimal mass transportation", "comment": null, "summary": "Controlling the $\\mathcal W_\\infty$ Wasserstein distance by the $\\mathcal W_p$ Wasserstein distance is interesting both for theorical and numerical applications. A first paper on this problem was written several years ago [3]. Some year later [14] framed it in the same inequality for more general costs which increase with the distance. In this paper, we prove this type of inequality for optimal transport problems with pointwise cost which is a decreasing function of the distance. We show, in particular, that there is a general framework that encompasses all the cases above."}
{"id": "2601.15242", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15242", "abs": "https://arxiv.org/abs/2601.15242", "authors": ["Kush Kinra", "Fernanda Cipriano"], "title": "Optimal control problem associated with three-dimensional critical convective Brinkman-Forchheimer equations", "comment": null, "summary": "In this article, we are concerned about the velocity tracking optimal control problem for 3D critical convective Brinkman-Forchheimer equations defined on a simply connected bounded domain $\\mathbb{D}\\subset\\mathbb{R}^3$ with $\\mathrm{C}^2$-boundary $\\partial\\mathbb{D}$. The control is introduced through an external force. The objective is to optimally minimize a velocity tracking cost functional, for which the velocity vector field is oriented towards a target velocity. Most importantly, we are concerned about the first-order necessary optimality conditions for above-mentioned optimal control problem which is the main challenging task of this article. To overcome the difficulties related to the differentiability of the control-to-state mapping, consequence of the lack of regularity of the state variable on bounded domains, we first establish some intermediate optimality conditions and then pass to the limit."}
{"id": "2601.15252", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.15252", "abs": "https://arxiv.org/abs/2601.15252", "authors": ["Jamie Fravel", "Robert Hildebrand"], "title": "Automating Idealness Proofs for Binary Programs with Application to Rectangle Packing", "comment": "Associated git repo: https://github.com/jfravel/Ideal-O-Matic . 30 pages main body, 45 pages total", "summary": "An integer program is called ideal if its continuous relaxation coincides with its convex hull allowing the problem to be solved as a continuous program and offering substantial computational advantages. Proving idealness analytically can be extraordinarily tedious -- even for small formulations -- such proofs often span many pages of intricate case analysis which motivates the development of automated verification methods. We develop a general-purpose framework for certifying idealness in Mixed Binary Linear Programs (MBLPs), formulating the verification problem as a linear program when the data is fixed and as a nonconvex quadratic program when the data is parametric. We apply this framework to study several formulations of the rectangle packing problem that are conjectured to be pairwise-ideal, obtaining computational proofs where analytic proofs were previously unknown or impractical. As our second contribution, we introduce and model a novel generalization of the rectangle packing problem that enforces edge clearances between selected rectangles. We present both existing and novel MBLP formulations which arise from different encodings of the underlying disjunctive constraints. We perform some computational experiments on these formulations under a strip-packing objective to determine the importance of pairwise-idealness in practice."}
