{"id": "2601.20139", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.20139", "abs": "https://arxiv.org/abs/2601.20139", "authors": ["Nathan Sauldubois"], "title": "Model Risk Static-Hedging a Constrained Distributionally Robust Optimization approach", "comment": null, "summary": "We investigate model risk and distributionally robust optimization (DRO) under marginal and martingale constraints. Building on our previous work, we address the previously open case of static hedging with second-period maturity vanilla options and hedging strategies involving a vanilla payoff. We also extend recent sensitivity results to settings where admissible models must satisfy a martingale coupling constraint. Our approach relies on a weak implicit function theorem argument to construct families of measures satisfying the prescribed constraints. We derive closed-form sensitivity formulas and characterize the corresponding hedging strategies when the underlying process is real-valued."}
{"id": "2601.20350", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.20350", "abs": "https://arxiv.org/abs/2601.20350", "authors": ["Xiao-Yu Zhao"], "title": "Propagation of Chaos for Derivatives of McKean-Vlasov Stochastic Differential Equations and Applications", "comment": "30 pages", "summary": "As an enhanced version of existing results on Kac's propagation of chaos, which describes the convergence of mean-field particle systems to the independent McKean-Vlasov particle system as the number of particles tends to infinity, we prove the convergence at the level of derivatives with respect to the perturbations of initial value and noise, together with explicit convergence rates that can be sharp. As a consequence, the intrinsic derivative for the distribution of a single particle converges to that of an independent McKean-Vlasov SDE."}
{"id": "2601.20390", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.20390", "abs": "https://arxiv.org/abs/2601.20390", "authors": ["Samuel Chan-Ashing"], "title": "On The Cutoff Phenomenon For Dyson-Jacobi Processes", "comment": null, "summary": "We study the convergence to equilibrium of the Dyson-Jacobi process, a system of n interacting particles on the segment [0, 1] arising from Random Matrix Theory. We establish the occurence of a cutoff phenomenon for the intrinsic Wasserstein distance and provide an explicit formula for the associated mixing time.  Our approach relies on the interplay between the Riemannian geometry of the process and a flattened Euclidean representation obtained via a diffeomorphic deformation. This transformation allows us to transfer curvature-dimension inequalities from the Euclidean setting to the original space, thereby yielding sharp quantitative estimates."}
{"id": "2601.20440", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.20440", "abs": "https://arxiv.org/abs/2601.20440", "authors": ["Adam Bobrowski", "Andrey Pilipenko"], "title": "On Portenko's approximation of skew Brownian motion", "comment": "34 pages", "summary": "From the perspective of the theory of operator semigroups, we reflect back on the classical theorem of Portenko devoted to approximation of skew Brownian motion. The theorem says that by concentrating the power of drift of a diffusion process around a point one obtains an equivalent of a semi-permeable membrane at this point, described by skew Brownian motion's boundary condition. We prove convergence of the corresponding Feller semigroups and in doing so, generalize Portenko's theorem to the case of the Walsh processes on star graphs. Our analysis leads through singular perturbations of Sturm--Liouville equations, and reveals that as a result of Portenko-type approximation parameters of Walsh processes are transformed in a simple and elegant manner."}
{"id": "2601.20018", "categories": ["math.ST", "econ.EM", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.20018", "abs": "https://arxiv.org/abs/2601.20018", "authors": ["Mingxuan Zou", "Jingfan Xu", "Peng Ding", "Fang Han"], "title": "Decoupling and randomization for double-indexed permutation statistics", "comment": "42 pages", "summary": "This paper introduces a version of decoupling and randomization to establish concentration inequalities for double-indexed permutation statistics. The results yield, among other applications, a new combinatorial Hanson-Wright inequality and a new combinatorial Bennett inequality. Several illustrative examples from rank-based statistics, graph-based statistics, and causal inference are also provided."}
{"id": "2601.20076", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.20076", "abs": "https://arxiv.org/abs/2601.20076", "authors": ["Abhishek Chakraborty", "Angelia Nedić"], "title": "Randomized Feasibility Methods for Constrained Optimization with Adaptive Step Sizes", "comment": null, "summary": "We consider minimizing an objective function subject to constraints defined by the intersection of lower-level sets of convex functions. We study two cases: (i) strongly convex and Lipschitz-smooth objective function and (ii) convex but possibly nonsmooth objective function. To deal with the constraints that are not easy to project on, we use a randomized feasibility algorithm with Polyak steps and a random number of sampled constraints per iteration, while taking (sub)gradient steps to minimize the objective function. For case (i), we prove linear convergence in expectation of the objective function values to any prescribed tolerance using an adaptive stepsize. For case (ii), we develop a fully problem parameter-free and adaptive stepsize scheme that yields an $O(1/\\sqrt{T})$ worst-case rate in expectation. The infeasibility of the iterates decreases geometrically with the number of feasibility updates almost surely, while for the averaged iterates, we establish an expected lower bound on the function values relative to the optimal value that depends on the distribution for the random number of sampled constraints. For certain choices of sample-size growth, optimal rates are achieved. Finally, simulations on a Quadratically Constrained Quadratic Programming (QCQP) problem and Support Vector Machines (SVM) demonstrate the computational efficiency of our algorithm compared to other state-of-the-art methods."}
{"id": "2601.20000", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20000", "abs": "https://arxiv.org/abs/2601.20000", "authors": ["Alina Chertock", "Qingcheng Fu", "Alexander Kurganov", "Lorenzo Micalizzi"], "title": "New Adaptive Numerical Methods Based on Dual Formulation of Hyperbolic Conservation Laws", "comment": null, "summary": "In this paper, we propose an adaptive high-order method for hyperbolic systems of conservation laws. The proposed method is based on a dual formulation approach: Two numerical solutions, corresponding to conservative and nonconservative formulations of the same system, are evolved simultaneously. Since nonconservative schemes are known to produce nonphysical weak solutions near discontinuities, we exploit the difference between these two solutions to construct a smoothness indicator (SI). In smooth regions, the difference between the conservative and nonconservative solutions is of the same order as the truncation error of the underlying discretization, whereas in nonsmooth regions, it is ${\\cal O}(1)$. We apply this idea to the Euler equations of gas dynamics and define the SI using differences in the momentum and pressure variables. This choice allows us to further distinguish neighborhoods of contact discontinuities from other nonsmooth parts of the computed solution. The resulting classification is used to adaptively select numerical discretizations. In the vicinities of contact discontinuities, we employ the low-dissipation central-upwind numerical flux and a second-order piecewise linear reconstruction with the slopes computed using an overcompressive SBM limiter. Elsewhere, we use an alternative weighted essentially non-oscillatory (A-WENO) framework with the central-upwind finite-volume numerical fluxes and either unlimited (in smooth regions) or Ai-WENO-Z (in the nonsmooth regions away from contact discontinuities) fifth-order interpolation. Numerical results for the one- and two-dimensional compressible Euler equations show that the proposed adaptive method improves both the computational efficiency and resolution of complex flow features compared with the non-adaptive fifth-order A-WENO scheme."}
{"id": "2601.20498", "categories": ["math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20498", "abs": "https://arxiv.org/abs/2601.20498", "authors": ["Pierpaolo Brutti", "Claudio Durastanti", "Francesco Mari"], "title": "Spectral Diffusion Models on the Sphere", "comment": "28 pages, 1 figure", "summary": "Diffusion models provide a principled framework for generative modeling via stochastic differential equations and time-reversed dynamics. Extending spectral diffusion approaches to spherical data, however, raises nontrivial geometric and stochastic issues that are absent in the Euclidean setting.\n  In this work, we develop a diffusion modeling framework defined directly on finite-dimensional spherical harmonic representations of real-valued functions on the sphere. We show that the spherical discrete Fourier transform maps spatial Brownian motion to a constrained Gaussian process in the frequency domain with deterministic, generally non-isotropic covariance. This induces modified forward and reverse-time stochastic differential equations in the spectral domain.\n  As a consequence, spatial and spectral score matching objectives are no longer equivalent, even in the band-limited setting, and the frequency-domain formulation introduces a geometry-dependent inductive bias. We derive the corresponding diffusion equations and characterize the induced noise covariance."}
{"id": "2601.20020", "categories": ["math.ST", "math.PR", "stat.CO", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20020", "abs": "https://arxiv.org/abs/2601.20020", "authors": ["Zhirui Li", "Keith D. Levin", "Zhiang Zhao", "Vince Lyzinski"], "title": "Matching and mixing: Matchability of graphs under Markovian error", "comment": "48 pages, 12 figures", "summary": "We consider the problem of graph matching for a sequence of graphs generated under a time-dependent Markov chain noise model. Our edgelighter error model, a variant of the classical lamplighter random walk, iteratively corrupts the graph $G_0$ with edge-dependent noise, creating a sequence of noisy graph copies $(G_t)$. Much of the graph matching literature is focused on anonymization thresholds in edge-independent noise settings, and we establish novel anonymization thresholds in this edge-dependent noise setting when matching $G_0$ and $G_t$. Moreover, we also compare this anonymization threshold with the mixing properties of the Markov chain noise model. We show that when $G_0$ is drawn from an Erdős-Rényi model, the graph matching anonymization threshold and the mixing time of the edgelighter walk are both of order $Θ(n^2\\log n)$. We further demonstrate that for more structured model for $G_0$ (e.g., the Stochastic Block Model), graph matching anonymization can occur in $O(n^α\\log n)$ time for some $α<2$, indicating that anonymization can occur before the Markov chain noise model globally mixes. Through extensive simulations, we verify our theoretical bounds in the settings of Erdős-Rényi random graphs and stochastic block model random graphs, and explore our findings on real-world datasets derived from a Facebook friendship network and a European research institution email communication network."}
{"id": "2601.20181", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20181", "abs": "https://arxiv.org/abs/2601.20181", "authors": ["Christian Parkinson", "Souvik Roy"], "title": "A Fokker-Planck Framework for Control of Epidemics", "comment": "20 pages, 5 figures", "summary": "We present a control framework for stochastic compartmental models in epidemiology. In this framework, rather than directly controlling the stochastic system, we perform optimal control of an associated Fokker-Planck equation, with the goal of steering the distribution of possible solutions of the stochastic system to some desirable state. In particular, this allows for robust control mechanism with uncertainty not only in the dynamics, but also in the initial data. We formulate and fully analyze a partial differential equation constrained optimization problem, including a proof of existence of optimal controls via analysis of the control-to-state map, and a characterization of optimal controls via the Pontryagin minimum principle. We describe the application of the sequential quadratic Hamiltonian method to our problem, which provides numerical approximations of optimal control maps. We demonstrate our method using a minimal stochastic susceptible-infected-recovered model with different choices of cost functionals that represent different policy-maker concerns."}
{"id": "2601.20013", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20013", "abs": "https://arxiv.org/abs/2601.20013", "authors": ["Min Liu", "Zhiqiang Cai"], "title": "Least-Squares Neural Network (LSNN) Method for Scalar Hyperbolic Partial Differential Equations", "comment": "25 pages, 5 figures", "summary": "This chapter offers a comprehensive introduction to the least-squares neural network (LSNN) method introduced in [14,16], for solving scalar first-order hyperbolic partial differential equations, specifically linear advection-reaction equations and nonlinear hyperbolic conservation laws. The LSNN method is built on an equivalent least-squares formulation of the underlying problem on an admissible solution set that accommodates discontinuous solutions. It employs ReLU neural networks (in place of finite elements) as the approximating functions, uses a carefully designed physics-preserved numerical differentiation, and avoids penalization techniques such as artificial viscosity, entropy condition, and/or total variation. This approach captures shock features in the solution without oscillations or overshooting. Efficiently and reliably solving the resulting non-convex optimization problem posed by the LSNN method remains an open challenge. This chapter concludes with a brief discussion on application of the structure-guided Gauss-Newton (SgGN) method developed recently in [21] for solving shallow NN approximation."}
{"id": "2601.20502", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.20502", "abs": "https://arxiv.org/abs/2601.20502", "authors": ["Nathanaël Enriquez", "Mike Liu", "Laurent Ménard", "Vianney Perchet"], "title": "Optimal matching under size priority", "comment": "79 pages, 17 figures", "summary": "Past studies on the local limit of maximal weight matchings in edge-weighted large random graphs rely fundamentally on the assumption that the weights are atomless, which ensures that the maximal weight matching is unique. This excludes de facto maximal size matchings that correspond to equal edge-weights. In this work, we overcome this difficulty by assigning i.i.d.~atomless weights to edges and choosing the maximal size matching that maximises the weight. We call these doubly constrained matchings \\emph{optimal matchings}. The natural generalisation of optimal matchings for infinite unimodular random graphs are unimodular matchings of maximal density at the root that maximise the expected weight at the root when it is matched.\n  For unimodular Bienaymé-Galton-Watson (UBGW) trees and for a broad class of weight distributions, we show existence and uniqueness in law of such matchings. We also prove that if a sequence of finite random weighted graphs converges locally to an UBGW tree with i.i.d.~weights, then there exists a sequence of matchings on the finite graphs that converges locally to the optimal matching on the limiting tree. Finally, we identify a regime, depending only on the offspring distribution of the limiting tree, in which correlations between edge states in the optimal matching decay exponentially with their graph distance. In this regime, we strengthen the previous convergence to the convergence of optimal matchings of the finite graphs. As a by-product, we can explicitly compute the asymptotic densities of edges that belong to all maximal-density matchings, and of edges that belong to none."}
{"id": "2601.20152", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20152", "abs": "https://arxiv.org/abs/2601.20152", "authors": ["Chen Cheng", "Rina Foygel Barber"], "title": "Concentration Inequalities for Exchangeable Tensors and Matrix-valued Data", "comment": "45 pages, 3 figures", "summary": "We study concentration inequalities for structured weighted sums of random data, including (i) tensor inner products and (ii) sequential matrix sums. We are interested in tail bounds and concentration inequalities for those structured weighted sums under exchangeability, extending beyond the classical framework of independent terms.\n  We develop Hoeffding and Bernstein bounds provided with structure-dependent exchangeability. Along the way, we recover known results in weighted sum of exchangeable random variables and i.i.d. sums of random matrices to the optimal constants. Notably, we develop a sharper concentration bound for combinatorial sum of matrix arrays than the results previously derived from Chatterjee's method of exchangeable pairs.\n  For applications, the richer structures provide us with novel analytical tools for estimating the average effect of multi-factor response models and studying fixed-design sketching methods in federated averaging. We apply our results to these problems, and find that our theoretical predictions are corroborated by numerical evidence."}
{"id": "2601.20292", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20292", "abs": "https://arxiv.org/abs/2601.20292", "authors": ["Shuyang Ling"], "title": "Improved Global Landscape Guarantees for Low-rank Factorization in Synchronization", "comment": null, "summary": "The orthogonal group synchronization problem, which aims to recover a set of $d \\times d$ orthogonal matrices from their pairwise noisy products, plays a fundamental role in signal processing, computer vision, and network analysis. In recent years, numerous optimization techniques, such as semidefinite relaxation (SDR) and low-rank (Burer-Monteiro) factorization, have been proposed to address this problem and their theoretical guarantees have been extensively studied. While SDR is provably powerful and exact in recovering the least-squares estimator under certain mild conditions, it is not scalable. In contrast, the low-rank factorization is highly efficient but nonconvex, meaning its iterates may get trapped in local minima. To close the gap, we analyze the low-rank approach and focus on understanding when the associated nonconvex optimization landscape is benign, i.e., free of spurious local minima. Recent works suggest that the benignness depends on the condition number of the Hessian at the global minimizer, but it remains unclear whether sharp guarantees can be achieved. In this work, we consider the low-rank approach which corresponds to an optimization problem over the Stiefel manifold ${\\rm St}(p,d)^{\\otimes n}$. By formulating the landscape analysis into another convex optimization problem, we provide a unified characterization of the optimization landscape for all parameter pairs $(p,d)$ with $p \\geq d+2$ for $d\\geq 1$ and $p = d+1$ for $1\\leq d\\leq 3$ which gives a much improved dependence on the condition number of the Hessian. Our results recover the known sharp state-of-the-art bound for $d=1$ which is extremely useful for characterizing the Kuramoto synchronization, and significantly improved the guarantees for the general case $d \\geq 2$ with $p \\geq d+2$ over the existing results. The theoretical results are versatile and applicable to a wide range of examples."}
{"id": "2601.20050", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20050", "abs": "https://arxiv.org/abs/2601.20050", "authors": ["Felipe Lepe", "Gonzalo Rivera"], "title": "A mixed virtual element discretization for the generalized Oseen problem", "comment": null, "summary": "In this paper we introduce a mixed virtual element method to approximate the solution for the two dimensional generalized Oseen problem. We introduce the pseudostress as an additional unknown, which allows to eliminate the pressure from the system; the pressure can be recovered via a post-process of the pseudostress tensor. We prove existence and uniqueness of the continuous solution via a fixed point argument. Under standard mesh assumptions, we develop a virtual element method to approximate both the tensor and the velocity field, and we show that it is stable. Furthermore, we provide a priori error estimates for the method and validate them through a series of numerical tests using different polygonal meshes."}
{"id": "2601.20523", "categories": ["math.PR", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.20523", "abs": "https://arxiv.org/abs/2601.20523", "authors": ["Haiyan Wang", "Melinda Wang"], "title": "Necessary and Sufficient Conditions for Existence of a Unique Solution to Gamma Moment Closure for the Stochastic Ricker Equation", "comment": null, "summary": "This paper investigates the stochastic Ricker difference equation $X_{n+1} = X_n \\exp(r(1-X_n)) \\varepsilon_n$, where $X_n$ is a random variable representing the population size and $\\{\\varepsilon_n\\}$ denotes independent random perturbations with $E[\\varepsilon_n] = 1$ and $E[\\varepsilon_n^2] = v > 1$. We derive a closed system of difference equations for the mean and variance of $X_n$ using the Gamma moment-closure technique and numerically verify the validity of the Gamma moment-closure approximation. By constructing an auxiliary function, we establish the necessary and sufficient condition, $v < (2 - e^{-r})^2$, for the existence of the positive unique feasible equilibrium. We further verify its local stability with numerical analysis. Monte Carlo simulations confirm the validity of the Gamma moment approximation and illustrate how the interplay between the intrinsic growth rate $r$ and noise intensity $v$ determines population persistence. The results provide a unified theoretical framework for analyzing stochastic Gamma dynamics, offering new biological insights into the stabilizing and destabilizing effects of environmental variability."}
{"id": "2601.20341", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.20341", "abs": "https://arxiv.org/abs/2601.20341", "authors": ["Baba Thiam"], "title": "Partial heteroscedastic deconvolution estimation in nonparametric regression", "comment": null, "summary": "In this paper, we consider a partial deconvolution kernel estimator for nonparametric regression when some covariates are measured with error while others are observed without error. We focus on a general and realistic setting in which the measurement errors are heteroscedastic. We propose a kernel-based estimator of the regression function in this framework and show that it achieves the optimal convergence rate under suitable regularity conditions. The finite-sample performance of the proposed estimator is illustrated through simulation studies."}
{"id": "2601.20338", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20338", "abs": "https://arxiv.org/abs/2601.20338", "authors": ["Nam Van Tran"], "title": "A novel neural network with predefined-time stability for solving generalized monotone inclusion problems with applications", "comment": null, "summary": "We propose a novel dynamical framework for solving inclusion\n  problems of the form \\(0 \\in F(x) + G(x)\\) in Hilbert spaces, where \\(F\\) is a\n  maximal set-valued operator and \\(G\\) is a single-valued mapping. The analysis is\n  conducted under a generalized monotonicity assumption, which relaxes the\n  classical monotonicity conditions commonly imposed in the literature and thereby\n  extends the applicability of the proposed approach.\n  Under mild conditions on the system parameters, we establish both fixed-time and\n  predefined-time stability of the resulting dynamical system. The fixed-time\n  stability guarantees a uniform upper bound on the settling time that is\n  independent of the initial condition, whereas the predefined-time stability\n  framework allows the system parameters to be selected \\emph{a priori} in order\n  to ensure convergence within a user-specified time horizon.\n  Moreover, we investigate an explicit forward Euler discretization of the\n  continuous-time dynamics, leading to a novel forward--backward iterative\n  algorithm. A rigorous convergence analysis of the resulting discrete scheme is\n  provided. Finally, the effectiveness and versatility of the proposed method are\n  illustrated through several classes of problems, including constrained\n  optimization problems, mixed variational inequalities, and variational\n  inequalities, together with numerical experiments that corroborate the\n  theoretical results."}
{"id": "2601.20119", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20119", "abs": "https://arxiv.org/abs/2601.20119", "authors": ["Chris Siefert", "Raymond Tuminaro", "Daniel Sunderland"], "title": "Improving Smoothed Aggregation AMG Robustness on Stretched Mesh Applications", "comment": null, "summary": "Strength-of-connection algorithms play a key role in algebraic multigrid (AMG). Specifically, they determine which matrix nonzeros are classified as weak and so ignored when coarsening matrix graphs and defining interpolation sparsity patterns. The general goal is to encourage coarsening only in directions where error can be smoothed and to avoid coarsening across sharp problem variations. Unfortunately, developing robust and inexpensive strength-of-connection schemes is challenging.\n  The classification of matrix nonzeros involves four aspects: (a) choosing a strength-of-connection matrix, (b) scaling its values, (c) choosing a criterion to classify scaled values as strong or weak, and (d) dropping weak entries which includes adjusting matrix values to account for dropped terms. Typically, smoothed aggregation AMG uses the linear system being solved as a strength-of-connection matrix. It scales values symmetrically using square-roots of the matrix diagonal. It classifies based on whether scaled values are above or below a threshold. Finally, it adjusts matrix values by modifying the diagonal so that the sum of entries within each row of the dropped matrix matches that of the original. While these procedures can work well, we illustrate failure cases that motivate alternatives. The first alternative uses a distance Laplacian strength-of-connection matrix. The second centers on non-symmetric scaling. We then investigate alternative classification criteria based on identifying gaps in the values of the scaled entries. Finally, an alternative lumping procedure is proposed where row sums are preserved by modifying all retained matrix entries (as opposed to just diagonal entries). A series of numerical results illustrates trade-offs demonstrating in some cases notably more robust convergence on matrices coming from linear finite elements on stretched meshes."}
{"id": "2601.20616", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.20616", "abs": "https://arxiv.org/abs/2601.20616", "authors": ["Siyu Liang"], "title": "Uniqueness of invariant measures for stochastic damped anisotropic Navier--Stokes equations", "comment": null, "summary": "We study a two-dimensional Navier--Stokes system with anisotropic viscosity, linear damping term, and an additive noise on the whole space $\\mathbb{R}^2$. For this model we prove uniqueness of invariant measures when the damping coefficient is sufficiently large compared to the noise intensity. The argument is based on an asymptotic coupling method and relies on anisotropic energy estimates together with exponential-type estimates for the $H^1$-energy. Since no Poincaré inequality is available on $\\mathbb{R}^2$, the damping term is essential even for the existence of invariant measures. Our result applies to general additive noise without any non-degeneracy condition and remains valid even in the deterministic case $σ\\equiv0$."}
{"id": "2601.20442", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.20442", "abs": "https://arxiv.org/abs/2601.20442", "authors": ["José E. Chacón", "Eduardo García-Portugués", "Andrea Meilán-Vila"], "title": "Blessing of dimensionality in cross-validated bandwidth selection on the sphere", "comment": "25 pages, 6 figures, 2 tables. Supplementary material: 43 pages, 4 figures", "summary": "We study the asymptotic behavior of least-squares cross-validation bandwidth selection in kernel density estimation on the $d$-dimensional hypersphere, $d\\geq 1$. We show that the exact rate of convergence with respect to the optimal bandwidth minimizing the mean integrated squared error, shown to exist under mild non-uniformity conditions, is $n^{-d/(2d+8)}$, thus approaching the $n^{-1/2}$ parametric rate as $d$ grows. This ``blessing of dimensionality'' in bandwidth selection offers theoretical support for utilizing the conceptually simpler cross-validation selector over plug-in techniques for larger dimensions $d$. We compare this result for bandwidth estimation on the $d$-dimensional Euclidean space through explicit expressions for the asymptotic variance functionals. Numerical experiments corroborate the speed of this convergence in an array of scenarios and dimensions, precisely illustrating the tipping dimension where cross-validation outperforms plug-in approaches."}
{"id": "2601.20340", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20340", "abs": "https://arxiv.org/abs/2601.20340", "authors": ["Zhaohua Yang", "Yuxing Zhong", "Ling Shi"], "title": "Data-Driven Structured Control for Continuous-Time LTI Systems", "comment": null, "summary": "This paper addresses the data-driven structured controller design problem for continuous-time linear time-invariant (LTI) systems. We consider three control objectives, including stabilization, $H_2$ performance, and $H_\\infty$ performance. Using the collected data, we construct a minimal matrix ellipsoid that contains all admissible system matrices. We propose some linearization techniques that enable us to incorporate the structural constraint on the controller, which motivates an iterative algorithm for each control objective. Finally, we provide some numerical examples to demonstrate the effectiveness of the proposed methods."}
{"id": "2601.20145", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.20145", "abs": "https://arxiv.org/abs/2601.20145", "authors": ["Xingyuan Lin", "Xiuxiu Lin", "Xuesong Chen"], "title": "Error estimates of $hp$-finite element method for elliptic optimal control problems with robin boundary", "comment": null, "summary": "A priori and a posteriori error analysis of $hp$ finite element method for elliptic control problem with Robin boundary condition and boundary observation are presented. are presented. Through the Clément-type approach and the construction of an auxiliary system, we derived a priori error estimates for the elliptic optimal control problem. Residual-based a posteriori error estimates are derived based on the well-known Scott-Zhang-type quasi-interpolation and coupled state-control approximations, thus establishing an a posteriori error estimator for the $hp$ finite element method. The numerical example demonstrates the accuracy of error estimation for the elliptic optimal control problems with Robin boundary."}
{"id": "2601.20794", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.20794", "abs": "https://arxiv.org/abs/2601.20794", "authors": ["Jiaming Chen"], "title": "Small Ball Probabilities for the Stochastic Heat Equation on Compact Manifolds", "comment": null, "summary": "We consider the stochastic heat equation on a compact smooth Riemannian manifold without boundary satisfying \\begin{equation*} \\partial_tu(t,x)=\\frac{1}{2}Δ_Mu(t,x)+σ(t,x,u)\\dot{W}(t,x),\\quad (t,x)\\in\\mathbb{R}_+\\times M, \\end{equation*} where $\\dot{W}$ is a centered Gaussian noise that is white in time and colored in space. Assuming that $σ$ is Lipschitz in $u$ and uniformly bounded, we estimate small ball probabilities for the solution $u$ when $u(0,x)\\equiv 0$."}
{"id": "2601.20522", "categories": ["math.ST", "cs.DS", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.20522", "abs": "https://arxiv.org/abs/2601.20522", "authors": ["Zhangsong Li"], "title": "Improved Computational Lower Bound of Estimation for Multi-Frequency Group Synchronization", "comment": "22 pages", "summary": "We study the computational phase transition in a multi-frequency group synchronization problem, where pairwise relative measurements of group elements are observed across multiple frequency channels and corrupted by Gaussian noise. Using the framework of \\emph{low-degree polynomial algorithms}, we analyze the task of estimating the structured signal in such observations. We show that, assuming the low-degree heuristic, in synchronization models over the circle group $\\mathsf{SO}(2)$, a simple spectral method is computationally optimal among all polynomial-time estimators when the number of frequencies satisfies $L=n^{o(1)}$. This significantly extends prior work \\cite{KBK24+}, which only applied to a fixed constant number of frequencies. Together with known upper bounds on the statistical threshold \\cite{PWBM18a}, our results establish the existence of a \\emph{statistical-to-computational gap} in this model when the number of frequencies is sufficiently large."}
{"id": "2601.20345", "categories": ["math.OC", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.20345", "abs": "https://arxiv.org/abs/2601.20345", "authors": ["Shivangi Dubey Sharma", "Basil M. Idrees", "Lavish Arora", "Ketan Rajawat"], "title": "Decentralized Stochastic Constrained Optimization via Prox-Linearization", "comment": "18 pages, 6 figures", "summary": "This paper studies consensus-based decentralized stochastic optimization for minimizing possibly non-convex expected objectives with convex non-smooth regularizers and nonlinear functional inequality constraints. We reformulate the constrained problem using the exact-penalty model and develop two algorithms that require only local stochastic gradients and first-order constraint information. The first method, Decentralized Stochastic Momentum-based Prox-Linear Algorithm (D-SMPL), combines constraint linearization with a prox-linear step, resulting in a linearly constrained quadratic subproblem per iteration. Building on this approach, we propose a successive convex approximation (SCA) variant, Decentralized SCA Momentum-based Prox-Linear (D-SCAMPL), which handles additional objective structure through strongly convex surrogate subproblems while still allowing infeasible initialization. Both methods incorporate recursive momentum-based gradient estimators and a consensus mechanism requiring only two communication rounds per iteration. Under standard smoothness and regularity assumptions, both algorithms achieve an oracle complexity of $\\mathcal{O}(ε^{-3/2})$, matching the optimal rate known for unconstrained centralized stochastic non-convex optimization. Numerical experiments on energy-optimal ocean trajectory planning corroborate the theory and demonstrate improved performance over existing decentralized baselines."}
{"id": "2601.20191", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20191", "abs": "https://arxiv.org/abs/2601.20191", "authors": ["Junqing Chen", "Chengzhe Jiang"], "title": "A direct sampling method for magnetic induction tomography", "comment": null, "summary": "This paper proposes a direct sampling method for the inverse problem of magnetic induction tomography (MIT). Our approach defines a class of point spread functions with explicit expressions, which are computed via inner products, leading to a simple and fast imaging process. We then prove that these point spread functions decay with distance, establishing the theoretical basis of the algorithm. Specific expressions for special cases are also derived to visually demonstrate their attenuation pattern. Numerical experimental results further confirm the efficiency and accuracy of the proposed algorithm."}
{"id": "2601.20018", "categories": ["math.ST", "econ.EM", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.20018", "abs": "https://arxiv.org/abs/2601.20018", "authors": ["Mingxuan Zou", "Jingfan Xu", "Peng Ding", "Fang Han"], "title": "Decoupling and randomization for double-indexed permutation statistics", "comment": "42 pages", "summary": "This paper introduces a version of decoupling and randomization to establish concentration inequalities for double-indexed permutation statistics. The results yield, among other applications, a new combinatorial Hanson-Wright inequality and a new combinatorial Bennett inequality. Several illustrative examples from rank-based statistics, graph-based statistics, and causal inference are also provided."}
{"id": "2601.20528", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20528", "abs": "https://arxiv.org/abs/2601.20528", "authors": ["Claudio Durastanti"], "title": "Spectral Bayesian Regression on the Sphere", "comment": "42 pages, 3 figures, 2 tables", "summary": "We develop a fully intrinsic Bayesian framework for nonparametric regression on the unit sphere based on isotropic Gaussian field priors and the harmonic structure induced by the Laplace-Beltrami operator. Under uniform random design, the regression model admits an exact diagonalization in the spherical harmonic basis, yielding a Gaussian sequence representation with frequency-dependent multiplicities.\n  Exploiting this structure, we derive closed-form posterior distributions, optimal spectral truncation schemes, and sharp posterior contraction rates under integrated squared loss. For Gaussian priors with polynomially decaying angular power spectra, including spherical Matérn priors, we establish posterior contraction rates over Sobolev classes, which are minimax-optimal under correct prior calibration.\n  We further show that the posterior mean admits an exact variational characterization as a geometrically intrinsic penalized least-squares estimator, equivalent to a Laplace-Beltrami smoothing spline."}
{"id": "2601.20387", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.20387", "abs": "https://arxiv.org/abs/2601.20387", "authors": ["Zhongqin Gao", "Yan Lv", "Jingmin He"], "title": "Reinforcement Learning for Dividend Optimization in Partially Observed Regime-Switching Diffusion Model", "comment": "41 pages, 4 figures, 3 tables", "summary": "This paper studies the optimal dividend problem with a bounded payout rate in a partially observed regime-switching diffusion model, where, in practice, the market regime is unobserved and key model parameters are unknown. To address this partial-information setting, we propose a continuous-time reinforcement learning (RL) approach within an exploratory (entropy-regularized) stochastic control framework for discounted dividends under regime switching. The associated exploratory Hamilton-Jacobi-Bellman (HJB) system admits semi-analytical characterizations of the value function and the optimal exploratory dividend policy, determined by two unknown functions solving two ordinary differential equations (ODEs) together with positive real roots of the induced quadratic equations. Exploiting this structure, we introduce parametric families for both the value function and the policy, using low-degree polynomial approximations to the ODE solutions. We then develop an actor-critic RL algorithm to learn the optimal exploratory policy through interactions with the market environment: it performs belief-state filtering from observed data and iterates policy evaluation and policy improvement online to refine the policy. Numerical experiments demonstrate strong out-of-sample performance of the learned dividend policies."}
{"id": "2601.20207", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20207", "abs": "https://arxiv.org/abs/2601.20207", "authors": ["Xiaobin Li", "Leevan Ling", "Yizhong Sun"], "title": "Local Regularity Estimation through Sobolev-Scale Norm Profile", "comment": null, "summary": "We develop a kernel-based approach for estimating the spatially varying Sobolev regularity~$s$ of an unknown $d$-variate function~$f$ from scattered sampling data, which quantifies the degree of local differentiability supported by the data. Relying only on neighborhood data near the point of interest $z\\in Ω_z$, our method constructs a sequence of Sobolev-space reproducing kernel interpolants whose kernel smoothness order is specified by an index~$m > d/2$. The native-space norms of these interpolants are evaluated over a bounded range of~$m$, producing a \\emph{Sobolev-scale norm profile}. The elbow of this profile serves as a quantitative probe of the underlying local regularity~$s(Ω_z)$. In particular, when $m > s(Ω_z)$, the profile exhibits rapid, near-worst-case growth governed by the classical upper bound associated with the conditioning of the kernel matrix. A band-limited surrogate analysis explains this transition and establishes a lower-bound relation linking native-norm growth to the Sobolev regularity of~$f$. Two complementary strategies are incorporated for further enhancement: (i)~a \\emph{stencil-shift} subroutine, which repositions local neighborhoods to avoid crossing discontinuities whenever possible, thereby suppressing artifacts in the norm estimates; and (ii)~a local--global \\emph{norm-sweep comparison} strategy that combines short two-point local tails with an optional one-point global screen to detect outlier $Ω_z$ of low Sobolev regularity and accelerate evaluation on large datasets. Numerical experiments on synthetic test functions and turbulent-flow data demonstrate accurate recovery of spatially varying regularity and confirm the robustness of the proposed characterization for kernel-based approximation and differentiation."}
{"id": "2601.20020", "categories": ["math.ST", "math.PR", "stat.CO", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20020", "abs": "https://arxiv.org/abs/2601.20020", "authors": ["Zhirui Li", "Keith D. Levin", "Zhiang Zhao", "Vince Lyzinski"], "title": "Matching and mixing: Matchability of graphs under Markovian error", "comment": "48 pages, 12 figures", "summary": "We consider the problem of graph matching for a sequence of graphs generated under a time-dependent Markov chain noise model. Our edgelighter error model, a variant of the classical lamplighter random walk, iteratively corrupts the graph $G_0$ with edge-dependent noise, creating a sequence of noisy graph copies $(G_t)$. Much of the graph matching literature is focused on anonymization thresholds in edge-independent noise settings, and we establish novel anonymization thresholds in this edge-dependent noise setting when matching $G_0$ and $G_t$. Moreover, we also compare this anonymization threshold with the mixing properties of the Markov chain noise model. We show that when $G_0$ is drawn from an Erdős-Rényi model, the graph matching anonymization threshold and the mixing time of the edgelighter walk are both of order $Θ(n^2\\log n)$. We further demonstrate that for more structured model for $G_0$ (e.g., the Stochastic Block Model), graph matching anonymization can occur in $O(n^α\\log n)$ time for some $α<2$, indicating that anonymization can occur before the Markov chain noise model globally mixes. Through extensive simulations, we verify our theoretical bounds in the settings of Erdős-Rényi random graphs and stochastic block model random graphs, and explore our findings on real-world datasets derived from a Facebook friendship network and a European research institution email communication network."}
{"id": "2601.20399", "categories": ["math.OC", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20399", "abs": "https://arxiv.org/abs/2601.20399", "authors": ["Gaku Omiya", "Pierre-Louis Poirion", "Akiko Takeda"], "title": "Convergence Analysis of Randomized Subspace Normalized SGD under Heavy-Tailed Noise", "comment": "41 pages", "summary": "Randomized subspace methods reduce per-iteration cost; however, in nonconvex optimization, most analyses are expectation-based, and high-probability bounds remain scarce even under sub-Gaussian noise. We first prove that randomized subspace SGD (RS-SGD) admits a high-probability convergence bound under sub-Gaussian noise, achieving the same order of oracle complexity as prior in-expectation results. Motivated by the prevalence of heavy-tailed gradients in modern machine learning, we then propose randomized subspace normalized SGD (RS-NSGD), which integrates direction normalization into subspace updates. Assuming the noise has bounded $p$-th moments, we establish both in-expectation and high-probability convergence guarantees, and show that RS-NSGD can achieve better oracle complexity than full-dimensional normalized SGD."}
{"id": "2601.20212", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20212", "abs": "https://arxiv.org/abs/2601.20212", "authors": ["Lun Ji", "Hang Li", "Alexander Ostermann"], "title": "A low regularity exponential-type integrator for the derivative nonlinear Schrödinger equation", "comment": "20 pages, 6 figures", "summary": "In this work, we present a first-order unfiltered exponential integrator for the one-dimensional derivative nonlinear Schrödinger equation with low regularity. Our analysis shows that for any $s>\\frac12$, the method converges with first-order in $H^s(\\mathbb{T})$ for initial data $u_0\\in H^{s+1}(\\mathbb{T})$. Moreover, we constructed a symmetrized version of this method that performs better in terms of both global error and conservation behavior. To the best of our knowledge, these are the first low regularity integrators for the derivative nonlinear Schrödinger equation. Numerical experiments illustrate our theoretical findings."}
{"id": "2601.20152", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20152", "abs": "https://arxiv.org/abs/2601.20152", "authors": ["Chen Cheng", "Rina Foygel Barber"], "title": "Concentration Inequalities for Exchangeable Tensors and Matrix-valued Data", "comment": "45 pages, 3 figures", "summary": "We study concentration inequalities for structured weighted sums of random data, including (i) tensor inner products and (ii) sequential matrix sums. We are interested in tail bounds and concentration inequalities for those structured weighted sums under exchangeability, extending beyond the classical framework of independent terms.\n  We develop Hoeffding and Bernstein bounds provided with structure-dependent exchangeability. Along the way, we recover known results in weighted sum of exchangeable random variables and i.i.d. sums of random matrices to the optimal constants. Notably, we develop a sharper concentration bound for combinatorial sum of matrix arrays than the results previously derived from Chatterjee's method of exchangeable pairs.\n  For applications, the richer structures provide us with novel analytical tools for estimating the average effect of multi-factor response models and studying fixed-design sketching methods in federated averaging. We apply our results to these problems, and find that our theoretical predictions are corroborated by numerical evidence."}
{"id": "2601.20418", "categories": ["math.OC", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.20418", "abs": "https://arxiv.org/abs/2601.20418", "authors": ["Wenqi Zhu", "Coralia Cartis"], "title": "Sufficiently Regularized Nonnegative Quartic Polynomials are Sum-of-Squares", "comment": null, "summary": "Hilbert's 17th problem famously established that not all nonnegative polynomials admit a sum-of-squares (SoS) representation. Hilbert also identified a few special classes in which nonnegativity and SoS are equivalent, such as univariate polynomials, quadratic polynomials, and bivariate quartic polynomials. In this paper, we extend this equivalence to several new subclasses of multivariate quartically regularized polynomials and characterize the NP-hardness boundary of these special-structure polynomials. Specifically, we consider the global optimization of multivariate symmetric cubic polynomials regularized by weighted quartic powers of the Euclidean norm. These special-structure polynomials arise as iterative subproblems in high-order tensor methods for nonconvex optimization problems. We consider shifting these polynomials by their global optimum so as to make them nonnegative, and show that for sufficiently large regularization parameters and under mild assumptions, these polynomials admit a sum-of-squares representation. We also identify several structured subclasses of quartically regularized cubic polynomials for which global optimality of the model implies that nonnegativity is certified by a sum-of-squares decomposition for all values of the regularization parameter, including quadratic-quartic polynomials and quartic polynomials containing a special cubic term that can be decomposed as the product of a quadratic norm and a linear form. We provide counterexamples based on quartic separable norms that demonstrate the crucial role of the Euclidean norm in these representations. Finally, we illustrate how these SoS-based certificates can be used for Taylor subproblems arising in high-order tensor methods for nonconvex optimization, with encouraging numerical results."}
{"id": "2601.20235", "categories": ["math.NA", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.20235", "abs": "https://arxiv.org/abs/2601.20235", "authors": ["Wenbin Wang", "Yunqing Huang", "Huayi Wei"], "title": "A Unified Variational Functional for Equidistribution and Alignment in Moving Mesh Adaptation", "comment": "28 pages,41 figures", "summary": "Existing variational mesh functionals often suffer from strong nonlinearity or dependence on empirical parameters.We propose a new variational functional for adaptive moving mesh generation that enforces equidistribution and alignment through an $\\boldsymbol A$-pullback formulation, where $\\boldsymbol A=\\boldsymbol J^{-1}\\boldsymbol M^{-1}\\boldsymbol J^{-T}$. The functional combines a trace-based term with a logarithmic determinant term, achieving balanced control of mesh size and anisotropy without empirical parameters. We establish coercivity, polyconvexity, existence of minimizers, and geodesic convexity with respect to the inverse Jacobian, and derive a simplified geometric discretization leading to an efficient moving mesh algorithm. Numerical experiments confirm the theoretical properties and demonstrate robust adaptive behavior for function-induced meshes and Rayleigh-Taylor instability simulations."}
{"id": "2601.20387", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.20387", "abs": "https://arxiv.org/abs/2601.20387", "authors": ["Zhongqin Gao", "Yan Lv", "Jingmin He"], "title": "Reinforcement Learning for Dividend Optimization in Partially Observed Regime-Switching Diffusion Model", "comment": "41 pages, 4 figures, 3 tables", "summary": "This paper studies the optimal dividend problem with a bounded payout rate in a partially observed regime-switching diffusion model, where, in practice, the market regime is unobserved and key model parameters are unknown. To address this partial-information setting, we propose a continuous-time reinforcement learning (RL) approach within an exploratory (entropy-regularized) stochastic control framework for discounted dividends under regime switching. The associated exploratory Hamilton-Jacobi-Bellman (HJB) system admits semi-analytical characterizations of the value function and the optimal exploratory dividend policy, determined by two unknown functions solving two ordinary differential equations (ODEs) together with positive real roots of the induced quadratic equations. Exploiting this structure, we introduce parametric families for both the value function and the policy, using low-degree polynomial approximations to the ODE solutions. We then develop an actor-critic RL algorithm to learn the optimal exploratory policy through interactions with the market environment: it performs belief-state filtering from observed data and iterates policy evaluation and policy improvement online to refine the policy. Numerical experiments demonstrate strong out-of-sample performance of the learned dividend policies."}
{"id": "2601.20443", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20443", "abs": "https://arxiv.org/abs/2601.20443", "authors": ["Shota Takahashi"], "title": "Adaptive Conditional Gradient Sliding: Projection-Free and Line-Search-Free Acceleration", "comment": "24 pages, 10 figures", "summary": "We study convex optimization problems over a compact convex set where projections are expensive but a linear minimization oracle (LMO) is available. We propose the adaptive conditional gradient sliding method (AdCGS), a projection-free and line-search-free method that retains Nesterov's acceleration with adaptive stepsizes based on local Lipschitz estimates. AdCGS combines an accelerated outer scheme with an LMO-based inner routine. It reuses gradients across multiple LMO calls to reduce gradient evaluations, while controlling the subproblem inexactness via a prescribed accuracy level coupled with adaptive stepsizes. We prove accelerated convergence rates for convex objective functions matching those of projection-based accelerated methods, while requiring no projection oracle. For strongly convex objective functions, we further establish linear convergence without additional geometric assumptions on the constraint set, such as polytopes or strongly convex sets. Experiments on constrained $\\ell_p$ regression, logistic regression with real-world datasets, and least-squares problems demonstrate improvements over both projection-free and projection-based baselines."}
{"id": "2601.20243", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20243", "abs": "https://arxiv.org/abs/2601.20243", "authors": ["Peng Yang", "Maodong Pan", "Falai Chen", "Zhimin Zhang"], "title": "Element-based B-spline basis function spaces: construction and application in isogeometric analysis", "comment": "28 pages, 8 figures, 4 tables", "summary": "This paper develops a unified theoretical framework for constructing B-spline basis function spaces with structural equivalence to finite element spaces. The theory rigorously establishes that these bases emerge as explicit linear combinations of B-spline element bases. For any prescribed smoothness requirements, this element-wise formulation enables the Hermite interpolation at nodes, which directly utilizes function values and derivatives without solving global linear systems. By focusing on explicit interpolation properties, element-wise analysis establishes optimal approximation errors, even when the space smoothness attains its theoretical maximum for the space degree. In isogeometric analysis (IgA), the construction naturally decomposes geometric mappings into element-level representations, allowing efficient computations across elements regardless of node distribution. Notably, the same Hermite interpolation framework simultaneously handles domain parameterization and IgA solutions, allowing direct imposition of boundary conditions through function and derivative matching. Numerical tests demonstrate optimal convergence rates and superconvergence properties in 2D IgA under uniform knot configurations, and improved computational efficiency in 3D IgA with non-uniform knot distributions."}
{"id": "2601.20522", "categories": ["math.ST", "cs.DS", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.20522", "abs": "https://arxiv.org/abs/2601.20522", "authors": ["Zhangsong Li"], "title": "Improved Computational Lower Bound of Estimation for Multi-Frequency Group Synchronization", "comment": "22 pages", "summary": "We study the computational phase transition in a multi-frequency group synchronization problem, where pairwise relative measurements of group elements are observed across multiple frequency channels and corrupted by Gaussian noise. Using the framework of \\emph{low-degree polynomial algorithms}, we analyze the task of estimating the structured signal in such observations. We show that, assuming the low-degree heuristic, in synchronization models over the circle group $\\mathsf{SO}(2)$, a simple spectral method is computationally optimal among all polynomial-time estimators when the number of frequencies satisfies $L=n^{o(1)}$. This significantly extends prior work \\cite{KBK24+}, which only applied to a fixed constant number of frequencies. Together with known upper bounds on the statistical threshold \\cite{PWBM18a}, our results establish the existence of a \\emph{statistical-to-computational gap} in this model when the number of frequencies is sufficiently large."}
{"id": "2601.20594", "categories": ["math.OC", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.20594", "abs": "https://arxiv.org/abs/2601.20594", "authors": ["Florentin Münch", "Christian Seifert", "Peter Stollmann", "Martin Tautenhahn"], "title": "On controllability, observability and stabilizability of the heat equation on discrete graphs", "comment": null, "summary": "We consider linear control problems for the heat equation of the form $\\dot f (t) = -Hf (t) + \\mathbf{1}_D u (t)$, $f (0) \\in \\ell_2 (X,m)$, where $H$ is the weighted Laplacian on a discrete graph $(X,b,m)$, and where $D \\subseteq X$ is relatively dense. We show cost-uniform $α$-controllability by means of a weak observability estimate for the corresponding dual observation problem. We discuss optimality of our result as well as consequences on stabilizability properties."}
{"id": "2601.20290", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20290", "abs": "https://arxiv.org/abs/2601.20290", "authors": ["Mou Cai", "Takashi Goda"], "title": "A note on approximation in weighted Korobov spaces via multiple rank-1 lattices", "comment": "25 pages, no figure", "summary": "This paper studies the multivariate approximation of functions in weighted Korobov spaces using multiple rank-1 lattice rules. It has been shown by Kämmerer and Volkmer (2019) that algorithms based on multiple rank-1 lattices achieve the optimal convergence rate for the $L_{\\infty}$ error in Wiener-type spaces, up to logarithmic factors. While this result was translated to weighted Korobov spaces in the recent monograph by Dick, Kritzer, and Pillichshammer (2022), the analysis requires the smoothness parameter $α$ to be greater than $1$ and is restricted to product weights. In this paper, we extend this result for multiple rank-1 lattice-based algorithms to the case where $1/2<α\\le 1$ and for general weights, covering a broader range of periodic functions with low smoothness and general relative importance of variables. We also provide a summability condition on the weights to ensure strong polynomial tractability for any $α>1/2$. Furthermore, by incorporating random shifts into multiple rank-1 lattice-based algorithms, we prove that the resulting randomized algorithm achieves a nearly optimal convergence rate in terms of the worst-case root mean squared $L_2$ error, while retaining the same tractability property."}
{"id": "2601.20528", "categories": ["math.ST", "math.PR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.20528", "abs": "https://arxiv.org/abs/2601.20528", "authors": ["Claudio Durastanti"], "title": "Spectral Bayesian Regression on the Sphere", "comment": "42 pages, 3 figures, 2 tables", "summary": "We develop a fully intrinsic Bayesian framework for nonparametric regression on the unit sphere based on isotropic Gaussian field priors and the harmonic structure induced by the Laplace-Beltrami operator. Under uniform random design, the regression model admits an exact diagonalization in the spherical harmonic basis, yielding a Gaussian sequence representation with frequency-dependent multiplicities.\n  Exploiting this structure, we derive closed-form posterior distributions, optimal spectral truncation schemes, and sharp posterior contraction rates under integrated squared loss. For Gaussian priors with polynomially decaying angular power spectra, including spherical Matérn priors, we establish posterior contraction rates over Sobolev classes, which are minimax-optimal under correct prior calibration.\n  We further show that the posterior mean admits an exact variational characterization as a geometrically intrinsic penalized least-squares estimator, equivalent to a Laplace-Beltrami smoothing spline."}
{"id": "2601.20693", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20693", "abs": "https://arxiv.org/abs/2601.20693", "authors": ["Amirhossein Abbaszadeh", "Hossein Hashemi Doulabi"], "title": "Drone-Aided Blood Collection Routing Problem: A Column Generation Approach", "comment": null, "summary": "Platelet extraction requires whole blood to be processed within six hours of donation. To meet this deadline, blood collection organizations must optimally route a fleet of vehicles to pick up blood units from donation sites and deliver them to a processing center. This paper introduces a drone-aided blood collection routing problem in which a fleet of trucks, each equipped with a drone, operates in a synchronized manner to collect blood units before their processing time limit expires. Each truck-drone tandem can perform multiple trips throughout the planning horizon, allowing donation sites to be visited repeatedly as new blood units become available over time. We formulate this problem as a mixed-integer linear program that jointly optimizes the routing of trucks and drones, pickup schedules, and timing decisions to maximize the total number of viable blood units collected. We also develop a column generation approach that decomposes the problem into a master problem to select the optimal set of truck-drone tours and a pricing subproblem, which is solved using a tailored memetic algorithm to generate promising new columns. Through a comprehensive computational study, we show the operational benefits of integrating drones into the blood collection system. In addition, we demonstrate the superior performance of the proposed algorithm over Gurobi and two metaheuristics from the literature, namely the hybrid genetic algorithm and the invasive weed optimization, in both the drone-aided and truck-only settings."}
{"id": "2601.20407", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20407", "abs": "https://arxiv.org/abs/2601.20407", "authors": ["Bernard Haasdonk", "Gabriele Santin", "Tizian Wenzel", "Daniel Winkle"], "title": "Refined rates of convergence for target-data dependent greedy generalized interpolation with Sobolev kernels", "comment": null, "summary": "Greedy methods have recently been successfully applied to generalized kernel interpolation, or the recovery of a function from data stemming from the evaluation of linear functionals, including the approximation of solutions of linear PDEs by symmetric collocation. When applied to kernels generating Sobolev spaces as their native Hilbert spaces, some of these greedy methods can provide the same error guarantee of generalized interpolation on quasi-uniform points. More importantly, certain target-data-adaptive methods even give a dimension- and smoothness-independent improvement in the speed of convergence over quasi-uniform points, thus offering advantages for high-dimensional problems. These convergence rates however contain a spurious logarithmic term that limits this beneficial effect. The goal of this note is to remove this factor, and this is possible by using estimates on metric entropy numbers."}
{"id": "2601.20697", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20697", "abs": "https://arxiv.org/abs/2601.20697", "authors": ["Yifan Bai", "Clarice Poon", "Jingwei Liang"], "title": "Adaptive Dimension Reduction for Overlapping Group Sparsity", "comment": null, "summary": "Typical dimension reduction techniques for nonoverlapping sparse optimization involve screening or sieving strategies based on a dual certificate derived from the first-order optimality condition, approximating the gradients or exploiting certain inherent low-dimensional structure of the sparse solution. In comparison, dimension reduction rules for overlapping group sparsity are generally less developed because the subgradient structure is more complex, making the link between sparsity pattern and the dual variable indirect due to the non-separability. In this work, we propose new dual certificates for overlapping group sparsity and a novel adaptive scheme for identifying the support of the overlapping group LASSO. We demonstrate how this scheme can be integrated into and significantly accelerate existing algorithms, including Primal-Dual splitting method, alternating direction method of multipliers and a recently developed variable projection scheme based on over-parameterization. We provide convergence analysis of the method and verify its practical effectiveness through experiments on standard datasets."}
{"id": "2601.20456", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20456", "abs": "https://arxiv.org/abs/2601.20456", "authors": ["Ritu Kumari", "Cyrille Kenne", "Landry Djomegne", "Mani Mehra"], "title": "Fokker--Planck Dynamics on Star Graphs with Variable Drift: Well-Posedness, Adjoint Analysis, and Numerical Approximation", "comment": null, "summary": "Stochastic transport processes on networked domains (modelled on metric graphs) arise in a variety of applications where diffusion and drift mechanisms interact with an underlying graph structure. The Fokker--Planck equation provides a natural framework for describing the evolution of probability densities associated with such dynamics. While Fokker--Planck equations on metric graphs have been studied from an analytical viewpoint, their optimal control remains largely unexplored, particularly in settings where the control acts through the drift term. In this paper, we investigate an optimal control problem governed by the Fokker--Planck equation on a star graph, with a bilinear control appearing in the drift. We establish the well-posedness of the state equation and prove the existence of at least one optimal control. The associated adjoint system is derived, and first-order necessary optimality conditions are formulated. A wavelet-based numerical scheme is proposed to approximate the optimal solution, and its performance is illustrated through representative numerical experiments. These results contribute to the analytical and computational understanding of controlled stochastic dynamics on network-like domains."}
{"id": "2601.20811", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.20811", "abs": "https://arxiv.org/abs/2601.20811", "authors": ["Charles Audet", "Andrea Brilli", "Youssef Diouane", "Sébastien Le Digabel", "Everton J. Silva", "Christophe Tribes"], "title": "A penalty-interior point method combined with MADS for equality and inequality constrained optimization", "comment": null, "summary": "This work introduces MADS-PIP, an efficient framework that integrates a penalty-interior point strategy into the mesh adaptive direct search (MADS) algorithm for solving nonsmooth blackbox optimization problems with general inequality and equality constraints. Inequality constraints are partitioned into two subsets: one treated via a logarithmic barrier applied to an aggregated interior constraint violation, and the other handled through an exterior quadratic penalty. All equality constraints are treated by the exterior penalty. A merit function defines a sequence of unconstrained subproblems, which are solved approximately using MADS, while a carefully designed update rule drives the penalty-barrier parameter to zero. In the nonsmooth setting, we establish convergence results ensuring feasibility for general constraints as well as Clarke stationarity for inequality-constrained problems. Computational experiments on both analytical test sets and challenging blackbox problems demonstrate that the proposed MADS-PIP algorithm is competitive with, and often outperforms, MADS with the progressive barrier strategy, particularly in the presence of equality constraints."}
{"id": "2601.20494", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20494", "abs": "https://arxiv.org/abs/2601.20494", "authors": ["Anika Beckers", "Jan Friedrich"], "title": "Monotone-based Numerical Schemes for Two-Dimensional Systems of Nonlocal Conservation Laws", "comment": null, "summary": "We present a class of numerical schemes for two-dimensional systems of nonlocal conservation laws, which are based on utilizing well-known monotone numerical flux functions after suitably approximating the nonlocal terms. The considered systems are weakly coupled by the nonlocal terms and the underlying flux function is rather general to guarantee that our results are applicable to a wide range of common nonlocal models. We state sufficient conditions to ensure the convergence of the monotone-based numerical schemes to the unique weak entropy solution. Moreover, we provide an error estimate that yields the convergence rate of $\\mathcal{O}(\\sqrt{Δt})$ for the numerical approximations of the solution. Our results include an existence and uniqueness proof of the nonlocal system, too. Numerical results illustrate our theoretical findings."}
{"id": "2601.20139", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.20139", "abs": "https://arxiv.org/abs/2601.20139", "authors": ["Nathan Sauldubois"], "title": "Model Risk Static-Hedging a Constrained Distributionally Robust Optimization approach", "comment": null, "summary": "We investigate model risk and distributionally robust optimization (DRO) under marginal and martingale constraints. Building on our previous work, we address the previously open case of static hedging with second-period maturity vanilla options and hedging strategies involving a vanilla payoff. We also extend recent sensitivity results to settings where admissible models must satisfy a martingale coupling constraint. Our approach relies on a weak implicit function theorem argument to construct families of measures satisfying the prescribed constraints. We derive closed-form sensitivity formulas and characterize the corresponding hedging strategies when the underlying process is real-valued."}
{"id": "2601.20566", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20566", "abs": "https://arxiv.org/abs/2601.20566", "authors": ["Chang Hou", "Hu Chen"], "title": "Local convergence analysis of a linearized Alikhanov scheme for the time fractional sine-Gordon equation", "comment": null, "summary": "This paper investigates the time fractional sine-Gordon equation whose solution exhibits a weak singularity of type t^α. By means of the Alikhanov formula we derive a fully discrete, linearized scheme. Using the more general regularity assumption, we derive a sharp truncation-error bound for the fractional derivative. Furthermore, we prove a key inequality and a less restrictive stability result that is valid on general graded temporal meshes. Consequently, the temporal local convergence order is shown to be min{2, r} in H^1-seminorm, where r is the degree of grading; numerical experiments confirm that the optimal rate is already attained as soon as r = 2."}
{"id": "2601.20145", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.20145", "abs": "https://arxiv.org/abs/2601.20145", "authors": ["Xingyuan Lin", "Xiuxiu Lin", "Xuesong Chen"], "title": "Error estimates of $hp$-finite element method for elliptic optimal control problems with robin boundary", "comment": null, "summary": "A priori and a posteriori error analysis of $hp$ finite element method for elliptic control problem with Robin boundary condition and boundary observation are presented. are presented. Through the Clément-type approach and the construction of an auxiliary system, we derived a priori error estimates for the elliptic optimal control problem. Residual-based a posteriori error estimates are derived based on the well-known Scott-Zhang-type quasi-interpolation and coupled state-control approximations, thus establishing an a posteriori error estimator for the $hp$ finite element method. The numerical example demonstrates the accuracy of error estimation for the elliptic optimal control problems with Robin boundary."}
{"id": "2601.20583", "categories": ["math.NA", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.20583", "abs": "https://arxiv.org/abs/2601.20583", "authors": ["Liliana Borcea", "Josselin Garnier", "Alexander V. Mamonov", "Jörn Zimmerling"], "title": "Quantitative synthetic aperture radar inversion", "comment": "Submitted to IEEE Transactions on Antennas and Propagation, keywords: SAR, imaging, multiple scattering, inversion", "summary": "We study an inverse scattering problem for monostatic synthetic aperture radar (SAR): Estimate the wave speed in a heterogeneous, isotropic and nonmagnetic medium probed by waves emitted and measured by a moving antenna. The forward map, from the wave speed to the measurements, is derived from Maxwell's equations. It is a nonlinear map that accounts for multiple scattering and it is very oscillatory at high frequencies. This makes the standard, nonlinear least squares data fitting formulation of the inverse problem difficult to solve. We introduce an alternative, two-step approach: The first step computes the nonlinear map from the measurements to an approximation of the electric field inside the unknown medium aka, the internal wave. This is done for each antenna location in a non-iterative manner.\n  The internal wave fits the data by construction, but it does not solve Maxwell's equations. The second step uses optimization to minimize the discrepancy between the internal wave and the solution of Maxwell's equations, for all antenna locations. The optimization is iterative. The first step defines an imaging function whose computational cost is comparable to that of standard SAR imaging, but it gives a better estimate of the support of targets. Further iterations improve the quantitative estimation of the wave speed. We assess the performance of the method with numerical simulations and compare the results with those of standard inversion."}
{"id": "2601.20677", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20677", "abs": "https://arxiv.org/abs/2601.20677", "authors": ["Philipp Bringmann", "Christoph Lietz", "Dirk Praetorius"], "title": "Unconditional full linear convergence and quasi-optimal complexity of smoothed adaptive finite element methods", "comment": null, "summary": "We present the first rigorous convergence analysis of the smoothed adaptive finite element method (S-AFEM) proposed in [Mulita, Giani, Heltai: SIAM J. Sci. Comput. 43, 2021]. S-AFEM modifies the classical adaptive finite element method (AFEM) by performing accurate discrete solves only on periodically determined mesh levels, while the intermediate levels employ a fixed number of cheap smoothing iterations. Numerical experiments in that work showed that this strategy generates adapted meshes comparable to those of AFEM at substantially lower computational cost. In this paper, we prove unconditional full R-linear convergence of a suitable quasi-error quantity and, for sufficiently small adaptivity parameters, optimal convergence rates with respect to the overall computational cost. The analysis requires only a mild uniform stability assumption on the employed smoother, satisfied by standard methods such as Richardson, Gauss-Seidel, conjugate gradient, and multigrid schemes. Our results apply to general second-order linear elliptic PDEs and show that S-AFEM retains all desired abstract convergence guarantees of AFEM while reducing the cumulative computational time. Numerical experiments validate the theory, analyze runtime performance, and underline the potential of S-AFEM for speed-up in AFEM computations."}
{"id": "2601.20750", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20750", "abs": "https://arxiv.org/abs/2601.20750", "authors": ["Vit Dolejsi", "Jakub Sistek"], "title": "Adaptive domain decomposition method for time-dependent problems with applications in fluid dynamics", "comment": null, "summary": "We deal with the numerical solution of the time-dependent partial differential equations using the adaptive space-time discontinuous Galerkin (DG) method. The discretization leads to a nonlinear algebraic system at each time level, the size of the system is varying due to mesh adaptation. A Newton-like iterative solver leads to a sequence of linear algebraic systems which are solved by GMRES solver with a domain decomposition preconditioner. Particularly, we consider additive and hybrid two-level Schwarz preconditioners which are efficient and easy to implement for DG discretization. We study the convergence of the linear solver in dependence on the number of subdomains and the number of element of the coarse grid. We propose a simplified cost model measuring the computational costs in terms of floating-point operations, the speed of computation, and the wall-clock time for communications among computer cores. Moreover, the cost model serves as a base of the presented adaptive domain decomposition method which chooses the number of subdomains and the number of element of the coarse grid in order to minimize the computational costs. The efficiency of the proposed technique is demonstrated by two benchmark problems of compressible flow simulations."}
{"id": "2601.20781", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20781", "abs": "https://arxiv.org/abs/2601.20781", "authors": ["Jessie Chen", "Hangjie Ji", "Arvind K. Saibaba"], "title": "Optimal Sensor Placement in Gaussian Processes via Column Subset Selection", "comment": null, "summary": "Gaussian process regression uses data measured at sensor locations to reconstruct a spatially dependent function with quantified uncertainty. However, if only a limited number of sensors can be deployed, it is important to determine how to optimally place the sensors to minimize a measure of the uncertainty in the reconstruction. We consider the Bayesian D-optimal criterion to determine the optimal sensor locations by choosing sensors from a candidate set of sensors. Since this is an NP-hard problem, our approach models sensor placement as a column subset selection problem (CSSP) on the covariance matrix, computed using the kernel function on the candidate sensor points. We propose an algorithm that uses the Golub-Klema-Stewart framework (GKS) to select sensors and provide an analysis of lower bounds on the D-optimality of these sensor placements. To reduce the computational cost in the GKS step, we propose and analyze algorithms for the D-optimal sensor placements using Nyström approximations on the covariance matrix. Moreover, we propose several algorithms that select sensors via Nyström approximation of the covariance matrix, utilizing the randomized Nyström approximation, random pivoted Cholesky and greedy pivoted Cholesky. We demonstrate the performance of our method on two applications: thin liquid film dynamics and sea surface temperature."}
{"id": "2601.20799", "categories": ["math.NA", "math-ph", "math.DG", "math.SG"], "pdf": "https://arxiv.org/pdf/2601.20799", "abs": "https://arxiv.org/abs/2601.20799", "authors": ["Adérito Araújo", "Gonçalo Inocêncio Oliveira", "João Nuno Mestre"], "title": "Jacobi Hamiltonian Integrators: construction and applications", "comment": "33 pages, 18 figures", "summary": "We propose a systematic framework for constructing geometric integrators for Hamiltonian systems on Jacobi manifolds. By combining Poissonization of Jacobi structures with homogeneous symplectic bi-realizations, Jacobi dynamics are lifted to homogeneous Poisson Hamiltonian systems, enabling the construction of structure-preserving Jacobi Hamiltonian integrators. The resulting schemes are constructed explicitly and applied to a range of examples, including contact Hamiltonian systems and classical models. Numerical experiments highlight their qualitative advantages over standard integrators, including better preservation of geometric structure and improved long-time behavior."}
{"id": "2601.20807", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.20807", "abs": "https://arxiv.org/abs/2601.20807", "authors": ["Felipe Leppe", "Gonzalo Rivera"], "title": "A locking-free mixed virtual element discretization for the elasticity eigenvalue problem", "comment": null, "summary": "In this paper, we introduce a mixed virtual element method to approximate the eigenvalues and eigenfunctions of the two-dimensional elasticity eigenvalue problem. Under standard assumptions on the meshes, we prove the convergence of the discrete solution operator to the continuous one as the mesh size tends to zero. Using the theory of compact operators, we analyze the convergence of the method and derive error estimates for both the eigenvalues and eigenfunctions. We validate our theoretical results with a series of numerical tests, in which we compute convergence orders and show that the method is locking-free and capable of accurately approximating the spectrum independently of the shape of the polygons on the meshes."}
{"id": "2601.20841", "categories": ["math.NA", "math-ph", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2601.20841", "abs": "https://arxiv.org/abs/2601.20841", "authors": ["Sarah Dennis", "Thomas G. Fai"], "title": "Fast Solvers for the Reynolds Equation on Piecewise Linear Geometries", "comment": "16 pages, 6 figures", "summary": "The Reynolds equation is derived from the incompressible Navier Stokes equations under the lubrication assumptions of a long and thin domain geometry and a small scaled Reynolds number. The Reynolds equation is an elliptic differential equation and a dramatic simplification from the governing equations. When the fluid domain is piecewise linear, the Reynolds equation has an exact solution that we formulate by coupling the exact solutions of each piecewise component. We consider a formulation specifically for piecewise constant heights, and a more general formulation for piecewise linear heights; in both cases the linear system is inverted using the Schur complement. These methods can also be applied in the case of non-linear heights by approximating the height as piecewise constant or piecewise linear, in which case the methods achieve second order accuracy. We assess the time complexity of the two methods, and determine that the method for piecewise linear heights is linear time for the number of piecewise components. As an application of these methods, we explore the limits of validity for lubrication theory by comparing the solutions of the Reynolds and the Stokes equations for a variety of linear and non-linear textured slider geometries."}
