{"id": "2602.16732", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16732", "abs": "https://arxiv.org/abs/2602.16732", "authors": ["Jielin Yang", "Guosheng Fu"], "title": "An entropy-stable oscillation-eliminating dgsem for the euler equations on curvilinear meshes", "comment": null, "summary": "We develop an entropy-stable high-order numerical method for the two-dimensional compressible Euler equations on general curvilinear meshes. The proposed approach is based on a nodal discontinuous Galerkin spectral element method (DGSEM) that satisfies the summation-by-parts (SBP) property. At the semidiscrete level, entropy stability is established through the SBP structure and the discrete metric identities associated with curvilinear coordinate mappings. By incorporating entropy-stable numerical fluxes at element interfaces, a global discrete entropy inequality is obtained. To further control nonphysical oscillations near strong discontinuities, the entropy-stable DG formulation is combined with a modified oscillation-eliminating discontinuous Galerkin (OEDG) method, which was originally proposed in [59]. We observe that the zero-order damping coefficient in the original OEDG method naturally serves as an effective shock indicator, which enables localization of the oscillation control mechanism and significantly reduces computational cost. Moreover, while the original OEDG formulation relies on local orthogonal modal bases and is primarily restricted to simplicial meshes, we reformulate the OE procedure using projection operators, allowing for a systematic extension to general curvilinear meshes. The resulting method preserves conservation and entropy stability while effectively suppressing spurious oscillations. A series of challenging numerical experiments is presented to demonstrate the accuracy, robustness, and effectiveness of the proposed entropy-stable OEDG method on both Cartesian and curvilinear meshes."}
{"id": "2602.16797", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16797", "abs": "https://arxiv.org/abs/2602.16797", "authors": ["Ethan N. Epperly", "Taejun Park", "Yuji Nakatsukasa"], "title": "Fast, High-Accuracy, Randomized Nullspace Computations for Tall Matrices", "comment": "20 pages, 5 figures", "summary": "In this paper, we develop RLOBPCG, an efficient method for computing a small number of singular triplets corresponding to the smallest singular values of large, tall matrices. The algorithm combines randomized preconditioner from the sketch-and-precondition techniques with the LOBPCG eigensolver: a small sketch is used to construct a high-quality preconditioner, and LOBPCG is run on the Gram matrix to refine the singular vector. Under the standard subspace embedding assumption and a modest singular value gap between the two smallest singular values, we prove that RLOBPCG converges geometrically to the minimum singular vector. In numerical experiments, RLOBPCG achieves near-optimal accuracy on matrices with up to $10^6$ rows, outperforming classical LOBPCG and Lanczos methods by a speedup of up to $12\\times$ and maintaining robustness when other iterative methods fail to converge."}
{"id": "2602.16874", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.16874", "abs": "https://arxiv.org/abs/2602.16874", "authors": ["Lenka Ptackova", "Michal Outrata"], "title": "Domain Decomposition for Mean Curvature Flow of Surface Polygonal Meshes", "comment": null, "summary": "We examine the use of domain decomposition for potentially more efficient mean curvature flow of surface meshes, whose faces are arbitrary simple polygons. We first test traditional domain decomposition methods with and without overlap of deconstructed domains. And we present adapted Robin transmission conditions of optimized Schwarz method. We then analyze the resulting smoothing from the point of view of shape quality and texture deformation. By decomposing the initial mesh into two sub-meshes, we solve two smaller boundary value problems instead of one big problem, and we can process these two tasks almost entirely in parallel."}
{"id": "2602.17151", "categories": ["math.NA", "cs.MS", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17151", "abs": "https://arxiv.org/abs/2602.17151", "authors": ["Peter Koepernik", "Thomas Coxon", "James Foster"], "title": "ARCANE: Scalable high-degree cubature formulae for simulating SDEs without Monte Carlo error", "comment": "57 pages", "summary": "Monte Carlo sampling is the standard approach for estimating properties of solutions to stochastic differential equations (SDEs), but accurate estimates require huge sample sizes. Lyons and Victoir (2004) proposed replacing independently sampled Brownian driving paths with \"cubature formulae\", deterministic weighted sets of paths that match Brownian \"signature moments\" up to some degree $D$. They prove that cubature formulae exist for arbitrary $D$, but explicit constructions are difficult and have only reached $D=7$, too small for practical use. We present ARCANE, an algorithm that efficiently and automatically constructs cubature formulae of arbitrary degree. It reproduces the state of the art in seconds and reaches $\\boldsymbol{D=19}$ within hours on modest hardware. In simulations across multiple different SDEs and error metrics, our cubature formulae robustly achieve an error orders of magnitude smaller than Monte Carlo with the same number of paths."}
{"id": "2602.16862", "categories": ["math.OC", "q-fin.PM"], "pdf": "https://arxiv.org/pdf/2602.16862", "abs": "https://arxiv.org/abs/2602.16862", "authors": ["Andy Au"], "title": "Entropy Regularization as Robustness under Bayesian Drift Uncertainty", "comment": "25 pages, 2 figures", "summary": "We study entropy-regularized mean-variance portfolio optimization under Bayesian drift uncertainty. Gaussian policies remain optimal under partial information, the value function is quadratic in wealth, and belief-dependent coefficients admit closed-form solutions. The mean control is identical to deterministic Bayesian Markowitz feedback; entropy regularization affects only the policy variance. Additionally, this variance does not affect information gain, and instead provides belief-dependent robustness. Notably, optimal policy variance increases with posterior conviction $|m_t|$, forcing greater action randomization when mean position is most aggressive."}
{"id": "2602.17466", "categories": ["math.ST", "cs.IT"], "pdf": "https://arxiv.org/pdf/2602.17466", "abs": "https://arxiv.org/abs/2602.17466", "authors": ["Jun Fan", "Jingyu Yang", "Xinyu Zhang", "Liqun Wang"], "title": "Support Recovery and $\\ell_2$-Error Bound for Sparse Regression with Quadratic Measurements via Weakly-Convex-Concave Regularization", "comment": null, "summary": "The recovery of unknown signals from quadratic measurements finds extensive applications in fields such as phase retrieval, power system state estimation, and unlabeled distance geometry. This paper investigates the finite sample properties of weakly convex--concave regularized estimators in high-dimensional quadratic measurements models. By employing a weakly convex--concave penalized least squares approach, we establish support recovery and $\\ell_2$-error bounds for the local minimizer. To solve the corresponding optimization problem, we adopt two proximal gradient strategies, where the proximal step is computed either in closed form or via a weighted $\\ell_1$ approximation, depending on the regularization function. Numerical examples demonstrate the efficacy of the proposed method."}
{"id": "2602.16838", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.16838", "abs": "https://arxiv.org/abs/2602.16838", "authors": ["P. J. Fitzsimmons", "Jay Rosen"], "title": "Ray-Knight theorems for the local times of rebirthed Markov processes", "comment": null, "summary": "We prove generalizations of the first and second Ray-Knight theorems, for a large class of non-symmetric strong Markov processes. These results link the local times of the Markov process with the squares of associated Gaussian processes. This connection allows us to establish results about the exact modulus of continuity (in the spatial variable) of the local times. Our approach is different from earlier treatments which were based on associated permanental processes rather than Gaussian processes.\n  The type of process with which we work can be described as follows. Start with a symmetric Markov process with finite lifetime; upon its death resurrect it at a place in the state space chosen at random, independent of the past. Continue in this way, resurrecting at each death, to obtain a recurrent process. The rebirthing procedure destroys the symmetry of the original process, leading to a large class of non-symmetric processes.\n  The main results are illustrated by many examples."}
{"id": "2602.17344", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.17344", "abs": "https://arxiv.org/abs/2602.17344", "authors": ["Peter Elbau", "Noemi Naujoks"], "title": "Invertibility of the Fourier Diffraction Relation in Raster Scan Diffraction Tomography", "comment": null, "summary": "Diffraction tomography aims to recover an object's scattering potential from measured wave fields. In the classical setting, the object is illuminated by plane waves from many directions, and the Fourier diffraction theorem gives a direct relation between the Fourier transform of the scattering potential of the object and the Fourier transformed measurements.\n  In many practical imaging systems, however, focused beams are used instead of plane waves. These beams are then translated across the object to bring different regions of interest into focus. The Fourier diffraction relation adapted to this setting differs in one crucial point from the plane-wave case: while certain Fourier coefficients of the measurements still directly correspond to individual Fourier coefficients of the scattering potential, others are given by linear combinations of two Fourier coefficients of the scattering potential.\n  This article investigates which Fourier coefficients of the scattering potential can be uniquely recovered from these relations. We show that in dimensions higher than two, all coefficients appearing in the equations are typically uniquely determined. In two dimensions, however, only part of the Fourier coverage is uniquely recoverable, while on the remaining subset, distinct coefficients can produce identical data."}
{"id": "2602.16982", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.16982", "abs": "https://arxiv.org/abs/2602.16982", "authors": ["Jay Paek"], "title": "Dynamics of Nesterov's Accelerated Gradient Descent in Quadratic Games", "comment": null, "summary": "We analyze Nesterov's accelerated gradient descent (NAGD) for Nash equilibrium seeking in $N$-player quadratic games. While the continuous-time NAGD dynamics, specifically the Su-Boyd-Candès ODE, are well understood for convex optimization, their behavior with non-symmetric pseudo-gradient matrices arising in games has not been previously studied. We establish sharp spectral characterizations: stability holds if and only if all eigenvalues of the pseudo-gradient matrix $G$ lie in $\\mathbb{R}_{\\geq 0}$, with the convergence direction additionally requiring diagonalizability of $G$. Remarkably, complex eigenvalues with positive real parts, which ensure stability for first-order gradient dynamics, induce exponential instability in NAGD. This reveals that the momentum mechanism enabling $O(1/t^2)$ convergence in optimization can be detrimental for equilibrium seeking in non-potential games, providing theoretical guidance for algorithm selection."}
{"id": "2602.17565", "categories": ["math.ST", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.17565", "abs": "https://arxiv.org/abs/2602.17565", "authors": ["Hien Dang", "Pratik Patil", "Alessandro Rinaldo"], "title": "Optimal Unconstrained Self-Distillation in Ridge Regression: Strict Improvements, Precise Asymptotics, and One-Shot Tuning", "comment": "78 pages, 25 figures", "summary": "Self-distillation (SD) is the process of retraining a student on a mixture of ground-truth labels and the teacher's own predictions using the same architecture and training data. Although SD has been empirically shown to often improve generalization, its formal guarantees remain limited. We study SD for ridge regression in unconstrained setting in which the mixing weight $ξ$ may be outside the unit interval. Conditioned on the training data and without any distributional assumptions, we prove that for any squared prediction risk (including out-of-distribution), the optimally mixed student strictly improves upon the ridge teacher for every regularization level $λ> 0$ at which the teacher ridge risk $R(λ)$ is nonstationary (i.e., $R'(λ) \\neq 0$). We obtain a closed-form expression for the optimal mixing weight $ξ^\\star(λ)$ for any value of $λ$ and show that it obeys the sign rule: $\\operatorname{sign}(ξ^\\star(λ))=-\\operatorname{sign}(R'(λ))$. In particular, $ξ^\\star(λ)$ can be negative, which is the case in over-regularized regimes. To quantify the risk improvement due to SD, we derive exact deterministic equivalents for the optimal SD risk in the proportional asymptotics regime (where the sample and feature sizes $n$ and $p$ both diverge but their aspect ratio $p/n$ converges) under general anisotropic covariance and deterministic signals. Our asymptotic analysis extends standard second-order ridge deterministic equivalents to their fourth-order analogs using block linearization, which may be of independent interest. From a practical standpoint, we propose a consistent one-shot tuning method to estimate $ξ^\\star$ without grid search, sample splitting, or refitting. Experiments on real-world datasets and pretrained neural network features support our theory and the one-shot tuning method."}
{"id": "2602.16924", "categories": ["math.PR", "cond-mat.stat-mech", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.16924", "abs": "https://arxiv.org/abs/2602.16924", "authors": ["Noé Blassel"], "title": "Overdamped limits for Langevin dynamics with position-dependent coefficients via $L^2$-hypocoercivity", "comment": "28 pages, 1 figure", "summary": "This note provides a simple derivation of the overdamped approximation for kinetic (or underdamped) equilibrium Langevin dynamics, in cases where certain coefficients depend on the position variable. The equivalent small-mass limit of these dynamics, known as the Kramers--Smoluchowski approximation, in the case of a state-dependent friction coefficient, has been previously studied by a variety of approaches. Our new approach uses hypocoercivity estimates, which may be of interest in their own right, and lead to a very direct derivation, providing in particular a clear explanation of the ``noise-induced drift'' term in the overdamped equation in the case of a state-dependent friction term. Using the same approach, we also treat several effective kinetic dynamical models derived from a coarse-graining approximation of a high-dimensional system, as well as a class of kinetic dynamics with position-dependent mass matrices. All of these models are relevant to applications in computational chemistry. We finally identify a mistake in a related work and suggest a solution."}
{"id": "2602.17348", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17348", "abs": "https://arxiv.org/abs/2602.17348", "authors": ["Charles-Edouard Bréhier", "David Cohen", "Lluís Quer-Sardanyons", "Johan Ulander"], "title": "Analysis of an exponential integrator for stochastic PDEs driven by Riesz noise", "comment": null, "summary": "We present and study an explicit exponential integrator for parabolic SPDEs in any dimension driven by a Gaussian noise which is white in time and with spatial correlation given by a Riesz kernel. Under assumptions on the coefficients of the SPDE, we prove strong error bounds and exhibit how the rate of convergence depends on the exponent in the Riesz kernel. Finally, numerical experiments in spatial dimensions $1$ and $2$ are provided in order to confirm our convergence results."}
{"id": "2602.17064", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17064", "abs": "https://arxiv.org/abs/2602.17064", "authors": ["Yifan Bai", "Yantao Li", "Jian Yu", "Jingwei Liang"], "title": "Formalization of Two Fixed-Point Algorithms in Hilbert Spaces", "comment": null, "summary": "Iterative algorithms are fundamental tools for approximating fixed-points of nonexpansive operators in real Hilbert spaces. Among them, Krasnosel'skiĭ--Mann iteration and Halpern iteration are two widely used schemes. In this work, we formalize the convergence of these two fixed-point algorithms in the interactive theorem prover Lean4 based on type dependent theory. To this end, weak convergence and topological properties in the infinite-dimensional real Hilbert space are formalized. Definition and properties of nonexpansive operators are also provided. As a useful tool in convex analysis, we then formalize the Fejér monotone sequence. Building on these foundations, we verify the convergence of both the iteration schemes. Our formalization provides reusable components for machine-checked convergence analysis of fixed-point iterations and theories of convex analysis in real Hilbert spaces. Our code is available at https://github.com/TTony2019/fixed-point-iterations-in-lean."}
{"id": "2602.17587", "categories": ["math.ST", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.17587", "abs": "https://arxiv.org/abs/2602.17587", "authors": ["Alhad Sethi", "Kavali Sofia Sagar", "Shubhada Agrawal", "Debabrota Basu", "P. N. Karthik"], "title": "Asymptotically Optimal Sequential Testing with Markovian Data", "comment": null, "summary": "We study one-sided and $α$-correct sequential hypothesis testing for data generated by an ergodic Markov chain. The null hypothesis is that the unknown transition matrix belongs to a prescribed set $P$ of stochastic matrices, and the alternative corresponds to a disjoint set $Q$. We establish a tight non-asymptotic instance-dependent lower bound on the expected stopping time of any valid sequential test under the alternative. Our novel analysis improves the existing lower bounds, which are either asymptotic or provably sub-optimal in this setting. Our lower bound incorporates both the stationary distribution and the transition structure induced by the unknown Markov chain. We further propose an optimal test whose expected stopping time matches this lower bound asymptotically as $α\\to 0$. We illustrate the usefulness of our framework through applications to sequential detection of model misspecification in Markov Chain Monte Carlo and to testing structural properties, such as the linearity of transition dynamics, in Markov decision processes. Our findings yield a sharp and general characterization of optimal sequential testing procedures under Markovian dependence."}
{"id": "2602.16934", "categories": ["math.PR", "cond-mat.stat-mech"], "pdf": "https://arxiv.org/pdf/2602.16934", "abs": "https://arxiv.org/abs/2602.16934", "authors": ["Duy-Bao Le", "Tuan-Minh Nguyen"], "title": "Once-excited random walks on general trees", "comment": "31 pages, 1 figure", "summary": "We study once-excited random walks on general trees, modeled by placing a single \"cookie\" at each vertex. Each cookie acts as a metaphorical reward that is consumed upon the first visit to the vertex where the cookie is placed. On that initial visit, the walk is in an excited state and behaves like a biased random walk. Once the cookie is consumed, the process reverts to a symmetric random walk on all subsequent visits. We consider a random environment in which the bias parameters are independent random variables. We prove that the process exhibits a sharp phase transition between transience and recurrence on general trees with polynomial growth, where the critical threshold is determined by the branching-ruin number of the tree."}
{"id": "2602.17351", "categories": ["math.NA", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.17351", "abs": "https://arxiv.org/abs/2602.17351", "authors": ["Peter Elbau", "Noemi Naujoks", "Otmar Scherzer"], "title": "Raster Scan Diffraction Tomography", "comment": null, "summary": "Diffraction tomography is a widely used inverse scattering technique for quantitative imaging of weakly scattering media. In its conventional formulation, diffraction tomography assumes monochromatic plane wave illumination. This assumption, however, represents a simplification that often fails to reflect practical imaging systems such as medical ultrasound, where focused beams are used to scan a region of interest of the human body. Such measurement setups, combining focused illumination with scanning, have not yet been incorporated into the diffraction tomography framework. To bridge this gap, we extend diffraction tomography by modeling incident fields as Herglotz waves, thereby incorporating focused beams into the theory. Within this setting, we derive a new Fourier diffraction relation, which forms the basis for quantitative tomographic reconstruction from scanning data. Using this result, we systematically analyze how different scan geometries influence the reconstruction."}
{"id": "2602.17138", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17138", "abs": "https://arxiv.org/abs/2602.17138", "authors": ["Arijit Das"], "title": "Adjoint-based gradient methods for inverse design in a multiple fragmentation model", "comment": null, "summary": "We study an inverse design problem for the linear multiple fragmentation equation arising in particle dynamics. Our objective is to reconstruct an unknown initial size distribution that evolves, under a prescribed fragmentation law, into a desired size distribution at a specified final time. We first establish the existence of global mass-conserving solutions for a broad class of fragmentation kernels with unbounded rates, and subsequently prove the continuous dependence and uniqueness of these solutions under additional assumptions on the fragmentation kernels. We then formulate the inverse design problem as an optimal control problem constrained by the fragmentation dynamics and prove the existence of the optimal control problem. Also derive the corresponding continuous adjoint equation and propose a gradient-type iterative reconstruction method. For the numerical implementation, we develop finite volume schemes for both the forward and adjoint equations, including a weighted finite volume scheme designed to enhance mass conservation and accuracy. Two benchmark problems, involving linear and nonlinear fragmentation rates with known analytical solutions, are used to assess the accuracy and efficiency of the proposed approach and to compare the performance of the two discretizations in both forward simulations and inverse reconstructions."}
{"id": "2602.17006", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17006", "abs": "https://arxiv.org/abs/2602.17006", "authors": ["Christian Hirsch", "Kyeongsik Nam", "Moritz Otto"], "title": "Central limit theorem for linear eigenvalue statistics of random geometric graphs", "comment": "27 pages, 2 figures", "summary": "Random spatial networks-that is, graphs whose connectivity is governed by geometric proximity-have emerged as fundamental models for systems constrained by an underlying spatial structure. A prototypical example is the random geometric graph, obtained by placing vertices according to a Poisson point process and connecting two vertices whenever their Euclidean distance is less than a certain threshold. Despite their broad applicability, the spectral properties of such spatial models remain far less understood than those of classical random graph models, such as Erdős-Rényi graphs and Wigner matrices. The main obstacle is the presence of spatial constraints, which induce highly nontrivial dependencies among edges, placing these models outside the scope of techniques developed for purely combinatorial random graphs.\n  In this paper, we provide the first rigorous analysis of Gaussian fluctuations for linear eigenvalue statistics of random geometric graphs. Specifically, we establish central limit theorems for $\\text{Tr}[φ(A)]$, where $A$ is the adjacency matrix and $φ$ ranges over a broad class of suitable (possibly non-polynomial) test functions. In the polynomial setting, we moreover obtain a quantitative central limit theorem, including an explicit convergence rate to the limiting Gaussian law. We further obtain polynomial-test-function CLTs for other canonical random spatial networks, including $k$-nearest neighbor graphs and relative neighborhood graphs. Our results open new avenues for the study of spectral fluctuations in spatially embedded random structures and underscore the delicate interplay between geometry, local dependence, and spectral behavior."}
{"id": "2602.17353", "categories": ["math.NA", "cs.CV"], "pdf": "https://arxiv.org/pdf/2602.17353", "abs": "https://arxiv.org/abs/2602.17353", "authors": ["Michael Quellmalz", "Mia Kvåle Løvmo", "Simon Moser", "Franziska Strasser", "Monika Ritsch-Marte"], "title": "Application and Evaluation of the Common Circles Method", "comment": null, "summary": "We investigate the application of the common circle method for estimating sample motion in optical diffraction tomography (ODT) of sub-millimeter sized biological tissue. When samples are confined via contact-free acoustical force fields, their motion must be estimated from the captured images. The common circle method identifies intersections of Ewald spheres in Fourier space to determine rotational motion. This paper presents a practical implementation, incorporating temporal consistency constraints to achieve stable reconstructions. Our results on both simulated and real-world data demonstrate that the common circle method provides a computationally efficient alternative to full optimization methods for motion detection."}
{"id": "2602.17392", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17392", "abs": "https://arxiv.org/abs/2602.17392", "authors": ["Warley Almeida Silva", "Margarida Carvalho", "Sanjay Dominik Jena"], "title": "Stackelberg Dynamic Location Planning under Cumulative Demand", "comment": "48 pages, 17 figures", "summary": "Dynamic facility location problems predominantly suppose a monopoly over the service or product provided. Nonetheless, this premise can be a severe oversimplification in the presence of market competitors, as customers may prefer facilities installed by one of them. The monopolistic assumption can particularly worsen planning performance when demand depends on prior location decisions of the market participants, namely, when unmet demand from one period carries over to the next. Such a demand behaviour creates an intrinsic relationship between customer demand and location decisions of all market participants, and requires the decision-maker to anticipate the competitor's response. This work studies a novel competitive facility location problem that combines cumulative demand and market competition to devise high-quality solutions. We propose bilevel mixed-integer programming formulations for two variants of our problem, prove that the optimistic variant is $Σ^{p}_{2}$-hard, and develop branch-and-cut algorithms with tightened value-function cuts that significantly outperform general-purpose bilevel solvers. Our results quantify the severe cost of planning under a monopolistic assumption (profit drops by half on average) and the gains from cooperation over competition (6% more joint profit), while drawing managerial guidelines on how instance attributes and duopolistic modelling choices shape robust location schedules."}
{"id": "2602.17076", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17076", "abs": "https://arxiv.org/abs/2602.17076", "authors": ["Daisuke Shiraishi", "Satomi Watanabe"], "title": "Graph distance and effective resistance of the four-dimensional random walk trace", "comment": "30 pages, no figures", "summary": "Refining previous results, we establish a sharp asymptotic estimate on the expected graph distance between the origin and the terminal point of the trace of the first $n$ steps of the walk. A similar conclusion is drawn for the resistance metric."}
{"id": "2602.17494", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17494", "abs": "https://arxiv.org/abs/2602.17494", "authors": ["Andreas Langer", "Marc Runft", "Talal Rahman", "Xue-Cheng Tai", "Bin Wu"], "title": "Functional Analysis and Parallel Domain Decomposition for the TV-Stokes Model", "comment": null, "summary": "The TV-Stokes model is a two-step variational method for image denoising that combines the estimation of a divergence-free tangent field with total variation regularization in the first step and then uses that to reconstruct the image in the second step. Although effective in practice, its mathematical structure and potential for parallelization have remained unexplored. In this work, we establish a rigorous functional-analytic foundation for the TV-Stokes model. We formulate both steps in appropriate infinite-dimensional function spaces, derive their dual formulations, and analyze the compatibility and mathematical consistency of the coupled system. In particular, we identify analytical inconsistencies in the original formulation and demonstrate how an alternative model resolves them. We also examine the orthogonal projection onto the divergence-free subspace, proving its existence in a continuous setting and establishing consistency with its discrete counterpart.\n  Building on this theoretical framework, we develop the first domain decomposition method for TV-Stokes by applying overlapping Schwarz-type iterations to the duals of both steps. Although the divergence-free constraint gives rise to a global projection operator in the continuous model, we show that it becomes locally computable in the discrete setting. This insight enables a fully parallelizable algorithm suitable for large-scale image processing in memory-constrained environments. Numerical experiments demonstrate the correctness of the domain decomposition approach and its usability in parallel image reconstruction."}
{"id": "2602.17405", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17405", "abs": "https://arxiv.org/abs/2602.17405", "authors": ["Feryal Mashkoorzadeh", "Nooshin Movahedian"], "title": "Optimization Problems with Difference of Tangentially Convex Functions under Uncertainty", "comment": "This article is under review at the Bulletin of the Malaysian Mathematical Sciences Society", "summary": "This paper investigates a specific class of nonsmooth nonconvex optimization problems in the face of data uncertainty, namely, robust optimization problems, where the given objective function can be expressed as a difference of two tangentially convex (DTC) functions. More precisely, we develop a range of nonsmooth calculus rules to establish relationships between Frechet and limiting subdifferentials for a particular maximum function and the tangential subdifferential of its constituent functions. Subsequently, we derive optimality conditions for problems involving DTC functions, employing generalized constraint qualifications within the framework of the tangential subdifferential concept. Several illustrative examples are presented to demonstrate the obtained results."}
{"id": "2602.17087", "categories": ["math.PR", "stat.CO"], "pdf": "https://arxiv.org/pdf/2602.17087", "abs": "https://arxiv.org/abs/2602.17087", "authors": ["Hirofumi Shiba", "Kengo Kamatani"], "title": "Diffusive Scaling Limits of Forward Event-Chain Monte Carlo: Provably Efficient Exploration with Partial Refreshment", "comment": "43 pages, 5 figures", "summary": "Piecewise deterministic Markov process samplers are attractive alternatives to Metropolis--Hastings algorithms. A central design question is how to incorporate partial velocity refreshment to ensure ergodicity without injecting excessive noise. Forward Event-Chain Monte Carlo (FECMC) is a generalization of the Bouncy Particle Sampler (BPS) that addresses this issue through a stochastic reflection mechanism, thereby reducing reliance on global refreshment moves. Despite promising empirical performance, its theoretical efficiency remains largely unexplored.\n  We develop a high-dimensional scaling analysis for standard Gaussian targets and prove that the negative log-density (or potential) process of FECMC converges to an Ornstein--Uhlenbeck diffusion, under the same scaling as BPS. We derive closed-form expressions for the limiting diffusion coefficients of both methods by analyzing their associated radial momentum processes and solving the corresponding Poisson equations. These expressions yield a sharp efficiency comparison: the diffusion coefficient of FECMC is strictly larger than that of optimally tuned BPS, and the optimum for FECMC is attained at zero global refreshment. Specifically, they imply an approximately eightfold increase in effective sample size per event over optimal BPS. Numerical experiments confirm the predicted diffusion coefficients and show that the resulting efficiency gains remain substantial for a range of non-Gaussian targets. Finally, as an application of these results, we propose an asymptotic variance estimator for Piecewise deterministic Markov processes that becomes increasingly efficient in high dimensions by extracting information from the velocity variable."}
{"id": "2602.17507", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17507", "abs": "https://arxiv.org/abs/2602.17507", "authors": ["Boscarino Sebastiano", "Giuseppe Izzo"], "title": "High Order semi-implicit Rosenbrock type and Multistep methods for evolutionary partial differential equations with higher order derivatives", "comment": null, "summary": "The aim of this work is to apply a semi-implicit (SI) strategy within a Rosenbrock-type and IMEX linear multistep (LM) framework to a sequence of 1D time-dependent partial differential equations (PDEs) with high order spatial derivatives. This strategy provides great flexibility to treat these equations, and allows the construction of simple lienarly implicit schemes without any Newton iteration. Furthermore, the SI schemes so designed do not require the severe time-step restrictions typically encountered when using explicit methods for stability, i.e., $Δt = \\mathcal{O}(Δx^k)$ for the $k$-th order PDEs with $k\\ge 2$. For space discrertization, this strategy is combined with finite difference schemes. We provide example of methods up to order $p = 4$, and we illustrate the effectiveness of the schemes with appllications to dissipative, dispersive, and biharmonic-type equations. Numerical experiments show that the proposed schemes are stable and achieve the expected orders of accuracy."}
{"id": "2602.17447", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.17447", "abs": "https://arxiv.org/abs/2602.17447", "authors": ["Guilherme Mazanti", "Laurent Pfeiffer", "Saeed Sadeghi Arjmand"], "title": "A variational mean field game of controls with free final time and pairwise interactions", "comment": null, "summary": "This article considers a mean field game model inspired by crowd motion models in which agents aim at reaching a given target set and wish to minimize a cost consisting of an individual running cost, an individual cost depending on the arrival time at the target set, and an interaction running cost, which takes the form of pairwise interactions with other agents through both positions and velocities. We subsume this game under a more general class of games on abstract Polish spaces with pairwise interactions, and prove that the latter games have a variational structure (in the sense that their equilibria can be characterized as critical points of some potential functional) and admit equilibria. We also discuss two a priori distinct notions of equilibria, providing a sufficient condition under which both notions coincide. The results for the games in abstract Polish spaces are applied to our mean field game model, and a numerical illustration concludes the paper."}
{"id": "2602.17285", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17285", "abs": "https://arxiv.org/abs/2602.17285", "authors": ["Erika Hausenblas", "Ankit Kumar", "Jonas M. Tölle"], "title": "A stochastic Schauder-Tychonoff type theorem and its applications", "comment": null, "summary": "One standard way to prove existence for deterministic, highly nonlinear PDEs is to use the Schauder-Tychonoff fixed-point theorem. In what follows, we introduce and verify a stochastic variant of the Schauder-Tychonoff theorem. We apply our existence result to nonlinear stochastic diffusion equations with non-Lipschitz perturbations"}
{"id": "2602.17516", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.17516", "abs": "https://arxiv.org/abs/2602.17516", "authors": ["Stefano Pozza", "Shazma Zahid"], "title": "Computing the action of a matrix exponential on an interval via the $\\star$-product approach", "comment": null, "summary": "We present a new method for computing the action of the matrix exponential on a vector, $e^{At}v$. The proposed approach efficiently evaluates the solution for all $t$ within a prescribed bounded interval by expanding it into an orthogonal polynomial series. This method is derived from a new representation of the matrix exponential in the so-called $\\star$-algebra, an algebra of bivariate distributions. The resulting formulation leads to a linear system equivalent to a matrix equation of Stein type, which can be solved by either direct or Krylov subspace methods. Numerical experiments demonstrate the accuracy and efficiency of the proposed approach in comparison with state-of-the-art techniques."}
{"id": "2602.17545", "categories": ["math.OC", "cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2602.17545", "abs": "https://arxiv.org/abs/2602.17545", "authors": ["Xiaokai Chen", "Ilya Kuruzov", "Gesualdo Scutari"], "title": "Adaptive Decentralized Composite Optimization via Three-Operator Splitting", "comment": "25 pages, 3 figures", "summary": "The paper studies decentralized optimization over networks, where agents minimize a sum of {\\it locally} smooth (strongly) convex losses and plus a nonsmooth convex extended value term. We propose decentralized methods wherein agents {\\it adaptively} adjust their stepsize via local backtracking procedures coupled with lightweight min-consensus protocols. Our design stems from a three-operator splitting factorization applied to an equivalent reformulation of the problem. The reformulation is endowed with a new BCV preconditioning metric (Bertsekas-O'Connor-Vandenberghe), which enables efficient decentralized implementation and local stepsize adjustments. We establish robust convergence guarantees. Under mere convexity, the proposed methods converge with a sublinear rate. Under strong convexity of the sum-function, and assuming the nonsmooth component is partly smooth, we further prove linear convergence. Numerical experiments corroborate the theory and highlight the effectiveness of the proposed adaptive stepsize strategy."}
{"id": "2602.17289", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17289", "abs": "https://arxiv.org/abs/2602.17289", "authors": ["Andrei-Eugeniu Patularu", "Pim van der Hoorn"], "title": "Limiting Behavior of Degree-Degree Metrics under Local Convergence in Probability", "comment": "24 pages, contains figures and proofs; will be resubmitted to Electronic Journal of Probability (EJP)", "summary": "This paper investigates the limiting behaviour of degree-degree correlation metrics for sequences of random graphs under a general assumption of local convergence in probability. We establish convergence results for Pearson's correlation coefficient r, Spearman's rho, Kendall's tau, average nearest neighbour degree (ANND), and average nearest neighbour rank (ANNR). Our results explicitly show how the limits of these degree-degree correlation metrics depend on the local structure of the graph. We then apply our general results to study degree-degree correlations in rank-1 inhomogeneous random graphs and random geometric graphs, deriving explicit expressions for ANND in both models and for Pearson's correlation coefficient in the latter one.\n  Keywords: random graphs, degree-degree metrics, neutral mixing"}
{"id": "2602.17578", "categories": ["math.OC", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17578", "abs": "https://arxiv.org/abs/2602.17578", "authors": ["Gabriele Bolli", "Filippo de Feo"], "title": "Optimal control of stochastic Volterra integral equations with completely monotone kernels and stochastic differential equations on Hilbert spaces with unbounded control and diffusion operators", "comment": null, "summary": "The dynamic programming approach is one of the most powerful ones in optimal control. However, when dealing with optimal control problems of stochastic Volterra integral equations (SVIEs) with completely monotone kernels, deep mathematical difficulties arise and it is still not understood. These very classical problems have applications in most fields and have now become even more popular due to their applications in mathematical finance under rough volatility. In this article, we consider a class of optimal control problems of SVIEs with completely monotone kernels. Via a recent Markovian lift \\cite{FGW2024}, the problem can be reformulated as an optimal control problem of stochastic differential equations (SDEs) on suitable Hilbert spaces, which due to the roughness of the kernel, presents a generator of an analytic semigroup and unbounded control and diffusion operators.\n  This analysis leads us to study a general class of optimal control problems of abstract SDEs on Hilbert spaces with unbounded control and diffusion operators. This class includes optimal control problems of SVIEs with completely monotone kernels, but it is also motivated by other models. We analyze the regularity of the associated Ornstein-Uhlenbeck transition semigroup. We prove that the semigroup exhibits a new smoothing property in control directions through a general observation operator $Γ$, which we call $Γ$-smoothing. This allows us to establish existence and uniqueness of mild solutions of the Hamilton-Jacobi-Bellman equation, establish a verification theorem, and construct optimal feedback controls. We apply these results to optimal control problems of SVIEs with completely monotone kernels. To the best of our knowledge these are the first results of this kind for this abstract class of infinite dimensional problems and for the optimal control of SVIEs with completely monotone kernels."}
{"id": "2602.17305", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17305", "abs": "https://arxiv.org/abs/2602.17305", "authors": ["Justin Salez"], "title": "Hyper-contractivity and entropy decay in discrete time", "comment": "7 pages, comments welcome!", "summary": "Consider a measure-preserving transition kernel $T$ on an arbitrary probability space $(\\mathbb X,\\mathcal cA,π)$. In this level of generality, we prove that a one-step hyper-contractivity estimate of the form $\\|T\\|_{p\\to q}\\le 1$ with $p< q$ implies a one-step entropy contraction estimate of the form ${\\mathrm H}(μT\\,|\\,π)\\le θ\\, {\\mathrm H}(μ\\,|\\,π)$, with $θ=p/q$. Neither reversibility, nor any sort of regularity is required. This static implication is simultaneously simpler and stronger than the celebrated dynamic relation between exponential hyper-contractivity and exponential entropy decay along continuous-time Markov semi-groups."}
{"id": "2602.17319", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17319", "abs": "https://arxiv.org/abs/2602.17319", "authors": ["Rik Versendaal"], "title": "Quenched large deviations for randomly weighted geodesic random walks", "comment": null, "summary": "We consider weighted geodesic random walks in a complete Riemannian manifold $(M,g)$. We show that for almost all sequences of weights (with respect to a suitable measure), these weighted geodesic random walks satisfy, when suitably scaled, a large deviation principle with a universal rate function. This extends the results from [3], where this was shown for the real-valued case. It turns out the argument is also valid for general vector spaces. This allows us to use the methodology of [9], in which large deviations for geodesic random walks are obtained from large deviation estimates for associated random walks in tangent spaces."}
{"id": "2602.17339", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17339", "abs": "https://arxiv.org/abs/2602.17339", "authors": ["Xin Chen", "Jian Wang", "Kun Yin"], "title": "Stochastic homogenization of diffusions in turbulence driven by non-local symmetric Lévy operators", "comment": "37 pages", "summary": "We investigate the stochastic homogenization of a class of turbulent diffusions generated by non-local symmetric Lévy operators with divergence-free drift fields in ergodic random environments, where neither the drift fields nor their associated stream functions are assumed to be bounded. A pivotal step in our proof is the establishment of $W_{loc}^{1,q}$ estimates with $q\\in (1,2)$ for the corresponding correctors, under mild prior regularity conditions imposed on the Lévy measure and the stream function."}
{"id": "2602.17369", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.17369", "abs": "https://arxiv.org/abs/2602.17369", "authors": ["Máté Gerencsér", "Yueh-Sheng Hsu"], "title": "Variance renormalisation in regularity structures -- the case of $2d$ gPAM", "comment": null, "summary": "We consider the variance renormalisation of a singular SPDE for which a Da Prato-Debussche trick is not applicable. The example taken is the $2$-dimensional generalised parabolic Anderson model (gPAM), driven by a much rougher than white noise, necessitating both a multiplicative and an additive renormalisation. To handle the discrepancy between the regularity structures of the approximate and the limiting equations, we consider models that lift $0$ noises to nontrivial models, in analogy with ``pure area'' from rough paths. The convergence to such a model is shown for the BPHZ model over the vanishing noise via graphical computations."}
{"id": "2602.17437", "categories": ["math.PR", "math.AP", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.17437", "abs": "https://arxiv.org/abs/2602.17437", "authors": ["Yvain Bruned", "Yingtong Hou", "Paul Laubie", "Zhicheng Zhu"], "title": "Banach fixed point and flow approach for rough analysis", "comment": null, "summary": "In this paper, we show that the main algebraic assumption required to perform a fixed point argument for rough differential equations implies the algebraic assumption for the Bailleul flow approach. This assumption requires that the rough path associated with the equation is given by a Hopf algebra whose coproduct admits a cocycle and has a tree-like basis. We show that the Hopf algebra of multi-indices does not satisfy the cocycle condition. This is a rigorous result on the impossibility, observed in practice, of performing a fixed point argument for multi-indices rough paths and multi-indices in Regularity Structures."}
{"id": "2602.17495", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.17495", "abs": "https://arxiv.org/abs/2602.17495", "authors": ["Andrea Di Primio", "Marvin Fritz", "Luca Scarpa", "Margherita Zanella"], "title": "An Allen-Cahn equation with jump-diffusion noise for biological damage and repair processes", "comment": null, "summary": "This paper analyzes a stochastic Allen--Cahn equation for the dynamics of biomolecular damage and repair. The system is driven by two distinct noise processes: a multiplicative cylindrical Wiener process, modeling continuous background stochastic fluctuations, and a jump-type noise, modeling the abrupt, localized damage induced by external shocks. The drift of the equation is singular and covers the typical logarithmic Flory-Huggins potential required in phase-separation dynamics. We prove well-posedness of the model in a strong probabilistic sense, and analyze its long-time behavior in terms of existence and uniqueness of invariant measures, ergodicity, and mixing properties. Eventually, we present an Euler--Maruyama scheme to simulate the model and illustrate how it captures fundamental biological phenomena, such as damage clustering, stress-induced topology perturbations, and damage dynamics."}
{"id": "2602.17579", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2602.17579", "abs": "https://arxiv.org/abs/2602.17579", "authors": ["Bastian Hilder", "Patrick van Meurs", "Upanshu Sharma"], "title": "Non-equilibrium functional inequalities for finite Markov chains", "comment": "35 pages, 2 figures", "summary": "Functional inequalities such as the Poincaré and log-Sobolev inequalities quantify convergence to equilibrium in continuous-time Markov chains by linking generator properties to variance and entropy decay. However, many applications, including multiscale and non-reversible dynamics, require analysing probability measures that are not at equilibrium, where the classical theory tied to steady states no longer applies. We introduce generalised versions of these inequalities for arbitrary positive measures on a finite state space, retaining key structural properties of their classical counterparts. In particular, we prove continuity of the associated constants with respect to the reference measure and establish explicit positive lower bounds. As an application, we derive quantitative coarse-graining error estimates for non-reversible Markov chains, both with and without explicit scale separation, and propose a quantitative criterion for assessing the quality of coarse-graining maps."}
{"id": "2602.17628", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.17628", "abs": "https://arxiv.org/abs/2602.17628", "authors": ["Giorgio Cipolloni", "László Erdős", "Oleksii Kolupaiev"], "title": "The eigenvalues of i.i.d. matrices are hyperuniform", "comment": "58 pages + 41 page of supplemental materials, 1 figure", "summary": "We prove that the point process of the eigenvalues of real or complex non-Hermitian matrices $X$ with independent, identically distributed entries is hyperuniform: the variance of the number of eigenvalues in a subdomain $Ω$ of the spectrum is much smaller than the volume of $Ω$. Our main technical novelty is a very precise computation of the covariance between the resolvents of the Hermitization of $X-z_1, X-z_2$, for two distinct complex parameters $z_1,z_2$."}
{"id": "2602.17151", "categories": ["math.NA", "cs.MS", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17151", "abs": "https://arxiv.org/abs/2602.17151", "authors": ["Peter Koepernik", "Thomas Coxon", "James Foster"], "title": "ARCANE: Scalable high-degree cubature formulae for simulating SDEs without Monte Carlo error", "comment": "57 pages", "summary": "Monte Carlo sampling is the standard approach for estimating properties of solutions to stochastic differential equations (SDEs), but accurate estimates require huge sample sizes. Lyons and Victoir (2004) proposed replacing independently sampled Brownian driving paths with \"cubature formulae\", deterministic weighted sets of paths that match Brownian \"signature moments\" up to some degree $D$. They prove that cubature formulae exist for arbitrary $D$, but explicit constructions are difficult and have only reached $D=7$, too small for practical use. We present ARCANE, an algorithm that efficiently and automatically constructs cubature formulae of arbitrary degree. It reproduces the state of the art in seconds and reaches $\\boldsymbol{D=19}$ within hours on modest hardware. In simulations across multiple different SDEs and error metrics, our cubature formulae robustly achieve an error orders of magnitude smaller than Monte Carlo with the same number of paths."}
{"id": "2602.17348", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17348", "abs": "https://arxiv.org/abs/2602.17348", "authors": ["Charles-Edouard Bréhier", "David Cohen", "Lluís Quer-Sardanyons", "Johan Ulander"], "title": "Analysis of an exponential integrator for stochastic PDEs driven by Riesz noise", "comment": null, "summary": "We present and study an explicit exponential integrator for parabolic SPDEs in any dimension driven by a Gaussian noise which is white in time and with spatial correlation given by a Riesz kernel. Under assumptions on the coefficients of the SPDE, we prove strong error bounds and exhibit how the rate of convergence depends on the exponent in the Riesz kernel. Finally, numerical experiments in spatial dimensions $1$ and $2$ are provided in order to confirm our convergence results."}
{"id": "2602.17578", "categories": ["math.OC", "math.AP", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17578", "abs": "https://arxiv.org/abs/2602.17578", "authors": ["Gabriele Bolli", "Filippo de Feo"], "title": "Optimal control of stochastic Volterra integral equations with completely monotone kernels and stochastic differential equations on Hilbert spaces with unbounded control and diffusion operators", "comment": null, "summary": "The dynamic programming approach is one of the most powerful ones in optimal control. However, when dealing with optimal control problems of stochastic Volterra integral equations (SVIEs) with completely monotone kernels, deep mathematical difficulties arise and it is still not understood. These very classical problems have applications in most fields and have now become even more popular due to their applications in mathematical finance under rough volatility. In this article, we consider a class of optimal control problems of SVIEs with completely monotone kernels. Via a recent Markovian lift \\cite{FGW2024}, the problem can be reformulated as an optimal control problem of stochastic differential equations (SDEs) on suitable Hilbert spaces, which due to the roughness of the kernel, presents a generator of an analytic semigroup and unbounded control and diffusion operators.\n  This analysis leads us to study a general class of optimal control problems of abstract SDEs on Hilbert spaces with unbounded control and diffusion operators. This class includes optimal control problems of SVIEs with completely monotone kernels, but it is also motivated by other models. We analyze the regularity of the associated Ornstein-Uhlenbeck transition semigroup. We prove that the semigroup exhibits a new smoothing property in control directions through a general observation operator $Γ$, which we call $Γ$-smoothing. This allows us to establish existence and uniqueness of mild solutions of the Hamilton-Jacobi-Bellman equation, establish a verification theorem, and construct optimal feedback controls. We apply these results to optimal control problems of SVIEs with completely monotone kernels. To the best of our knowledge these are the first results of this kind for this abstract class of infinite dimensional problems and for the optimal control of SVIEs with completely monotone kernels."}
