{"id": "2602.20282", "categories": ["math.NA", "cs.DM"], "pdf": "https://arxiv.org/pdf/2602.20282", "abs": "https://arxiv.org/abs/2602.20282", "authors": ["Egor P. Berezin", "Robert T. Zaks", "German Z. Alekhin", "Stanislav V. Morozov", "Sergey A. Matveev"], "title": "Two approaches to low-parametric SimRank computation", "comment": "13 pages, 3 figures, 1 table, 3 algorithms, 24 references", "summary": "In this work, we discuss low-parametric approaches for approximating SimRank matrices, which estimate the similarity between pairs of nodes in a graph. Although SimRank matrices and their computation require a significant amount of memory, common approaches mostly address the problem of algorithmic complexity. We propose two major formats for the economical embedding of target data. The first approach adopts a non-symmetric form that can be computed using a specialized alternating optimization algorithm. The second is based on a symmetric representation and Newton-type iterations. We propose numerical implementations for both methodologies that avoid working with dense matrices and maintain low memory consumption. Furthermore, we study both types of embeddings numerically using real data from publicly available datasets. The results show that our algorithms yield a good approximation of the SimRank matrices, both in terms of the error norm (particularly the Chebyshev norm) and in preserving the average number of the most similar elements for each given node."}
{"id": "2602.20390", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.20390", "abs": "https://arxiv.org/abs/2602.20390", "authors": ["James Chen", "Alan Edelman", "John Urschel"], "title": "The largest 5th pivot may be the root of a 61st degree polynomial", "comment": null, "summary": "This paper introduces a number of new techniques in the study of the famous question from numerical linear algebra: what is the largest possible growth factor when performing Gaussian elimination with complete pivoting? This question is highly complex, due to a complicated set of polynomial inequalities that need to be simultaneously satisfied. This paper introduces the JuMP + Groebner basis + discriminant polynomial approach as well as the use of interval arithmetic computations. Thus, we are introducing a marriage of numerical and exact mathematical computations.\n  In 1988, Day and Peterson performed numerical optimization on $n=5$ with NPSOL and obtained a largest seen value of $4.1325...$. This same best value was reproduced by Gould with LANCELOT in 1991. We ran extensive comparable experiments with the modern software tool JuMP and also saw the same value $4.1325...$. While the combinatorial explosion of possibilities prevents us from knowing there may not be a larger maximum, we succeed in obtaining the exact mathematical value: the number $4.1325...$ is exactly the root of a 61st degree polynomial provided in this work, and is a maximum given the equality constraints seen by JuMP. In light of the numerics, we pose the conjecture that this lower bound is indeed the maximum. We also apply this technique to $n = 6$, $7$, and $8$.\n  Furthermore, in 1969, an upper bound of $4\\frac{17}{18}\\approx 4.94$ was produced for the maximum possible growth for $n = 5$. We slightly lower this upper bound to $4.84$."}
{"id": "2602.20395", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.20395", "abs": "https://arxiv.org/abs/2602.20395", "authors": ["Tristan Goodwill", "Jeremy Hoskins", "Zydrunas Gimbutas", "Bowei Wu"], "title": "A parametrix for the surface Stokes equation", "comment": null, "summary": "We introduce an integral equation formulation of the surface Stokes equations, constructed using two-dimensional Stokeslets. The resulting integral equations are Fredholm integral equations of the second kind and can be discretized to high order using standard tools. Since the resulting discrete linear systems are dense, we describe and analyze a proxy shell method to construct fast direct solvers for these systems. The properties of our integral equation, and the performance of the resulting numerical scheme, are illustrated with several representative numerical examples."}
{"id": "2602.20679", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.20679", "abs": "https://arxiv.org/abs/2602.20679", "authors": ["Andreu Martorell", "Pep Mulet", "Dionisio F. Yáñez"], "title": "Implicit-explicit all-speed schemes for compressible Cahn-Hilliard-Navier-Stokes equations", "comment": null, "summary": "We propose a second-order implicit-explicit (IMEX) time-stepping scheme for the isentropic, compressible Cahn-Hilliard-Navier-Stokes equations in the low Mach number regime.\n  The method is based on finite differences on staggered grids and is specifically designed to handle the challenges posed by the low Mach number limit, where the system approaches to an incompressible behavior.\n  In this regime, standard explicit schemes suffer from severe time-step restrictions due to fourth-order diffusion terms and the stiffness induced by fast acoustic waves.\n  To overcome this, we employ an IMEX strategy which splits the governing equations into stiff and non-stiff components.\n  The stiff terms, arising from pressure, viscous forces and fourth-order Cahn-Hilliard contributions, are treated implicitly, while the remaining are dealt explicitly."}
{"id": "2602.20266", "categories": ["math.PR", "math.ST", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2602.20266", "abs": "https://arxiv.org/abs/2602.20266", "authors": ["Cristina Costantini", "Matteo Ruggiero"], "title": "Multiple Poisson-Dirichlet diffusions on generalized Kingman simplices", "comment": null, "summary": "We construct a new class of infinite-dimensional diffusions taking values in a generalized Kingman simplex. Our model describes the temporal evolution of the relative frequencies of infinitely-many types which are \"labeled\" by an arbitrary finite number of marks or colors, but \"unlabeled\" within each mark. We start with a finite-dimensional construction which extends to Wright-Fisher diffusions a self-similarity property known for Dirichlet distributions, and corresponds to a multiple skew-product representation of the Wright-Fisher diffusion relative to the marks in the population. After ranking decreasingly the frequencies within each mark, we identify the limit in distribution of the resulting diffusion when the number of types for each mark goes to infinity, and describe its infinitesimal operator. The limiting process reduces to a diffusion in the Thoma simplex in the special case of only two marks, whereas the infinitely-many-neutral-alleles model is recovered when all frequencies have the same mark. The stationary measure of the limit diffusion is shown to be the recently introduced multiple Poisson-Dirichlet distribution, which extends Kingman's Poisson-Dirichlet distribution and is the de Finetti representing measure for a family of random partitions whose elements are marked."}
{"id": "2602.20371", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.20371", "abs": "https://arxiv.org/abs/2602.20371", "authors": ["Magid Sabbagh", "David A. Stephens"], "title": "Semi-parametric Bayesian inference under Neyman orthogonality", "comment": "18 pages", "summary": "The validity of two-step or plug-in inference methods is questioned in the Bayesian framework. We study semi-parametric models where the plug-in of a non-parametrically modelled nuisance component is used. We show that when the nuisance and targeted parameters satisfy a Neyman orthogonal score property, the approach of cutting feedback through a two-step procedure is a valid way of conducting Bayesian inference. Our method relies on a non-parametric Bayesian formulation based on the Dirichlet process and the Bayesian bootstrap. We show that the marginal posterior of the targeted parameter exhibits good frequentist properties despite not accounting for the inferential uncertainty of the nuisance parameter. We adopt this approach in Bayesian causal inference problems where the nuisance propensity score model is estimated to obtain marginal inference for the treatment effect parameter, and demonstrate that a plug-in of the propensity score has a negligible effect on marginal posterior inference for the causal contrast. We investigate the absence of Neyman orthogonality and exploit our findings to show that in conventional two-step procedures, the posterior distribution converges under weaker restrictions than those needed in the frequentist sequel. For a simple family of useful scores, we demonstrate that even in the absence of Neyman orthogonality, the posterior distribution is asymptotically unchanged by the estimation of the nuisance parameter, merely provided the latter estimator is consistent."}
{"id": "2602.20310", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.20310", "abs": "https://arxiv.org/abs/2602.20310", "authors": ["Ke Xu", "John Gunnar Carlsson"], "title": "A unified solution framework for truck-and-drone routing problems", "comment": null, "summary": "Coordinated truck-and-drone routing integrates the high capacity and range of ground vehicles with the flexible routing and speed of drones, enabling simultaneous service. Increasingly applied in last-mile delivery, this synchronization helps reduce completion time and operational costs. To improve its efficiency, various coordination modes between trucks and drones have been proposed. Each mode accommodates diverse operational constraints tailored to particular delivery requirements. In existing work, a slight change in the structural framework or operational characteristics could generate a totally different problem variant, which often requires the design of specialized algorithms. Consequently, under the requirement of maintaining structural validation and adapting to multiple operational features, this paper presents a unified three-phase solution framework based on the Lin-Kernighan-Helsgaun algorithm to solve a wide family of truck-and-drone routing problems. To validate its flexibility and effectiveness, we carry out numerical experiments on three problem variants: the Flying Sidekick Traveling Salesman Problem (FSTSP), the Traveling Salesman Problem with Multiple Drones (TSP-mD), and the Vehicle Routing Problem with Drones (VRP-D), benchmarking each against an effective algorithm. Computational results show that the framework can closely match optimal solutions on small-size instances and even improve the best-known solutions for several medium-size instances. Moreover, additional extensions are discussed to further highlight its versatility."}
{"id": "2602.20697", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.20697", "abs": "https://arxiv.org/abs/2602.20697", "authors": ["Vladimír Lukeš", "Eduard Rohan"], "title": "Reduced-order computational homogenization for hyperelastic media using gradient based sensitivity analysis of microstructures", "comment": null, "summary": "We propose an algorithm for the computational homogenization of locally periodic hyperelastic structures undergoing large deformations due to external quasi-static loading. The algorithm performs clustering of macroscopic deformations into subsets called \"centroids\", and, as a new ingredient, approximates the homogenized coefficients using sensitivity analysis of micro-configurations with respect to the macroscopic deformation. The novel \"model-order reduction\" approach significantly reduces the number of microscopic problems that must be solved in nonlinear simulations, thereby accelerating the overall computational process. The degree of reduction can be controlled by a user-defined error tolerance parameter. The algorithm is implemented in the finite element framework SfePy, and its performance effectiveness is demonstrated using two-dimensional test examples, when compared with solutions obtained by the proper orthogonal decomposition method, and by the full \"FE-square\" simulations. Extensions beyond the present implementations and the scope of tractable problems are discussed."}
{"id": "2602.20416", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.20416", "abs": "https://arxiv.org/abs/2602.20416", "authors": ["Gane Samb Lo", "El Hadji Babou"], "title": "Independence of the indicator functions of record values for Multivariate independent data", "comment": null, "summary": "We consider a sequence of random vectors on \\(\\mathbb{R}^d, \\ d\\geq 1\\). We consider the record values based on the simultaneous strict inequality of the coordinates. The indicator record variable (irv) of the j-th observation is the function that assigns the value 1 (one) if that observation is a record value and the null value otherwise. Here, we give a detailed and a thorough proof that the indicator functions are independent, whenever the data are themselves independent, not necessarily <i>iid</i>, in \\(\\mathbb{R}^d, \\ d\\geq 1\\). We compare that proof with available proofs in dimension one. Indeed, in seminal works on records, in particular in Ahsanullah(2024), Nevzorov(2001), Resnick (1987), Ahsanullah and Nevzorov (2015), etc., the independence of record indicator functions is usually validated based on logical reasoning, and so, is not rigorously proved. This allows us to undertake a detailed and thorough proof for independent data, not necessity <i>iid</i>, in \\(\\mathbb{R}^d, \\ d\\geq 1\\). The proof includes leads for not even independent data."}
{"id": "2602.20640", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.20640", "abs": "https://arxiv.org/abs/2602.20640", "authors": ["Razak Christophe Sabi Gninkou", "Andrés F. López-Lopera", "Franck Massa", "Rodolphe Le Riche"], "title": "Scalable multitask Gaussian processes for complex mechanical systems with functional covariates", "comment": null, "summary": "Functional covariates arise in many scientific and engineering applications when model inputs take the form of time-dependent or spatially distributed profiles, such as varying boundary conditions or changing material behaviours. In addition, new practices in digital simulation require predictions accompanied by confidence intervals. Models based on Gaussian processes (GPs) provide principled uncertainty quantification. However, GPs capable of jointly handling functional covariates and multiple correlated functional tasks remain largely under-explored. In this work, we extend the framework of GPs with functional covariates to multitask problems by introducing a fully separable kernel structure that captures dependencies across tasks and functional inputs. By taking advantage of the Kronecker structure of the covariance matrix, the model is made scalable. The proposed model is validated on a synthetic benchmark and applied to a realistic structure, a riveted assembly with functional descriptions of the material behaviour and response forces. The proposed functional multitask GP significantly improves over single task GPs. For the riveted assembly, it requires less than 100 samples to produce an accurate mean and confidence interval prediction. Despite its larger number of parameters, the multitask GP is computationally easier to learn than its single task pendant."}
{"id": "2602.20326", "categories": ["math.OC", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.20326", "abs": "https://arxiv.org/abs/2602.20326", "authors": ["Ghorbanali Haghighatdoost"], "title": "Poisson Hamiltonian Pontryagin Dynamics and Optimal Control of Mechanical Systems on Lie Groupoids", "comment": null, "summary": "We develop a Poisson Hamiltonian formulation of Pontryagin dynamics for optimal control of mechanical systems on Lie groupoids. The reduced dynamics is formulated intrinsically on the dual Lie algebroid endowed with its canonical linear Poisson structure and evolves on its symplectic leaves. The main result of this work shows that symplectic leaves, rather than coadjoint orbits, provide the natural reduced phase spaces for Pontryagin dynamics on Lie groupoids. Under suitable regularity assumptions, we prove the equivalence between the variational formulation of the optimal control problem and the associated Poisson Hamiltonian Pontryagin system, and we show that groupoid invariant Lagrangians lead to reduced optimality conditions of Euler Poincare type. Several mechanical examples, including systems with configuration dependent inertia and local symmetries, are presented to illustrate the theory."}
{"id": "2602.20719", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.20719", "abs": "https://arxiv.org/abs/2602.20719", "authors": ["Peiyao Zhao", "Rui Wang", "Tingting Wu", "Yuesheng Xu"], "title": "The Adaptive Solution of High-Frequency Helmholtz Equations via Multi-Grade Deep Learning", "comment": null, "summary": "The Helmholtz equation is fundamental to wave modeling in acoustics, electromagnetics, and seismic imaging, yet high-frequency regimes remain challenging due to the ``pollution effect''. We propose FD-MGDL, an adaptive framework integrating finite difference schemes with Multi-Grade Deep Learning to efficiently resolve high-frequency solutions. While traditional PINNs struggle with spectral bias and automatic differentiation overhead, FD-MGDL employs a progressive training strategy, incrementally adding hidden layers to refine the solution and maintain stability. Crucially, when using ReLU activation, our algorithm recasts the highly non-convex training problem into a sequence of convex subproblems. Numerical experiments in 2D and 3D with wavenumbers up to $κ=200$ show that FD-MGDL significantly outperforms single-grade and conventional neural solvers in accuracy and speed. Applied to an inhomogeneous concave velocity model, the framework accurately resolves wave focusing and caustics, surpassing the 5-point finite difference method in capturing sharp phase transitions and amplitude spikes. These results establish FD-MGDL as a robust, scalable solver for high-frequency wave equations in complex domains."}
{"id": "2602.20434", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.20434", "abs": "https://arxiv.org/abs/2602.20434", "authors": ["Dmitry Beliaev", "Akshay Hegde"], "title": "High local maxima of stationary smooth Gaussian fields", "comment": "41 pages, 5 figures. Comments welcome!", "summary": "Consider the point process (in $\\mathbb{R}^d$) of local maxima of smooth Gaussian fields, with sufficient decay of correlation at infinity, above a level $u$. We show that this point process, rescaled appropriately, converges weakly to a Poisson point process in the limit $u \\to \\infty$. Our proof relies on the classical observation that simple point processes are characterised by avoidance probabilities (i.e. $\\mathbb{P}(η(B)=0)$ for a point process $η$ and Borel set $B$). Then we approximate avoidance probability with the excursion probability, where the latter is well studied. Second main result is a quantified version of the Poisson convergence of high local maxima of the Bargmann-Fock field in $\\mathbb{R}^2$. We prove that, for Bargmann-Fock field in two dimensions, the total variation distance between a Poisson random variable and the number of local maxima of the field above a threshold $u$ in an $R \\times R$ box in $\\mathbb{R}^2$ decays like $\\exp(- βu^2)$, for some fixed $β>0$. As an immediate consequence, when the level $u$ is a function of $R$ such that $u(R) \\to \\infty$ and $u(R)/ \\sqrt{\\log R} \\to 0$ as $R \\to \\infty$, we have a quantitative central limit theorem for the number of high local maxima. The proof is based on the Chen-Stein method for quantitative Poisson approximation. We produce a close coupling of a stationary smooth field and its Palm version, which might be of independent interest."}
{"id": "2602.20681", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.20681", "abs": "https://arxiv.org/abs/2602.20681", "authors": ["Sirui Lin", "Zijun Gao", "Jose Blanchet", "Peter Glynn"], "title": "Statistical Inference in Causal Partial Identification with Smooth Densities", "comment": null, "summary": "Many causal quantities are only partially identifiable due to the inherent missingness of potential outcomes, and the associated partial identification (PI) sets can be obtained by solving an optimal transport (OT) problem. Covariates often provide additional information about the potential outcomes and thus yield tighter PI sets, which can be obtained via conditional optimal transport (COT). However, COT-based PI set estimators are susceptible to the curse of dimensionality in the covariates and outcomes, which precludes the asymptotic normality and hinders statistical inference. In this paper, we exploit smoothness in the marginal densities of covariates and potential outcomes and develop a wavelet-based primal method for COT with multivariate outcomes and covariates. Moreover, for quadratic cost functions, we establish a stability result for COT and prove asymptotic normality of the proposed estimator. This characterization of the asymptotic distribution enables valid statistical inference for the partial identification set. Empirically, we validate the estimation and inference performance of our approach through numerical experiments in comparison with existing benchmarks."}
{"id": "2602.20266", "categories": ["math.PR", "math.ST", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2602.20266", "abs": "https://arxiv.org/abs/2602.20266", "authors": ["Cristina Costantini", "Matteo Ruggiero"], "title": "Multiple Poisson-Dirichlet diffusions on generalized Kingman simplices", "comment": null, "summary": "We construct a new class of infinite-dimensional diffusions taking values in a generalized Kingman simplex. Our model describes the temporal evolution of the relative frequencies of infinitely-many types which are \"labeled\" by an arbitrary finite number of marks or colors, but \"unlabeled\" within each mark. We start with a finite-dimensional construction which extends to Wright-Fisher diffusions a self-similarity property known for Dirichlet distributions, and corresponds to a multiple skew-product representation of the Wright-Fisher diffusion relative to the marks in the population. After ranking decreasingly the frequencies within each mark, we identify the limit in distribution of the resulting diffusion when the number of types for each mark goes to infinity, and describe its infinitesimal operator. The limiting process reduces to a diffusion in the Thoma simplex in the special case of only two marks, whereas the infinitely-many-neutral-alleles model is recovered when all frequencies have the same mark. The stationary measure of the limit diffusion is shown to be the recently introduced multiple Poisson-Dirichlet distribution, which extends Kingman's Poisson-Dirichlet distribution and is the de Finetti representing measure for a family of random partitions whose elements are marked."}
