{"id": "2602.02856", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.02856", "abs": "https://arxiv.org/abs/2602.02856", "authors": ["Tanner J. Reese", "Sunder Sethuraman"], "title": "Crystal Growth on Locally Finite Partially Ordered Sets", "comment": null, "summary": "We consider a Markovian growth process on a partially ordered set $Λ$, equivalent to last passage percolation (LPP) with independent (not necessarily identical) exponentially distributed weights on the elements of $Λ$. Such a process includes inhomogeneous exponential LPP on the Euclidean lattice $\\mathbb{N}_0^d$. We give non-asymptotic bounds on the mean and variance, as well as higher, central, and exponential moments of the passage time $τ_A$ to grow any set $A \\subseteq Λ$ in terms of characteristics of $A$. We also give a limit shape theorem when $Λ$ is equipped with a monoid structure. Methods involve making use of the backward equation associated to the Markovian evolution and comparison inequalities with respect to the time-reversed generator."}
{"id": "2602.03058", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.03058", "abs": "https://arxiv.org/abs/2602.03058", "authors": ["Silouanos Brazitikos", "Colin Tang", "Tomasz Tkocz"], "title": "Moments of sums of exponentials, beyond CHS", "comment": null, "summary": "We establish a sharp lower bound on the $L_p$-norm of sums of independent exponential random variables with fixed variance, for $p \\geq 2$, thus extending Hunter's positivity theorem (1976) for completely homogeneous polynomials. We determine the exact regime of $p$ where such sums enjoy Schur-monotonicity."}
{"id": "2602.03492", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.03492", "abs": "https://arxiv.org/abs/2602.03492", "authors": ["Mikhail Menshikov", "Serguei Popov", "Andrew Wade"], "title": "Dynamics of the leftmost particle in heterogeneous semi-infinite exclusion systems", "comment": "24 pages, 1 figure", "summary": "We study the behaviour of the leftmost particle in a semi-infinite particle system on $\\mathbb{Z}$, where each particle performs a continuous-time nearest-neighbour random walk, with particle-specific jump rates, subject to the exclusion interaction (i.e., no more than one particle per site). We give conditions, in terms of the jump rates on the system, under which the leftmost particle is recurrent or transient, and develop tools to study its rate of escape in the transient case, including by comparison with an $M/G/\\infty$ queue. In particular we show examples in which the leftmost particle can be null recurrent, positive recurrent, ballistically transient, or subdiffusively transient. Finally we indicate the role of the initial condition in determining the dynamics, and show, for example, that sub-ballistic transience can occur started from close-packed initial configurations but not from stationary initial conditions."}
{"id": "2602.03503", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.03503", "abs": "https://arxiv.org/abs/2602.03503", "authors": ["Luisa Beghin", "Lorenzo Cristofaro", "Enrico Scalas"], "title": "Shot-noise processes with logarithmic response function and their scaling limits", "comment": "15 pages, 2 figures", "summary": "We consider shot-noise processes with an impulse response written in terms of the logarithm of the ratio between current and event time (instead of the usual absolute time difference). We study its finite-time properties as well as its weak convergence, under appropriate scaling and with general assumptions on the dependence of noises on event times. The limiting process coincides with the so-called Hadamard fractional Brownian motion (introduced in Beghin, Cristofaro, Polito (2026)), which represents a middle ground between standard Brownian motion and fractional Brownian motion. It shares the one-dimensional distribution with the former, while possessing the long-memory property (within a certain parameter range) of the latter, though with smaller intensity."}
{"id": "2602.02800", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.02800", "abs": "https://arxiv.org/abs/2602.02800", "authors": ["Suhan Liu", "Mo Liu"], "title": "Decision-Focused Optimal Transport", "comment": null, "summary": "We propose a fundamental metric for measuring the distance between two distributions. This metric, referred to as the decision-focused (DF) divergence, is tailored to stochastic linear optimization problems in which the objective coefficients are random and may follow two distinct distributions. Traditional metrics such as KL divergence and Wasserstein distance are not well-suited for quantifying the resulting cost discrepancy, because changes in the coefficient distribution do not necessarily change the optimizer of the underlying linear program. Instead, the impact on the objective value depends on how the two distributions are coupled (aligned). Motivated by optimal transport, we introduce decision-focused distances under several settings, including the optimistic DF distance, the robust DF distance, and their entropy-regularized variants. We establish connections between the proposed DF distance and classical distributional metrics. For the calculation of the DF distance, we develop efficient computational methods. We further derive sample complexity guarantees for estimating these distances and show that the DF distance estimation avoids the curse of dimensionality that arises in Wasserstein distance estimation. The proposed DF distance provides a foundation for a broad range of applications. As an illustrative example, we study the interpolation between two distributions. Numerical studies, including a toy newsvendor problem and a real-world medical testing dataset, demonstrate the practical value of the proposed DF distance."}
{"id": "2602.02549", "categories": ["math.NA", "cs.DC"], "pdf": "https://arxiv.org/pdf/2602.02549", "abs": "https://arxiv.org/abs/2602.02549", "authors": ["Yuki Uchino", "Katsuhisa Ozaki", "Toshiyuki Imamura"], "title": "Error Analysis of Matrix Multiplication Emulation Using Ozaki-II Scheme", "comment": "18 pages, 4 figures", "summary": "The Ozaki-II scheme is an emulation method that leverages the Chinese Remainder Theorem to compute high-precision matrix multiplication via a sequence of low-precision matrix multiplications. In this scheme, the attainable numerical accuracy improves as the number of low-precision matrix multiplications increases. Previous numerical studies have shown that single- and double-precision matrix multiplication using the Ozaki-II scheme achieves higher throughput than that of standard BLAS routines on modern AI hardware equipped with fast INT8 matrix multiply-accumulate units with INT8 inputs and INT32 accumulation. However, the accuracy of the Ozaki-II scheme can degrade when the exponent distribution of the input matrices is wide, in which case a large number of low-precision matrix multiplications is required to obtain high-precision results. In this paper, we present a rigorous deterministic error analysis of the Ozaki-II scheme. The proposed analysis not only clarifies the accuracy behavior of the method but also enables the estimation of the number of low-precision matrix multiplications required to achieve a desired level of numerical accuracy."}
{"id": "2602.02814", "categories": ["math.OC", "cs.RO", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.02814", "abs": "https://arxiv.org/abs/2602.02814", "authors": ["Berk Bozkurt", "Aditya Mahajan", "Ashutosh Nayyar", "Yi Ouyang"], "title": "Sub-optimality bounds for certainty equivalent policies in partially observed systems", "comment": "12 pages, 0 figures", "summary": "In this paper, we present a generalization of the certainty equivalence principle of stochastic control. One interpretation of the classical certainty equivalence principle for linear systems with output feedback and quadratic costs is as follows: the optimal action at each time is obtained by evaluating the optimal state-feedback policy of the stochastic linear system at the minimum mean square error (MMSE) estimate of the state. Motivated by this interpretation, we consider certainty equivalent policies for general (non-linear) partially observed stochastic systems that allow for any state estimate rather than restricting to MMSE estimates. In such settings, the certainty equivalent policy is not optimal. For models where the cost and the dynamics are smooth in an appropriate sense, we derive upper bounds on the sub-optimality of certainty equivalent policies. We present several examples to illustrate the results."}
{"id": "2602.03740", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.03740", "abs": "https://arxiv.org/abs/2602.03740", "authors": ["Xavier Emery", "Christian Lantuéjoul"], "title": "On the compatibility between the spatial moments and the codomain of a real random field", "comment": null, "summary": "While any symmetric and positive semidefinite mapping can be the non-centered covariance of a Gaussian random field, it is known that these conditions are no longer sufficient when the random field is valued in a two-point set. The question therefore arises of what are the necessary and sufficient conditions for a mapping $ρ: \\X \\times \\X \\to \\R$ to be the non-centered covariance of a random field with values in a subset ${\\cE}$ of $\\R$. Such conditions are presented in the general case when ${\\cE}$ is a closed subset of the real line, then examined for some specific cases. In particular, if ${\\cE}=\\R$ or $\\Z$, it is shown that the conditions reduce to $ρ$ being symmetric and positive semidefinite. If ${\\cE}$ is a closed interval or a two-point set, the necessary and sufficient conditions are more restrictive: the symmetry, positive semidefiniteness, upper and lower boundedness of $ρ$ are no longer enough to guarantee the existence of a random field valued in ${\\cE}$ and having $ρ$ as its non-centered covariance. Similar characterizations are obtained for semivariograms and higher-order spatial moments, as well as for multivariate random fields."}
{"id": "2602.03202", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.03202", "abs": "https://arxiv.org/abs/2602.03202", "authors": ["Joonhyuk Jung", "Chao Gao"], "title": "Sharp Inequalities between Total Variation and Hellinger Distances for Gaussian Mixtures", "comment": "34 pages", "summary": "We study the relation between the total variation (TV) and Hellinger distances between two Gaussian location mixtures. Our first result establishes a general upper bound: for any two mixing distributions supported on a compact set, the Hellinger distance between the two mixtures is controlled by the TV distance raised to a power $1-o(1)$, where the $o(1)$ term is of order $1/\\log\\log(1/\\mathrm{TV})$. We also construct two sequences of mixing distributions that demonstrate the sharpness of this bound. Taken together, our results resolve an open problem raised in Jia et al. (2023) and thus lead to an entropic characterization of learning Gaussian mixtures in total variation. Our inequality also yields optimal robust estimation of Gaussian mixtures in Hellinger distance, which has a direct implication for bounding the minimax regret of empirical Bayes under Huber contamination."}
{"id": "2602.02616", "categories": ["math.NA", "physics.flu-dyn", "physics.med-ph"], "pdf": "https://arxiv.org/pdf/2602.02616", "abs": "https://arxiv.org/abs/2602.02616", "authors": ["Élise Foulatier", "Pierre-Alain Boucard", "François Louf", "David Néron", "Philipp Junker"], "title": "A space-time LATIN-PGD strategy for solving Newtonian compressible flows", "comment": null, "summary": "Simulating flow problems is at the core of many engineering applications but often requires high computational effort, especially when dealing with complex models. This work presents a novel approach for resolving flow problems using the LATIN-PGD solver. In this contribution, we place ourselves within the framework of Newtonian compressible and laminar flows. This specific and relatively simple case enables focusing on flows for which a state equation provides a direct relation between pressure and density. It is then possible to use the LATIN solver to set up a pressure-velocity decoupling algorithm. Moreover, Proper Generalised Decomposition (PGD) is natively included in the solver and yields two independent space-time decompositions for the velocity and the pressure fields. As a first step, the solver is validated on a problem for which an analytical solution is available. It is then applied to slightly more complex problems. The results show good agreement with the literature, and we expect that the solver could be used to compute more complicated material laws in the future."}
{"id": "2602.02826", "categories": ["math.OC", "cs.RO"], "pdf": "https://arxiv.org/pdf/2602.02826", "abs": "https://arxiv.org/abs/2602.02826", "authors": ["Louis Callens", "Bastiaan Vandewal", "Ibrahim Ibrahim", "Jan Swevers", "Wilm Decré"], "title": "Fast Near Time-Optimal Motion Planning for Holonomic Vehicles in Structured Environments", "comment": null, "summary": "This paper proposes a novel and efficient optimization-based method for generating near time-optimal trajectories for holonomic vehicles navigating through complex but structured environments. The approach aims to solve the problem of motion planning for planar motion systems using magnetic levitation that can be used in assembly lines, automated laboratories or clean-rooms. In these applications, time-optimal trajectories that can be computed in real-time are required to increase productivity and allow the vehicles to be reactive if needed. The presented approach encodes the environment representation using free-space corridors and represents the motion of the vehicle through such a corridor using a motion primitive. These primitives are selected heuristically and define the trajectory with a limited number of degrees of freedom, which are determined in an optimization problem. As a result, the method achieves significantly lower computation times compared to the state-of-the-art, most notably solving a full Optimal Control Problem (OCP), OMG-tools or VP-STO without significantly compromising optimality within a fixed corridor sequence. The approach is benchmarked extensively in simulation and is validated on a real-world Beckhoff XPlanar system"}
{"id": "2602.03283", "categories": ["math.ST", "cs.IT", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.03283", "abs": "https://arxiv.org/abs/2602.03283", "authors": ["Haohua Chen", "Songbin Liu", "Junjie Ma"], "title": "Orthogonal Approximate Message Passing Algorithms for Rectangular Spiked Matrix Models with Rotationally Invariant Noise", "comment": "To appear in the IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) 2026", "summary": "We propose an orthogonal approximate message passing (OAMP) algorithm for signal estimation in the rectangular spiked matrix model with general rotationally invariant (RI) noise. We establish a rigorous state evolution that exactly characterizes the high-dimensional dynamics of the algorithm. Building on this framework, we derive an optimal variant of OAMP that minimizes the predicted mean-squared error at each iteration. For the special case of i.i.d. Gaussian noise, the fixed point of the proposed OAMP algorithm coincides with that of the standard AMP algorithm. For general RI noise models, we conjecture that the optimal OAMP algorithm is statistically optimal within a broad class of iterative methods, and achieves Bayes-optimal performance in certain regimes."}
{"id": "2602.02779", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.02779", "abs": "https://arxiv.org/abs/2602.02779", "authors": ["Koji Koyamada"], "title": "Comparison of Trefftz-Based PINNs and Standard PINNs Focusing on Structure Preservation", "comment": null, "summary": "In this study, we investigate the capability of physics-informed neural networks (PINNs) to preserve global physical structures by comparing standard PINNs with a Trefftz-based PINN (Trefftz-PINN). The target problem is the reproduction of mag-netic field-line structures in a helical fusion reactor configuration. Using identical training data sampled from exact solutions, we perform comparisons under matched mean squared error (MSE) levels. Visualization of magnetic field lines reveals that standard PINNs may exhibit structural collapse across magnetic surfaces even when the MSE is sufficiently small, whereas Trefftz-PINNs successfully preserve the global topology of magnetic field lines. Furthermore, the proposed framework is extended to computational fluid dynamics (CFD) problems, where streamline structures of veloc-ity fields are analyzed. Similar tendencies are observed, demonstrating that Trefftz-PINNs provide superior structure preservation compared to standard PINNs. These results indicate that minimizing numerical error alone does not guarantee physical consistency, and that constraining the solution space prior to learning is an effective strategy for physics-consistent surrogate modeling."}
{"id": "2602.02981", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.02981", "abs": "https://arxiv.org/abs/2602.02981", "authors": ["Harbir Antil", "Animesh Jain", "Rainald Löhner"], "title": "Fisher-Information-Based Sensor Placement for Structural Digital Twins: Analytic Results and Benchmarks", "comment": null, "summary": "High-fidelity digital twins rely on the accurate assimilation of sensor data into physics-based computational models. In structural applications, such twins aim to identify spatially distributed quantities--such as elementwise weakening fields, material parameters, or effective thermal loads--by minimizing discrepancies between measured and simulated responses subject to the governing equations of structural mechanics. While adjoint-based methods enable efficient gradient computation for these inverse problems, the quality and stability of the resulting estimates depend critically on the choice of sensor locations, measurement types, and directions.\n  This paper develops a rigorous and implementation-ready framework for Fisher-information-based sensor placement in adjoint-based finite-element digital twins. Sensor configurations are evaluated using a D-optimal design criterion derived from a linearization of the measurement map, yielding a statistically meaningful measure of information content. We present matrix-free operator formulas for applying the Jacobian and its adjoint, and hence for computing Fisher-information products $Fv = J^\\top R^{-1} Jv$ using only forward and adjoint solves. Building on these operator evaluations, we derive explicit sensitivity expressions for D-optimal sensor design with respect to measurement parameters and discuss practical strategies for evaluating the associated log-determinant objectives. To complement the general framework, we provide analytically tractable sensor placement results for a canonical one-dimensional structural model, clarifying the distinction between detectability and localizability and proving that D-optimal placement of multiple displacement sensors yields approximately uniform spacing."}
{"id": "2602.03539", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.03539", "abs": "https://arxiv.org/abs/2602.03539", "authors": ["Thomas Nagler", "Sophie Langer"], "title": "Optimal neural network approximation of smooth compositional functions on sets with low intrinsic dimension", "comment": null, "summary": "We study approximation and statistical learning properties of deep ReLU networks under structural assumptions that mitigate the curse of dimensionality. We prove minimax-optimal uniform approximation rates for $s$-Hölder smooth functions defined on sets with low Minkowski dimension using fully connected networks with flexible width and depth, improving existing results by logarithmic factors even in classical full-dimensional settings. A key technical ingredient is a new memorization result for deep ReLU networks that enables efficient point fitting with dense architectures. We further introduce a class of compositional models in which each component function is smooth and acts on a domain of low intrinsic dimension. This framework unifies two common assumptions in the statistical learning literature, structural constraints on the target function and low dimensionality of the covariates, within a single model. We show that deep networks can approximate such functions at rates determined by the most difficult function in the composition. As an application, we derive improved convergence rates for empirical risk minimization in nonparametric regression that adapt to smoothness, compositional structure, and intrinsic dimensionality."}
{"id": "2602.03083", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03083", "abs": "https://arxiv.org/abs/2602.03083", "authors": ["Hao Hu", "Haijun Yu"], "title": "Scaling Optimized Spectral Approximations on Unbounded Domains: The Generalized Hermite and Laguerre Methods", "comment": "40 pages", "summary": "We propose a novel error analysis framework for scaled generalized Laguerre and generalized Hermite approximations.This framework can be regarded as an analogue of the Nyquist-Shannon sampling theorem: It characterizes the spatial and frequency bandwidths that can be effectively captured by Laguerre or Hermite sampling points. Provided a function satisfies the corresponding bandwidth constraints, it can be accurately approximated within this framework. The proposed framework is notably more powerful than classical theory -- it not only provides systematic guidance for choosing the optimal scaling factor, but also predicts root-exponential and other intricate convergence behaviors that classical approaches fail to capture. Leveraging this framework, we conducted a detailed comparative study of Hermite and Laguerre approximations. We find that functions with similar decay and oscillation characteristics may nonetheless display markedly different convergence rates. Furthermore, approximations based on two concatenated sets of Laguerre functions may offer significant advantages over those using a single set of Hermite functions."}
{"id": "2602.02992", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.02992", "abs": "https://arxiv.org/abs/2602.02992", "authors": ["Masashi Wakaiki"], "title": "Data-driven stabilization of continuous-time systems with noisy input-output data", "comment": "18 pages", "summary": "We study data-driven stabilization of continuous-time systems in autoregressive form when only noisy input-output data are available. First, we provide an operator-based characterization of the set of systems consistent with the data. Next, combining this characterization with behavioral theory, we derive a necessary and sufficient condition for the noisy data to be informative for quadratic stabilization. This condition is formulated as linear matrix inequalities, whose solution yields a stabilizing controller. Finally, we characterize data informativity for system identification in the noise-free setting."}
{"id": "2602.03740", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.03740", "abs": "https://arxiv.org/abs/2602.03740", "authors": ["Xavier Emery", "Christian Lantuéjoul"], "title": "On the compatibility between the spatial moments and the codomain of a real random field", "comment": null, "summary": "While any symmetric and positive semidefinite mapping can be the non-centered covariance of a Gaussian random field, it is known that these conditions are no longer sufficient when the random field is valued in a two-point set. The question therefore arises of what are the necessary and sufficient conditions for a mapping $ρ: \\X \\times \\X \\to \\R$ to be the non-centered covariance of a random field with values in a subset ${\\cE}$ of $\\R$. Such conditions are presented in the general case when ${\\cE}$ is a closed subset of the real line, then examined for some specific cases. In particular, if ${\\cE}=\\R$ or $\\Z$, it is shown that the conditions reduce to $ρ$ being symmetric and positive semidefinite. If ${\\cE}$ is a closed interval or a two-point set, the necessary and sufficient conditions are more restrictive: the symmetry, positive semidefiniteness, upper and lower boundedness of $ρ$ are no longer enough to guarantee the existence of a random field valued in ${\\cE}$ and having $ρ$ as its non-centered covariance. Similar characterizations are obtained for semivariograms and higher-order spatial moments, as well as for multivariate random fields."}
{"id": "2602.03118", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03118", "abs": "https://arxiv.org/abs/2602.03118", "authors": ["Henri Klintebäck", "Christoph Ortner", "Lior Silberman"], "title": "The High Cost of Data Augmentation for Learning Equivariant Models", "comment": "33 pages, 13 figures", "summary": "According to Noether's theorem the presence of a continuous symmetry in a Hamiltonian systems is equivalent to the existence of a conserved quantity, yet these symmetries are not always explicitly enforced in data-driven models. There remains a debate whether or not encoding of symmetry into a model architecture is the optimal approach. A competing approach is to target approximate symmetry through data augmentation. In this work, we study two approaches aimed at improving the symmetry properties of such an approximation scheme: one based on a quadrature rule for the Haar measure on the compact Lie group encoding the continuous symmetry of interest and one based on a random sampling of that Haar measure. We demonstrate both theoretically and empirically that the quadrature augmentation leads to exact symmetry preservation in polynomial models, while the random augmentation has only square-root convergence of the symmetrization error."}
{"id": "2602.03460", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.03460", "abs": "https://arxiv.org/abs/2602.03460", "authors": ["Julia Adlercreutz", "Richard Pates"], "title": "Cholesky factorisation, and intrinsically sparse linear quadratic regulation", "comment": "15 pages, 7 figures, under review", "summary": "We classify a family of matrices of shift operators that can be factorised in a computationally tractable manner with the Cholesky algorithm. Such matrices arise in the linear quadratic regulator problem, and related areas. We use the factorisation to uncover intrinsic sparsity properties in the control laws for transportation problems with an underlying tree structure. This reveals that the optimal control can be applied in a distributed manner that is obscured by standard solution methods."}
{"id": "2602.03166", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03166", "abs": "https://arxiv.org/abs/2602.03166", "authors": ["Arun Govind Neelan"], "title": "Event-Level Probabilistic Prediction of Extreme Rainfall over India Using Physics-Gated Latent Dynamics", "comment": null, "summary": "Extreme rainfall over the Indian monsoon region poses severe societal and infrastructural risks but remains difficult to predict at daily time scales due to stochastic convective triggering and multiscale atmospheric interactions. While large-scale atmospheric fields provide important environmental context, their ability to localize extreme rainfall events is fundamentally limited. In this study, we examine how large-scale atmospheric information from ERA5 reanalysis can be leveraged for event-level probabilistic prediction of daily rainfall extremes over India. We compare an adaptive ConvLSTM baseline with a proposed Physics-Gated Latent Ordinary Differential Equation (PG-LODE) framework, which models atmospheric evolution as a continuous-time latent process whose dynamics are explicitly modulated by a physics-based gating mechanism under convectively unstable conditions. Extreme events are defined using the local 95th percentile of the India Meteorological Department gridded rainfall dataset during the June to September monsoon season. Pixel-wise evaluation shows limited skill for both models due to spatial displacement errors, whereas event-level tile-based verification reveals a clear performance contrast. The ConvLSTM remains highly conservative, detecting only 27 percent of extreme events, while PG-LODE achieves near-complete detection with a substantially higher critical success index and a moderate false alarm rate. These results demonstrate that physics-gated continuous-time latent dynamics offer a robust pathway for translating large-scale atmospheric predictability into reliable assessments of extreme rainfall risk."}
{"id": "2602.03508", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.03508", "abs": "https://arxiv.org/abs/2602.03508", "authors": ["Galina Sidorenko", "Johan Thunberg"], "title": "A necessary and sufficient condition for discrete-time consensus on star boundaries", "comment": "14 pages, 8 figures", "summary": "It is intuitive and well known, that if agents in a multi-agent system iteratively update their states in the Euclidean space as convex combinations of neighbors' states, all states eventually converge to the same value (consensus), provided the interaction graph is sufficiently connected. However, this seems to be also true in practice if the convex combinations of states are mapped or radially projected onto any unit $l_p$-sphere or even boundaries of star-convex sets, herein referred to as star boundaries. In this paper, we present insight into this matter by providing a necessary and sufficient condition for asymptotic consensus of the normalized states (directions) for strongly connected directed graphs, which is equivalent to asymptotic consensus of states when the star boundaries are the same for all agents. Furthermore, we show that when asymptotic consensus occurs, the states converge linearly and the point of convergence is continuous in the initial states. Assuming a directed strongly connected graph provides a more general setting than that considered, for example, in gradient-based consensus protocols, where symmetric graphs are assumed. Illustrative examples and a vast number of numerical simulations showcase the theoretical results."}
{"id": "2602.03178", "categories": ["math.NA", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.03178", "abs": "https://arxiv.org/abs/2602.03178", "authors": ["Davit Aslanyan", "Constantine Sideris"], "title": "Fully Automated Adaptive Parameter Selection for 3-D High-order Nyström Boundary Integral Equation Methods", "comment": null, "summary": "We present an adaptive Chebyshev-based Boundary Integral Equation (CBIE) solver for electromagnetic scattering from smooth perfect electric conductor (PEC) objects. The proposed approach eliminates manual parameter tuning by introducing (i) a unified adaptive quadrature strategy for automatic selection of the near-singular interaction distance and (ii) an adaptive computation of all self- and near-singular precomputation integrals to a prescribed accuracy using Gauss-Kronrod (h-adaptive) or Clenshaw-Curtis (p-adaptive) rules and singularity-resolving changes of variables. Both h-adaptive and p-adaptive schemes are explored within this framework, ensuring high-order accuracy and robustness across a broad range of geometries without loss of efficiency. Numerical results for canonical and complex CAD geometries demonstrate that the adaptive solver achieves accuracy and convergence rates comparable to optimally tuned fixed-grid CBIE implementations, while offering automation and scalability to electrically large, geometrically complex problems."}
{"id": "2602.03526", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.03526", "abs": "https://arxiv.org/abs/2602.03526", "authors": ["Hossein Safi", "Rizwana Ahmad", "Iman Tavakkolnia", "Harald Haas"], "title": "Q-Learning for 3D Coverage in VCSEL-based Optical Wireless Systems", "comment": "Accepted for oral presentation at the IEEE ICC 2026 symposium", "summary": "Beam divergence control is a key factor in maintaining reliable coverage in indoor optical wireless communication (OWC) systems as receiver height varies.Conventional systems employ fixed divergence angles, which result in significant coverage degradation due to the non-convex tradeoff between optical power concentration and spatial spread. In this paper, we introduce a reinforcement learning (RL)-based framework for dynamic divergence adaptation in vertical-cavity surface-emitting laser (VCSEL)-based OWC networks. By continuously interacting with the environment, the RL agent autonomously learns a near-optimal mapping between receiver height and beam divergence, thereby eliminating the need for analytical modeling or computationally intensive exhaustive search. Simulation results demonstrate that the proposed approach achieves up to 92% coverage at low receiver heights and maintains robust performance under challenging conditions, enabling scalable, real-time, and energy-efficient beam control for dense VCSEL array deployments in next-generation OWC systems."}
{"id": "2602.03239", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03239", "abs": "https://arxiv.org/abs/2602.03239", "authors": ["Wenli Wang", "Duo Liu", "Gangrong Qu", "Michiel E. Hochstenbach"], "title": "Deterministic and randomized Kaczmarz methods for $AXB=C$ with applications to color image restoration", "comment": null, "summary": "We study Kaczmarz type methods to solve consistent linear matrix equations. We first present a block Kaczmarz (BK) method that employs a deterministic cyclic row selection strategy. Assuming that the associated coefficient matrix has full column or row rank, we derive matrix formulas for a cycle of this BK method. Moreover, we propose a greedy randomized block Kaczmarz (GRBK) method and further extend it to a relaxed variant (RGRBK) and a deterministic counterpart (MWRBK). We establish the convergence properties of the proposed methods. Numerical tests verify the theoretical findings, and we apply the proposed methods to color image restoration problems."}
{"id": "2602.03763", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.03763", "abs": "https://arxiv.org/abs/2602.03763", "authors": ["Mathias Hudoba de Badyn", "Tyler Summers"], "title": "Optimizing Weighted Hodge Laplacian Flows on Simplicial Complexes", "comment": "6 pages, 4 figures, presented at 2025 Conference on Decision and Control", "summary": "Simplicial complexes are generalizations of graphs that describe higher-order network interactions among nodes in the graph. Network dynamics described by graph Laplacian flows have been widely studied in network science and control theory, and these can be generalized to simplicial complexes using Hodge Laplacians. We study weighted Hodge Laplacian flows on simplicial complexes. In particular, we develop a framework for weighted consensus dynamics based on weighted Hodge Laplacian flows and show some decomposition results for weighted Hodge Laplacians. We then show that two key spectral functions of the weighted Hodge Laplacians, the trace of the pseudoinverse and the smallest non-zero eigenvalue, are jointly convex in upper and lower simplex weights and can be formulated as semidefinite programs. Thus, globally optimal weights can be efficiently determined to optimize flows in terms of these functions. Numerical experiments demonstrate that optimal weights can substantially improve these metrics compared to uniform weights."}
{"id": "2602.03247", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03247", "abs": "https://arxiv.org/abs/2602.03247", "authors": ["Qianxing Jia", "Dong Wang"], "title": "Physics informed learning of orthogonal features with applications in solving partial differential equations", "comment": null, "summary": "The random feature method (RFM) constructs approximation spaces by initializing features from generic distributions, which provides universal approximation properties to solve general partial differential equations. However, such standard initializations lack awareness of the underlying physical laws and geometry, which limits approximation. In this work, we propose the Physics-Driven Orthogonal Feature Method (PD-OFM), a framework for constructing feature representations that are explicitly tailored to both the differential operator and the computational domain by pretraining features using physics-informed objectives together with orthogonality regularization. This pretraining strategy yields nearly orthogonal feature bases. We provide both theoretical and empirical evidence that physics-informed pretraining improves the approximation capability of the learned feature space. When employed to solve Helmholtz, Poisson, wave, and Navier-Stokes equations, the proposed method achieves residual errors 2-3 orders of magnitude lower than those of comparable methods. Furthermore, the orthogonality regularization improves transferability, enabling pretrained features to generalize effectively across different source terms and domain geometries for the same PDE."}
{"id": "2602.03322", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03322", "abs": "https://arxiv.org/abs/2602.03322", "authors": ["Yanyan Shi", "Christian Lubich"], "title": "Weighted finite difference methods for a nonlinear Klein--Gordon equation with high oscillations in space and time", "comment": null, "summary": "We consider a nonlinear Klein--Gordon equation in the nonrelativistic limit regime with initial data in the form of a modulated highly oscillatory exponential. In this regime of a small scaling parameter $\\varepsilon$, the solution exhibits rapid oscillations in both time and space, posing challenges for numerical approximation. We propose an explicit and an implicit exponentially weighted finite difference method. While the explicit weighted leapfrog method needs to satisfy a CFL-type stability condition, the implicit weighted Crank--Nicolson method is unconditionally stable. Both methods achieve second-order accuracy with time steps and mesh sizes that are not restricted in magnitude by $\\varepsilon$. The methods are uniformly convergent in the range from arbitrarily small to moderately bounded $\\varepsilon$. Numerical experiments illustrate the theoretical results."}
{"id": "2602.03348", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.03348", "abs": "https://arxiv.org/abs/2602.03348", "authors": ["Shaoshuai Chu", "Michael Herty"], "title": "A Comparative Study of Low-Dissipation Numerical Schemes for Hyperbolic Conservation Laws", "comment": "arXiv admin note: substantial text overlap with arXiv:2504.01699", "summary": "This work provides a comparative assessment of several low-dissipation numerical schemes for hyperbolic conservation laws, highlighting their performance relative to the classical Harten-Lax-van Leer (HLL) schemes. The schemes under consideration include the classical Harten-Lax-van Leer-Contact (HLLC), the recently proposed TV flux splitting, the low-dissipation Central-Upwind (LDCU), and the local characteristic decomposition-based Central-Upwind (LCDCU) schemes. These methods are extended to higher orders of accuracy, up to the fifth order, within both finite-volume and finite-difference frameworks. A series of numerical experiments for the one- and two-dimensional Euler equations of gas dynamics are performed to evaluate the accuracy, robustness, and computational efficiency of the studied schemes. The comparison highlights the trade-offs between resolution of contact and shear waves, robustness in the presence of shocks, and computational cost. The investigated low-dissipation schemes show comparable levels of numerical dissipation, with only subtle differences appearing in selected benchmark problems. The results provide practical guidance for selecting efficient low-dissipation solvers for the simulation of complex compressible flows."}
{"id": "2602.03428", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.03428", "abs": "https://arxiv.org/abs/2602.03428", "authors": ["T. Chaumont-Frelet", "S. Sauter"], "title": "On singular Galerkin discretizations for three models in high-frequency scattering", "comment": null, "summary": "We consider three common mathematical models for time-harmonic high frequency scattering: the Helmholtz equation in two and three spatial dimensions, a transverse magnetic problem in two dimensions, and Maxwell's equation in three dimensions with dissipative boundary conditions such that the continuous problem is well posed. In this paper, we construct meshes for popular (low order) Galerkin finite element discretizations such that the discrete system matrix becomes singular and the discrete problem is not well posed. This implies that a condition \"the finite element space has to be sufficiently rich\" in the form of a resolution condition - typically imposed for discrete well-posedness - is not an artifact from the proof by a compact perturbation argument but necessary for discrete stability of the Galerkin discretization."}
{"id": "2602.02981", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.02981", "abs": "https://arxiv.org/abs/2602.02981", "authors": ["Harbir Antil", "Animesh Jain", "Rainald Löhner"], "title": "Fisher-Information-Based Sensor Placement for Structural Digital Twins: Analytic Results and Benchmarks", "comment": null, "summary": "High-fidelity digital twins rely on the accurate assimilation of sensor data into physics-based computational models. In structural applications, such twins aim to identify spatially distributed quantities--such as elementwise weakening fields, material parameters, or effective thermal loads--by minimizing discrepancies between measured and simulated responses subject to the governing equations of structural mechanics. While adjoint-based methods enable efficient gradient computation for these inverse problems, the quality and stability of the resulting estimates depend critically on the choice of sensor locations, measurement types, and directions.\n  This paper develops a rigorous and implementation-ready framework for Fisher-information-based sensor placement in adjoint-based finite-element digital twins. Sensor configurations are evaluated using a D-optimal design criterion derived from a linearization of the measurement map, yielding a statistically meaningful measure of information content. We present matrix-free operator formulas for applying the Jacobian and its adjoint, and hence for computing Fisher-information products $Fv = J^\\top R^{-1} Jv$ using only forward and adjoint solves. Building on these operator evaluations, we derive explicit sensitivity expressions for D-optimal sensor design with respect to measurement parameters and discuss practical strategies for evaluating the associated log-determinant objectives. To complement the general framework, we provide analytically tractable sensor placement results for a canonical one-dimensional structural model, clarifying the distinction between detectability and localizability and proving that D-optimal placement of multiple displacement sensors yields approximately uniform spacing."}
