{"id": "2601.03719", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.03719", "abs": "https://arxiv.org/abs/2601.03719", "authors": ["Xenia Miscouridou", "Deborah Sulem"], "title": "Posterior concentration in spatio-temporal Hawkes processes", "comment": null, "summary": "We develop a Bayesian nonparametric framework for inference in spatio-temporal Hawkes processes, extending existing theoretical results beyond the purely temporal setting. Our framework encompasses modelling both the background and triggering components of the Hawkes process through Gaussian Processes priors. Under appropriate smoothness and regularity assumptions on the true parameter and the nonparametric prior family, we derive explicit posterior contraction rates for the conditional intensity function and the model's parameter, in the asymptotic regime of repeatedly observed and independent sequences. Our analysis generalizes known contraction results for purely temporal Hawkes processes to the spatio-temporal setting, which allows to jointly model self-excitation across time and space in event data. These results provide, to our knowledge, the first theoretical guarantees for Bayesian nonparametric methods in spatio-temporal point data."}
{"id": "2601.03911", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.03911", "abs": "https://arxiv.org/abs/2601.03911", "authors": ["Umberto Michelucci"], "title": "The Feldman-Hájek Dichotomy for Countable Gaussian Mixtures and their Asymptotic Separability in High Dimensions", "comment": "9 pages", "summary": "This paper establishes the theoretical foundations for the asymptotic separability of Gaussian Mixture Models (GMMs) in high dimensions by extending the classical Feldman-Hájek theorem. We first prove that a countable mixture of Gaussian measures is a well-defined probability measure. Our primary result, the Gaussian Mixture Dichotomy Theorem, demonstrates that the mutual singularity of individual Gaussian components is a sufficient condition for the mutual singularity of the resulting mixtures. We provide a rigorous proof and further discuss the ``Mixed Case,'' where the presence of even a single equivalent pair of components leads to partial absolute continuity via the Lebesgue decomposition, thereby defining the theoretical limits of perfect classification in infinite-dimensional spaces."}
{"id": "2601.03920", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.03920", "abs": "https://arxiv.org/abs/2601.03920", "authors": ["Claudio Durastanti", "Radomyra Shevchenko"], "title": "Adaptive thresholding for wavelet-based nonparametric heteroskedastic variance estimation on the sphere", "comment": "53 pages", "summary": "This paper investigates the nonparametric estimation of a heteroskedastic variance function on the sphere in a regression framework, assuming the variance belongs to a Besov regularity class. A needlet-based estimator is proposed, combining multiresolution analysis with hard thresholding. The method exploits the spatial and spectral localization of needlets to adapt to unknown smoothness and is shown to attain minimax-optimal convergence rates over Besov spaces."}
{"id": "2601.03518", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.03518", "abs": "https://arxiv.org/abs/2601.03518", "authors": ["Cosme Louart", "Sicheng Tan"], "title": "Sharp concentration inequality for the sum of random variables", "comment": "2 Figures", "summary": "We present a universal concentration bound for sums of random variables under arbitrary dependence, and we prove it is asymptotically optimal for every fixed common marginal law. The concentration bound is a direct - yet previously unnoticed - consequence of the subadditivity of expected shortfall, a property well known to financial statisticians. The sharpness result is a significant contribution relying on the construction of worst-case dependency profiles between identically distributed random variables."}
{"id": "2601.03384", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.03384", "abs": "https://arxiv.org/abs/2601.03384", "authors": ["Xiangying Huang"], "title": "Conjugacy-invariant random walks on nilpotent groups", "comment": null, "summary": "We establish bounds on the mixing times of conjugacy-invariant random walks on finite nilpotent groups in terms of the mixing times of their projections onto the abelianization. This comparison framework shows that, in several natural cases of interest, the mixing behavior on a nilpotent group is governed by that of the projected walk on the abelianization, reducing the study of mixing to a simpler problem in the Abelian setting. As an application, these bounds yield cutoff for two examples of conjugacy-invariant walks on unit upper-triangular matrix groups previously studied by Arias-Castro, Diaconis, and Stanley (2004) and by Nestoridi (2019)."}
{"id": "2601.03668", "categories": ["math.NA", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.03668", "abs": "https://arxiv.org/abs/2601.03668", "authors": ["Kapil Chawla", "Youngjoon Hong", "Jae Yong Lee", "Sanghyun Lee"], "title": "Discontinuous Galerkin finite element operator network for solving non-smooth PDEs", "comment": "24 pages, 11 figures", "summary": "We introduce Discontinuous Galerkin Finite Element Operator Network (DG--FEONet), a data-free operator learning framework that combines the strengths of the discontinuous Galerkin (DG) method with neural networks to solve parametric partial differential equations (PDEs) with discontinuous coefficients and non-smooth solutions. Unlike traditional operator learning models such as DeepONet and Fourier Neural Operator, which require large paired datasets and often struggle near sharp features, our approach minimizes the residual of a DG-based weak formulation using the Symmetric Interior Penalty Galerkin (SIPG) scheme. DG-FEONet predicts element-wise solution coefficients via a neural network, enabling data-free training without the need for precomputed input-output pairs. We provide theoretical justification through convergence analysis and validate the model's performance on a series of one- and two-dimensional PDE problems, demonstrating accurate recovery of discontinuities, strong generalization across parameter space, and reliable convergence rates. Our results highlight the potential of combining local discretization schemes with machine learning to achieve robust, singularity-aware operator approximation in challenging PDE settings."}
{"id": "2601.03278", "categories": ["math.OC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.03278", "abs": "https://arxiv.org/abs/2601.03278", "authors": ["Pablo Thomassin", "Guillaume Guerard", "Sonia Djebali", "Vincent Marc Lambert"], "title": "A Quantum Model for Constrained Markowitz Modern Portfolio Using Slack Variables to Process Mixed-Binary Optimization under QAOA", "comment": null, "summary": "Effectively encoding inequality constraints is a primary obstacle in applying quantum algorithms to financial optimization. A quantum model for Markowitz portfolio optimization is presented that resolves this by embedding slack variables directly into the problem Hamiltonian. The method maps each slack variable to a dedicated ancilla qubit, transforming the problem into a Quadratic Unconstrained Binary Optimization (QUBO) formulation suitable for the Quantum Approximate Optimization Algorithm (QAOA). This process internalizes the constraints within the quantum state, altering the problem's energy landscape to facilitate optimization. The model is empirically validated through simulation, showing it consistently finds the optimal portfolio where a standard penalty-based QAOA fails. This work demonstrates that modifying the Hamiltonian architecture via a slack-ancilla scheme provides a robust and effective pathway for solving constrained optimization problems on quantum computers. A fundamental quantum limit on the simultaneous precision of portfolio risk and return is also posited."}
{"id": "2601.03411", "categories": ["math.PR", "cond-mat.stat-mech"], "pdf": "https://arxiv.org/pdf/2601.03411", "abs": "https://arxiv.org/abs/2601.03411", "authors": ["Nicolas Forien", "Christopher Hoffman", "Tobias Johnson", "Josh Meisel", "Jacob Richey", "Leonardo T. Rolla"], "title": "Explosivity in 1-d Activated Random Walk", "comment": "7 pages", "summary": "We show that Activated Random Walk on $\\mathbb{Z}$ is explosive above criticality. That is, activating a single particle in a supercritical state of sleeping particles triggers an infinite avalanche of activity with positive probability. This extends the same result recently proven by Brown, Hoffman, and Son for i.i.d. initial distributions to the setting of ergodic ones, thus completing the proof of a conjecture of Rolla's in dimension one. As a corollary we obtain that, for supercritical ergodic initial distributions with any positive density of particles initially active, the system will stay active almost surely. Our result is another piece of evidence attesting to the universality of the phase transition of Activated Random Walk on $\\mathbb{Z}$."}
{"id": "2601.03885", "categories": ["math.NA", "cs.GR"], "pdf": "https://arxiv.org/pdf/2601.03885", "abs": "https://arxiv.org/abs/2601.03885", "authors": ["Siddhartha E. Guzman", "Egor Tiunov", "Leandro Aolita"], "title": "Local Interpolation via Low-Rank Tensor Trains", "comment": "22 pages, 16 figures", "summary": "Tensor Train (TT) decompositions provide a powerful framework to compress grid-structured data, such as sampled function values, on regular Cartesian grids. Such high compression, in turn, enables efficient high-dimensional computations. Exact TT representations are only available for simple analytic functions. Furthermore, global polynomial or Fourier expansions typically yield TT-ranks that grow proportionally with the number of basis terms. State-of-the-art methods are often prohibitively expensive or fail to recover the underlying low-rank structure. We propose a low-rank TT interpolation framework that, given a TT describing a discrete (scalar-, vector-, or tensor-valued) function on a coarse regular grid with $n$ cores, constructs a finer-scale version of the same function represented by a TT with $n+m$ cores, where the last $m$ cores maintain constant rank. Our method guarantees a $\\ell^{2}$-norm error bound independent of the total number of cores, achieves exponential compression at fixed accuracy, and admits logarithmic complexity with respect of the number of grid points. We validate its performance through numerical experiments, including 1D, 2D, and 3D applications such as: 2D and 3D airfoil mask embeddings, image super-resolution, and synthetic noise fields such as 3D synthetic turbulence. In particular, we generate fractal noise fields directly in TT format with logarithmic complexity and memory. This work opens a path to scalable TT-native solvers with complex geometries and multiscale generative models, with implications from scientific simulation to imaging and real-time graphics."}
{"id": "2601.03318", "categories": ["math.OC", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.03318", "abs": "https://arxiv.org/abs/2601.03318", "authors": ["Higor V. M. Ferreira", "Camila A. Tavares", "Nelson H. T. Lemes", "José Claudinei Ferreira", "José P. C. dos Santos"], "title": "An overview of the fractional-order gradient descent method and its applications", "comment": "26 pages, 2 tables, 8 figures", "summary": "Recent studies have shown that fractional calculus is an effective alternative mathematical tool in various scientific fields. However, some investigations indicate that results established in differential and integral calculus do not necessarily hold true in fractional calculus. In this work we will compare various methods presented in the literature to improve the Gradient Descent Method, in terms of convergence of the method, convergence to the extreme point, and convergence rate. In general, these methods that generalize the gradient descent algorithm by replacing the gradient with a fractional-order operator are inefficient in achieving convergence to the extremum point of the objective function. To avoid these difficulties, we proposed to choose the Fractional Continuous Time algorithm to generalize the gradient method. In this approach, the convergence of the method to the extreme point of the function is guaranteed by introducing the fractional order in the time derivative, rather than in of the gradient. In this case, the issue of finding the extreme point is resolved, while the issue of stability at the equilibrium point remains.\n  Fractional Continuous Time method converges to extreme point of cost function when fractional-order is between 0 and 1. The simulations shown in this work suggests that a similar result can be found when $1 \\leq α\\leq 2$. { This paper highlights the main advantages and disadvantages of generalizations of the gradient method using fractional derivatives, aiming to optimize convergence in complex problems. Some chemical problems, with n=11 and 24 optimization parameters, are employed as means of evaluating the efficacy of the propose algorithms. In general, previous studies are restricted to mathematical questions and simple illustrative examples."}
{"id": "2601.03518", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.03518", "abs": "https://arxiv.org/abs/2601.03518", "authors": ["Cosme Louart", "Sicheng Tan"], "title": "Sharp concentration inequality for the sum of random variables", "comment": "2 Figures", "summary": "We present a universal concentration bound for sums of random variables under arbitrary dependence, and we prove it is asymptotically optimal for every fixed common marginal law. The concentration bound is a direct - yet previously unnoticed - consequence of the subadditivity of expected shortfall, a property well known to financial statisticians. The sharpness result is a significant contribution relying on the construction of worst-case dependency profiles between identically distributed random variables."}
{"id": "2601.03931", "categories": ["math.NA", "math.OC", "physics.chem-ph", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.03931", "abs": "https://arxiv.org/abs/2601.03931", "authors": ["Yukuan Hu", "Laura Grazioli"], "title": "Constrained dynamics for searching saddle points on general Riemannian manifolds", "comment": "35 pages, 6 figures, 2 tables. All comments are welcome", "summary": "Finding constrained saddle points on Riemannian manifolds is significant for analyzing energy landscapes arising in physics and chemistry. Existing works have been limited to special manifolds that admit global regular level-set representations, excluding applications such as electronic excited-state calculations. In this paper, we develop a constrained saddle dynamics applicable to smooth functions on general Riemannian manifolds. Our dynamics is formulated compactly over the Grassmann bundle of the tangent bundle. By analyzing the Grassmann bundle geometry, we achieve universality via incorporating the second fundamental form, which captures variations of tangent spaces along the trajectory. We rigorously establish the local linear stability of the dynamics and the local linear convergence of the resulting algorithms. Remarkably, our analysis provides the first convergence guarantees for discretized saddle-search algorithms in manifold settings. Moreover, by respecting the intrinsic quotient structure, we remove unnecessary nondegeneracy assumptions on the eigenvalues of the Riemannian Hessian that are present in existing works. We also point out that locating saddle points can be more ill-conditioning than finding local minimizers, and requires using nonredundant parametrizations. Finally, numerical experiments on linear eigenvalue problems and electronic excited-state calculations showcase the effectiveness of the proposed algorithms and corroborate the established local theory."}
{"id": "2601.03333", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.03333", "abs": "https://arxiv.org/abs/2601.03333", "authors": ["Mrinal Kanti Roychowdhury"], "title": "Optimal Quantization of Finite Uniform Data on the Sphere", "comment": null, "summary": "This paper develops a systematic and geometric theory of optimal quantization on the unit sphere $\\mathbb S^2$, focusing on finite uniform probability distributions supported on the spherical surface - rather than on lower-dimensional geodesic subsets such as circles or arcs. We first establish the existence of optimal sets of $n$-means and characterize them through centroidal spherical Voronoi tessellations. Three fundamental structural results are obtained. First, a cluster - purity theorem shows that when the support consists of well-separated components, each optimal Voronoi region remains confined to a single component. Second, a ring - allocation (discrete water - filling) theorem provides an explicit rule describing how optimal representatives are distributed across multiple latitudinal rings, together with closed-form distortion formulas. Third, a Lipschitz - type stability theorem quantifies the robustness of optimal configurations under small geodesic perturbations of the support. In addition, a spherical analogue of Lloyd's algorithm is presented, in which intrinsic (Karcher) means replace Euclidean centroids for iterative refinement. These results collectively provide a unified and transparent framework for understanding the geometric and algorithmic structure of optimal quantization on $\\mathbb S^2$."}
{"id": "2601.03541", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.03541", "abs": "https://arxiv.org/abs/2601.03541", "authors": ["Meng Guan", "Zhenfeng Zou", "Taizhong Hu"], "title": "Moment inequalities for higher-order (inverse) stochastic dominance", "comment": null, "summary": "Stochastic dominance has been studied extensively, particularly in the finance and economics literature. In this paper, we obtain two results. First, necessary conditions for higher-order inverse stochastic dominance are developed. These conditions, which involve moment inequalities of the minimum order statistics, are analogous to the ones obtained by Fishburn (1980b) for usual higher-order stochastic dominance. Second, we investigate how background risk variables influence usual higher-order stochastic dominance. The main result generalizes the ones in Pomatto et al. (2020) from the first-order and second-order stochastic dominance to the higher-order."}
{"id": "2601.03967", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.03967", "abs": "https://arxiv.org/abs/2601.03967", "authors": ["M. H. Gfrerer", "P. Gangl"], "title": "On the importance of smoothness, interface resolution and numerical sensitivities in shape and topological sensitivity analysis", "comment": null, "summary": "In this paper we investigate the influence of the discretization of PDE constraints on shape and topological derivatives. To this end, we study a tracking-type functional and a two-material Poisson problem in one spatial dimension. We consider the discretization by a standard method and an enriched method. In the standard method we use splines of degree $p$ such that we can control the smoothness of the basis functions easily, but do not take any interface location into consideration. This includes for p=1 the usual hat basis functions. In the enriched method we additionally capture the interface locations in the ansatz space by enrichment functions. For both discretization methods shape and topological sensitivity analysis is performed. It turns out that the regularity of the shape derivative depends on the regularity of the basis functions. Furthermore, for point-wise convergence of the shape derivative the interface has to be considered in the ansatz space. For the topological derivative we show that only the enriched method converges."}
{"id": "2601.03566", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.03566", "abs": "https://arxiv.org/abs/2601.03566", "authors": ["Yanan Bo", "Yongqiang Wang"], "title": "Provably Convergent Decentralized Optimization over Directed Graphs under Generalized Smoothness", "comment": null, "summary": "Decentralized optimization has become a fundamental tool for large-scale learning systems; however, most existing methods rely on the classical Lipschitz smoothness assumption, which is often violated in problems with rapidly varying gradients. Motivated by this limitation, we study decentralized optimization under the generalized $(L_0, L_1)$-smoothness framework, in which the Hessian norm is allowed to grow linearly with the gradient norm, thereby accommodating rapidly varying gradients beyond classical Lipschitz smoothness. We integrate gradient-tracking techniques with gradient clipping and carefully design the clipping threshold to ensure accurate convergence over directed communication graphs under generalized smoothness. In contrast to existing distributed optimization results under generalized smoothness that require a bounded gradient dissimilarity assumption, our results remain valid even when the gradient dissimilarity is unbounded, making the proposed framework more applicable to realistic heterogeneous data environments. We validate our approach via numerical experiments on standard benchmark datasets, including LIBSVM and CIFAR-10, using regularized logistic regression and convolutional neural networks, demonstrating superior stability and faster convergence over existing methods."}
{"id": "2601.03599", "categories": ["math.PR", "q-bio.PE"], "pdf": "https://arxiv.org/pdf/2601.03599", "abs": "https://arxiv.org/abs/2601.03599", "authors": ["Conrad J. Burden", "Robert C. Griffiths"], "title": "The Feller diffusion as the limit of a coalescent point process", "comment": "30 pages, 3 diagrams", "summary": "The Feller diffusion is studied as the limit of a coalescent point process in which the density of the node height distribution is skewed towards zero. Using a unified approach, a number of recent results pertaining to scaling limits of branching processes are reinterpreted as properties of the Feller diffusion arising from this limit. The notion of Bernoulli sampling of a finite population is extended to the diffusion limit to cover finite Poisson-distributed samples drawn from infinite continuum populations. We show that the coalescent tree of a Poisson-sampled Feller diffusion corresponds to a coalescent point process with a node height distribution taking the same algebraic form as that of a Bernoulli-sampled birth-death process. By adapting methods for analysing k-sampled birth-death processes, in which the sample size is pre-specified, we develop methods for studying the coalescent properties of the k-sampled Feller diffusion."}
{"id": "2601.03971", "categories": ["math.NA", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.03971", "abs": "https://arxiv.org/abs/2601.03971", "authors": ["Josie König", "Han Cheng Lie"], "title": "Posterior error bounds for prior-driven balancing in linear Gaussian inverse problems", "comment": null, "summary": "In large-scale Bayesian inverse problems, it is often necessary to apply approximate forward models to reduce the cost of forward model evaluations, while controlling approximation quality. In the context of Bayesian inverse problems with linear forward models, Gaussian priors, and Gaussian noise, we use perturbation theory for inverses to bound the error in the approximate posterior mean and posterior covariance resulting from a linear approximate forward model. We then focus on the smoothing problem of inferring the initial condition of linear time-invariant dynamical systems, using finitely many partial state observations. For such problems, and for a specific model order reduction method based on balanced truncation, we show that the impulse response of a certain prior-driven system is closely related to the prior-preconditioned Hessian of the inverse problem. This reveals a novel connection between systems theory and inverse problems. We exploit this connection to prove the first a priori error bounds for system-theoretic model order reduction methods applied to smoothing problems. The bounds control the approximation error of the posterior mean and covariance in terms of the truncated Hankel singular values of the underlying system."}
{"id": "2601.03747", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.03747", "abs": "https://arxiv.org/abs/2601.03747", "authors": ["Julia Ackermann", "Thomas Kruse", "Petr Petrov", "Alexandre Popier"], "title": "Matrix Riccati BSDEs with singular terminal condition and stochastic LQ control with linear terminal constraint", "comment": null, "summary": "We analyze a class of multidimensional linear-quadratic stochastic control problems with random coefficients, motivated by multi-asset optimal trade execution. The problems feature non-diffusive controlled state dynamics and a terminal constraint that restricts the terminal state to a prescribed random linear subspace. We derive the associated Riccati backward stochastic differential equation (BSDE) and identify a suitable formalization of its singular terminal condition. Via a penalization approach, we establish existence of a minimal supersolution of the Riccati BSDE and use it to characterize both the value function and the optimal control. We analyze the asymptotic behavior of the supersolution near terminal time and discuss special cases where closed-form solutions can be obtained."}
{"id": "2601.03864", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.03864", "abs": "https://arxiv.org/abs/2601.03864", "authors": ["Nathanaël Berestycki", "Jonathan Hermon", "Lucas Teyssier"], "title": "Stationary hitting times on vertex-transitive graphs", "comment": "20 pages, comments welcome", "summary": "We prove a refined version of the Aldous and Brown's exponential approximation of stationary hitting times. These are valid for all reversible Markov chains. We then specialise our estimates for vertex-transitive graphs, where we obtain improved bounds which depend on the growth of the graphs. The most delicate cases are when the diameter is comparable to that of low-dimensional tori. In particular, in \"dimensions\" less than four (up to logarithmic factors) our error terms are the square of those of Aldous and Brown. These improved bounds play a crucial role in the companion work arXiv:2202.02255 characterising the fluctuations of the cover time on vertex-transitive graphs."}
{"id": "2601.04022", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.04022", "abs": "https://arxiv.org/abs/2601.04022", "authors": ["Ming-Jun Lai"], "title": "A Bivariate Spline Construction of Orthonormal Polynomials over Polygonal Domains and Its Applications to Quadrature", "comment": "36 pages, 110 figures", "summary": "We present computational methods for constructing orthogonal/orthonormal polynomials over arbitrary polygonal domains in $\\mathbb{R}^2$\n  using bivariate spline functions. Leveraging a mature MATLAB implementation which generates spline spaces of any degree, any smoothness over any triangulation, we have exact polynomial representation over the polygonal domain of interest. Two algorithms are developed: one constructs orthonormal polynomials of degree $d>0$\n  over a polygonal domain, and the other constructs orthonormal polynomials of degree $d+1$ in the orthogonal complement of $\\mathbb{P}_d$. Numerical examples for degrees $d=1--5$ illustrate the structure and zero curves of these polynomials, providing evidence against the existence of Gauss quadrature on centrally symmetric domains. In addition, we introduce polynomial reduction strategies based on odd- and even-degree orthogonal polynomials, reducing the integration to the integration of its residual quadratic or linear polynomials. These reductions motivate new quadrature schemes, which we further extend through polynomial interpolation to obtain efficient, high-precision quadrature rules for various polygonal domains."}
{"id": "2601.03754", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.03754", "abs": "https://arxiv.org/abs/2601.03754", "authors": ["Roland Schwan", "Daniel Kuhn", "Colin N. Jones"], "title": "GPU-Accelerated Cholesky Factorization of Block Tridiagonal Matrices", "comment": null, "summary": "This paper presents a GPU-accelerated framework for solving block tridiagonal linear systems that arise naturally in numerous real-time applications across engineering and scientific computing. Through a multi-stage permutation strategy based on nested dissection, we reduce the computational complexity from $\\mathcal{O}(Nn^3)$ for sequential Cholesky factorization to $\\mathcal{O}(\\log_2(N)n^3)$ when sufficient parallel resources are available, where $n$ is the block size and $N$ is the number of blocks. The algorithm is implemented using NVIDIA's Warp library and CUDA to exploit parallelism at multiple levels within the factorization algorithm. Our implementation achieves speedups exceeding 100x compared to the sparse solver QDLDL, 25x compared to a highly optimized CPU implementation using BLASFEO, and more than 2x compared to NVIDIA's CUDSS library. The logarithmic scaling with horizon length makes this approach particularly attractive for long-horizon problems in real-time applications. Comprehensive numerical experiments on NVIDIA GPUs demonstrate the practical effectiveness across different problem sizes and precisions. The framework provides a foundation for GPU-accelerated optimization solvers in robotics, autonomous systems, and other domains requiring repeated solution of structured linear systems. The implementation is open-source and available at https://github.com/PREDICT-EPFL/socu."}
{"id": "2601.03866", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.03866", "abs": "https://arxiv.org/abs/2601.03866", "authors": ["Denis Denisov", "Nikita Elizarov", "Vitali Wachtel"], "title": "Harmonic polynomials and other exactly computable characteristics for $2$-dimensional random walks in cones", "comment": "25 pages", "summary": "In this note we consider $2$-dimensional lattice random walks killed at leaving a wedge with opening $α\\in(0,π]$. Assuming that the walk cannot jump over the boundary of the wedge we prove that there exists a harmonic polynomial if and only if $α=π/m$ with some integer $m$. Our proof is constructive and allows one to give exact expressions for harmonic polynomials for every integer $m$. Furthermore, we give exact expressions for all finite moments of the exit time, this result is valid for all angles $α$."}
{"id": "2601.04075", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.04075", "abs": "https://arxiv.org/abs/2601.04075", "authors": ["Julia Muñoz-Echániz", "Christoph Reisinger"], "title": "A higher order sparse grid combination technique", "comment": null, "summary": "We show that a generalised sparse grid combination technique which combines multi-variate extrapolation of finite difference solutions with the standard combination formula lifts a second order accurate scheme on regular meshes to a fourth order combined sparse grid solution. In the analysis, working in a general dimension, we characterise all terms in a multivariate error expansion of the scheme as solutions of a sequence of semi-discrete problems. This is first carried out formally under suitable assumptions on the truncation error of the scheme, stability and regularity of solutions. We then verify the assumptions on the example of the Poisson problem with smooth data, and illustrate the practical convergence in up to seven dimensions."}
{"id": "2601.03759", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.03759", "abs": "https://arxiv.org/abs/2601.03759", "authors": ["Jean B Lasserre"], "title": "Connecting Max-entropy With Computational Geometry, LP And SDP", "comment": null, "summary": "We consider the well-known max-(relative) entropy problem $Θ$(y) = infQ$\\ll$P DKL(Q P ) with Kullback-Leibler divergence on a domain $Ω$ $\\subset$ R d , and with ''moment'' constraints h dQ = y, y $\\in$ R m . We show that when m $\\le$ d, $Θ$ is the Cram{é}r transform of a function v that solves a simply related computational geometry problem. Also, and remarkably, to the canonical LP: min x$\\ge$0 {c T x\\,: A x = y}, with A $\\in$ R mxd , one may associate a max-entropy problem with a suitably chosen reference measure P on R d + and linear mapping h(x) = Ax, such that its associated perspective function $ε$ $Θ$(y/$ε$) is the optimal value of the log-barrier formulation (with parameter $ε$) of the dual LP (and so it converges to the LP optimal value as $ε$ $\\rightarrow$ 0). An analogous result also holds for the canonical SDP: min X 0 { C, X\\,: A(X) = y }."}
{"id": "2601.03900", "categories": ["math.PR", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.03900", "abs": "https://arxiv.org/abs/2601.03900", "authors": ["Justinas Zaliaduonis", "Sergios Gatidis"], "title": "A Probabilistic Generalization of the Mazur-Ulam Theorem", "comment": null, "summary": "The classical Mazur-Ulam theorem establishes that every surjective isometry between normed real vector spaces is an affine transformation. In various applied mathematical settings, however, one encounters maps that preserve distances not pointwise, but almost everywhere with respect to a probability measure. This paper provides a rigorous generalization of the Mazur-Ulam theorem to probability spaces. We prove that if a measurable map on a subset of Rd preserves distances almost everywhere with respect to a measure with full-dimensional support, it coincides almost everywhere with a global Euclidean isometry, defined as an orthogonal transformation followed by a translation."}
{"id": "2601.04112", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.04112", "abs": "https://arxiv.org/abs/2601.04112", "authors": ["Ben S. Southworth", "Hussam Al Daas", "Golo A> Wimmer", "Ed Threlfall"], "title": "Algebraic Multigrid with Overlapping Schwarz Smoothers and Local Spectral Coarse Grids for Least Squares Problems", "comment": null, "summary": "This paper develops a new algebraic multigrid (AMG) method for sparse least-squares systems of the form $A=G^TG$ motivated by challenging applications in scientific computing where classical AMG methods fail. First we review and relate the use of local spectral problems in distinct fields of literature on AMG, domain decomposition (DD), and multiscale finite elements. We then propose a new approach blending aggregation-based coarsening, overlapping Schwarz smoothers, and locally constructed spectral coarse spaces. By exploiting the factorized structure of $A$, we construct an inexpensive symmetric positive semidefinite splitting that yields local generalized eigenproblems whose solutions define sparse, nonoverlapping coarse basis functions. This enables a fully algebraic and naturally recursive multilevel hierarchy that can either coarsen slowly to achieve AMG-like operator complexities, or coarsen aggressively-with correspondingly larger local spectral problems-to ensure robustness on problems that cannot be solved by existing AMG methods. The method requires no geometric information, avoids global eigenvalue solves, and maintains efficient parallelizable setup through localized operations. Numerical experiments demonstrate that the proposed least-squares AMG-DD method achieves convergence rates independent of anisotropy on rotated diffusion problems and remains scalable with problem size, while for small amounts of anisotropy we obtain convergence and operator complexities comparable with classical AMG methods. Most notably, for extremely anisotropic heat conduction operators arising in magnetic confinement fusion, where AMG and smoothed aggregation fail to reduce the residual even marginally, our method provides robust and efficient convergence across many orders of magnitude in anisotropy strength."}
{"id": "2601.03946", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.03946", "abs": "https://arxiv.org/abs/2601.03946", "authors": ["Valentine Olanubi", "Phineas Agar", "Brendan Ames"], "title": "Provably Finding a Hidden Dense Submatrix among Many Planted Dense Submatrices via Convex Programming", "comment": null, "summary": "We consider the densest submatrix problem, which seeks the submatrix of fixed size of a given binary matrix that contains the most nonzero entries. This problem is a natural generalization of fundamental problems in combinatorial optimization, e.g., the densest subgraph, maximum clique, and maximum edge biclique problems, and has wide application the study of complex networks. Much recent research has focused on the development of sufficient conditions for exact solution of the densest submatrix problem via convex relaxation. The vast majority of these sufficient conditions establish identification of the densest submatrix within a graph containing exactly one large dense submatrix hidden by noise. The assumptions of these underlying models are not observed in real-world networks, where the data may correspond to a matrix containing many dense submatrices of varying sizes.\n  We extend and generalize these results to the more realistic setting where the input matrix may contain \\emph{many} large dense subgraphs. Specifically, we establish sufficient conditions under which we can expect to solve the densest submatrix problem in polynomial time for random input matrices sampled from a generalization of the stochastic block model. Moreover, we also provide sufficient conditions for perfect recovery under a deterministic adversarial. Numerical experiments involving randomly generated problem instances and real-world collaboration and communication networks are used empirically to verify the theoretical phase-transitions to perfect recovery given by these sufficient conditions."}
{"id": "2601.04002", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.04002", "abs": "https://arxiv.org/abs/2601.04002", "authors": ["Michael McAuley"], "title": "Limit theorems for non-local functionals of smooth Gaussian fields via quasi-association", "comment": null, "summary": "Many classical objects of study related to the geometry/topology of smooth Gaussian fields (e.g. the volume, surface area or Euler characteristic of excursion sets) have a `locality' property which is crucial to their analysis. More recently, progress has been made in studying `non-local' quantities of such fields (e.g. the component/nodal count or the Betti numbers of excursion sets). In this work we establish limit theorems for non-local, approximately additive functionals of stationary fields evaluated on growing domains. Specifically we show that, for weakly dependent fields, such functionals satisfy a law of large numbers, have variance which is asymptotic to the volume of the domain and satisfy both quantitative and almost-sure central limit theorems. Our approach uses a covariance formula for topological events to establish a form of quasi-association for the functionals."}
{"id": "2601.04119", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.04119", "abs": "https://arxiv.org/abs/2601.04119", "authors": ["Martin Ehler", "Karlheinz Gröchenig"], "title": "Quantitative Constraints for Stable Sampling on the Sphere", "comment": null, "summary": "We derive quantitative volume constraints for sampling measures $μ_t$ on the unit sphere $\\mathbb{S}^d$ that satisfy Marcinkiewicz-Zygmund inequalities of order $t$. Using precise localization estimates for Jacobi polynomials, we obtain explicit upper and lower bounds on the $μ_t$-mass of geodesic balls at the natural scale $t^{-1}$. Whereas constants are typically left implicit in the literature, we place special emphasis on fully explicit constants, and the results are genuinely quantitative. Moreover, these bounds yield quantitative constraints for the $s$-dimensional Hausdorff volume of Marcinkiewicz-Zygmund sampling sets and, in particular, optimal lower bounds for the length of Marcinkiewicz-Zygmund curves."}
{"id": "2601.04003", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.04003", "abs": "https://arxiv.org/abs/2601.04003", "authors": ["P. Gangl", "M. Winkler"], "title": "Continuation methods for higher-order topology optimization", "comment": null, "summary": "We aim to solve a topology optimization problem where the distribution of material in the design domain is represented by a density function. To obtain candidates for local minima, we want to solve the first order optimality system via Newton's method. This requires the initial guess to be sufficiently close to the a priori unknown solution. Introducing a stepsize rule often allows for less restrictions on the initial guess while still preserving convergence. In topology optimization one typically encounters nonconvex problems where this approach might fail. We therefore opt for a homotopy (continuation) approach which is based on solving a sequence of parametrized problems to approach the solution of the original problem. In the density based framework the values of the design variable are constrained by 0 from below and 1 from above. Coupling the homotopy method with a barrier strategy enforces these constraints to be satisified. The numerical results for a PDE-constrained compliance minimization problem demonstrate that this combined approach maintains feasibility of the density function and converges to a (candidate for a) locally optimal design without a priori knowledge of the solution."}
{"id": "2601.04038", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.04038", "abs": "https://arxiv.org/abs/2601.04038", "authors": ["Tord Sjödin"], "title": "The Power Problem for Generalized Gamma Convolutions (GGC) and Related Questions", "comment": "11 pages", "summary": "The class of generalized gamma convolutions (GGC) is closed with respect to (wrt) change of scales, weak limits and addition and multiplication of independent random variables. Our main result adds the new property that GGC is also closed wrt q-th powers, q>1. The proof uses explicit formulas for the densities of finite sums of independent gamma variables, hyperbolically completely monotone functions (HCM) and the Laplace transform. The result is applied to sums and products of independent gamma variables and to symmetric extended GGC (symEGGC)."}
{"id": "2601.04132", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.04132", "abs": "https://arxiv.org/abs/2601.04132", "authors": ["Matieyendou Lamboni", "Sergei Kucherenko"], "title": "Active subspace methods and derivative-based Shapley effects for functions with non-independent variables", "comment": null, "summary": "Lower-dimensional subspaces that impact estimates of uncertainty are often described by Linear combinations of input variables, leading to active variables. This paper extends the derivative-based active subspace methods and derivative-based Shapley effects to cope with functions with non-independent variables, and it introduces sensitivity-based active subspaces. While derivative-based subspace methods focus on directions along which the function exhibits significant variation, sensitivity-based subspace methods seek a reduced set of active variables that enables a reduction in the function's variance. We propose both theoretical results using the recent development of gradients of functions with non-independent variables and practical settings by making use of optimal computations of gradients, which admit dimension-free upper-bounds of the biases and the parametric rate of convergence. Simulations show that the relative performance of derivative-based and sensitivity-based active subspaces methods varies across different functions."}
{"id": "2601.04120", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.04120", "abs": "https://arxiv.org/abs/2601.04120", "authors": ["Yongcun Song", "Shangzhi Zeng", "Jin Zhang", "Lvgang Zhang"], "title": "A Single-Loop Bilevel Deep Learning Method for Optimal Control of Obstacle Problems", "comment": null, "summary": "Optimal control of obstacle problems arises in a wide range of applications and is computationally challenging due to its nonsmoothness, nonlinearity, and bilevel structure. Classical numerical approaches rely on mesh-based discretization and typically require solving a sequence of costly subproblems. In this work, we propose a single-loop bilevel deep learning method, which is mesh-free, scalable to high-dimensional and complex domains, and avoids repeated solution of discretized subproblems. The method employs constraint-embedding neural networks to approximate the state and control and preserves the bilevel structure. To train the neural networks efficiently, we propose a Single-Loop Stochastic First-Order Bilevel Algorithm (S2-FOBA), which eliminates nested optimization and does not rely on restrictive lower-level uniqueness assumptions. We analyze the convergence behavior of S2-FOBA under mild assumptions. Numerical experiments on benchmark examples, including distributed and obstacle control problems with regular and irregular obstacles on complex domains, demonstrate that the proposed method achieves satisfactory accuracy while reducing computational cost compared to classical numerical methods."}
{"id": "2601.04079", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.04079", "abs": "https://arxiv.org/abs/2601.04079", "authors": ["Aryeh Kontorovich"], "title": "TV homogenization inequalities", "comment": null, "summary": "We study the total variation distance under two information-erasing maps on inhomogeneous Bernoulli product measures: summation and homogenization. While summation is a Markov kernel and hence satisfies the usual data processing inequality, homogenization -- which maps each Bernoulli parameter to the cumulative mean -- is not. Nevertheless, we prove that the homogenization map also reduces the TV distance, up to a universal constant. The argument is based on an explicit two-sided control of the TV distance between Poisson binomials, obtained via a parameter interpolation and a second-moment extraction lemma."}
{"id": "2601.04148", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.04148", "abs": "https://arxiv.org/abs/2601.04148", "authors": ["Dhivya Prabhu K", "Sanjeev Singh", "Antony Vijesh"], "title": "Efficient third-order iterative algorithms for computing zeros of special functions", "comment": null, "summary": "This manuscript presents a novel and reliable third-order iterative procedure for computing the zeros of solutions to second-order ordinary differential equations. By approximating the solution of the related Riccati differential equation using the trapezoidal rule, this study has derived the proposed third-order method. This work establishes sufficient conditions to ensure the theoretical non-local convergence of the proposed method. This study provides suitable initial guesses for the proposed third-order iterative procedure to compute all zeros in a given interval of the solutions to second-order ordinary differential equations. The orthogonal polynomials like Legendre and Hermite, as well as the special functions like Bessel, Coulomb wave, confluent hypergeometric, and cylinder functions, satisfy the proposed conditions for convergence. Numerical simulations demonstrate the effectiveness of the proposed theory. This work also presents a comparative analysis with recent studies."}
{"id": "2601.03931", "categories": ["math.NA", "math.OC", "physics.chem-ph", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.03931", "abs": "https://arxiv.org/abs/2601.03931", "authors": ["Yukuan Hu", "Laura Grazioli"], "title": "Constrained dynamics for searching saddle points on general Riemannian manifolds", "comment": "35 pages, 6 figures, 2 tables. All comments are welcome", "summary": "Finding constrained saddle points on Riemannian manifolds is significant for analyzing energy landscapes arising in physics and chemistry. Existing works have been limited to special manifolds that admit global regular level-set representations, excluding applications such as electronic excited-state calculations. In this paper, we develop a constrained saddle dynamics applicable to smooth functions on general Riemannian manifolds. Our dynamics is formulated compactly over the Grassmann bundle of the tangent bundle. By analyzing the Grassmann bundle geometry, we achieve universality via incorporating the second fundamental form, which captures variations of tangent spaces along the trajectory. We rigorously establish the local linear stability of the dynamics and the local linear convergence of the resulting algorithms. Remarkably, our analysis provides the first convergence guarantees for discretized saddle-search algorithms in manifold settings. Moreover, by respecting the intrinsic quotient structure, we remove unnecessary nondegeneracy assumptions on the eigenvalues of the Riemannian Hessian that are present in existing works. We also point out that locating saddle points can be more ill-conditioning than finding local minimizers, and requires using nonredundant parametrizations. Finally, numerical experiments on linear eigenvalue problems and electronic excited-state calculations showcase the effectiveness of the proposed algorithms and corroborate the established local theory."}
{"id": "2601.04161", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.04161", "abs": "https://arxiv.org/abs/2601.04161", "authors": ["Ayan Ghosh"], "title": "Ergodic Theorems and Equivalence of Green's Kernel for Random Walks in Random Environments", "comment": null, "summary": "We study the Ergodic Properties of Random Walks in stationary ergodic environments without uniform ellipticity under a minimal assumption. There are two main components in our work. The first step is to adopt the arguments of Lawler to first prove a uniqueness principle. We use a more general definition of environments using~\\textit{Environment Functions}. As a corollary, we can deduce an invariance principle under these assumptions for balanced environments under some assumptions. We also use the uniqueness principle to show that any balanced, elliptic random walk must have the same transience behaviour as the simple symmetric random walk. The second is to transfer the results we deduce in balanced environments to general ergodic environments(under some assumptions) using a control technique to derive a measure under which the \\textit{local process} is stationary and ergodic. As a consequence of our results, we deduce the Law of Large Numbers for the Random Walk and an Invariance Principle under our assumptions."}
{"id": "2601.04167", "categories": ["math.NA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.04167", "abs": "https://arxiv.org/abs/2601.04167", "authors": ["Anıl Zenginoğlu"], "title": "From Penrose to Melrose: Computing Scattering Amplitudes at Infinity for Unbounded Media", "comment": "36 pages, 11 figures", "summary": "We develop a method to compute scattering amplitudes for the Helmholtz equation in variable, unbounded media with possibly long-range asymptotics. Combining Penrose's conformal compactification and Melrose's geometric scattering theory, we formulate the time-harmonic scattering problem on a compactified manifold with boundary and construct a two-step solver for scattering amplitudes at infinity. The construction is asymptotic: it treats a neighborhood of infinity, and is meant to couple to interior solvers via domain decomposition. The method provides far-field data without relying on explicit solutions or Green's function representation. Scattering in variable media is treated in a unified framework where both the incident and scattered fields solve the same background Helmholtz operator. Numerical experiments for constant, short-range, and long-range media with single-mode and Gaussian beam incidence demonstrate spectral convergence of the computed scattering amplitudes in all cases."}
{"id": "2601.03967", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.03967", "abs": "https://arxiv.org/abs/2601.03967", "authors": ["M. H. Gfrerer", "P. Gangl"], "title": "On the importance of smoothness, interface resolution and numerical sensitivities in shape and topological sensitivity analysis", "comment": null, "summary": "In this paper we investigate the influence of the discretization of PDE constraints on shape and topological derivatives. To this end, we study a tracking-type functional and a two-material Poisson problem in one spatial dimension. We consider the discretization by a standard method and an enriched method. In the standard method we use splines of degree $p$ such that we can control the smoothness of the basis functions easily, but do not take any interface location into consideration. This includes for p=1 the usual hat basis functions. In the enriched method we additionally capture the interface locations in the ansatz space by enrichment functions. For both discretization methods shape and topological sensitivity analysis is performed. It turns out that the regularity of the shape derivative depends on the regularity of the basis functions. Furthermore, for point-wise convergence of the shape derivative the interface has to be considered in the ansatz space. For the topological derivative we show that only the enriched method converges."}
{"id": "2601.03333", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.03333", "abs": "https://arxiv.org/abs/2601.03333", "authors": ["Mrinal Kanti Roychowdhury"], "title": "Optimal Quantization of Finite Uniform Data on the Sphere", "comment": null, "summary": "This paper develops a systematic and geometric theory of optimal quantization on the unit sphere $\\mathbb S^2$, focusing on finite uniform probability distributions supported on the spherical surface - rather than on lower-dimensional geodesic subsets such as circles or arcs. We first establish the existence of optimal sets of $n$-means and characterize them through centroidal spherical Voronoi tessellations. Three fundamental structural results are obtained. First, a cluster - purity theorem shows that when the support consists of well-separated components, each optimal Voronoi region remains confined to a single component. Second, a ring - allocation (discrete water - filling) theorem provides an explicit rule describing how optimal representatives are distributed across multiple latitudinal rings, together with closed-form distortion formulas. Third, a Lipschitz - type stability theorem quantifies the robustness of optimal configurations under small geodesic perturbations of the support. In addition, a spherical analogue of Lloyd's algorithm is presented, in which intrinsic (Karcher) means replace Euclidean centroids for iterative refinement. These results collectively provide a unified and transparent framework for understanding the geometric and algorithmic structure of optimal quantization on $\\mathbb S^2$."}
{"id": "2601.03747", "categories": ["math.OC", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.03747", "abs": "https://arxiv.org/abs/2601.03747", "authors": ["Julia Ackermann", "Thomas Kruse", "Petr Petrov", "Alexandre Popier"], "title": "Matrix Riccati BSDEs with singular terminal condition and stochastic LQ control with linear terminal constraint", "comment": null, "summary": "We analyze a class of multidimensional linear-quadratic stochastic control problems with random coefficients, motivated by multi-asset optimal trade execution. The problems feature non-diffusive controlled state dynamics and a terminal constraint that restricts the terminal state to a prescribed random linear subspace. We derive the associated Riccati backward stochastic differential equation (BSDE) and identify a suitable formalization of its singular terminal condition. Via a penalization approach, we establish existence of a minimal supersolution of the Riccati BSDE and use it to characterize both the value function and the optimal control. We analyze the asymptotic behavior of the supersolution near terminal time and discuss special cases where closed-form solutions can be obtained."}
{"id": "2601.04132", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.04132", "abs": "https://arxiv.org/abs/2601.04132", "authors": ["Matieyendou Lamboni", "Sergei Kucherenko"], "title": "Active subspace methods and derivative-based Shapley effects for functions with non-independent variables", "comment": null, "summary": "Lower-dimensional subspaces that impact estimates of uncertainty are often described by Linear combinations of input variables, leading to active variables. This paper extends the derivative-based active subspace methods and derivative-based Shapley effects to cope with functions with non-independent variables, and it introduces sensitivity-based active subspaces. While derivative-based subspace methods focus on directions along which the function exhibits significant variation, sensitivity-based subspace methods seek a reduced set of active variables that enables a reduction in the function's variance. We propose both theoretical results using the recent development of gradients of functions with non-independent variables and practical settings by making use of optimal computations of gradients, which admit dimension-free upper-bounds of the biases and the parametric rate of convergence. Simulations show that the relative performance of derivative-based and sensitivity-based active subspaces methods varies across different functions."}
