{"id": "2602.12293", "categories": ["math.OC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.12293", "abs": "https://arxiv.org/abs/2602.12293", "authors": ["Ayrton Almada", "Laurent Pagnier", "Igal Goldshtein", "Saif R. Kazi", "Michael", "Chertkov"], "title": "Real-Time Dynamic N-1 Screening: Identifying High-Risk Lines and Transformers After Common Faults", "comment": "9 pages, 7 figures, 3 Tables, 1 Algorithm. arXiv admin note: substantial text overlap with arXiv:2510.18007", "summary": "Power system operators routinely perform N-1 contingency analysis, yet conventional tools provide limited guidance on which lines or transformers deserve heightened attention during fast post-fault transients. In particular, static screening does not reveal whether (1) the same faulted line repeatedly triggers severe downstream overloads, or (2) a specific transformer emerges as vulnerable across many distinct fault scenarios. This paper introduces a real-time dynamic N-1 screening framework that addresses this gap by estimating, for each counterfactual single-phase transmission fault, the probability of transient overcurrent on critical grid elements. The output is an operator-facing dashboard that ranks (a) faulted lines whose outages most frequently lead to dangerous transformer overloads, and (b) transformers that consistently overload across top-risk scenarios, both of which are actionable indicators for real-time situational awareness. The approach models post-fault electromechanical dynamics using a linear stochastic formulation of the swing equations with short-lived, fault-localized uncertainty, and combines analytic transient evaluation with cross-entropy based importance sampling to efficiently estimate rare but high-impact events. All N-1 contingencies are evaluated in parallel with linear computational complexity. The framework is demonstrated on the IEEE 118-bus system, where it reveals latent high-risk lines and transformers that remain invisible under deterministic dynamic or static N-1 analysis. Results show orders-of-magnitude computational speedup relative to brute-force Monte Carlo, enabling practical deployment within real-time operational cycles."}
{"id": "2602.12455", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12455", "abs": "https://arxiv.org/abs/2602.12455", "authors": ["M. H. Alizadeh", "F. Lara"], "title": "Existence Results and KKT Optimality Conditions for Generalized Quasiconvex Functions", "comment": null, "summary": "We studied a new notion of generalized convex functions called $e$-quasi\\-con\\-ve\\-xi\\-ty, which encompasses both quasiconvex and $e$-convex functions, including all Lipschitz functions. By extending the standard properties of quasiconvex functions to $e$-quasiconvex functions, we establish sufficient conditions for the nonemptiness and compactness of the solution set when minimizing an $e$-quasiconvex function, leveraging generalized asymptotic functions, a result which remains applicable even when the set of minimizers is nonconvex. Furthermore, in the differentiable case, we ensure the sufficiency of the KKT optimality conditions when the constraint functions in the mathematical programming problems are $e$-quasiconvex. Finally, we illustrate our new results with several nonconvex (non-quasiconvex) examples."}
{"id": "2602.12513", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12513", "abs": "https://arxiv.org/abs/2602.12513", "authors": ["Jiashuo Jiang", "Mengxiao Zhang"], "title": "An LP-Based Approach for Bilinear Saddle Point Problem with Instance-dependent Guarantee and Noisy Feedback", "comment": null, "summary": "In this work, we study the sample complexity of obtaining a Nash equilibrium (NE) estimate in two-player zero-sum matrix games with noisy feedback. Specifically, we propose a novel algorithm that repeatedly solves linear programs (LPs) to obtain an NE estimate with bias at most $\\varepsilon$ with a sample complexity of $O\\left(\\frac{m_1 m_2}{\\varepsilon\\min\\{δ^2,σ_0^2,σ^3\\}} \\log\\frac{m_1 m_2}{\\varepsilon}\\right)$ for general $m_1 \\times m_2$ game matrices, where $σ$, $σ_0$, $δ$ are some problem-dependent constants. To our knowledge, this is the first instance-dependent sample complexity bound for finding an NE estimate with $\\varepsilon$ bias in general-dimension matrix games with noisy feedback and potentially non-unique equilibria. Our algorithm builds on recent advances in online resource allocation and operates in two stages: (1) identifying the support set of an NE, and (2) computing the unique NE restricted to this support. Both stages rely on a careful analysis of LP solutions derived from noisy samples."}
{"id": "2602.12698", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.12698", "abs": "https://arxiv.org/abs/2602.12698", "authors": ["Hoai-Minh Nguyen"], "title": "Optimal bounds for the cost of fast controls of a KdV system", "comment": null, "summary": "We study the cost of fast controls for a linearized KdV system and a nonlinear KdV system locally, using right Neumann boundary control for non-critical lengths. Since the operator associated with the linearized system is neither self-adjoint nor skew-adjoint, its (known) spectral properties are not directly amenable to the moment method, leaving optimal cost bounds an open problem. We address this difficulty by shifting attention to a related KdV system and deriving the optimal bounds from the new one."}
{"id": "2602.12369", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.12369", "abs": "https://arxiv.org/abs/2602.12369", "authors": ["Farrukh Mukhamedov", "Muzaffar Rahmatullaev", "Obid Karshiboev"], "title": "Splitting Gibbs Measures for a Periodic Triple Mixed-Spin Ising Model on a Cayley Tree", "comment": "32 pages, 5 figures", "summary": "We consider an Ising model on the Cayley tree $Γ_k$ of arbitrary order $k\\ge1$ with three spin species of values $(\\tfrac12,1,\\tfrac32)$ distributed deterministically with period three along the generations. Within the framework of splitting Gibbs measures, we derive the exact boundary-law compatibility equations and characterize translation-invariant splitting Gibbs measures (TISGMs) via a finite system of algebraic relations. In the ferromagnetic regime $J>0$, writing $θ=\\exp(βJ/2)$, we further reduce the translation-invariant problem to a one-dimensional scalar fixed-point equation $x=f(x,θ,k)$ for a rational map $f$. We show that $f$ is strictly increasing and obtain an explicit sufficient condition for phase coexistence: if $s_k(θ)=f'(1,θ,k)-1>0$, then $x=f(x,θ,k)$ admits at least three distinct positive solutions, yielding at least three distinct TISGMs and hence a phase transition driven by the periodic inhomogeneity of the spin structure.\n  For the binary tree $k=2$ we exploit attractiveness to construct plus and minus Gibbs measures as weak limits with extremal boundary conditions, prove that they are TISGMs corresponding to the minimal and maximal fixed points of $f(\\cdot,θ,2)$, and show that they are the minimal and maximal Gibbs measures in the natural stochastic order. Finally, we construct the tree-indexed Markov chain associated with a TISGM and apply the Kesten--Stigum criterion to the disordered TISGM, identifying nonempty parameter regions where this measure is non-extremal and reconstruction occurs."}
{"id": "2602.12568", "categories": ["math.ST", "cs.SI", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.12568", "abs": "https://arxiv.org/abs/2602.12568", "authors": ["Anirudh Sridhar", "Arnob Ghosh"], "title": "Finding Super-spreaders in SIS Epidemics", "comment": "6 pages, 3 figures", "summary": "In network epidemic models, controlling the spread of a disease often requires targeted interventions such as vaccinating high-risk individuals based on network structure. However, typical approaches assume complete knowledge of the underlying contact network, which is often unavailable. While network structure can be learned from observed epidemic dynamics, existing methods require long observation windows that may delay critical interventions.\n  In this work, we show that full network reconstruction may not be necessary: control-relevant features, such as high-degree vertices (super-spreaders), can be learned far more efficiently than the complete structure. Specifically, we develop an algorithm to identify such vertices from the dynamics of a Susceptible-Infected-Susceptible (SIS) process. We prove that in an $n$-vertex graph, vertices of degree at least $n^α$ can be identified over an observation window of size $Ω(1/α)$, for any $α\\in (0,1)$. In contrast, existing methods for exact network reconstruction requires an observation window that grows linearly with $n$. Simulations demonstrate that our approach accurately identifies super-spreaders and enables effective epidemic control."}
{"id": "2602.12337", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12337", "abs": "https://arxiv.org/abs/2602.12337", "authors": ["Shun Li", "Yan Jiang", "Mengping Zhang", "Tao Xiong"], "title": "Temporal-Stability-Enhanced and Energy-Stable Dynamical Low-Rank Approximation for Multiscale Linear Kinetic Transport Equations", "comment": "29 pages, 29 figures, 1 table, 40 references", "summary": "In this paper, we develop an asymptotic-preserving dynamical low-rank method for the multiscale linear kinetic transport equation. The proposed scheme is unconditionally stable in the diffusive regime while preserving the correct asymptotic behavior, and can achieve significant reductions in computational cost through a low-rank representation and large time step stability. A low-rank formulation consistent with the discrete energy is introduced under the discrete ordinates discretization, and energy stability of the resulting scheme is established. Numerical experiments confirm the energy stability and demonstrate that the method is efficient while maintaining accuracy across different regimes and capturing the correct asymptotic limits."}
{"id": "2602.12807", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12807", "abs": "https://arxiv.org/abs/2602.12807", "authors": ["Alessandra Cutrì", "Paola Mannucci", "Claudio Marchi", "Nicoletta Tchou"], "title": "Constrained Mean Field Games with Grushin type dynamics", "comment": "22 pages", "summary": "This paper is devoted to a class of finite horizon deterministic mean field games with Grushin type dynamics, state constraints and nonlocal coupling. First, we consider the optimal control problem that each agent aims to solve when the evolution of the population is given and we establish some properties as: the existence of an optimal trajectory for any starting point $(x,t)$, the closed graph property for the multivalued map which associates to each point $(x,t)$ the set of optimal trajectories starting from that point, endowed with a suitable notion of convergence, the continuity of the value function. The main issue to overcome is due to the local interplay at boundary points between the set of state constraints and the degenerate dynamics. To this end, we shall point out two different sets of assumptions which are both sufficient for these properties. Afterwards, we tackle the mean field games; taking advantage of the aforementioned properties, we prove the existence of a relaxed equilibrium (which describes the evolution of the game in terms of a probability on the set of admissible trajectories) and derive the existence of a mild solution (which is a couple formed by the value function for the generic player and a family of time dependent measures on the state)."}
{"id": "2602.12456", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.12456", "abs": "https://arxiv.org/abs/2602.12456", "authors": ["Jinlong Wei", "Junhao Hu", "Guangying Lv", "Chenggui Yuan"], "title": "Strong solutions and sharp Euler--Maruyama approximations for SDEs with Lebesgue--Dini drift", "comment": "27 pages", "summary": "We investigate the strong approximation of stochastic differential equations whose drift is square-integrable in time and Dini continuous in space, while the diffusion coefficient is non-constant and uniformly elliptic. Using a refined Itô--Tanaka trick combined with parabolic regularity estimates, we first establish strong well-posedness and the stochastic flow property. Under additional Lipschitz regularity of the diffusion matrix, we then analyze a polygonal-type Euler--Maruyama scheme and prove the strong error estimate \\[ \\Big\\|\\sup_{0\\le t\\le1}|X_t-X_t^n|\\Big\\|_{L^p(Ω)} \\le C n^{-\\frac12}\\log(n)^{\\frac32}, \\quad p\\ge2. \\] We further show that this rate is sharp: even under smooth and uniformly elliptic diffusion coefficients with vanishing drift, the convergence order $1/2$ cannot be improved. These results provide the first sharp quantitative strong convergence estimates in a Lebesgue--Dini drift framework."}
{"id": "2602.12589", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.12589", "abs": "https://arxiv.org/abs/2602.12589", "authors": ["Zhijun Cai", "Xiang Li", "Lihu Xu"], "title": "Berry-Esseen Bounds and Moderate Deviations for Catoni-Type Robust Estimation", "comment": null, "summary": "A powerful robust mean estimator introduced by Catoni (2012) allows for mean estimation of heavy-tailed data while achieving the performance characteristics of classical mean estimator for sub-Gaussian data. While Catoni's framework has been widely extended across statistics, stochastic algorithms, and machine learning, fundamental asymptotic questions regarding the Central Limit Theorem and rare event deviations remain largely unaddressed. In this paper, we investigate Catoni-type robust estimators in two contexts: (i) mean estimation for heavy-tailed data, and (ii) linear regression with heavy-tailed innovations. For the first model, we establish the Berry--Esseen bound and moderate deviation principles, addressing both known and unknown variance settings. For the second model, we demonstrate that the associated estimator is consistent and satisfies a multi-dimensional Berry-Esseen bound."}
{"id": "2602.12365", "categories": ["math.NA", "cond-mat.soft"], "pdf": "https://arxiv.org/pdf/2602.12365", "abs": "https://arxiv.org/abs/2602.12365", "authors": ["Mohit Pundir", "Flavio Lorez", "David S. Kammer"], "title": "A versatile FEM framework with native GPU scalability via globally-applied AD", "comment": null, "summary": "Energy-based finite-element formulations provide a unified framework for describing complex physical systems in computational mechanics. In these energy-based methods, the governing equations can be obtained directly by considering the derivatives of a single global energy functional. While Automatic Differentiation (AD) can be used to automate the generation of these derivatives, current frameworks face a clear trade-off based primarily on the scale upon which the AD method is applied. Globally applied AD offers high expressivity but cannot currently be scaled to large problems. Locally applied AD scales well through traditional assembly methods, but the variety of physics and couplings that the framework can easily represent is more limited than the global approach. Here, we introduce an energy-centric framework tatva (https://github.com/smec-ethz/tatva) that defines the physics of a problem as a single global functional and applies AD globally to generate residual and tangent operators. By leveraging Jacobian-vector products for matrix-free solvers and coloring-based sparse differentiation for materializing sparse tangent stiffness matrices when needed, our flexible design scales linearly with the problem size on GPUs. We demonstrate that our framework can handle large problems (with millions of degrees of freedom) without memory exhaustion. Additionally, it offers a unified, fully differentiable methodology that can address a wide range of problems, including multi-point constraints, mixed-dimensional coupling, and the incorporation of neural networks, while maintaining high performance and scalability on modern GPU architectures."}
{"id": "2602.12821", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12821", "abs": "https://arxiv.org/abs/2602.12821", "authors": ["Stephanie Caro", "Abderrahim Hantoute"], "title": "Explicit data-dependent characterizations of the subdifferential of convex pointwise suprema and optimality conditions", "comment": null, "summary": "We establish explicit data-dependent and symmetric characterizations of the subdifferential of the supremum of convex functions, formulated directly in terms of the underlying data functions. In our approach, both active and non-active functions contribute equally through their subdifferentials, thereby avoiding the need for additional geometric constructions, such as the domain of the supremum, that arise in previous developments. Applications to infinite convex optimization yield sharp Karush-Kuhn-Tucker and Fritz-John optimality conditions, expressed exclusively in terms of the objective and constraint functions and clearly distinguishing the roles of (almost) active and non-active constraints."}
{"id": "2602.12523", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.12523", "abs": "https://arxiv.org/abs/2602.12523", "authors": ["Jose Correa", "Marcos Kiwi", "Vasilis Livanos", "Eilon Solan", "Ron Solan"], "title": "About a Ball Removal Process on Bins", "comment": null, "summary": "Consider the following process whereby $n$ balls are distributed into $k$ bins. Repeatedly, a ball is removed from a non-empty bin chosen uniformly at random. The process ends when a single non-empty bin remains. Will Ma (see~\\cite[Sec.~1.1]{GS24}) asked whether the initial assignment that minimizes the expected number of remaining balls is one that is as balanced as possible. Using a coupling argument we answer this conjecture positively, and we discuss the case of non-uniform choice among the non-empty bins."}
{"id": "2602.12604", "categories": ["math.ST", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.12604", "abs": "https://arxiv.org/abs/2602.12604", "authors": ["Joowon Lee", "Guanhua Chen"], "title": "Differentially Private Two-Stage Empirical Risk Minimization and Applications to Individualized Treatment Rule", "comment": "27 pages, 2 figures. Technical proofs are omitted for the initial version. It will be included in future versions", "summary": "Differential Privacy (DP) provides a rigorous framework for deriving privacy-preserving estimators by injecting calibrated noise to mask individual contributions while preserving population-level insights. Its central challenge lies in the privacy-utility trade-off: calibrating noise levels to ensure robust protection without compromising statistical performance. Standard DP methods struggle with a particular class of two-stage problems prevalent in individualized treatment rules (ITRs) and causal inference. In these settings, data-dependent weights are first computed to satisfy distributional constraints, such as covariate balance, before the final parameter of interest is estimated. Current DP approaches often privatize stages independently, which either degrades weight efficacy-leading to biased and inconsistent estimates-or introduces excessive noise to account for worst-case scenarios.\n  To address these challenges, we propose the Differentially Private Two-Stage Empirical Risk Minimization (DP-2ERM), a framework that injects a carefully calibrated noise only into the second stage while maintaining privacy for the entire pipeline and preserving the integrity of the first stage weights. Our theoretical contributions include deterministic bounds on weight perturbations across various widely used weighting methods, and probabilistic bounds on sensitivity for the final estimator. Simulations and real-world applications in ITR demonstrate that DP-2ERM significantly enhances utility over existing methods while providing rigorous privacy guarantees."}
{"id": "2602.12409", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.12409", "abs": "https://arxiv.org/abs/2602.12409", "authors": ["Bankim C. Mandal", "Deeksha Tomer"], "title": "Dirichlet-Neumann Waveform Relaxation Method with Multiple Subdomains for Reaction-Diffusion Equation with a Time Delay", "comment": null, "summary": "In this study, we present the numerical investigation of the Dirichlet-Neumann Waveform Relaxation (DNWR) algorithm applied to multiple subdomains for the reaction-diffusion equation with time delay. Various arrangements of transmission conditions between subdomains are explored and a series of numerical experiments are conducted to evaluate and compare the efficiency and effectiveness of these configurations."}
{"id": "2602.12867", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12867", "abs": "https://arxiv.org/abs/2602.12867", "authors": ["Kezang Yuden", "Levin Nemesch", "Stefan Ruzika"], "title": "Parametric Biobjective Linear Programming", "comment": null, "summary": "We consider parametric linear programming problems with multiple objective functions depending linearly on some parameter. Both parametric (single-objective) linear programming and (non-parametric) multi-objective linear programming are well-researched topics. However, literature on the combination of both, parametric linear programming with multiple objectives, is scarce. This research gap encourages our work in this field. Our main focus is on biobjective linear programs with a single parameter. We establish a connection of this problem to non-parametric multi-objective problems. Using the so-called weight set decomposition, we are able to explain the behavior of parametric biobjective linear programs when the parameter value is variated. We investigate two special cases of parametric biobjective linear programs: In the first, there is only one parametric objective and, in the second, the parametric dependency is the same for both objectives. We prove that there is a one-to-one correspondence between the solution of the parametric program and the solution of the triobjective program using the weighted sum scalarization. We provide structural insights to the solution of the parametric biobjective linear program with respect to extreme weights of the weight set of the triobjective linear program and develop solution strategies for the parametric program."}
{"id": "2602.12581", "categories": ["math.PR", "math.FA", "math.NA", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.12581", "abs": "https://arxiv.org/abs/2602.12581", "authors": ["Paulo Manrique"], "title": "The condition number of a random banded Toeplitz matrix is typically large", "comment": null, "summary": "It is well known that square matrices with independent and identically distributed (iid) random entries are typically well conditioned. A natural question is whether this favorable behavior persists for random matrices whose entries obey additional structure, i.e., their position inside of the matrix. A prominent class of structured matrices is given by {\\it Toeplitz matrices}, characterized by constant diagonals. A particular tractable subclass is that of circulant matrices, whose additional characteristic (its entries {\\it circulate} row by row) allows one to express their conditioning in terms of the localization of the zeros of a associated polynomial. When the entries of a circulant matrix are iid, the matrix is well conditioned precisely when the corresponding random polynomial has no zeros on the unit circle. This connection is especially relevant because, as the degree of a random polynomial increases, its zeros tend to concentrate near the unit circle, making it a delicate problem to quantify how close the closest zeros lie to the unit circle. Another notable family within the Toeplitz class is that of {\\it banded Toeplitz matrices}, namely matrices for which only finitely many diagonals around the main diagonal may be nonzero. These matrices have been extensively studied in Operator Theory, nevertheless, despite their apparent simplicity, they raise subtle questions regarding the behavior of their condition numbers. In present work we show that the bandwidth asymmetry plays a decisive role: if the band contains $r$ diagonals below and $s$ diagonal above the main diagonal, then if $r=s$ the banded Toeplitz matriz is well conditioned with high probability, whereas if $r\\neq s$ it is typically ill conditioned. This highlights that structural constraints can have a impact on the numerical behavior of random matrices."}
{"id": "2602.12653", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.12653", "abs": "https://arxiv.org/abs/2602.12653", "authors": ["Tianxing Mei", "Chen Wang", "Jianfeng Yao"], "title": "Many-sample tests for the dimensionality hypothesis for large covariance matrices among groups", "comment": "41pages, 2 figures", "summary": "In this paper, we consider procedures for testing hypotheses on the dimension of the linear span generated by a growing number of $p\\times p$ covariance matrices from independent $q$ populations. Under a proper limiting scheme where all the parameters, $q$, $p$, and the sample sizes from the $q$ populations, are allowed to increase to infinity, we derive the asymptotic normality of the proposed test statistics. The proposed test procedures show satisfactory performance in finite samples under both the null and the alternative. We also apply the proposed many-sample dimensionality test to investigate a matrix-valued gene dataset from the Mouse Aging Project and gain some new knowledge about its covariance structures."}
{"id": "2602.12483", "categories": ["math.NA", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.12483", "abs": "https://arxiv.org/abs/2602.12483", "authors": ["Sofiia Shvaiko", "Longxiu Huang", "Elizaveta Rebrova"], "title": "Quantile Randomized Kaczmarz Algorithm with Whitelist Trust Mechanism", "comment": "Accepted by ICASSP 2026", "summary": "Randomized Kaczmarz (RK) is a simple and fast solver for consistent overdetermined systems, but it is known to be fragile under noise. We study overdetermined $m\\times n$ linear systems with a sparse set of corrupted equations, $ {\\bf A}{\\bf x}^\\star = {\\bf b}, $where only $\\tilde{\\bf b} = {\\bf b} + \\boldsymbol{\\varepsilon}$ is observed with $\\|\\boldsymbol{\\varepsilon}\\|_0 \\le βm$. The recently introduced QuantileRK (QRK) algorithm addresses this issue by testing residuals against a quantile threshold, but computing a per-iteration quantile across many rows is costly. In this work we (i) reanalyze QRK and show that its convergence rate improves monotonically as the corruption fraction $β$ decreases; (ii) propose a simple online detector that flags and removes unreliable rows, which reduces the effective $β$ and speeds up convergence; and (iii) make the method practical by estimating quantiles from a small random subsample of rows, preserving robustness while lowering the per-iteration cost. Simulations on imaging and synthetic data demonstrate the efficiency of the proposed method."}
{"id": "2602.12886", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12886", "abs": "https://arxiv.org/abs/2602.12886", "authors": ["Hui Huang", "Jethro Warnett"], "title": "Well-posedness and mean-field limit estimate of a consensus-based algorithm for min-max problems", "comment": "Main body is 28 pages long. arXiv admin note: text overlap with arXiv:2505.13632", "summary": "The recent work arXiv:2407.17373 proposes a derivative-free consensus-based particle method that computes global solutions to nonconvex-nonconcave min-max problems and establishes global exponential convergence in the sense of the mean-field law. This paper aims to address the theoretical gaps in arXiv:2407.17373, specifically by providing a quantitative estimate of the mean-field limit with respect to the number of particles, as well as establishing the well-posedness of both the finite particle model and the corresponding mean-field dynamics."}
{"id": "2602.12595", "categories": ["math.PR", "cond-mat.dis-nn", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.12595", "abs": "https://arxiv.org/abs/2602.12595", "authors": ["Sourav Chatterjee"], "title": "Michel Talagrand and the Rigorous Theory of Mean Field Spin Glasses", "comment": "31 pages. To appear in H. Holden, R. Piene (eds.): The Abel Prize 2023-2027, Springer", "summary": "Michel Talagrand played a decisive role in the transformation of mean field spin glass theory into a rigorous mathematical subject. This chapter offers a narrative account of that development. We begin with the physical origins of the Sherrington-Kirkpatrick (SK) model and the emergence of the TAP and Almeida-Thouless stability frameworks, culminating in Parisi's replica symmetry breaking (RSB) ansatz and its hierarchical order parameter. We then review early rigorous milestones, including high-temperature results and stability identities, and describe the consolidation of interpolation and cavity methods through the work of Guerra and of Aizenman-Sims-Starr. The central event in this narrative is Talagrand's 2006 proof of the Parisi formula for the SK model and for a broad class of mixed $p$-spin models, and his subsequent analysis of Parisi measures. We also discuss Talagrand's later program constructing pure states under extended Ghirlanda-Guerra identities and an atom at the maximal overlap, together with the structural results that followed, notably Panchenko's ultrametricity theorem and extensions of the Parisi formula. Throughout, we indicate how related contributions by many authors fit into the same long-running program across probability, analysis, and mathematical physics."}
{"id": "2602.12710", "categories": ["math.ST", "stat.AP"], "pdf": "https://arxiv.org/pdf/2602.12710", "abs": "https://arxiv.org/abs/2602.12710", "authors": ["Dietmar Bauer Kurtulus Kidik"], "title": "On the relation between Global VAR Models and Matrix Time Series Models with Multiple Terms", "comment": null, "summary": "Matrix valued time series (MaTS) and global vector autoregressive (GVAR) models both impose restrictions on the general VAR for multidimensional data sets, in order to bring down the number of parameters. Both models are motivated from a different viewpoint such that on first sight they do not have much in common. When investigating the models more closely, however, one notices many connections between the two model sets. This paper investigates the relations between the restrictions imposed by the two models. We show that under appropriate restrictions in both models we obtain a joint framework allowing to gain insight into the nature of GVARs from the viewpoint of MaTS."}
{"id": "2602.12491", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.12491", "abs": "https://arxiv.org/abs/2602.12491", "authors": ["Dominic Blanco"], "title": "Proving periodic solutions and branches in the 2D Swift Hohenberg PDE with hexagonal and triangular symmetry", "comment": null, "summary": "In this article, we enforce space group symmetries in Fourier series to rigorously prove the existence of smooth, periodic solutions in partial differential equations (PDEs) with hexagonal and triangular symmetries. In particular, we provide the necessary analytical and numerical tools to construct Fourier series of functions on the hexagonal lattice. This allows one to build approximate solutions that are periodic. Moreover, to generate the periodic tiling, we can use one symmetric hexagon for $D_6$ symmetry and two symmetric triangles for $D_3$ symmetry. We derive a Newton-Kantorovich approach based on the construction of an approximate inverse around an approximate solution, $\\overline{u}$. More specifically, we verify a condition based on the computation of explicit bounds. The strategy for constructing $\\overline{u}$, the approximate inverse, and the computation of these bounds will be presented. We demonstrate our approach on the 2D Swift-Hohenberg PDE by proving the existence of $D_3$ and $D_6$ periodic solutions. We then perform proofs of branches of solutions by using Chebyshev series. The algorithmic details to perform the proof can be found on Github."}
{"id": "2602.12935", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12935", "abs": "https://arxiv.org/abs/2602.12935", "authors": ["Philippe Blondeel", "Filip Van Utterbeeck", "Ben Lauwens"], "title": "A Stochastic Optimal Control Formulation for Mine Counter Measure Simulations with Multiple Autonomous Survey Vehicles", "comment": null, "summary": "Modelling and simulating mine counter measure search missions performed by autonomous vehicles equipped with a sensor capable of detecting mines at sea is a challenging endeavour. To address this, we formulated and implemented the problem as a stochastic optimal control model. Our implementation computes an optimal path within a user chosen quadrilateral domain such that the mission duration is minimized for a given residual risk of undetected sea mines. First, we compare the stochastic optimal control implementation against the traditionally used boustrophedon implementation. We show that the mission duration in case of the stochastic optimal control implementation is shorter. Then, by building on our previous work, we introduce a novel mathematical approach that enables multiple autonomous survey vehicles to investigate the domain concurrently. We present results for up to six vehicles, including computed trajectories and an analysis of how mission duration varies with the number of vehicles. Our findings show that mission time decreases non-linearly, , i.e., we observe diminishing returns as more vehicles are added."}
{"id": "2602.12713", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.12713", "abs": "https://arxiv.org/abs/2602.12713", "authors": ["Gérard Letac", "Mauro Piccioni", "Jacek Wesołowski"], "title": "GIG random matrices and a Yang-Baxter extension of the Matsumoto-Yor property", "comment": "17 pages", "summary": "Sasada and Uozumi, \\cite{SasUoz2024}, identified independence preserving $[2:2]$ quadrirational parametric Yang-Baxter maps, see \\eqref{YBEQ}, on $(0,\\infty)$. In particular, the map denoted there by $H_{III,B}^{(α,β)}$, see \\eqref{CS}, was connected to the independence preserving property of the GIG distributions on $(0,\\infty)$. Remarkably, the property appears also naturally in probabilistic integrable models of discrete Korteweg de Vries type, as observed by Croydon and Sasada, \\cite{CroSas2020}. In the case of $(α,β)=(1,0)$ the independence reduces to the classical Matsumoto-Yor property, \\cite{MatYor2001}. In \\cite{LetWes2024} we proposed an extension of $H_{III,B}^{(α,β)}$ to a map on the cone of symmetric positive definite matrices of a fixed dimension, showing that such extended map preserves independence of GIG random matrices. In the present paper we prove two results: (i) the matrix GIG distributions are characterized by the independence property governed by this map; (ii) the matrix variate extension of $H_{III,B}^{(α,β)}$ we use, is a parametric Yang-Baxter map."}
{"id": "2602.12874", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2602.12874", "abs": "https://arxiv.org/abs/2602.12874", "authors": ["Markus Zobel", "Axel Munk"], "title": "Quantile characterization of univariate unimodality", "comment": "18 pages, 2 figures", "summary": "Unimodal univariate distributions can be characterized as piecewise convex-concave cumulative distribution functions. In this note we transfer this shape constraint characterization to the quantile function. We show that this characterization comes with the upside that the quantile function of a unimodal distribution is always absolutely continuous and consequently unimodality is equivalent to the quasi-convexity of its Radon-Nikodym derivative, i.e., the quantile density. Our analysis is based on the theory of generalized inverses of non-decreasing functions and relies on a version of the inverse function rule for non-decreasing functions."}
{"id": "2602.12559", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12559", "abs": "https://arxiv.org/abs/2602.12559", "authors": ["Zhiqiang Cai", "Anastassia Doktorova", "Robert D. Falgout", "César Herrera"], "title": "Convergence Analysis of Block Newton Methods for 1D Shallow Neural Network Approximation", "comment": null, "summary": "This paper analyzes local convergence of the block Newton (BN) method introduced in [5, 6] for one-dimensional shallow neural network approximation to functions and diffusion-reaction problems. The BN method consists of the 2x2 block nonlinear Gauss-Seidel, linear Gauss-Seidel, or Jacobi method for outer iteration and the Newton method for inner iteration. The blocks are corresponding to the linear and the nonlinear parameters. Under some reasonable assumptions, we establish local convergence of the BN methods as well as the reduced BN (rBN) method for one-dimensional diffusion-reaction problems and least-squares function approximation. Unlike common optimization methods, the rBN allows for the reduction of the number of parameters during the optimization process when some neurons contribute little to the approximation or are at nearly optimal locations."}
{"id": "2602.13000", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13000", "abs": "https://arxiv.org/abs/2602.13000", "authors": ["Hanfeng Zeng", "Wenqing Ouyang", "Andre Milzarek"], "title": "A linesearch-type normal map-based semismooth Newton method for nonsmooth nonconvex composite optimization", "comment": null, "summary": "We propose a novel linesearch variant of the trust region normal map-based semismooth Newton method developed in [Ouyang and Milzarek, Math. Program. 212(1-2), 389--435 (2025)] for solving a class of nonsmooth, nonconvex composite-type optimization problems. Our approach uses adaptive parameter estimation techniques, which allow us to avoid explicit and potentially expensive Lipschitz constant computations. We provide extensive convergence results including global convergence, convergence of the iterates under the Kurdyka-Łojasiewicz inequality, and transition to fast local q-superlinear convergence. Compared to the original trust region framework, the linesearch-based algorithm is simpler and the overall convergence analysis can be conducted under weaker assumptions -- in particular, without requiring explicit boundedness conditions on the Hessian approximations and iterates. Numerical experiments on sparse logistic regression, image compression, and nonlinear least squares with group penalty terms demonstrate the efficiency of the proposed approach."}
{"id": "2602.12988", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.12988", "abs": "https://arxiv.org/abs/2602.12988", "authors": ["Anastasiia S. Kovtun", "Nikolai N. Leonenko", "Andrey Pepelyshev"], "title": "Multidimensional Dickman distribution and operator selfdecomposability", "comment": "30 pages", "summary": "The one-dimensional Dickman distribution arises in various stochastic models across number theory, combinatorics, physics, and biology. Recently, a definition of the multidimensional Dickman distribution has appeared in the literature, together with its application to approximating the small jumps of multidimensional Lévy processes. In this paper, we extend this definition to a class of vector-valued random elements, which we characterise as fixed points of a specific affine transformation involving a random matrix obtained from the matrix exponential of a uniformly distributed random variable. We prove that these new distributions possess the key properties of infinite divisibility and operator selfdecomposability. Furthermore, we identify several cases where this new distribution arises as a limiting distribution."}
{"id": "2602.12988", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2602.12988", "abs": "https://arxiv.org/abs/2602.12988", "authors": ["Anastasiia S. Kovtun", "Nikolai N. Leonenko", "Andrey Pepelyshev"], "title": "Multidimensional Dickman distribution and operator selfdecomposability", "comment": "30 pages", "summary": "The one-dimensional Dickman distribution arises in various stochastic models across number theory, combinatorics, physics, and biology. Recently, a definition of the multidimensional Dickman distribution has appeared in the literature, together with its application to approximating the small jumps of multidimensional Lévy processes. In this paper, we extend this definition to a class of vector-valued random elements, which we characterise as fixed points of a specific affine transformation involving a random matrix obtained from the matrix exponential of a uniformly distributed random variable. We prove that these new distributions possess the key properties of infinite divisibility and operator selfdecomposability. Furthermore, we identify several cases where this new distribution arises as a limiting distribution."}
{"id": "2602.12580", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12580", "abs": "https://arxiv.org/abs/2602.12580", "authors": ["Yaguang Gu", "Guanghui Hu", "Tao Tang"], "title": "Adaptive mesh methods for hyperbolic conservation laws with bound-preserving flux limiters", "comment": "25 pages", "summary": "In this paper, we develop bound-preserving (BP) finite-volume schemes for hyperbolic conservation laws on adaptive moving meshes. For scalar conservative laws, we rewrite the conventional high-order discretization as a convex combination of first-order counterparts on each sub-cell, which is mathematically equivalent to introducing a bound-preserving flux limiter. Such a limiter is inexpensive to evaluate, with a feature that the corresponding BP CFL conditions depend solely on the first-order sub-cell schemes. A mild CFL restriction is derived under which high-order spatial accuracy is retained. The proposed BP schemes are extend to two nonlinear systems, namely, the Euler equations and the five-equation transport model of two-medium flows. Numerical results demonstrate that the present schemes possess high resolution and strong robustness properties."}
{"id": "2602.13005", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13005", "abs": "https://arxiv.org/abs/2602.13005", "authors": ["Patrick Jung"], "title": "Optimizing Initial Feature-Mapping Variables from Given Designs via Tracking", "comment": "Master's thesis, Friedrich-Alexander-Universitaet Erlangen-Nuernberg (FAU), 2025. 116 pages, 76 figures", "summary": "A feature-mapping framework for inverse reconstruction of density-based topology optimization results is proposed. Unlike SIMP, whose voxelized outputs are hard to interpret or reuse, the method represents designs with high-level geometric primitives mapped to a fixed analysis grid. Capsule-shaped bars (endpoints plus radius) are used, with closed-form signed distances and smooth transition functions providing derivatives up to second order. Differentiable pseudo-densities are aggregated with smooth operators, enabling gradient-based optimization with exact Hessians. Robustness is improved through asymmetric transition functions that propagate sensitivities into void regions, a reward-only objective for initialization, and geometric safeguards against degenerate configurations. Reconstruction is performed in stages (exploration, bridging, convergence) with optional refinement that can add, remove, or merge features based on residuals and geometric criteria. Experiments on canonical SIMP benchmarks, including five-bar and cantilever layouts, show high-fidelity reconstructions using a moderate number of features. p-norm and softmax aggregation yield sharp results; pruning removes redundant features and additive refinement restores coverage. Exact Hessians accelerate convergence and improve robustness compared to quasi-Newton updates, providing a bridge from voxel-based outputs to explicit parametric models."}
{"id": "2602.13056", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.13056", "abs": "https://arxiv.org/abs/2602.13056", "authors": ["Pierre Étoré", "Anna Melnykova", "Irene Tubikanec"], "title": "Splitting methods for stochastic Hodgkin-Huxley type systems and a localized fundamental mean-square convergence theorem", "comment": null, "summary": "Existing fundamental theorems for mean-square convergence of numerical methods for stochastic differential equations (SDEs) require globally or one-sided Lipschitz continuous coefficients, while strong convergence results under merely local Lipschitz conditions are largely restricted to Euler-Maruyama type methods. To address these limitations, we introduce a novel localized version of the fundamental mean-square convergence theorem for SDEs with locally Lipschitz coefficients, which naturally arise in a wide range of applications. Specifically, we show that if a numerical scheme is locally consistent in the mean-square sense of order $q>1$, then it is locally mean-square convergent with rate $q-1$. Building on this result, we further prove that global mean-square convergence follows, provided that both the exact solution and its numerical approximation admit bounded $2p$th moments for some $p>1$.\n  These new convergence results are illustrated on a class of locally Lipschitz SDEs of Hodgkin-Huxley type, characterized by a conditionally linear drift structure. For these systems, we construct different Lie-Trotter and Strang splitting methods exploiting their conditional linearity. The proposed convergence framework is then applied to these schemes, requiring innovative proofs of local consistency and boundedness of moments. In addition, we establish key structure-preserving properties of the splitting methods, in particular state-space preservation and geometric ergodicity. Numerical experiments support the theoretical results and demonstrate that the proposed splitting schemes significantly outperform Euler-Maruyama type methods in preserving the qualitative features of the model."}
{"id": "2602.12676", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12676", "abs": "https://arxiv.org/abs/2602.12676", "authors": ["Changjian Xie"], "title": "Semi-implicit Structure Preserving Method for The Landau-Lifshitz Equation", "comment": null, "summary": "A critical challenge inherent to the projection method applied to the Landau-Lifshitz equation is the deficiency of rigorous theoretical justifications for the stability of its projection step. To mitigate this limitation, we introduce a semi-implicit numerical scheme, which is formulated on the basis of the first-order Backward Differentiation Formula (BDF) incorporated with one-sided extrapolation and a Crank-Nicolson-type norm-preserving procedure. This proposed scheme exhibits three fundamental characteristics: structure preservation, numerical stability, and first-order accuracy in time. In practical implementations, the scheme not only ensures stable computation and adheres to the norm constraint but also guarantees the uniqueness of the numerical solution, thereby providing substantial facilitation for the theoretical analysis of the normalizing step."}
{"id": "2602.13032", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13032", "abs": "https://arxiv.org/abs/2602.13032", "authors": ["Raghupati Vyas", "Kousik Das", "Veeraruna Kavitha", "Souvik Roy"], "title": "Multi-type random game dynamics: limits at discontinuities and cyclic limits", "comment": null, "summary": "We consider (random) strategic interactions in a large population consisting of a variety of players. A rational player chooses actions that maximize certain utility functions, while a behavioral player chooses actions based on preferences such as avoid-the-crowd or follow-the-majority. We specifically study a turn-by-turn dynamic process in which players choose their actions sequentially and once; the utilities are realized either immediately or at the end of the game.\n  In the literature, such dynamical systems are often analyzed using an appropriate approximating ordinary differential equation (ODE). However, the ODEs approximating the dynamics with pure actions are typically discontinuous. We adopt a differential inclusion (DI) based stochastic-approximation framework to derive the limiting analysis. The limits of the dynamics are characterized through the internally chain transitive (ICT) sets. We identify the presence of non-classical zeros as potential limits of the dynamics, a phenomenon not observed in classical settings involving continuous ODEs. These new limits arise precisely at the points of discontinuity of the dynamics. We further provide the conditions under which cyclic outcomes may occur at the limit.\n  Finally, we study a queuing game with differential priority-based services and examine the impact of the proportions of avoid-the-crowd and two types of rational populations on the long-run outcomes of the strategic interactions. We identify potential point limits and establish the possibility of cyclic outcomes for certain parameter configurations."}
{"id": "2602.13089", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.13089", "abs": "https://arxiv.org/abs/2602.13089", "authors": ["Daniela Morale", "Giulia Rui", "Stefania Ugolini"], "title": "Well-posedness of stochastic reacting particle systems with non-local and Lennard-Jones interactions", "comment": "20 pages", "summary": "We establish well-posedness results for systems of a finite number of stochastic particles driven by independent Brownian motions and subject to a strongly singular drift induced by a Lennard-Jones interaction. In addition to the pairwise force, the dynamics includes a nonlocal drift mediated by an environmental field, whose evolution is coupled to the particle configuration through a regularized empirical density. We then extend the analysis to a reaction model in which the switching (or killing) rate also depends on the field. An interlacing technique is considered for establishing the well-posedness of the full system. The model is motivated by the challenge to provide a stochastic microscopic description of the sulphation phenomenon in cultural heritage materials."}
{"id": "2602.12788", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12788", "abs": "https://arxiv.org/abs/2602.12788", "authors": ["Daniele Corallo", "Pascal Lehner", "Christian Wieners"], "title": "A parallel space-time $p$-adaptive discontinuous Galerkin method for nonlinear acoustics", "comment": null, "summary": "In this paper, we introduce and analyze a space-time $p$-adaptive discontinuous Galerkin method for nonlinear acoustics. We first present the underlying mathematical model, which is based on a recently derived formulation involving, in particular, only first order in time derivatives. We then propose a spacetime discontinuous Galerkin discretization of this model, combining a symmetric Friedrichs systems discretization for symmetric hyperbolic systems with an interior penalty discretization for damping terms. The resulting nonlinear system is solved using Newton's method. Next, we present a well-posedness analysis of the discrete problem. The analysis begins with a linearized system, for which stability is shown. Using a fixed point argument, these results are extended to the fully discrete nonlinear system, yielding a priori error estimates in a natural discontinuous Galerkin norm. Finally, we present numerical experiments demonstrating the parallel solvability of the spacetime formulation and the effectiveness of p-adaptivity. The results confirm the theoretical convergence rates and show that adaptive refinement can reduce the number of degrees of freedom required to accurately approximate selected goal functionals. Moreover, the experiments demonstrate that the model reproduces characteristic phenomena of nonlinear acoustics, such as harmonic generation, thereby validating the proposed model."}
{"id": "2602.13063", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13063", "abs": "https://arxiv.org/abs/2602.13063", "authors": ["Antonin Clerc", "Ségolène Martin", "Nicolas Papadakis", "Gabriele Steidl"], "title": "Reinterpreting EMML as Mirror Descent for Constrained Maximum Likelihood Estimation", "comment": "6 pages, 3 figures, submitted at EUSIPCO 2026", "summary": "The Expectation--Maximization Maximum Likelihood (EMML) algorithm belongs to the Expectation--Maximization family and is widely used for image reconstruction problems under Poisson noise.In this paper, we reinterpret EMML as a mirror descent method applied to a reparametrized objective function. This perspective allows us to incorporate convex constraints into the algorithm through appropriately chosen Bregman projections, while preserving the multiplicative structure of the EMML updates to ensure computational efficiency. We then establish the convergence of the resulting algorithm toward a solution of the constrained maximum-likelihood problem. Numerical experiments on hyperspectral unmixing problems demonstrate that the constrained EMML converges in fewer iterations than the classical EMML."}
{"id": "2602.13183", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.13183", "abs": "https://arxiv.org/abs/2602.13183", "authors": ["Piotr Śniady"], "title": "Determinant and Pfaffian formulas for particle annihilation", "comment": "26 pages, 6 figures", "summary": "When particles on a line collide, they may annihilate-both are destroyed. Computing exact annihilation probabilities has been difficult because collisions reduce the particle count, while determinantal methods require a fixed count throughout. The ghost particle method, introduced in a companion paper for coalescence, keeps destroyed particles walking as invisible ghosts that restore the missing dimension. We apply this method to annihilation: when two particles annihilate, both trajectories continue as invisible walkers, yielding an exact determinantal formula that specifies the number of annihilations, where survivors end up, and where ghosts end up. For complete annihilation (no survivors), the formula simplifies to a Pfaffian-an algebraic relative of the determinant built from pairwise quantities-connecting to Pfaffian point process theory. The annihilation formula also yields results about coalescence: pairwise coalescence can be reinterpreted as complete annihilation, producing a Pfaffian coalescence formula. These formulas are exact for any finite initial configuration and apply to discrete lattice paths, birth-death chains, and continuous diffusions including Brownian motion."}
{"id": "2602.12790", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12790", "abs": "https://arxiv.org/abs/2602.12790", "authors": ["Yu Feng", "Shuo Ling", "Wenjun Ying", "Zhennan Zhou"], "title": "A Stabilized Numerical Framework for Necrotic Tumor Growth via Coupled Boundary Integral and Obstacle Solvers", "comment": null, "summary": "We present a robust computational framework for Hele-Shaw tumor growth with necrotic cores, a problem identified as the incompressible limit of the Porous Media Equation. Simulating this system presents a fundamental challenge: while the outer boundary evolves via advection, the inner necrotic interface is defined by an obstacle problem and lacks an explicit advection structure, causing standard schemes to fail. To address this, we introduce a stabilized predictor-corrector strategy that iteratively resolves the bidirectional coupling between the nutrient-pressure fields and the domain geometry, ensuring robust time-stepping for both the advection-driven outer surface and the obstacle-defined necrotic core. We establish rigorous convergence theory for the single-interface case and demonstrate the method's robustness in capturing the topological transition of necrotic core nucleation and complex geometric evolution."}
{"id": "2602.13141", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.13141", "abs": "https://arxiv.org/abs/2602.13141", "authors": ["Yixin Xie", "Jin-Peng Liu", "Cong Sun", "Ya-Xiang Yuan"], "title": "New gradient methods with 3 dimensional quadratic termination", "comment": "23 pages, 5 figures", "summary": "A new stepsize for gradient method is proposed. Combining it with the exact line search stepsizes, the gradient method achieves the optimal solution in 5 steps for 3 dimensional quadratic function minimization problem. The new stepsize is plugged in the cyclic stepsize update strategy, and a new gradient method is proposed. By applying the quadratic interpolation for Cauchy approximation, the proposed gradient method is extended to solve general unconstrained problem. With the improved GLL line search, the global convergence of the proposed method is proved. Furthermore, its sublinear convergence rate for convex problems and R-linear convergence rate for problems with quadratic functional growth property are analyzed. Numerical results show that our proposed algorithm enjoys good performances in terms of computational cost, and line search requires very few trial stepsizes."}
{"id": "2602.12568", "categories": ["math.ST", "cs.SI", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.12568", "abs": "https://arxiv.org/abs/2602.12568", "authors": ["Anirudh Sridhar", "Arnob Ghosh"], "title": "Finding Super-spreaders in SIS Epidemics", "comment": "6 pages, 3 figures", "summary": "In network epidemic models, controlling the spread of a disease often requires targeted interventions such as vaccinating high-risk individuals based on network structure. However, typical approaches assume complete knowledge of the underlying contact network, which is often unavailable. While network structure can be learned from observed epidemic dynamics, existing methods require long observation windows that may delay critical interventions.\n  In this work, we show that full network reconstruction may not be necessary: control-relevant features, such as high-degree vertices (super-spreaders), can be learned far more efficiently than the complete structure. Specifically, we develop an algorithm to identify such vertices from the dynamics of a Susceptible-Infected-Susceptible (SIS) process. We prove that in an $n$-vertex graph, vertices of degree at least $n^α$ can be identified over an observation window of size $Ω(1/α)$, for any $α\\in (0,1)$. In contrast, existing methods for exact network reconstruction requires an observation window that grows linearly with $n$. Simulations demonstrate that our approach accurately identifies super-spreaders and enables effective epidemic control."}
{"id": "2602.12816", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.12816", "abs": "https://arxiv.org/abs/2602.12816", "authors": ["Nan Deng", "Wanrong Cao"], "title": "Finite Difference Method for Stochastic Cahn-Hilliard Equation Driven by A Fractional Brownian Sheet", "comment": "38 pages", "summary": "The stochastic Cahn-Hilliard equation driven by a fractional Brownian sheet provides a more accurate model for correlated space-time random perturbations. This study delves into two key aspects: first, it rigorously examines the regularity of the mild solution to the stochastic Cahn-Hilliard equation, shedding light on the intricate behavior of solutions under such complex perturbations. Second, it introduces a fully discrete numerical scheme designed to solve the equation effectively. This scheme integrates the finite difference method for spatial discretization with the tamed exponential Euler method for temporal discretization. The analysis demonstrates that the proposed scheme achieves a strong convergence rate of $O\\big(h^{1-ε}+τ^{H_1-\\frac{1}{8}-\\fracε{2}}\\big)$, where $ε$ is an arbitrarily small positive constant, providing a solid foundation for the numerical treatment of such equations."}
{"id": "2602.13157", "categories": ["math.OC", "cs.RO", "eess.SY"], "pdf": "https://arxiv.org/pdf/2602.13157", "abs": "https://arxiv.org/abs/2602.13157", "authors": ["Sean Bowerfind", "Matthew R. Kirchner", "Gary Hewer"], "title": "A Data-Driven Algorithm for Model-Free Control Synthesis", "comment": null, "summary": "Presented is an algorithm to synthesize the optimal infinite-horizon LQR feedback controller for continuous-time systems. The algorithm does not require knowledge of the system dynamics but instead uses only a finite-length sampling of arbitrary input-output data. The algorithm is based on a constrained optimization problem that enforces a necessary condition on the dynamics of the optimal value function along any trajectory. In addition to calculating the standard LQR gain matrix, a feedforward gain can be found to implement a reference tracking controller. This paper presents a theoretical justification for the method and shows several examples, including a validation test on a real scale aircraft."}
{"id": "2602.12816", "categories": ["math.NA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.12816", "abs": "https://arxiv.org/abs/2602.12816", "authors": ["Nan Deng", "Wanrong Cao"], "title": "Finite Difference Method for Stochastic Cahn-Hilliard Equation Driven by A Fractional Brownian Sheet", "comment": "38 pages", "summary": "The stochastic Cahn-Hilliard equation driven by a fractional Brownian sheet provides a more accurate model for correlated space-time random perturbations. This study delves into two key aspects: first, it rigorously examines the regularity of the mild solution to the stochastic Cahn-Hilliard equation, shedding light on the intricate behavior of solutions under such complex perturbations. Second, it introduces a fully discrete numerical scheme designed to solve the equation effectively. This scheme integrates the finite difference method for spatial discretization with the tamed exponential Euler method for temporal discretization. The analysis demonstrates that the proposed scheme achieves a strong convergence rate of $O\\big(h^{1-ε}+τ^{H_1-\\frac{1}{8}-\\fracε{2}}\\big)$, where $ε$ is an arbitrarily small positive constant, providing a solid foundation for the numerical treatment of such equations."}
{"id": "2602.12850", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12850", "abs": "https://arxiv.org/abs/2602.12850", "authors": ["Xin Liu", "Qinglin Tang", "Yong Zhang"], "title": "Fast convolution solvers using moment-matching", "comment": null, "summary": "We propose two easy-to-implement fast algorithms based on moment-matching to compute the nonlocal potential $\\varphi(\\textbf{x})=(U\\ast ρ)(\\textbf{x})$ on bounded domain, where the kernel $U$ is singular at the origin and the density $ρ$ is a fast-decaying smooth function. Each method requires merely minor modifications to commonly-used existing methods, i.e., the sine spectral/Fourier quadrature method, and achieves a much better convergence rate. The key lies in the introduction of a smooth auxiliary function $ρ_1$ whose moments match those of the density up to an integer order $m$. Specifically, $ρ_1$ is constructed using Gaussian function in an explicit way and the associated potential can be calculated analytically. The moments of residual density vanish up to order $m$, and the corresponding residual potential $U \\ast (ρ-ρ_1)$ decays much faster than the original potential $\\varphi$ at the far field. As for the residual potential evaluation, for classical kernels (e.g., the Coulomb kernel), we solve a differential/pseudo-differential equation on a rectangular domain with homogeneous Dirichlet boundary conditions via sine pseudospectral method, and achieve an arbitrary high convergence rate. While, for general kernels, the regularity of Fourier integrand increase by $m$ thanks to the moments-vanishing property, therefore, the standard trapezoidal rule/midpoint quadrature also converges much faster. To gain a better numerical performance, we utilize the domain expansion technique to obtain better accuracy, and improve the efficiency by simplifying the quadrature into one discrete convolution and applying Fast Fourier Transform (FFT) to a double-sized vector. Rigorous error estimates and extensive numerical investigations showcase the accuracy and efficiency for different nonlocal potentials."}
{"id": "2602.13169", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.13169", "abs": "https://arxiv.org/abs/2602.13169", "authors": ["William Hofgard", "Asaf Cohen", "Mathieu Laurière"], "title": "Operator Learning for Families of Finite-State Mean-Field Games", "comment": "34 pages, 21 figures", "summary": "Finite-state mean-field games (MFGs) arise as limits of large interacting particle systems and are governed by an MFG system, a coupled forward-backward differential equation consisting of a forward Kolmogorov-Fokker-Planck (KFP) equation describing the population distribution and a backward Hamilton-Jacobi-Bellman (HJB) equation defining the value function. Solving MFG systems efficiently is challenging, with the structure of each system depending on an initial distribution of players and the terminal cost of the game. We propose an operator learning framework that solves parametric families of MFGs, enabling generalization without retraining for new initial distributions and terminal costs. We provide theoretical guarantees on the approximation error, parametric complexity, and generalization performance of our method, based on a novel regularity result for an appropriately defined flow map corresponding to an MFG system. We demonstrate empirically that our framework achieves accurate approximation for two representative instances of MFGs: a cybersecurity example and a high-dimensional quadratic model commonly used as a benchmark for numerical methods for MFGs."}
{"id": "2602.12872", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12872", "abs": "https://arxiv.org/abs/2602.12872", "authors": ["Shuo Ling", "Wenjun Ying", "Zhen Zhang"], "title": "Neural Evolutionary Kernel Method: A Knowledge-Guided Framework for Solving Evolutionary PDEs", "comment": null, "summary": "Numerical solution of partial differential equations (PDEs) plays a vital role in various fields of science and engineering. In recent years, deep neural networks (DNNs) have emerged as a powerful tool for solving PDEs, leveraging their approximation capabilities to handle complex domains and high-dimensional problems. Among these, operator learning has gained increasing attention by learning mappings between function spaces using DNNs. This paper proposes a novel approach, termed the Neural Evolutionary Kernel Method (NEKM), for solving a class of time-dependent partial differential equations (PDEs) via deep neural network (DNN)-based kernel representations. By integrating boundary integral techniques with operator learning, prior mathematical information of time-dependent partial differential equations (PDEs) is embedded into the design of neural network architectures for predicting their solutions, enhancing both computational efficiency and solution accuracy. Numerical experiments on the heat, wave, and Schrödinger equations demonstrate that the Neural Evolutionary Kernel Method (NEKM) achieves high accuracy and favorable computational efficiency. Furthermore, the operator learning framework inherently supports the simultaneous prediction of solutions to multiple PDEs with different coefficients, rendering its capability for solving random PDEs."}
{"id": "2602.13177", "categories": ["math.OC", "cs.DS", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.13177", "abs": "https://arxiv.org/abs/2602.13177", "authors": ["Swati Gupta", "Jai Moondra", "Mohit Singh"], "title": "Improved Regret Guarantees for Online Mirror Descent using a Portfolio of Mirror Maps", "comment": null, "summary": "OMD and its variants give a flexible framework for OCO where the performance depends crucially on the choice of the mirror map. While the geometries underlying OPGD and OEG, both special cases of OMD, are well understood, it remains a challenging open question on how to construct an optimal mirror map for any given constrained set and a general family of loss functions, e.g., sparse losses. Motivated by parameterizing a near-optimal set of mirror maps, we consider a simpler question: is it even possible to obtain polynomial gains in regret by using mirror maps for geometries that interpolate between $L_1$ and $L_2$, which may not be possible by restricting to only OEG ($L_1$) or OPGD ($L_2$).\n  Our main result answers this question positively. We show that mirror maps based on block norms adapt better to the sparsity of loss functions, compared to previous $L_p$ (for $p \\in [1, 2]$) interpolations. In particular, we construct a family of online convex optimization instances in $\\mathbb{R}^d$, where block norm-based mirror maps achieve a provable polynomial (in $d$) improvement in regret over OEG and OPGD for sparse loss functions. We then turn to the setting in which the sparsity level of the loss functions is unknown. In this case, the choice of geometry itself becomes an online decision problem. We first show that naively switching between OEG and OPGD can incur linear regret, highlighting the intrinsic difficulty of geometry selection. To overcome this issue, we propose a meta-algorithm based on multiplicative weights that dynamically selects among a family of uniform block norms. We show that this approach effectively tunes OMD to the sparsity of the losses, yielding adaptive regret guarantees. Overall, our results demonstrate that online mirror-map selection can significantly enhance the ability of OMD to exploit sparsity in online convex optimization."}
{"id": "2602.12940", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.12940", "abs": "https://arxiv.org/abs/2602.12940", "authors": ["Nitin Kumar", "Federico Pichi", "Gianluigi Rozza"], "title": "Bifurcation curve detection with deflation for multiparametric PDEs", "comment": null, "summary": "This work presents a comprehensive framework for capturing bifurcating phenomena and detecting bifurcation curves in nonlinear multiparametric partial differential equations, where the system exhibits multiple coexisting solutions for given values of the parameters. Traditional continuation methods for one-dimensional parameterizations employ the previously computed solution as the initial guess for the next parameter value. These are usually very inefficient, since small step sizes increase computational cost, while larger steps could jeopardize the method convergence jumping to a different solution branch or missing the bifurcation point. To address these challenges, we propose a novel framework that combines: (i) arclength continuation, adaptively selecting new parameter values in higher dimension, and (ii) the deflation technique, discovering multiple branches to construct complete bifurcation diagrams. In particular, the arclength continuation method is designed to handle multiparametric scenarios, where the parameter vector $λ\\in \\mathbb{R}^p$ traces a curve $g(λ)$ within a $p$-dimensional parameter space. In addition, we introduce a zigzag path-following strategy to robustly track the bifurcation curves and surfaces, respectively, for two- and three-dimensional parametric spaces. Finally, we demonstrate its performance on two benchmark problems: the Bratu equation and the Allen-Cahn equation."}
{"id": "2602.12523", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.12523", "abs": "https://arxiv.org/abs/2602.12523", "authors": ["Jose Correa", "Marcos Kiwi", "Vasilis Livanos", "Eilon Solan", "Ron Solan"], "title": "About a Ball Removal Process on Bins", "comment": null, "summary": "Consider the following process whereby $n$ balls are distributed into $k$ bins. Repeatedly, a ball is removed from a non-empty bin chosen uniformly at random. The process ends when a single non-empty bin remains. Will Ma (see~\\cite[Sec.~1.1]{GS24}) asked whether the initial assignment that minimizes the expected number of remaining balls is one that is as balanced as possible. Using a coupling argument we answer this conjecture positively, and we discuss the case of non-uniform choice among the non-empty bins."}
{"id": "2602.13048", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.13048", "abs": "https://arxiv.org/abs/2602.13048", "authors": ["Hamid Fathi", "Alexander Skorikov", "Tristan van Leeuwen"], "title": "Data-Driven Filter Design for Flexible and Noise-Robust Tomographic Imaging", "comment": null, "summary": "While filtered back projection (FBP) is still the method of choice for fast tomographic reconstruction, its performance degrades noticeably in the presence of noise, incomplete sampling, or non-standard scan geometries. We propose a data-driven approach for learning FBP filters and projection weights directly from training data, with the goal of improving robustness without sacrificing computational efficiency. The resulting reconstructions adapt naturally to the noise level and acquisition geometry, while retaining the speed and simplicity of classical back-projection. The proposed method can be formulated as a regularized optimization problem for a linear inverse operator, which allows us to establish existence, uniqueness, and stability of the learned solution. From a spectral viewpoint, the learned filters act as data-adaptive gain functions that explicitly balance noise amplification and bias, in close analogy to a regularized pseudo-inverse. Experiments in both 2D and 3D show consistent improvements over conventional FBP and FDK in different case studies. Finally, we show that filters trained on synthetic laminography data generalize well to real-world measurements, delivering image quality comparable to advanced iterative methods without the high computational cost."}
{"id": "2602.13079", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.13079", "abs": "https://arxiv.org/abs/2602.13079", "authors": ["Malachi Phillips"], "title": "Multi-physics Preconditioning for Thermally Activated Batteries", "comment": "23 pages, 7 figures", "summary": "Thermal batteries, also known as molten-salt batteries, are single-use reserve power systems activated by pyrotechnic heat generation, which transitions the solid electrolyte into a molten state. The simulation of these batteries relies on multiphysics modeling to evaluate performance and behavior under various conditions. This paper presents advancements in scalable preconditioning strategies for the Thermally Activated Battery Simulator (TABS) tool, enabling efficient solutions to the coupled electrochemical systems that dominate computational costs in thermal battery simulations. We propose a hierarchical block Gauss-Seidel preconditioner implemented through the Teko package in Trilinos, which effectively addresses the challenges posed by tightly coupled physics, including charge transport, porous flow, and species diffusion. The preconditioner leverages scalable subblock solvers, including smoothed aggregation algebraic multigrid (SA-AMG) methods and domain-decomposition techniques, to achieve robust convergence and parallel scalability. Strong and weak scaling studies demonstrate the solver's ability to handle problem sizes up to 51.3 million degrees of freedom on 2048 processors, achieving near sub-second setup and solve times for the end-to-end electrochemical solve. These advancements significantly improve the computational efficiency and turnaround time of thermal battery simulations, paving the way for higher-resolution models and enabling the transition from 2D axisymmetric to full 3D simulations."}
{"id": "2602.12581", "categories": ["math.PR", "math.FA", "math.NA", "math.SP"], "pdf": "https://arxiv.org/pdf/2602.12581", "abs": "https://arxiv.org/abs/2602.12581", "authors": ["Paulo Manrique"], "title": "The condition number of a random banded Toeplitz matrix is typically large", "comment": null, "summary": "It is well known that square matrices with independent and identically distributed (iid) random entries are typically well conditioned. A natural question is whether this favorable behavior persists for random matrices whose entries obey additional structure, i.e., their position inside of the matrix. A prominent class of structured matrices is given by {\\it Toeplitz matrices}, characterized by constant diagonals. A particular tractable subclass is that of circulant matrices, whose additional characteristic (its entries {\\it circulate} row by row) allows one to express their conditioning in terms of the localization of the zeros of a associated polynomial. When the entries of a circulant matrix are iid, the matrix is well conditioned precisely when the corresponding random polynomial has no zeros on the unit circle. This connection is especially relevant because, as the degree of a random polynomial increases, its zeros tend to concentrate near the unit circle, making it a delicate problem to quantify how close the closest zeros lie to the unit circle. Another notable family within the Toeplitz class is that of {\\it banded Toeplitz matrices}, namely matrices for which only finitely many diagonals around the main diagonal may be nonzero. These matrices have been extensively studied in Operator Theory, nevertheless, despite their apparent simplicity, they raise subtle questions regarding the behavior of their condition numbers. In present work we show that the bandwidth asymmetry plays a decisive role: if the band contains $r$ diagonals below and $s$ diagonal above the main diagonal, then if $r=s$ the banded Toeplitz matriz is well conditioned with high probability, whereas if $r\\neq s$ it is typically ill conditioned. This highlights that structural constraints can have a impact on the numerical behavior of random matrices."}
