{"id": "2601.18817", "categories": ["math.NA", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2601.18817", "abs": "https://arxiv.org/abs/2601.18817", "authors": ["Nadim Rooholamin", "Kabir Bakhshaei", "Giovanni Stabile"], "title": "A Hybrid Discretize-then-Project Reduced Order Model for Turbulent Flows on Collocated Grids with Data-Driven Closure", "comment": "Preprint. Submitted to a journal", "summary": "This study presents a hybrid reduced-order modeling (ROM) framework for turbulent incompressible flows on collocated finite volume grids. The methodology employs the \"discretize-then-project\" consistent flux strategy, which ensures mass conservation and pressure-velocity coupling without requiring auxiliary stabilization like boundary control or pressure stabilization techniques. However, because standard Galerkin projection fails to yield physically consistent results for the turbulent viscosity field, a hybrid strategy is adopted: velocity and pressure are resolved via intrusive projection, while the turbulent viscosity is reconstructed using a non-intrusive data-driven closure. We evaluate three neural network architectures, Multilayer Perceptron (MLP), Transformers, and Long Short-Term Memory (LSTM), to model the temporal evolution of the viscosity coefficients. Validated against a 3D Large Eddy Simulation of a lid-driven cavity, the LSTM-based closure demonstrates superior performance in capturing transient dynamics, achieving relative errors of 0.7\\% for velocity and 4\\% for turbulent viscosity. The resulting framework effectively combines the mathematical rigor of the consistent flux formulation with the adaptability of deep learning for turbulence modeling."}
{"id": "2601.18838", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18838", "abs": "https://arxiv.org/abs/2601.18838", "authors": ["Igor Chollet"], "title": "Kroneckerised Particle Mesh Ewald", "comment": null, "summary": "Particle Mesh Ewald (PME) methods accelerated through Fast Fourier Transforms (FFTs) for their reciprocal part are widely used to solve N -body problems over periodic structures with Laplace-like kernels. The FFT dependence of classical PME may mitigate its performance on parallel distributed-memory architectures. We here introduce a new variant of the reciprocal part based on Sum of Kronecker Products (SKP) instead of FFT. Moreover, our implementation of this new method is not linearithmic (as opposed to classical PME) but has an important parallel potential. We present the different approximation levels exploited in our new scheme and demonstrate to what extent it could be used on parallel distributed-memory architectures. Numerical examples supplement presented assertions."}
{"id": "2601.18947", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.18947", "abs": "https://arxiv.org/abs/2601.18947", "authors": ["Mohammad R. Najafian", "Brian C. Vermeire"], "title": "On the Strong Stability Preserving Property of Runge-Kutta Methods for Hyperbolic Problems", "comment": null, "summary": "Strong Stability Preserving (SSP) time integration schemes maintain stability of the forward Euler method for any initial value problem. However, only a small subset of Runge-Kutta (RK) methods are SSP, and many efficient high-order time integration schemes do not formally belong to this class. In this work, we introduce a mathematical strategy to analyze the nonlinear stability of RK schemes that may not necessarily belong to the SSP class. With this approach, we mathematically demonstrate that there are time integration schemes outside the class of SSP schemes that can maintain entropy stability and positivity of density and pressure for the Lax-Friedrichs discretization, and Total Variation Diminishing stability for the first-order upwind and the second-order MUSCL schemes. As a result, for these problems, a broader range of RK methods, including the classical fourth-order, four-stage RK scheme, can be used while the numerical integration remains stable. Numerical experiments confirm these theoretical findings, and additional experiments demonstrate similar observations for a wider class of space discretizatins."}
{"id": "2601.19020", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19020", "abs": "https://arxiv.org/abs/2601.19020", "authors": ["Stefano Costa"], "title": "AAA least squares solution of Helmholtz problems", "comment": "18 pages, 10 figures", "summary": "This paper presents an adaptive numerical framework for solving exterior \"sound-soft\" scattering problems governed by the Helmholtz equation. By interpreting the Method of Fundamental Solutions through the lens of rational approximation, we introduce an automated strategy for singularity placement based on the analytic continuation of boundary data. The proposed AAALS-Helmholtz algorithm leverages a \"continuum\" variant of the AAA algorithm to identify the singularities limiting analytic extension, and to ensure an optimal source distribution even for complex, non star-shaped geometries. Furthermore, we establish a formal connection between the Helmholtz and Laplace problems, providing a theoretical justification for the \"double poles\" technique. The approach offers a robust, meshless alternative to heuristic source placement."}
{"id": "2601.18935", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.18935", "abs": "https://arxiv.org/abs/2601.18935", "authors": ["Bernard Bercu", "Claudia Contardi", "Emanuele Dolera", "Stefano Favaro"], "title": "A Central Limit Theorem for the Ewens-Pitman random partition in the large-$θ$ regime via a martingale approach", "comment": "28 pages", "summary": "The Ewens-Pitman model defines a distribution on random partitions of $\\{1,\\ldots,n\\}$, with parameters $α\\in [0,1)$ and $θ> -α$; the case $α=0$ reduces to the classical Ewens model from population genetics. We investigate the large-$n$ asymptotic behaviour of the Ewens-Pitman random partition in the nonstandard regime $θ=λn$ with $λ>0$, establishing joint fluctuation results for the total number of blocks $K_n^{\\{n\\}}$ and the counts $K_{r,n}^{\\{n\\}}$ of blocks of sizes $r=1,\\dots,d$, for fixed $d\\in\\mathbb{N}$. In particular, for $α\\in[0,1)$ and $θ=λn$, our main result provides a strong law of large numbers and a central limit theorem for the $(d+1)$-dimensional vector $\\mathbf{K}_{d,n}^{\\{n\\}} = \\bigl(K_n^{\\{n\\}}, K_{1,n}^{\\{n\\}}, \\dots, K_{d,n}^{\\{n\\}}\\bigr)^T$ as $n \\to \\infty$. The proof exploits the Chinese restaurant sequential construction under $θ=λn$ and a central limit theorem for triangular arrays of martingales, extending techniques previously developed for the classical regime with fixed $θ$. As corollaries of our results, we recover known asymptotics for $K_n^{\\{n\\}}$ and derive new strong laws and central limit theorems for each fixed $K_{r,n}^{\\{n\\}}$, thereby completing earlier weak-law results and providing a comprehensive asymptotic description of the Ewens-Pitman partition structure in the large-$θ$ setting."}
{"id": "2601.19071", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.19071", "abs": "https://arxiv.org/abs/2601.19071", "authors": ["Eitaro Kawamo", "Hiroki Masuda"], "title": "Asymptotic inference for skewed stable Ornstein-Uhlenbeck process", "comment": null, "summary": "We consider the parametric estimation of the Ornstein-Uhlenbeck process driven by a non-Gaussian $α$-stable Lévy process with the stable index $α>1$ and possibly skewed jumps, based on a discrete-time sample over a fixed period. By employing a suitable non-diagonal normalizing matrix, we present the following: the parametric family satisfies the local asymptotic mixed normality with a non-degenerate Fisher information matrix; there exists a local maximum of the log-likelihood function which is asymptotically mixed-normal; the local maximum is asymptotically efficient in the sense that it has maximal concentration around the true value over symmetric convex Borel subsets. In the proof, we prove the asymptotic equivalence between the genuine likelihood and the much simpler Euler-type quasi-likelihood. Furthermore, we propose a simple moment-based method to estimate the parameters of the driving stable Lévy process, which serves as an initial estimator for numerical search of the (quasi-)likelihood, reducing the computational burden of the optimization to a large extent. We also present simulation results, which illustrate the theoretical results and highlight the advantages and disadvantages of the genuine and quasi-likelihood approaches."}
{"id": "2601.18906", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18906", "abs": "https://arxiv.org/abs/2601.18906", "authors": ["Vittorio Colao", "Katherine Rossella Foglia"], "title": "On the Convergence of HalpernSGD", "comment": null, "summary": "HalpernSGD is a gradient-type optimizer obtained by combining the classical Halpern fixed-point iteration with a stochastic gradient step. While its empirical advantages have already been observed in \\cite{colao2025optimizer,foglia2024halpernsgd}, this paper provides a theoretical analysis of the method. Assuming a convex $L$-smooth objective and standard stochastic-approximation conditions, we prove almost sure convergence of the iterates to a minimizer, characterized as the metric projection of the anchor onto the solution set. These results fill a gap in the literature on HalpernSGD and lay the groundwork for future extensions to adaptive schemes."}
{"id": "2601.19172", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19172", "abs": "https://arxiv.org/abs/2601.19172", "authors": ["Weiguo Gao", "Zhansi He", "Jia Yin"], "title": "A sixth-order compact time-splitting Fourier pseudospectral method", "comment": "28 pages, 3 figures", "summary": "In this paper, we propose a novel sixth-order compact time-splitting scheme, denoted as $ S_{6\\text{c}}$, for solving the Dirac equation in the absence of external magnetic potentials. This method is easy to implement, and it provides a substantial reduction in computational complexity compared to the existing sixth-order splitting schemes. By incorporating a time-ordering technique, we also extend $S_{6\\text{c}}$ to address problems with time-dependent potentials. Comprehensive comparisons with various time-splitting methods show that $S_{6\\text{c}}$ exhibits significant advantages in terms of both precision and efficiency. Moreover, numerical results indicate that $S_{6\\text{c}}$ maintains the super-resolution property for the Dirac equation in the nonrelativistic regime in the absence of external magnetic potentials."}
{"id": "2601.19024", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.19024", "abs": "https://arxiv.org/abs/2601.19024", "authors": ["Pablo Groisman", "Alejandro F. Ramírez", "Santiago Saglietti", "Sebastián Zaninovich"], "title": "A universality property for large deviations of RWRE close to the axis", "comment": "9 pages", "summary": "We establish a general version of the strong KPZ universality conjecture near the axis for random walks in a random environment (RWRE) on $\\mathbb{Z}^2$. For an i.i.d. elliptic random environment, we consider the quenched large deviations probabilities for trajectories starting at the origin and arriving at time $n+[n^a]$ to the position $(n,[n^a])$ and show that, if the logarithm of the right-jump probability has a finite moment of order $p>2$, then for $a < \\frac{3}{7}(1-\\frac{2}{p})$ the fluctuations of these propabilities are asymptotically governed by the GUE Tracy-Widom distribution. Our results are based on a comparison between RWRE and a last passage percolation model, whose asymptotic fluctuations near the axis were previously established independently by Bodineau-Martin and Baik-Suidan. Furthermore, we obtain also the full convergence to the directed landscape in this regime based on the extension of the aforementioned results to this setting by McKeown and Zhang."}
{"id": "2601.19389", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.19389", "abs": "https://arxiv.org/abs/2601.19389", "authors": ["F. Belzunce", "C. Martínez-Riquelme", "M. Pereda"], "title": "Sufficient Conditions for Some Stochastic Orders of Discrete Random Variables with Applications in Reliability", "comment": "15 pages. Published open access article", "summary": "In this paper we focus on providing sufficient conditions for some well-known stochastic orders in reliability but dealing with the discrete versions of them, filling a gap in the literature. In particular, we find conditions based on the unimodality of the likelihood ratio for the comparison in some stochastic orders of two discrete random variables. These results have interest in comparing discrete random variables because the sufficient conditions are easy to check when there are no closed expressions for the survival functions, which occurs in many cases. In addition, the results are applied to compare several parametric families of discrete distributions."}
{"id": "2601.18942", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18942", "abs": "https://arxiv.org/abs/2601.18942", "authors": ["Jimin Choi", "Husni R. Idris", "Huy T. Tran", "Max Z. Li"], "title": "Collaborative Decision-Making and Optimal Utilization of Pathfinding Flights during Convective Weather", "comment": null, "summary": "Air traffic operations are strongly influenced by convective weather, and one common response is pathfinder operations, in which a designated aircraft tests the viability of weather-impacted airspace and routes. Despite relatively routine use in practice, how pathfinder operations evolve under uncertainty and how the pathfinder decision-making process unfolds are largely treated as exogenous. Addressing this gap requires jointly modeling weather-driven system accessibility, flight responses to pathfinder offers, and the sequencing of those offers to improve outcomes. We develop a unified analytical framework that connects weather-driven system state transitions, flight acceptance decisions, and the sequencing of pathfinder offers. We first construct a four-state Markov chain to model stochastic closure and reopening of exit points, or fixes, out of the terminal departure airspace surrounding a major airport, pathfinder selection, and pathfinding execution, and analyze its steady-state behavior to characterize long-term capacity and delay implications. We introduce utility-based decision models for flights, air traffic control (ATC), and dispatchers, and analyze worst-case collective rejection to quantify system vulnerability under selfless behavior and uncertainty. Finally, we formulate optimization problems that model ATC-initiated and dispatcher-initated pathfinder offers, with the goal of optimizing the sequence of pathfinder offers. Using a discrete event simulation for a major US airport, we show that ATC- and dispatcher-driven objectives lead to distinct, near real-time sequencing strategies, providing the first formal decision models for pathfinder operations under weather uncertainty."}
{"id": "2601.19211", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.19211", "abs": "https://arxiv.org/abs/2601.19211", "authors": ["Neetu Garg", "Varsha R"], "title": "On a Class of Multi-Dimensional Non-linear Time-Fractional Fokker-Planck Equations Capturing Brownian Motion", "comment": null, "summary": "The time-fractional Fokker-Planck equation is a key model for characterizing anomalous diffusion, stochastic transport, and non-equilibrium statistical mechanics with applications in finance, chaotic dynamics, optical physics, and biological systems. In this work, we develop a semi-analytical solution for the multi-dimensional time-fractional Fokker-Planck equation employing the Laplace residual power series method. This method blends the Laplace transform and the traditional residual power series method, guaranteeing efficient solutions incorporating the memory and nonlocal effects. To validate the accuracy and effectiveness of the approach, we address several examples, including non-linear problems in multi-dimensions, and analyze the evolution of errors. The numerical simulations are compared with existing methods to confirm the adopted method's strength. The smooth and stable error evolution promises that the suggested method is a powerful tool for analyzing time-fractional Fokker-Planck equations."}
{"id": "2601.19084", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.19084", "abs": "https://arxiv.org/abs/2601.19084", "authors": ["Jiusheng Liu", "Jing Zhang"], "title": "A Probabilistic Interpretation of the Master Equation Arising from Mean Field Games with Jump Diffusion", "comment": "33 pages", "summary": "In this paper we study the classical solution to the master equation arising from mean-field games (MFGs) driven by jump-diffusion processes. The master equation, a nonlinear partial differential equation on Wasserstein space, characterizes the value function of MFGs and is challenging to analyze directly due to its measure-valued derivatives. We propose a probabilistic interpretation using coupled McKean-Vlasov forward-backward stochastic differential equations (MV-FBSDEs) with jumps. Under suitable Lipschitz and differentiability assumptions on the coefficients, we first establish the well-posedness of the MV-FBSDEs on a small time interval via a contraction mapping argument. We then prove the existence and regularity of the first- and second-order derivatives of the solutions with respect to the spatial and measure variables, relying on careful estimates involving jump terms and measure derivatives. Finally, we show that the decoupling field of the MV-FBSDEs satisfies the master equation in the classical sense, providing both existence and uniqueness of the solution. Our work extends earlier results on diffusion-driven MFGs to the jump-diffusion setting and offers a probabilistic framework for analyzing and numerically solving such kind of master equations."}
{"id": "2601.19649", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.19649", "abs": "https://arxiv.org/abs/2601.19649", "authors": ["Fadoua Balabdaoui", "Jinyu Chen"], "title": "Semi-supervised learning in unmatched linear regression using an empirical likelihood approach", "comment": null, "summary": "Knowing the link between observed predictive variables and outcomes is crucial for making inference in any regression model. When this link is missing, partially or completely, classical estimation methods fail in recovering the true regression function. Deconvolution approaches have been proposed and studied in detail in the unmatched setting where the predictive variables and responses are allowed to be independent. In this work, we consider linear regression in a semi-supervised learning setting where, beside a small sample of matched data, we have access to a relatively large unmatched sample. Using maximum likelihood estimation, we show that under some mild assumptions the semi-supervised learning empirical maximum likelihood estimator (SSLEMLE) is asymptotically normal and give explicitly its asymptotic covariance matrix as a function of the ratio of the matched/unmatched sample sizes and other parameters. Furthermore, we quantify the statistical gain achieved by having the additional large unmatched sample over having only the small matched sample. To illustrate the theory, we present the results of an extensive simulation study and apply our methodology to the \"combined cycle power plant\" data set."}
{"id": "2601.18969", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.18969", "abs": "https://arxiv.org/abs/2601.18969", "authors": ["Peter Benner", "Michael Hinze", "Hamdullah Yücel"], "title": "A Local Discontinuous Galerkin Method for Dirichlet Boundary Control Problems", "comment": null, "summary": "In this paper, we consider control constrained $L^2-$Dirichlet boundary control of a convection-diffusion equation on a two dimensional convex polygonal domain. We discretize the control problem based on the local discontinuous Galerkin method with piecewise linear ansatz functions for the flux and potential. We derive a priori error estimates for the full as well as for the variational discrete control approximation. We present a selection of numerical results to demonstrate the performance of our approach and to underpin the theoretical findings."}
{"id": "2601.19250", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19250", "abs": "https://arxiv.org/abs/2601.19250", "authors": ["Weiwei Xu", "Weijie Shen", "Zhengjian Bai", "Chen Xu"], "title": "Precision-induced Adaptive Randomized Low-Rank Approximation for SVD and Matrix Inversion", "comment": null, "summary": "Singular value decomposition (SVD) and matrix inversion are ubiquitous in scientific computing. Both tasks are computationally demanding for large scale matrices. Existing algorithms can approximatively solve these problems with a given rank, which however is unknown in practice and requires considerable cost for tuning. In this paper, we tackle the SVD and matrix inversion problems from a new angle, where the optimal rank for the approximate solution is explicitly guided by the distribution of the singular values. Under the framework, we propose a precision-induced random re-normalization procedure for the considered problems without the need of guessing a good rank. The new algorithms built upon the procedure simultaneously calculate the optimal rank for the task at a desired precision level and lead to the corresponding approximate solution with a substantially reduced computational cost. The promising performance of the new algorithms is supported by both theory and numerical examples."}
{"id": "2601.19145", "categories": ["math.PR", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.19145", "abs": "https://arxiv.org/abs/2601.19145", "authors": ["Juraj Foldes", "Declan Stacy"], "title": "Stochastic Persistence in Infinite Dimensions", "comment": "88 pages", "summary": "Motivated by infinite-dimensional ecological and biological models such as reaction-diffusion SPDEs and stochastic functional differential equations, we develop a general criteria for stochastic persistence (coexistence) in terms of an average lyapunov function, which was previously known only in finite dimensions. To apply our results to SPDEs we analyze the projective process, and we employ a combination of mild (stochastic convolution) and variational (lyapunov function) techniques. Our analysis also requires some nontrivial well-posedness and nonnegativity results for reaction-diffusion SPDEs, which we state and prove in great generality, extending the known results in the literature. Finally, we present several examples including ecological models (Lotka-Volterra), an epidemic model (SIR), and a model for turbulence. Notably we show that, as in the SDE case, coexistence in the Lotka-Volterra model is determined by the invasion rates."}
{"id": "2601.19715", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.19715", "abs": "https://arxiv.org/abs/2601.19715", "authors": ["Poulami Paul", "Chanchal Kundu"], "title": "Normalized Fractional Order Entropy-Based Decision-Making Models under Risk", "comment": "19 pages, 3 figures", "summary": "Constructing efficient portfolios requires balancing expected returns with risk through optimal stock selection, while accounting for investor preferences. In a recent work by Paul and Kundu (2026), the fractional-order entropy due to Ubriaco was introduced as an uncertainty measure to capture varying investor attitudes toward risk. Building on this foundation, we introduce a novel normalized fractional order entropy aligned with investors' risk preferences that combines normalized fractional entropy with expected utility and variance. Risk sensitivity is modeled through the fractional parameter, interpolating between conservative or risk aversion and adventurous or high risk tolerance attitudes. Furthermore, the robustness and statistical significance of the fractional order entropy-based risk measure, termed normalized expected utility-fractional entropy (NEU-FE) and normalized expected utility-fractional entropy-variance (NEU-FEV) risk measures are explained with the help of machine learning tools, including Random forest, Ridge regression, Lasso Regression and artificial neural networks by using Indian stock market (NIFTY50). The results confirm that the proposed decision models support investors in making high-quality portfolio investments."}
{"id": "2601.19003", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19003", "abs": "https://arxiv.org/abs/2601.19003", "authors": ["Santanu S Dey", "Jingye Xu"], "title": "Asymptotically tight Lagrangian dual of smooth nonconvex problems via improved error bound of Shapley-Folkman Lemma", "comment": null, "summary": "In convex geometry, the Shapley-Folkman Lemma asserts that the nonconvexity of a Minkowski sum of $n$ dimensional bounded nonconvex sets does not accumulate once the number of summands exceeds the dimension $n$, and thus the sum becomes approximately convex. Originally published by Starr in the context of quasi-equilibrium in nonconvex market models in economics, the lemma has since found widespread use in optimization, particularly for estimating the duality gap of the Lagrangian dual of separable nonconvex problems. Given its foundational nature, we pose the following geometric question: Is it possible for the nonconvexity of the Minkowski sum of $n$-dimensional nonconvex sets to even diminish instead of just not accumulating as the number of summands increases, under some general conditions? We answer this affirmatively. First, we provide an elementary geometric proof of the Shapley-Folkman Lemma based on the facial structure of the convex hull of each set. This leads to refinement of the classical error bound derived from the lemma. Building on this new geometric perspective, we further show that when most of the sets satisfy a certain local smoothness condition which naturally arises in the epigraphs of smooth functions, their Minkowski sum converges directly to a convex set, with a vanishing nonconvexity measure. In optimization, this implies that the Lagrangian dual of block-structured smooth nonconvex problems with potentially additional sparsity constraints is asymptotically tight under mild assumptions, which contracts nonvanishing duality gap obtained via classical Shapley-Folkman Lemma."}
{"id": "2601.19357", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19357", "abs": "https://arxiv.org/abs/2601.19357", "authors": ["Yang Yang", "Mingjiao Yan", "Zongliang Zhang", "Yinpeng Yin", "Qiang Liu", "You-liang Li"], "title": "Seepage analysis using a polygonal cell-based smoothed finite element method", "comment": "53 pages;24 figures", "summary": "This work develops a polygonal cell-based smoothed finite element method for steady-state, transient, and free-surface seepage in saturated porous media. Wachspress interpolation on convex polygonal elements is combined with cell-based gradient smoothing, so that element matrices are assembled using boundary integrals without in-element derivatives. Polygonal, quadtree, and hybrid quadtree--polygonal meshes are employed to accommodate local refinement and hanging nodes, and a solution-driven adaptive strategy further concentrates resolution near steep gradients and wet--dry transitions. Free-surface seepage is solved using a fixed-mesh iterative scheme that updates the wetted region, permeability field, and boundary conditions. Benchmark tests demonstrate accurate hydraulic-head and free-surface predictions, and show that adaptivity attains similar accuracy with substantially fewer degrees of freedom and CPU time."}
{"id": "2601.19307", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.19307", "abs": "https://arxiv.org/abs/2601.19307", "authors": ["Vincent Bansaye", "Ana Fernández Baranda", "Stéphane Giraudier", "Sylvie Méléard"], "title": "Hematopoiesis as a continuum: from stochastic compartmental model to hydrodynamic limit", "comment": null, "summary": "We consider a multiscale stochastic compartmental model with three types of cells (stem cells, immature cells and mature cells) which combines cell proliferation and cell differentiation. We derive a hydrodynamic limit when the number of immature compartments goes to infinity obtaining a partial differential equations system with boundary conditions, modelling hematopoiesis as a continuum. We assume that proliferation and differentiation are regulated and let the corresponding rates depend on the number of mature cells. This leads us to model the dynamics of the population by a Markov process in continuous time and discrete space, which does not satisfy the branching property. We prove the convergence in law of the stem and mature cells population size processes and of the empirical measures of the immature cells dynamics, conveniently rescaled, to the unique triplet involving coupled functions and a measure, which are solutions of a deterministic measure valued equation with boundary dynamics. The cell differentiation induces a transport term in space and the main difficulty comes from the boundary effects coming from stem and mature cells. We also prove that the limiting measure admits at each time a density with respect to Lebesgue measure and can be characterized as solution of a partial differential equation."}
{"id": "2601.19868", "categories": ["math.ST"], "pdf": "https://arxiv.org/pdf/2601.19868", "abs": "https://arxiv.org/abs/2601.19868", "authors": ["Shrajal Bajpai", "Lakshmi Kanta Patra"], "title": "Estimating ordered variance of two scale mixture of normal distributions", "comment": null, "summary": "This study investigates component wise estimation of ordered variances of scale mixture of two normal distributions. For this study two special loss functions are considered namely squared error loss function and entropy loss function. We have derived the general improvement results and based on these results the estimators that outperform BAEE are obtained. Moreover under certain sufficient conditions a class of improved estimators is proposed for both loss functions. As a special case of scale mixture of normal distribution the results are applied to the multivariate t-distribution and obtained the improvement results. For this case a detailed numerical comparison is carried out which validates our theoretical findings."}
{"id": "2601.19013", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19013", "abs": "https://arxiv.org/abs/2601.19013", "authors": ["Zeyi Xu", "Long Chen"], "title": "Adaptive Accelerated Gradient Descent Methods for Convex Optimization", "comment": null, "summary": "This work proposes A$^2$GD, a novel adaptive accelerated gradient descent method for convex and composite optimization. Smoothness and convexity constants are updated via Lyapunov analysis. Inspired by stability analysis in ODE solvers, the method triggers line search only when accumulated perturbations become positive, thereby reducing gradient evaluations while preserving strong convergence guarantees. By integrating adaptive step size and momentum acceleration, A$^2$GD outperforms existing first-order methods across a range of problem settings."}
{"id": "2601.19542", "categories": ["math.NA", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.19542", "abs": "https://arxiv.org/abs/2601.19542", "authors": ["Yao Luo"], "title": "Unified Regularization of 2D Singular Integrals for Axisymmetric Galerkin BEM in Eddy-Current Evaluation", "comment": "31 pages, 6 figures", "summary": "This paper presents an axisymmetric Galerkin boundary element method (BEM) for modeling eddy-current interactions between excitation coils and conductive objects. The formulation derives boundary integral equations from the Stratton-Chu representation for the azimuthal component of the vector potential in both air and conductive regions. The central contribution is a unified regularization framework for the two-dimensional (2D) singular integrals arising in Galerkin BEM. This framework handles both logarithmic and Cauchy singularities through a common set of integral transformations, eliminating the need for case-by-case analytical singularity extraction and enabling straightforward numerical quadrature. The regularization and quadrature stability are proved and verified numerically. The method is validated on several representative axisymmetric geometries, including cylindrical, conical, and spherical shells. Numerical experiments demonstrate consistently high accuracy and computational efficiency across broad frequency ranges and coil lift-off distances. The results confirm that the proposed axisymmetric Galerkin BEM, combined with the integral transformation technique, provides a robust and efficient framework for axisymmetric eddy-current nondestructive evaluation."}
{"id": "2601.19323", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.19323", "abs": "https://arxiv.org/abs/2601.19323", "authors": ["James Allen Fill", "Svante Janson"], "title": "Positive autocorrelation at unit lag for stationary random walk Metropolis-Hastings in ${\\mathbb R}^d$", "comment": "52 pages", "summary": "It is often asserted in the literature that one should expect positive autocorrelation for random walk Metropolis-Hastings (RWMH), especially if the typical proposal step-size is small relative to the variability in the target density. In this paper, we consider a stationary RWMH chain ${\\bf X}$ taking values in $d$-dimensional Euclidean space and (subject only to the existence of densities with respect to Lebesgue measure) with general target distribution having finite second moment and general proposal random walk step-distribution. We prove, for any nonzero vector ${\\bf c}$, strict positivity of the autocorrelation function at unit lag for the stochastic process $\\langle{\\bf c},{\\bf X}\\rangle$, that is, \\[{\\operatorname{Corr}}(\\langle{\\bf c},{\\bf X}_0\\rangle,\\langle{\\bf c},{\\bf X}_1\\rangle)>0,\\] and we establish the same result, but with weak inequality (which can in some cases be equality) when the state space for ${\\bf X}$ is changed to the integer grid ${\\mathbb Z}^d$. Further, for ${\\bf c}\\neq{\\bf 0}$ we establish the sharp lower bound \\[{\\operatorname{Corr}}(\\langle{\\bf c},{\\bf X}_0\\rangle,\\langle{\\bf c},{\\bf X}_1\\rangle)>\\tfrac19\\] on autocorrelation when we assume both that (i) the target density $π$ is spherically symmetric and unimodal in the specific sense that $π({\\bf x})=\\hatπ(\\|{\\bf x}\\|)$ for some nonincreasing function $\\hatπ$ on $[0,\\infty)$ and that (ii) the proposal step-density is symmetric about ${\\bf 0}$.\n  We study the autocorrelation indirectly, by considering the incremental variance function (or incremental second-moment function) at unit lag. The same approach allows us also for $r\\in[2,\\infty)$ to upper-bound the incremental $r$th-absolute-moment function at unit lag.\n  We give also closely related inequalities for the total variation distance between two distributions on ${\\mathbb R}^d$ differing only by a location shift."}
{"id": "2601.19323", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.19323", "abs": "https://arxiv.org/abs/2601.19323", "authors": ["James Allen Fill", "Svante Janson"], "title": "Positive autocorrelation at unit lag for stationary random walk Metropolis-Hastings in ${\\mathbb R}^d$", "comment": "52 pages", "summary": "It is often asserted in the literature that one should expect positive autocorrelation for random walk Metropolis-Hastings (RWMH), especially if the typical proposal step-size is small relative to the variability in the target density. In this paper, we consider a stationary RWMH chain ${\\bf X}$ taking values in $d$-dimensional Euclidean space and (subject only to the existence of densities with respect to Lebesgue measure) with general target distribution having finite second moment and general proposal random walk step-distribution. We prove, for any nonzero vector ${\\bf c}$, strict positivity of the autocorrelation function at unit lag for the stochastic process $\\langle{\\bf c},{\\bf X}\\rangle$, that is, \\[{\\operatorname{Corr}}(\\langle{\\bf c},{\\bf X}_0\\rangle,\\langle{\\bf c},{\\bf X}_1\\rangle)>0,\\] and we establish the same result, but with weak inequality (which can in some cases be equality) when the state space for ${\\bf X}$ is changed to the integer grid ${\\mathbb Z}^d$. Further, for ${\\bf c}\\neq{\\bf 0}$ we establish the sharp lower bound \\[{\\operatorname{Corr}}(\\langle{\\bf c},{\\bf X}_0\\rangle,\\langle{\\bf c},{\\bf X}_1\\rangle)>\\tfrac19\\] on autocorrelation when we assume both that (i) the target density $π$ is spherically symmetric and unimodal in the specific sense that $π({\\bf x})=\\hatπ(\\|{\\bf x}\\|)$ for some nonincreasing function $\\hatπ$ on $[0,\\infty)$ and that (ii) the proposal step-density is symmetric about ${\\bf 0}$.\n  We study the autocorrelation indirectly, by considering the incremental variance function (or incremental second-moment function) at unit lag. The same approach allows us also for $r\\in[2,\\infty)$ to upper-bound the incremental $r$th-absolute-moment function at unit lag.\n  We give also closely related inequalities for the total variation distance between two distributions on ${\\mathbb R}^d$ differing only by a location shift."}
{"id": "2601.19038", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19038", "abs": "https://arxiv.org/abs/2601.19038", "authors": ["Long Chen", "Hao Luo", "Jingrong Wei", "Zeyi Xu", "Yuan Yao"], "title": "Accelerated Mirror Descent Method through Variable and Operator Splitting", "comment": null, "summary": "Mirror descent uses the mirror function to encode geometry and constraints, improving convergence while preserving feasibility. Accelerated Mirror Descent Methods (Acc-MD) are derived from a discretization of an accelerated mirror ODE system using a variable--operator splitting framework. A geometric assumption, termed the Generalized Cauchy-Schwarz (GCS) condition, is introduced to quantify the compatibility between the objective and the mirror geometry, under which the first accelerated linear convergence for Acc-MD on a broad class of problems is established. Numerical experiments on smooth and composite optimization tasks demonstrate that Acc-MD consistently outperforms existing accelerated variants, both theoretically and empirically."}
{"id": "2601.19682", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.19682", "abs": "https://arxiv.org/abs/2601.19682", "authors": ["Kazuaki Tanaka", "Ryoga Iwanami", "Kaname Matsue", "Hiroyuki Ochiai"], "title": "A Green's Function-Based Enclosure Framework for Poisson's Equation and Generalized Sub- and Super-Solutions", "comment": "37 pages, 11 figures", "summary": "This paper presents a novel framework for enclosing solutions of Poisson's equation based on generalized sub- and super-solutions constructed using fundamental solutions. The conventional definition of sub- and super-solutions based on variational inequalities often fails for natural function classes such as piecewise linear functions and encounters theoretical difficulties in non-convex polygonal domains, where H^2 regularity is lost because of corner singularities. To overcome these limitations, we introduce the concept of ``Green-representable solutions'' utilizing test functions constructed from fundamental solutions. This framework enables a new formulation of sub- and super-solutions that permits rigorous pointwise evaluation. For one-dimensional problems, we derive explicit constructions of the test functions. For two-dimensional polygonal domains, we employ the Method of Fundamental Solutions to generate test functions. The approach is validated through numerical experiments in both settings, including non-convex polygons. The results demonstrate that the proposed method yields strict and accurate pointwise enclosures of the true solution, even for problems with discontinuous source terms or geometric singularities."}
{"id": "2601.19417", "categories": ["math.PR", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.19417", "abs": "https://arxiv.org/abs/2601.19417", "authors": ["Jérémie Brieussel", "Romain Tessera", "Tianyi Zheng"], "title": "Concentration inequalities for maximal displacement of random walks on groups of polynomial growth", "comment": null, "summary": "We prove Gaussian concentration inequalities for maximal displacement of compactly supported random walks on a compactly generated locally compact group with polynomial growth. Concentration inequalities with different exponents hold for non-centred random walks as well, after correction by the drift.\n  When the support of the measure generates a virtually nilpotent group, we provide an effective version of this result. These more refined estimates rely on the existence of a ``quantitative splitting'' of a virtually simply connected nilpotent group, a result which may be of independent interest.\n  As applications, we deduce that the same concentration inequalities hold for centred random walks on the following classes of groups: amenable connected Lie groups (including non-unimodular ones), polycyclic and more generally finitely generated solvable groups with finite Prüfer rank. This shows in particular that centred random walk are diffusive on such groups. For polycyclic groups, this strengthens and completes partial results previously obtained by Russ Thompson in 2011."}
{"id": "2601.19800", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.19800", "abs": "https://arxiv.org/abs/2601.19800", "authors": ["Xavier Emery", "Christian Lantuéjoul", "Nadia Mery", "Mohammad Maleki"], "title": "Towards a complete characterization of indicator variograms and madograms", "comment": null, "summary": "Indicator variograms and madograms are structural tools used in many disciplines of the natural sciences and engineering to describe random sets and random fields. To date, several necessary conditions are known for a function to be a valid indicator variogram but, except for intractable corner-positive inequalities, a complete characterization of indicator variograms is missing. Likewise, only partial characterizations of madograms are known. This paper provides novel necessary and sufficient conditions for a given function to be the variogram of an indicator random field with constant mean value or to be the madogram of a random field, and establishes under which conditions these two families of functions coincide. Our results apply to any set of points where the random field is defined and rely on distance geometry and Gaussian random field theory."}
{"id": "2601.19195", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19195", "abs": "https://arxiv.org/abs/2601.19195", "authors": ["Yi Xu", "Chufeng Cui", "Liqun Qi"], "title": "On the SOS Rank of Simple and Diagonal Biquadratic Forms", "comment": null, "summary": "We study the sum-of-squares (SOS) rank of simple and diagonal biquadratic forms. For simple biquadratic forms in $3 \\times 3$ variables, we show that the maximum SOS rank is exactly $6$, attained by a specific six-term form. We further prove that for any $m \\ge 3$, there exists an $m \\times m$ simple biquadratic form whose SOS rank is exactly $2m$, providing a general lower bound that extends the $3\\times3$ case. For diagonal biquadratic forms with nonnegative coefficients, we prove an SOS rank upper bound of $7$, improving the general bound of $8$ for $3 \\times 3$ forms. In addition, we extend the techniques to a broader class of \\textbf{sparse biquadratic forms}, obtaining combinatorial upper bounds and constructing explicit families whose SOS rank grows linearly with the number of terms. These results provide new lower and upper bounds on the worst-case SOS rank of biquadratic forms and highlight the role of structure in reducing the required number of squares."}
{"id": "2601.19740", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19740", "abs": "https://arxiv.org/abs/2601.19740", "authors": ["Pengjun Wang", "Zezhong Zhang", "Minglei Yang", "Feng Bao", "Yanzhao Cao", "Guannan Zhang"], "title": "Error estimates of a training-free diffusion model for high-dimensional sampling", "comment": null, "summary": "Score-based diffusion models are a powerful class of generative models, but their practical use often depends on training neural networks to approximate the score function. Training-free diffusion models provide an attractive alternative by exploiting analytically tractable score functions, and have recently enabled supervised learning of efficient end-to-end generative samplers. Despite their empirical success, the training-free diffusion models lack rigorous and numerically verifiable error estimates. In this work, we develop a comprehensive error analysis for a class of training-free diffusion models used to generate labeled data for supervised learning of generative samplers. By exploiting the availability of the exact score function for Gaussian mixture models, our analysis avoids propagating score-function approximation errors through the reverse-time diffusion process and recovers classical convergence rates for ODE discretization schemes, such as first-order convergence for the Euler method. Moreover, the resulting error bounds exhibit favorable dimension dependence, scaling as $O(d)$ in the $\\ell_2$ norm and $O(\\log d)$ in the $\\ell_\\infty$ norm. Importantly, the proposed error estimates are fully numerically verifiable with respect to both time-step size and dimensionality, thereby bridging the gap between theoretical analysis and observed numerical behavior."}
{"id": "2601.19511", "categories": ["math.PR", "math.FA", "math.OC", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2601.19511", "abs": "https://arxiv.org/abs/2601.19511", "authors": ["Johannes Langner", "Gregor Svindland"], "title": "P-Sensitive Functions and Localizations", "comment": null, "summary": "This paper assumes a robust stochastic model where a set $\\mathcal{P}$ of probability measures replaces the single probability measure of dominated models. We introduce and study $\\mathcal{P}$-sensitive functions defined on robust function spaces of random variables. We show that $\\mathcal{P}$-sensitive functions are precisely those that admit a representation via so-called functional localization. The theory is applied to solving robust optimization problems, to convex risk measures, and to the study of no arbitrage in robust one-period financial models."}
{"id": "2601.19299", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19299", "abs": "https://arxiv.org/abs/2601.19299", "authors": ["Minghui Zhang", "Xun Li", "Xin Zhang"], "title": "Continuous-time q-learning for Markov regime switching system under Tsallis entropy", "comment": null, "summary": "This paper studies the continuous-time q-learning (the continuous time counterpart of Q-learing) for Markov switching system under Tsallis entropy regularization. We address the difficulty in traditional RL algorithms where the Tsallis entropy regularization leads to an optimal policy distribution not necessarily a Gibbs measure, which often complicates algorithm design. Furthermore, to address the limited universality of current continuous time regime-switching RL algorithms (often restricted to the EMV framework), this study focuses on continuous-time q-learning for Markov regime-switching systems based on Tsallis entropy, aiming for a more universally applicable continuous-time RL method. We establish the martingale characterization of the q-function under Tsallis entropy for continuous-time Markov regime-switching systems. Based on this, we design two q-learning algorithms, distinguished by whether the Lagrange multiplier can be explicitly derived. We apply these algorithms to the continuous-time exploratory Mean-Variance (EMV) portfolio optimization problem in a regime-switching market. Numerical experiments demonstrate the satisfactory performance of our q-learning algorithms."}
{"id": "2601.19813", "categories": ["math.NA", "eess.SY", "math.DS", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.19813", "abs": "https://arxiv.org/abs/2601.19813", "authors": ["Michael S. Ackermann", "Linus Balicki", "Serkan Gugercin", "Steffen W. R. Werner"], "title": "A refined nonlinear least-squares method for the rational approximation problem", "comment": "26 pages, 5 figures", "summary": "The adaptive Antoulas-Anderson (AAA) algorithm for rational approximation is a widely used method for the efficient construction of highly accurate rational approximations to given data. While AAA can often produce rational approximations accurate to any prescribed tolerance, these approximations may have degrees larger than what is actually required to meet the given tolerance. In this work, we consider the adaptive construction of interpolating rational approximations while aiming for the smallest feasible degree to satisfy a given error tolerance. To this end, we introduce refinement approaches to the linear least-squares step of the classical AAA algorithm that aim to minimize the true nonlinear least-squares error with respect to the given data. Furthermore, we theoretically analyze the derived approaches in terms of the corresponding gradients from the resulting minimization problems and use these insights to propose a new greedy framework that ensures monotonic error convergence. Numerical examples from function approximation and model order reduction verify the effectiveness of the proposed algorithm to construct accurate rational approximations of small degrees."}
{"id": "2601.19546", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2601.19546", "abs": "https://arxiv.org/abs/2601.19546", "authors": ["Augusto Teixeira", "Daniel Ungaretti"], "title": "Holder continuity of interfaces for scale-invariant Poisson stick soup", "comment": "34 pages, 8 figures", "summary": "We study the interface of covered and vacant sets in the subcritical phase of a scale-invariant Poisson stick soup on the plane. This model is a natural candidate for scaling limit of some planar models and has connections with long-range percolation on the plane with critical parameter $s=4$. We analyze a family of exploration paths on boxes and prove tightness for this family and Holder continuity for its limiting measures."}
{"id": "2601.19379", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.19379", "abs": "https://arxiv.org/abs/2601.19379", "authors": ["Yidong Wu", "Luo Luo"], "title": "Optimal Asynchronous Stochastic Nonconvex Optimization under Heavy-Tailed Noise", "comment": null, "summary": "This paper considers the problem of asynchronous stochastic nonconvex optimization with heavy-tailed gradient noise and arbitrarily heterogeneous computation times across workers. We propose an asynchronous normalized stochastic gradient descent algorithm with momentum. The analysis show that our method achieves the optimal time complexity under the assumption of bounded $p$th-order central moment with $p\\in(1,2]$. We also provide numerical experiments to show the effectiveness of proposed method."}
{"id": "2601.19828", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19828", "abs": "https://arxiv.org/abs/2601.19828", "authors": ["Sergio Gómez"], "title": "Galerkin-type time discretizations for parabolic and hyperbolic problems: stability and a priori error analysis", "comment": null, "summary": "We present a unified framework for the analysis of space-time methods based on Galerkin-type time discretizations for parabolic and hyperbolic problems. Crucially, the stability analysis relies on a suitable choice of test functions to establish the continuous dependence of the discrete solution on the data in $L^{\\infty}(0, T; X)$ norms, which is then used to derive a priori error estimates. This approach closes the gap in the analysis of some methods in this class caused by the limitation of standard energy arguments, and is characterized by the absence of Grönwall estimates, applicability to arbitrary approximation degrees, reduced regularity assumptions, and robustness with respect to the model parameters."}
{"id": "2601.19614", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.19614", "abs": "https://arxiv.org/abs/2601.19614", "authors": ["Antoine Jego"], "title": "Derivatives of Gaussian multiplicative chaos", "comment": "30 pages, 1 figure", "summary": "Consider a logarithmically-correlated Gaussian field $X$ in $d$ dimensions. For all $γ\\in (-\\sqrt{2d},\\sqrt{2d})$, we show that the derivatives $\\frac{\\partial^k}{\\partialγ^k} :e^{γX_ε}:$ of the regularised Gaussian multiplicative chaos $:e^{γX_ε}:$ converge as $ε\\to 0$. By deriving optimal bounds on their growth as $k\\to\\infty$, we control the power expansion of $:e^{γX_ε}:$ about each $γ\\in(-\\sqrt{2d},\\sqrt{2d})$. This yields an alternative approach to complex Gaussian multiplicative chaos in the whole subcritical regime, based entirely on real-valued quantities.\n  One of our key technical contributions is to provide a truncated second moment approach to the uniform integrability of the derivatives of multiplicative chaos and its associated complex variant."}
{"id": "2601.19381", "categories": ["math.OC", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.19381", "abs": "https://arxiv.org/abs/2601.19381", "authors": ["Xinyan Chen", "Weiguo Gao", "Luo Luo"], "title": "Decentralized Nonsmooth Nonconvex Optimization with Client Sampling", "comment": null, "summary": "This paper considers decentralized nonsmooth nonconvex optimization problem with Lipschitz continuous local functions. We propose an efficient stochastic first-order method with client sampling, achieving the $(δ,ε)$-Goldstein stationary point with the overall sample complexity of ${\\mathcal O}(δ^{-1}ε^{-3})$, the computation rounds of ${\\mathcal O}(δ^{-1}ε^{-3})$, and the communication rounds of ${\\tilde{\\mathcal O}}(γ^{-1/2}δ^{-1}ε^{-3})$, where $γ$ is the spectral gap of the mixing matrix for the network. Our results achieve the optimal sample complexity and the sharper communication complexity than existing methods. We also extend our ideas to zeroth-order optimization. Moreover, the numerical experiments show the empirical advantage of our methods."}
{"id": "2601.19838", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19838", "abs": "https://arxiv.org/abs/2601.19838", "authors": ["Mechthild Thalhammer", "Gregor Thalhammer-Thurner"], "title": "Modified splitting methods for Gross-Pitaevskii systems modelling Bose-Einstein condensates: Time evolution and ground state computation", "comment": null, "summary": "The year 2025 marks the 100 and 30 years anniversaries of the discovery of Bose--Einstein condensation and its successful experimental realisation. Inspired by these important research achievements, a conceptually simple approach is proposed to facilitate reliable and efficient numerical simulations. The structure of the underlying systems of coupled Gross--Pitaevskii equations suggests the use of optimised high-order operator splitting methods for dynamical evolution and ground state computation. A second-order barrier, however, prevents the applicability of standard operator splitting methods for both, time evolution as well as imaginary time propagation. An innovative alternative approach accomplishes the design of novel modified operator splitting methods that remain stable under moderate smallness assumptions on the time increments. The core idea is to incorporate commutators of the defining differential and nonlinear multiplication operators, since this permits to fulfill the basic stability requirement of positive method coefficients. Further improvements with respect to convergence at the targeted precision arise from automatic adjustments of the time stepsizes by an inexpensive local error control. The presented numerical experiments confirm the favourable performance of a specific fourth-order modified operator splitting method. Amongst others, it is demonstrated that the excellent mass and energy conservation in long-term evolutions, intrinsic attributes of geometric numerical integrators for Hamiltonian systems, is maintained for a sensible variation of the time stepsizes. Moreover, the benefits of adaptive higher-order approximations in ground state computations are illustrated."}
{"id": "2601.19630", "categories": ["math.PR", "math-ph", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.19630", "abs": "https://arxiv.org/abs/2601.19630", "authors": ["Matías G. Delgadino", "Scott A. Smith"], "title": "Mass generation for the two dimensional O(N) Linear Sigma Model in the large N limit", "comment": null, "summary": "This work studies the $O(N)$ Linear Sigma Model on $\\mathbb{R}^{2}$ under a scaling dictated by the formal $1/N$ expansion. We show that in the large $N$ limit, correlations decay exponentially fast, where the acquired mass decays exponentially in the inverse temperature. In fact, each marginal converges to a massive Gaussian Free Field (GFF) on $\\mathbb{R}^{2}$, quantified in the $2$-Wasserstein distance with a weighted $H^{1}(\\mathbb{R}^{2})$ cost function. In contrast to prior work on the torus via parabolic stochastic quantization, our results hold without restrictions on the coupling constants, allowing us to also obtain a massive GFF in a suitable double scaling limit. Our proof combines the Feyel/Üstünel extension of Talagrand's inequality with some classical tools in Euclidean Quantum Field Theory."}
{"id": "2601.19400", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.19400", "abs": "https://arxiv.org/abs/2601.19400", "authors": ["Shuntaro Nagashima", "Hideaki Iiduka"], "title": "Improved Convergence Rates of Muon Optimizer for Nonconvex Optimization", "comment": null, "summary": "The Muon optimizer has recently attracted attention due to its orthogonalized first-order updates, and a deeper theoretical understanding of its convergence behavior is essential for guiding practical applications; however, existing convergence guarantees are either coarse or obtained under restrictive analytical settings. In this work, we establish sharper convergence guarantees for the Muon optimizer through a direct and simplified analysis that does not rely on restrictive assumptions on the update rule. Our results improve upon existing bounds by achieving faster convergence rates while covering a broader class of problem settings. These findings provide a more accurate theoretical characterization of Muon and offer insights applicable to a broader class of orthogonalized first-order methods."}
{"id": "2601.19877", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2601.19877", "abs": "https://arxiv.org/abs/2601.19877", "authors": ["Gunnar Birke", "Christian Engwer", "Sandra May", "Louis Petri", "Hendrik Ranocha"], "title": "An Energy-Preserving Domain of Dependence Stabilization for the Linear Wave Equation on Cut-Cell Meshes", "comment": null, "summary": "We present an energy-preserving (either energy-conservative or energy-dissipative) domain of dependence stabilization method for the linear wave equation on cut-cell meshes. Our scheme is based on a standard discontinuous Galerkin discretization in space and an explicit (strong stability preserving) Runge Kutta method in time. Tailored stabilization terms allow for selecting the time step length based on the size of the background cells rather than the small cut cells by propagating information across small cut cells. The stabilization terms preserve the energy stability or energy conservation property of the underlying discontinuous Galerkin space discretization. Numerical results display the high accuracy and stability properties of our scheme."}
{"id": "2601.19633", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.19633", "abs": "https://arxiv.org/abs/2601.19633", "authors": ["Alice Cortinovis", "Sophie Hautphenne", "Stefano Massei"], "title": "Computing the density of the Kesten-Stigum limit in supercritical Galton-Watson processes", "comment": null, "summary": "This paper proposes a novel numerical method for computing the density of the limit random variable associated with a supercritical Galton-Watson process. This random variable captures the effect of early demographic fluctuations and determines the random amplitude of long-term exponential population growth. While the existence of a non-trivial limit is ensured by the Kesten-Stigum theorem, computing its density in a stable and efficient manner for arbitrary offspring laws remains a significant challenge. The proposed approach leverages a functional equation that characterizes the Laplace-Stieltjes transform of the limit distribution and combines it with a moment-matching method to obtain accurate approximations within a class of linear combinations of Laguerre polynomials with exponential damping. The effectiveness of the approach is validated on several examples in which the offspring generating function is a polynomial of bounded degree."}
{"id": "2601.19544", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.19544", "abs": "https://arxiv.org/abs/2601.19544", "authors": ["Karine Beauchard", "Thomas Perrin", "Eugenio Pozzoli"], "title": "Approximate controllability of a bilinear wave equation and minimum time", "comment": null, "summary": "We study the global approximate controllability (GAC) of a Klein-Gordon wave equation, posed on the torus $\\mathbb{T}^d$ of arbitrary dimension $d\\in \\mathbb{N}^*$, with bilinear control potentials supported on the first $(2d+1)$-Fourier modes. Let $Z(W_0)\\subset \\mathbb{T}^d$ be the set of essential zeroes of the initial state $W_0\\in H^1\\times L^2(\\mathbb{T}^d)$, and $r(W_0)\\geq 0$ be the maximum radius of a ball of $\\mathbb{T}^d$ contained in $Z(W_0)$. Due to finite speed of propagation, the minimum control time starting from $W_0$ is necessarily larger than or equal to $r(W_0)$. We prove the following three facts.\n  In low dimensions $d \\in \\{1,2\\}$: the minimum time for GAC from $W_0 \\neq 0$ is equal to $r(W_0)$.\n  In any dimensions $d\\geq 3$: the minimum time for GAC from $W_0$ is zero if $Z(W_0)$ has zero Lebesgue measure; and the GAC in sufficiently large time from all $W_0\\neq 0$.\n  The proof strategy consists in combining Lie bracket techniques \\emph{à la Agrachev-Sarychev} with the propagation of well-prepared positive states."}
{"id": "2601.19633", "categories": ["math.PR", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.19633", "abs": "https://arxiv.org/abs/2601.19633", "authors": ["Alice Cortinovis", "Sophie Hautphenne", "Stefano Massei"], "title": "Computing the density of the Kesten-Stigum limit in supercritical Galton-Watson processes", "comment": null, "summary": "This paper proposes a novel numerical method for computing the density of the limit random variable associated with a supercritical Galton-Watson process. This random variable captures the effect of early demographic fluctuations and determines the random amplitude of long-term exponential population growth. While the existence of a non-trivial limit is ensured by the Kesten-Stigum theorem, computing its density in a stable and efficient manner for arbitrary offspring laws remains a significant challenge. The proposed approach leverages a functional equation that characterizes the Laplace-Stieltjes transform of the limit distribution and combines it with a moment-matching method to obtain accurate approximations within a class of linear combinations of Laguerre polynomials with exponential damping. The effectiveness of the approach is validated on several examples in which the offspring generating function is a polynomial of bounded degree."}
{"id": "2601.19639", "categories": ["math.PR", "math.AP", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.19639", "abs": "https://arxiv.org/abs/2601.19639", "authors": ["Antonio Agresti", "Fabian Germ", "Mark Veraar"], "title": "Sharp bounds for non-trace class noise and applications to SPDEs", "comment": null, "summary": "In the study of stochastic PDEs with colored, non-trace class space-time noise, one frequently encounters Gaussian series of the form $$ \\sum_{n\\geq 1} γ_n μ_n f_n, $$ where $(γ_n)_{n}$ is a sequence of standard independent Gaussian variables, $g$ is an $L^η(\\mathcal{O})$ function, $(μ_n)_{n}$ is a sequence of scalars, and $(f_n)_n$ is an orthonormal system in $L^2(\\mathcal{O})$ where $\\mathcal{O} \\subseteq \\mathbb{R}^d$ is an open set. In this manuscript, we establish necessary and sufficient conditions for the above sum to converge in Bessel potential spaces $H^{-s,q}(\\mathcal{O})$. The latter can be interpreted as a Sobolev embedding for Gaussian series. Our main theorem is formulated using weighted sequence spaces that encode the $L^\\infty$-growth of the orthonormal system $(f_n)_{n}$, a feature that is crucial for obtaining sharp estimates. We apply our results to the stochastic heat equation with additive non-trace class noise. In this case, our conditions capture the scaling relationship between the heat operator and the coloring of the noise."}
{"id": "2601.19601", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19601", "abs": "https://arxiv.org/abs/2601.19601", "authors": ["Bharti Bharti", "René Bekker", "Nikki Levering", "Michel Mandjes"], "title": "A framework for window design in delivery schedules", "comment": null, "summary": "This paper develops a structured framework for the design and dynamic updating of service time windows in delivery and appointment-based systems. We consider a single-server setting with stochastic service and travel times, where customers are promised a time window in which the provider will arrive. The first part of the paper introduces a static window construction method based on a probabilistic threshold criterion, using an analytical approximation of residual travel and service time distributions. Building on this, we develop a dynamic update mechanism that monitors residual system uncertainty, where time windows are revised during execution only when the remaining time until the window's start falls below a predefined threshold. This threshold-based approach enables communication-efficient scheduling while substantially improving delivery accuracy. Numerical experiments demonstrate significant performance gains of the dynamic approach in both stylized and real-world settings."}
{"id": "2601.19800", "categories": ["math.PR", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.19800", "abs": "https://arxiv.org/abs/2601.19800", "authors": ["Xavier Emery", "Christian Lantuéjoul", "Nadia Mery", "Mohammad Maleki"], "title": "Towards a complete characterization of indicator variograms and madograms", "comment": null, "summary": "Indicator variograms and madograms are structural tools used in many disciplines of the natural sciences and engineering to describe random sets and random fields. To date, several necessary conditions are known for a function to be a valid indicator variogram but, except for intractable corner-positive inequalities, a complete characterization of indicator variograms is missing. Likewise, only partial characterizations of madograms are known. This paper provides novel necessary and sufficient conditions for a given function to be the variogram of an indicator random field with constant mean value or to be the madogram of a random field, and establishes under which conditions these two families of functions coincide. Our results apply to any set of points where the random field is defined and rely on distance geometry and Gaussian random field theory."}
{"id": "2601.19615", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19615", "abs": "https://arxiv.org/abs/2601.19615", "authors": ["Oliver Bachtler", "Felix Fritz", "Stefan Ruzika"], "title": "An adjacency-based algorithm for computing all extreme-supported non-dominated points of a bi-objective combinatorial optimisation problem", "comment": null, "summary": "Generally, multi-objective optimisation problems are solved exactly or approximated by solving a series of scalarisations, for example by dichotomic search. In this paper, we take a different approach and attempt to compute the set of all extreme-supported non-dominated points of a bi-objective combinatorial optimisation problem by using a neighbourhood-based approach. Whether or not this works depends on the definition of adjacency and we provide sufficient conditions that guarantee its success. The resulting generic algorithm is an alternative to dichotomic search in our setting.\n  We then apply our generic algorithm to a specific example: the bi-objective minimum weight basis problem, in which we are given a matroid and want to find bases of minimum weight. We use the natural definition of adjacency, in which two bases are adjacent if they differ in exactly one element. Since this satisfies our sufficient condition on the adjacency relation, our generic algorithm works in this case and we analyse its running time, showing that it is polynomial. By tailoring this algorithm specifically to matroids, we obtain one that is faster but no longer transitions between adjacent solutions, instead swapping directly from one extreme-supported point to the next in a combinatorial fashion."}
{"id": "2601.19389", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.19389", "abs": "https://arxiv.org/abs/2601.19389", "authors": ["F. Belzunce", "C. Martínez-Riquelme", "M. Pereda"], "title": "Sufficient Conditions for Some Stochastic Orders of Discrete Random Variables with Applications in Reliability", "comment": "15 pages. Published open access article", "summary": "In this paper we focus on providing sufficient conditions for some well-known stochastic orders in reliability but dealing with the discrete versions of them, filling a gap in the literature. In particular, we find conditions based on the unimodality of the likelihood ratio for the comparison in some stochastic orders of two discrete random variables. These results have interest in comparing discrete random variables because the sufficient conditions are easy to check when there are no closed expressions for the survival functions, which occurs in many cases. In addition, the results are applied to compare several parametric families of discrete distributions."}
{"id": "2601.19746", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19746", "abs": "https://arxiv.org/abs/2601.19746", "authors": ["Nahid Sultana", "M M Rizvi", "Indu Wadhawan"], "title": "A Multiobjective Water Allocation Model for Economic Efficiency and Environmental Sustainability: Case Study", "comment": "38 pages", "summary": "The management of irrigation water systems has become increasingly complex due to competing demands for agricultural production, groundwater sustainability, and environmental flow requirements, particularly under hydrologic variability and climate uncertainty. Addressing these challenges requires optimization frameworks that can jointly determine optimal crop allocation, groundwater pumping, and environmental flow releases while maintaining economic and hydrological feasibility. However, existing hydro-economic models, including the widely used Lewis and Randall formulation, may overestimate net benefits by allowing infeasible negative pumping and surface water allocations. We extend the Lewis and Randall framework by reformulating groundwater pumping and surface water use as non-negative, demand-driven decision variables and by explicitly incorporating environmental flow and canal capacity constraints. Three models are developed to maximize economic benefit, minimize environmental deficits, and a multiobjective model that evaluates the trade-offs between these two objectives. An illustrative test case examining optimal crop area allocation and environmental flow management across dry, average, and wet years, using data from the Rajshahi Barind Tract in northwestern Bangladesh, is presented. The results show that the proposed formulation produces economically and hydrologically consistent solutions, identifying optimal strategies when either net benefits or environmental protection is prioritized, as well as Pareto-optimal trade-offs when both objectives are considered together. These findings provide practical insights for balancing farm income, groundwater sustainability, and ecological protection, offering a robust decision-support tool for irrigation management in water-limited river basins."}
{"id": "2601.19759", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2601.19759", "abs": "https://arxiv.org/abs/2601.19759", "authors": ["A. R. M.", "Wolfert"], "title": "Unique Preference Aggregation in Design and Decision Making", "comment": null, "summary": "Preference aggregation is a core operation in multi-objective design optimisation and group decision-making, as it determines the best-fit-for-common-purpose alternative within complex socio-technical contexts. Therefore, their aggregation requires a rigorous measurement-theoretic foundation to ensure mathematical validity, interpretability, and uniqueness. PFM establishes the principal axioms of unique preference aggregation, providing a rigorous basis on which aggregation can be demonstrated.\n  In this paper, it is shown that commonly used aggregation approaches in MCDM - such as weighted arithmetic and geometric means, as well as weighted distance-based optimisation methods - often fail to produce consistent rankings and are therefore unsuitable for pure MCDM. In contrast, the unique preference aggregation presented here clarifies the mathematical limits of valid aggregation and provides a principled, implementable foundation for robust multi-criteria decision analysis (MCDA) and multi-objective design optimisation (MODO) in multi-faceted problems."}
{"id": "2601.19084", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.19084", "abs": "https://arxiv.org/abs/2601.19084", "authors": ["Jiusheng Liu", "Jing Zhang"], "title": "A Probabilistic Interpretation of the Master Equation Arising from Mean Field Games with Jump Diffusion", "comment": "33 pages", "summary": "In this paper we study the classical solution to the master equation arising from mean-field games (MFGs) driven by jump-diffusion processes. The master equation, a nonlinear partial differential equation on Wasserstein space, characterizes the value function of MFGs and is challenging to analyze directly due to its measure-valued derivatives. We propose a probabilistic interpretation using coupled McKean-Vlasov forward-backward stochastic differential equations (MV-FBSDEs) with jumps. Under suitable Lipschitz and differentiability assumptions on the coefficients, we first establish the well-posedness of the MV-FBSDEs on a small time interval via a contraction mapping argument. We then prove the existence and regularity of the first- and second-order derivatives of the solutions with respect to the spatial and measure variables, relying on careful estimates involving jump terms and measure derivatives. Finally, we show that the decoupling field of the MV-FBSDEs satisfies the master equation in the classical sense, providing both existence and uniqueness of the solution. Our work extends earlier results on diffusion-driven MFGs to the jump-diffusion setting and offers a probabilistic framework for analyzing and numerically solving such kind of master equations."}
{"id": "2601.19511", "categories": ["math.PR", "math.FA", "math.OC", "q-fin.MF"], "pdf": "https://arxiv.org/pdf/2601.19511", "abs": "https://arxiv.org/abs/2601.19511", "authors": ["Johannes Langner", "Gregor Svindland"], "title": "P-Sensitive Functions and Localizations", "comment": null, "summary": "This paper assumes a robust stochastic model where a set $\\mathcal{P}$ of probability measures replaces the single probability measure of dominated models. We introduce and study $\\mathcal{P}$-sensitive functions defined on robust function spaces of random variables. We show that $\\mathcal{P}$-sensitive functions are precisely those that admit a representation via so-called functional localization. The theory is applied to solving robust optimization problems, to convex risk measures, and to the study of no arbitrage in robust one-period financial models."}
{"id": "2601.19813", "categories": ["math.NA", "eess.SY", "math.DS", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.19813", "abs": "https://arxiv.org/abs/2601.19813", "authors": ["Michael S. Ackermann", "Linus Balicki", "Serkan Gugercin", "Steffen W. R. Werner"], "title": "A refined nonlinear least-squares method for the rational approximation problem", "comment": "26 pages, 5 figures", "summary": "The adaptive Antoulas-Anderson (AAA) algorithm for rational approximation is a widely used method for the efficient construction of highly accurate rational approximations to given data. While AAA can often produce rational approximations accurate to any prescribed tolerance, these approximations may have degrees larger than what is actually required to meet the given tolerance. In this work, we consider the adaptive construction of interpolating rational approximations while aiming for the smallest feasible degree to satisfy a given error tolerance. To this end, we introduce refinement approaches to the linear least-squares step of the classical AAA algorithm that aim to minimize the true nonlinear least-squares error with respect to the given data. Furthermore, we theoretically analyze the derived approaches in terms of the corresponding gradients from the resulting minimization problems and use these insights to propose a new greedy framework that ensures monotonic error convergence. Numerical examples from function approximation and model order reduction verify the effectiveness of the proposed algorithm to construct accurate rational approximations of small degrees."}
