{"id": "2602.21277", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.21277", "abs": "https://arxiv.org/abs/2602.21277", "authors": ["Oren Louidor", "Santiago Saglietti"], "title": "A Limit in Law for the Cover Time and Last Visited Vertex of Wired Planar Domains", "comment": "90 pgs", "summary": "We derive a scaling limit in law for the cover time of a simple random walk on a lattice version of a scaled-up planar domain with wired boundary conditions. The limiting distribution is that of a Gumbel Random Variable shifted randomly by an independent quantity which is equal to the full mass of a variant of the critical Liouville Quantum Gravity Measure on the same domain. We also derive a limit in law for the scaled location of the vertex visited last by the walk. Here the limit turns out to be precisely the critical Liouville Measure, normalized by its total mass. Both limits hold jointly with the limiting joint law explicitly described. These results resolve well known open problems in the field, in the case of wired boundary conditions. The proof is based on comparison with the extremal landscape of the discrete Gaussian Free Field, and in particular a version there-of obtained by conditioning the average value of the field to be zero."}
{"id": "2602.21315", "categories": ["math.PR", "cs.DM", "cs.DS", "cs.IT", "cs.NI"], "pdf": "https://arxiv.org/pdf/2602.21315", "abs": "https://arxiv.org/abs/2602.21315", "authors": ["Leslie Ann Goldberg", "John Lapinskas"], "title": "The Instability of all Backoff Protocols", "comment": null, "summary": "In this paper we prove Aldous's conjecture from 1987 that there is no backoff protocol that is stable for any positive arrival rate. The setting is a communication channel for coordinating requests for a shared resource. Each user who wants to access the resource makes a request by sending a message to the channel. The users don't have any way to communicate with each other, except by sending messages to the channel. The operation of the channel proceeds in discrete time steps. If exactly one message is sent to the channel during a time step then this message succeeds (and leaves the system). If multiple messages are sent during a time step then these messages collide. Each of the users that sent these messages therefore waits a random amount of time before re-sending. A backoff protocol is a randomised algorithm for determining how long to wait -- the waiting time is a function of how many collisions a message has had. Specifically, a backoff protocol is described by a send sequence $\\overline{p} = (p_0,p_1,p_2,\\ldots)$. If a message has had $k$ collisions before a time step then, with probability $p_k$, it sends during that time step, whereas with probability $1-p_k$ it is silent (waiting for later). The most famous backoff protocol is binary exponential backoff, where $p_k = 2^{-k}$. Under Kelly's model, in which the number of new messages that arrive in the system at each time step is given by a Poisson random variable with mean $λ$, Aldous proved that binary exponential backoff is unstable for any positive $λ$. He conjectured that the same is true for any backoff protocol. We prove this conjecture."}
{"id": "2602.21679", "categories": ["math.PR", "math-ph"], "pdf": "https://arxiv.org/pdf/2602.21679", "abs": "https://arxiv.org/abs/2602.21679", "authors": ["Malin Palö Forsström"], "title": "Phase transitions in the charged compact abelian lattice Higgs model", "comment": "24 pages, 4 figures", "summary": "We consider the (compact) abelian lattice Higgs model with charge \\( k \\geq 1 \\) and show, using charged Wilson~loop observables and charged versions of the Marcu--Fredenhagen ratio, that this model exhibits several distinct phase transitions. In particular, we show that if \\(k = 2\\), then the Marcu--Fredenhagen ratio and Wilson~loop observables together can distinguish among three distinct phases of the parameter space, and hence both can be used as order parameters for the model."}
{"id": "2602.21775", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.21775", "abs": "https://arxiv.org/abs/2602.21775", "authors": ["Laure Marêché"], "title": "True self-repelling motion above a general barrier", "comment": "33 pages, no figure", "summary": "The true self-repelling motion is a continuous-time random process which was introduced by Tóth and Werner in 1998 to be a limit for the \"true\" self-avoiding random walk defined by Tóth in 1995. The construction of the true self-repelling motion involves an uncountable system of coalescing Brownian motions starting from all points of the upper half-plane, related to the Brownian web, but reflected and absorbed on a \"barrier\" which is the abscissa axis. In this work, we consider much more general barriers, construct an uncountable system of coalescing Brownian motions reflected and absorbed on these barriers, and the true self-repelling motion associated to it. The extension of the proofs of Tóth and Werner to this more general case is surprisingly difficult, especially when the barrier is irregular."}
{"id": "2602.21448", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.21448", "abs": "https://arxiv.org/abs/2602.21448", "authors": ["Linheng Ruan", "Ilja Kröker", "Sergey Oladyshkin", "Iryna Rybak"], "title": "Surrogate-assisted global sensitivity analysis of a hybrid-dimensional Stokes--Brinkman--Darcy model", "comment": null, "summary": "Development of new multiscale mathematical models often entails considerable complexity and multiple undetermined parameters, typically arising from closure relations. To enable reliable simulations, one must quantify how uncertain physical parameters influence model predictions. We propose surrogate-assisted global sensitivity analysis that combines computational efficiency with a rigorous assessment of parameter influence. In this work, we analyze the recently proposed hybrid-dimensional Stokes--Brinkman--Darcy model, which describes fluid flows in coupled free-flow and porous-medium systems with arbitrary flow directions at the fluid--porous interface. The model results from vertical averaging and contains several unknown parameters. We perform surrogate-assisted global sensitivity analysis using Sobol' indices to investigate the sensitivity of the model to variations of physical parameters for two test cases: filtration and splitting flows. However, constructing surrogates for higher-dimensional random fields requires either many training runs or sophisticated sampling strategies. To address this, we compare polynomial chaos surrogates, including sparse and multi-resolution representations, for their efficiency in global sensitivity analysis, using a predefined Sobol' sequence of training samples. Across the tested cases, multi-resolution approach delivers the most accurate estimation of Sobol' indices."}
{"id": "2602.21359", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.21359", "abs": "https://arxiv.org/abs/2602.21359", "authors": ["Swarnadeep Datta", "Monitirtha Dey"], "title": "Some Asymptotic Results on Multiple Testing under Weak Dependence", "comment": null, "summary": "This paper studies the means-testing problem under weakly correlated Normal setups. Although quite common in genomic applications, test procedures having exact FWER control under such dependence structures are nonexistent. We explore the asymptotic behaviors of the classical Bonferroni (when adjusted suitably) and the Sidak procedure; and show that both of these control FWER at the desired level exactly as the number of hypotheses approaches infinity. We derive analogous limiting results on the generalized family-wise error rate and power. Simulation studies depict the asymptotic exactness of the procedures empirically."}
{"id": "2602.21274", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.21274", "abs": "https://arxiv.org/abs/2602.21274", "authors": ["Johanna Garzón", "Jhonatan S. Mora Rodríguez", "Harold A. Moreno-Franco"], "title": "Optimal extraction with an impact on diffusion-jump pricing", "comment": null, "summary": "We study an optimal extraction problem where the agent's actions in the spot market exert an additive proportional negative impact on the commodity price. The commodity price dynamics, prior to any activity by the agent, are evolved by a drifted Brownian motion with jumps. The agent's primary aim is to identify an optimal extraction strategy that maximizes their expected net profits."}
{"id": "2602.21809", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.21809", "abs": "https://arxiv.org/abs/2602.21809", "authors": ["Serguei Popov", "Quirin Vogel"], "title": "On large deviations for the range of a two-dimensional random walk", "comment": "6 pages, 1 figure, comments welcome", "summary": "In this note, we compute the probability that a two-dimensional symmetric random walk visits more vertices than expected, for deviations on scales between the mean behavior and linear growth."}
{"id": "2602.21574", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.21574", "abs": "https://arxiv.org/abs/2602.21574", "authors": ["Na Li", "Yongchao Zhao"], "title": "Convergence Analysis of a Linear, Unconditionally Energy-Stable SAV Finite Element Method for the Cahn-Hilliard Equation", "comment": null, "summary": "This paper proposes a finite element scheme, based on the Scalar Auxiliary Variable (SAV) approach, for the Cahn-Hilliard equation--a model that possesses significant physical relevance and a rich mathematical structure. A convergence analysis of the fully discrete scheme is conducted under suitable regularity assumptions, confirming optimal-order convergence in both time and space for the phase variable, chemical potential, and auxiliary variable in the H1-norm. Furthermore, the scheme is proven to be unconditionally energy stable. Finally, a numerical example is presented to demonstrate the effectiveness of the method and to confirm the theoretical convergence rates."}
{"id": "2602.21423", "categories": ["math.ST", "stat.ME"], "pdf": "https://arxiv.org/pdf/2602.21423", "abs": "https://arxiv.org/abs/2602.21423", "authors": ["Patrick Kramer", "Edward H. Kennedy", "Isaac M. Opper"], "title": "Causal Inference with High-Dimensional Treatments", "comment": null, "summary": "In this work, we consider causal inference in various high-dimensional treatment settings, including for single multi-valued treatments and vector treatments with binary or continuous components, when the number of treatments can be comparable to or even larger than the number of observations. These settings bring unique challenges: first, the treatment effects of interest are a high-dimensional vector rather than a low-dimensional scalar; second, positivity violations are often unavoidable; and third, estimation can be based on a smaller effective sample size. We first discuss fundamental limits of estimating effects here, showing that consistent estimation is impossible without further assumptions. We go on to propose a novel sparse pseudo-outcome regression framework for arbitrary high-dimensional statistical functionals, which includes generic constrained regression estimators and error guarantees. We use the framework to derive new doubly robust estimators for mean potential outcomes of high-dimensional treatments, though it can also be applied to other scenarios. We analyze the proposed estimators under exact and approximate sparsity assumptions, giving finite-sample risk bounds. Finally, we derive minimax lower bounds to characterize optimal rates of convergence and show our risk bounds are unimprovable."}
{"id": "2602.21352", "categories": ["math.OC", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.21352", "abs": "https://arxiv.org/abs/2602.21352", "authors": ["Chiu-Yen Kao", "Seyyed Abbas Mohammadi", "Braxton Osting"], "title": "An accelerated rearrangement method for two-phase composite optimization", "comment": "21 pages, 7 figures", "summary": "We propose and analyze an Accelerated Rearrangement Method (ARM) for solving a class of nonconvex optimization problems involving two-phase composites. These problems include maximizing the (work) energy of a membrane governed by the Poisson equation and minimizing the principal eigenvalue of a weighted Dirichlet-Laplacian, both subject to material distribution constraints. Building on the classical rearrangement method, we introduce momentum-like acceleration by extrapolating the Fréchet derivative, leading to a provably convergent algorithm. We also introduce a restarted variant that guarantees monotonic improvement of the objective. In one dimension, we derive asymptotic convergence rates for ARM and prove that they improve upon the classical rearrangement method. Numerical experiments in both two and three dimensions confirm the accelerated convergence and demonstrate practical efficiency."}
{"id": "2602.21685", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.21685", "abs": "https://arxiv.org/abs/2602.21685", "authors": ["H. M. Verhelst", "L. Greco", "A. Reali"], "title": "Adaptive isogeometric analysis of high-order phase-field fracture based on THB-splines", "comment": null, "summary": "In recent decades, the study of fracture propagation in solids has increasingly relied on phase-field models. Several recent contributions have highlighted the potential of this approach in both static and dynamic frameworks. However, a major limitation remains the high computational cost. Two main strategies have been identified to mitigate this issue: the use of locally refined meshes and the adoption of higher-order models. In this work, leveraging Truncated Hierarchical B-splines (THB-splines), we introduce adaptive simulations of higher-order phase-field formulations (AT1 and AT2), focusing primarily on two-dimensional fracture problems."}
{"id": "2602.21753", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.21753", "abs": "https://arxiv.org/abs/2602.21753", "authors": ["Lisa Stammen", "Wolfgang Dornisch"], "title": "A dual lumping procedure for static condensation in mixed NURBS-based isogeometric elements with optimal convergence rates for arbitrary open knot vectors", "comment": "52 pages, 18 figures, 2 tables, Preprint submitted to Computer Methods in Applied Mechanics and Engineering", "summary": "Locking is a common effect in finite element and isogeometric analysis. In the case of plates, transverse shear locking is most prominent, for shells several other types of locking exist. A common cure are mixed methods that introduce additional fields of unknowns into the variational formulation. These fields reduce constraints and thus alleviate locking significantly. As a drawback, the discretized additional fields increase computational costs significantly. These fields are often eliminated by static condensation, which requires the inverse of a part of the stiffness matrix. In Lagrange-based finite elements, this inverse is computed on element level, due to a discontinuous interpolation of additional fields. Since isogeometric analysis features higher continuity, static condensation must be performed on patch level, which requires a costly matrix inversion on that level. In this contribution, the virtual shear parameters of a mixed isogeometric plate formulation are interpolated by enhanced approximate dual basis functions. This allows to conduct row-sum lumping of the relevant matrix part at a minimal loss of accuracy, since this part becomes diagonal dominant. For a properly chosen integration space, this lumped matrix becomes the identity matrix. Thus, the proposed condensation procedure does not require an inversion anymore. The crucial and novel point is the proposed treatment of knot vectors with limited internal continuity. With the help of several single- and multi-patch examples, both with full and with limited internal continuity, we show that the proposed procedure obtains optimal error convergence rates in all cases, while without these alterations, convergence rates are significantly deteriorated."}
{"id": "2602.21767", "categories": ["math.NA", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.21767", "abs": "https://arxiv.org/abs/2602.21767", "authors": ["P. Giesl", "S. Hafstein", "B. Hamzi", "J. Lee", "H. Owhadi", "G. Santin", "U. Vaidya"], "title": "Kernel Methods for the Construction of Certified Lyapunov Functions via Approximate Koopman Eigenfunctions", "comment": null, "summary": "We present a kernel-based methodology for constructing Lyapunov functions for nonlinear dynamical systems using approximate Koopman eigenfunctions. Our approach decomposes principal Koopman eigenfunctions into linear and nonlinear components, where the linear part is obtained from the system's linearization and the nonlinear part is computed by solving a partial differential equation using symmetric kernel collocation in reproducing kernel Hilbert spaces (RKHS). The resulting Lyapunov function is constructed as a quadratic form in the approximate eigenfunctions. We establish error bounds relating the approximation quality to the fill distance of collocation points and provide a certification procedure using continuous piecewise affine (CPA) methods. Numerical experiments on benchmark systems, including a polynomial system and the Duffing oscillator, demonstrate the effectiveness of our approach."}
{"id": "2602.21465", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.21465", "abs": "https://arxiv.org/abs/2602.21465", "authors": ["Nahom Seyoum"], "title": "Exponential Concentration Inequalities For Independent Random Vectors Under Sublinear Expectations", "comment": null, "summary": "Li and Hu recently established variance-type O(1/n) bounds for the sample mean of independent random vectors under sublinear expectations. We extend their results to the exponential concentration regime. For bounded, independent R^d-valued random vectors under a regular sublinear expectation, we prove: (i) a general concentration principle that reduces vector-valued tail bounds to scalar martingale inequalities via a three-layer architecture; (ii) an Azuma-Hoeffding inequality showing that the distance from the sample mean to the Minkowski average of the expectation sets has sub-Gaussian tails; (iii) a Bernstein inequality incorporating the variance parameter of Li and Hu, interpolating between sub-Gaussian and sub-exponential regimes; (iv) a dimension-free bound replacing the exponential covering prefactor with a polynomial one via the matrix Freedman inequality; and (v) an explicit construction demonstrating that the sub-Gaussian rate is optimal. To the best of our knowledge, these constitute the first exponential concentration inequalities for the multivariate sample mean under sublinear expectations in terms of the set-valued distance to the Minkowski average."}
{"id": "2602.22173", "categories": ["math.OC", "cs.NE"], "pdf": "https://arxiv.org/pdf/2602.22173", "abs": "https://arxiv.org/abs/2602.22173", "authors": ["Antonio A. Chaves", "Mauricio G. C. Resende", "Carise E. Schmidt", "J. Kyle Brubaker", "Helmut G. Katzgraber"], "title": "Applying a Random-Key Optimizer on Mixed Integer Programs", "comment": "29 pages, 8 figures, 6 tables, 4 algorithm pseudocodes", "summary": "Mixed-Integer Programs (MIPs) are NP-hard optimization models that arise in a broad range of decision-making applications, including finance, logistics, energy systems, and network design. Although modern commercial solvers have achieved remarkable progress and perform effectively on many small- and medium-sized instances, their performance often degrades when confronted with large-cale or highly constrained formulations. This paper explores the use of the Random-Key Optimizer (RKO) framework as a flexible, metaheuristic alternative for computing high-quality solutions to MIPs through the design of problem-specific decoders. The proposed approach separates the search process from feasibility enforcement by operating in a continuous random-key space while mapping candidate solutions to feasible integer solutions via efficient decoding procedures. We evaluate the methodology on two representative and structurally distinct benchmark problems: the mean-variance Markowitz portfolio optimization problem with buy-in and cardinality constraints, and the Time-Dependent Traveling Salesman Problem. For each formulation, tailored decoders are developed to reduce the effective search space, promote feasibility, and accelerate convergence. Computational experiments demonstrate that RKO consistently produces competitive, and in several cases superior, solutions compared to a state-of-the-art commercial MIP solver, both in terms of solution quality and computational time. These results highlight the potential of RKO as a scalable and versatile heuristic framework for tackling challenging large-scale MIPs."}
{"id": "2602.21352", "categories": ["math.OC", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.21352", "abs": "https://arxiv.org/abs/2602.21352", "authors": ["Chiu-Yen Kao", "Seyyed Abbas Mohammadi", "Braxton Osting"], "title": "An accelerated rearrangement method for two-phase composite optimization", "comment": "21 pages, 7 figures", "summary": "We propose and analyze an Accelerated Rearrangement Method (ARM) for solving a class of nonconvex optimization problems involving two-phase composites. These problems include maximizing the (work) energy of a membrane governed by the Poisson equation and minimizing the principal eigenvalue of a weighted Dirichlet-Laplacian, both subject to material distribution constraints. Building on the classical rearrangement method, we introduce momentum-like acceleration by extrapolating the Fréchet derivative, leading to a provably convergent algorithm. We also introduce a restarted variant that guarantees monotonic improvement of the objective. In one dimension, we derive asymptotic convergence rates for ARM and prove that they improve upon the classical rearrangement method. Numerical experiments in both two and three dimensions confirm the accelerated convergence and demonstrate practical efficiency."}
