{"id": "2602.11423", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.11423", "abs": "https://arxiv.org/abs/2602.11423", "authors": ["Enrique Otarola", "Abner J. Salgado"], "title": "The spectral fractional Laplacian with measure valued right hand sides: analysis and approximation", "comment": null, "summary": "We consider the spectral definition of the fractional Laplace operator and study a basic linear problem involving this operator and singular forcing. In two dimensions, we introduce an appropriate weak formulation in fractional Sobolev spaces and prove that it is well-posed. As an application of these results, we analyze a pointwise tracking optimal control problem for fractional diffusion. We also develop a finite element scheme for the linear problem using continuous, piecewise linear functions, prove a convergence result in energy norm, and derive an error bound in $L^2(Ω)$. Finally, we propose a practical scheme based on a diagonalization technique and derive an error bound in $L^2(Ω)$ using a regularization argument."}
{"id": "2602.11248", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11248", "abs": "https://arxiv.org/abs/2602.11248", "authors": ["Samuel Ward", "Marah-Lisanne Thormann", "Julian Wharton", "Alain Zemkoho"], "title": "Data-Driven Hull-Fouling Cleaning Schedule Optimization to Reduce Carbon Footprint of Vessels", "comment": null, "summary": "In response to climate change, the International Maritime Organization has introduced regulatory frameworks to reduce greenhouse gas emissions from international shipping. Compliance with these regulations is increasingly expected from individual shipping companies, compelling vessel operators to lower the CO2 emissions of their fleets while maintaining economic viability. An important step towards achieving this is performing regular hull and propeller cleaning; however, this entails significant costs. As a result, assessing whether ship performance has declined sufficiently to warrant cleaning from an environmental and economic standpoint is a critical task to ensure both long-term viability and regulatory compliance. In this paper, we address this challenge by proposing a novel data-driven dynamic programming approach to optimize vessel cleaning schedules by balancing both environmental and economic considerations. In numerical experiments, we demonstrate the usefulness of our proposed methodology based on real-world sensor data from ten tramp trading vessels. The results confirm that over a four-year period, fuel consumption can be reduced by up to 5%, even when accounting for the costs of one or two additional cleaning events."}
{"id": "2602.12006", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.12006", "abs": "https://arxiv.org/abs/2602.12006", "authors": ["Johan Benedikt Spille", "Wilhelm Stannat"], "title": "A Novel Approach to Peng's Maximum Principle for McKean-Vlasov Stochastic Differential Equations", "comment": null, "summary": "We present a novel approach to the proof of Peng's maximum principle for McKean-Vlasov stochastic differential equations (SDE). The main step is the introduction of a third adjoint equation, a conditional McKean-Vlasov backward SDE, to accommodate the dualization of quadratic terms containing two independent copies of the first-order variational process. This is an intrinsic extension of the maximum principle from Peng for standard SDE and gives a conceptually consistent proof. Our approach will be useful in further extensions to the common noise setting and the infinite dimensional setting."}
{"id": "2602.11493", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11493", "abs": "https://arxiv.org/abs/2602.11493", "authors": ["Daochang Zhang", "Yue Zhao", "Jingqian Li", "Dijana Mosic"], "title": "On the Block-Diagonalization and Multiplicative Equivalence of Quaternion $Z$-Block Circulant Matrices with their Applications", "comment": null, "summary": "The motivation of this paper is twofold. First, we investigate the block-diagonalization of the $z$-block circulant matrix $\\mathtt{bcirc_z}(\\mathcal A)$, based on this block-diagonal structure, and develop the algorithm $\\mathtt{bcirc_z}$-inv for computing the inverse of $\\mathtt{bcirc_z}(\\mathcal A)$. Second, we establish the equivalence between the QT-product of tensors and the product of the corresponding $z$-block circulant matrices. Based on this equivalence and in combination with the algorithm $\\mathtt{bcirc_z}$-inv, large-scale tests and scalability analysis of the Tikhonov-regularized model are conducted.\n  As a by-product of the analysis, some relevant and straightforward properties of the quaternion $z$-block circulant matrices are provided. As applications, a series of quaternion tensor decompositions under the QT-product and their corresponding $z$-block circulant matrices decompositions are obtained, including the QT-Polar decomposition, the QT-PLU decomposition, and the QT-LU decomposition. Meanwhile, the QT-SVD is rederived based on the relation between $\\mathcal A$ and $\\mathtt{bcirc_z}(\\mathcal A)$. Furthermore, we develop corresponding algorithms and present several large-scale tests and scalability analysis. In addition, applications in video rotation are presented to evaluate several rotation strategies based on the QT-Polar decomposition, which shows the decomposition remains stable and inter-frame consistent while accurately maintaining color reproduction."}
{"id": "2602.12190", "categories": ["math.PR"], "pdf": "https://arxiv.org/pdf/2602.12190", "abs": "https://arxiv.org/abs/2602.12190", "authors": ["Matthias Löwe"], "title": "High-Temperature Increasing Propagation of Chaos and its breakdown for the Hopfield Model", "comment": null, "summary": "We analyze increasing propagation of chaos in the high temperature regime of a disordered mean-field model, the Hopfield model. We show that for $β<1$ (the true high temperature region) we have increasing propagation of chaos as long as the size of the marginals $k=k(N)$ and the number of patterns\n  $M=M(N)$ satisfies $Mk/N \\to 0$. For $M=o(\\sqrt N)$ we show that propagation of chaos breaks down for $k/N \\to c>0$. At the ciritcal temperature we show that, for $M$ finite, there\n  is increasing propagation of chaos, for $k=o(\\sqrt N)$, while we have breakdown of\n  propagation of chaos for $k=c \\sqrt N$, for a $c>0$. All these reulst hold in probability in the disorder."}
{"id": "2602.11640", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11640", "abs": "https://arxiv.org/abs/2602.11640", "authors": ["Haruka Nakamura", "Norikazu Saito"], "title": "On the convergence rates of generalized conditional gradient method for fully discretized Mean Field Games", "comment": "29 pages, 9 figures", "summary": "We study convergence rates of the generalized conditional gradient (GCG) method applied to fully discretized Mean Field Games (MFG) systems. While explicit convergence rates of the GCG method have been established at the continuous PDE level, a rigorous analysis that simultaneously accounts for time-space discretization and iteration errors has been missing. In this work, we discretize the MFG system using finite difference method and analyze the resulting fully discrete GCG scheme. Under suitable structural assumptions on the Hamiltonian and coupling terms, we establish discrete maximum principles and derive explicit error estimates that quantify both discretization errors and iteration errors within a unified framework. Our estimates show how the convergence rates depend on the mesh sizes and the iteration number, and they reveal a non-uniform behavior with respect to the iteration. Moreover, we prove that higher convergence rates can be achieved under additional regularity assumptions on the solution. Numerical experiments are presented to illustrate the theoretical results and to confirm the predicted convergence behavior."}
{"id": "2602.11515", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11515", "abs": "https://arxiv.org/abs/2602.11515", "authors": ["Shanqing Liu", "Paula Chen", "Youngkyu Lee", "Jerome Darbon"], "title": "Algorithms and Differential Game Representations for Exploring Nonconvex Pareto Fronts in High Dimensions", "comment": "25 pages, 5 figures", "summary": "We develop a new Hamiton-Jacobi (HJ) and differential game approach for exploring the Pareto front of (constrained) multi-objective optimization (MOO) problems. Given a preference function, we embed the scalarized MOO problem into the value function of a parameterized zero-sum game, whose upper value solves a first-order HJ equation that admits a Hopf-Lax representation formula. For each parameter value, this representation yields an inner minimizer that can be interpreted as an approximate solution to a shifted scalarization of the original MOO problem. Under mild assumptions, the resulting family of solutions maps to a dense subset of the weak Pareto front. Finally, we propose a primal-dual algorithm based on this approach for solving the corresponding optimality system. Numerical experiments show that our algorithm mitigates the curse of dimensionality (scaling polynomially with the dimension of the decision and objective spaces) and is able to expose continuous curves along nonconvex Pareto fronts in 100D in just $\\sim$100 seconds."}
{"id": "2602.12257", "categories": ["math.PR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2602.12257", "abs": "https://arxiv.org/abs/2602.12257", "authors": ["Govind Menon", "Austin J. Stromme", "Adrien Vacher"], "title": "On the implicit regularization of Langevin dynamics with projected noise", "comment": "30 pages, 1 figure", "summary": "We study Langevin dynamics with noise projected onto the directions orthogonal to an isometric group action. This mathematical model is introduced to shed new light on the effects of symmetry on stochastic gradient descent for over-parametrized models. Our main result identifies a novel form of implicit regularization: when the initial and target density are both invariant under the group action, Langevin dynamics with projected noise is equivalent in law to Langevin dynamics with isotropic diffusion but with an additional drift term proportional to the negative log volume of the group orbit. We prove this result by constructing a coupling of the two processes via a third process on the group itself, and identify the additional drift as the mean curvature of the orbits."}
{"id": "2602.11843", "categories": ["math.NA", "cs.MS"], "pdf": "https://arxiv.org/pdf/2602.11843", "abs": "https://arxiv.org/abs/2602.11843", "authors": ["Piyush Sao"], "title": "Fast Evaluation of Truncated Neumann Series by Low-Product Radix Kernels", "comment": null, "summary": "Truncated Neumann series $S_k(A)=I+A+\\cdots+A^{k-1}$ are used in\n  approximate matrix inversion and polynomial preconditioning. In dense\n  settings, matrix-matrix products dominate the cost of evaluating $S_k$.\n  Naive evaluation needs $k-1$ products, while splitting methods reduce this\n  to $O(\\log k)$. Repeated squaring, for example, uses $2\\log_2 k$\n  products, so further gains require higher-radix kernels that extend the\n  series by $m$ terms per update. Beyond the known radix-5 kernel, explicit\n  higher-radix constructions were not available, and the existence of exact\n  rational kernels was unclear.\n  We construct radix kernels for $T_m(B)=I+B+\\cdots+B^{m-1}$ and use them to\n  build faster series algorithms. For radix 9, we derive an exact 3-product\n  kernel with rational coefficients, which is the first exact construction\n  beyond radix 5. This kernel yields $5\\log_9 k=1.58\\log_2 k$ products, a\n  21% reduction from repeated squaring. For radix 15, numerical optimization\n  yields a 4-product kernel that matches the target through degree 14 but\n  has nonzero spillover (extra terms) at degrees $\\ge 15$. Because spillover\n  breaks the standard telescoping update, we introduce a residual-based\n  radix-kernel framework that accommodates approximate kernels and retains\n  coefficient $(μ_m+2)/\\log_2 m$. Within this framework, radix 15 attains\n  $6/\\log_2 15\\approx 1.54$, the best known asymptotic rate. Numerical\n  experiments support the predicted product-count savings and associated\n  runtime trends."}
{"id": "2602.11561", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11561", "abs": "https://arxiv.org/abs/2602.11561", "authors": ["Xiaowei Wang", "Yize Chen", "Yue Chen"], "title": "Online Electric Vehicle Charging Control with Battery Thermal Management in Cold Environments", "comment": "11 pages, 7 figures", "summary": "Electric vehicles (EVs) are expanding rapidly, driven by the proposal to comply with global emission reduction targets. However, EV adoption in cold regions is hindered by degraded battery performance at low temperatures, which necessitates effective battery thermal management. Hence, this work proposes a novel online EV charging control strategy, incorporating battery thermal management for cold environments. We first build queue models for both battery charging and thermal dynamics. Then, we formulate an optimization problem, which allows us to coordinate battery charging and heating through maintaining queue stability. To solve the problem, we develop an online control algorithm within the theoretical framework of Lyapunov optimization. Note that our online method is prediction-free and independent of any assumed modeling of uncertainty. We also characterize both the feasibility and optimality of the proposed control approach. Numerical results based on real-world data corroborate our theoretical findings and demonstrate the effectiveness and robustness of our control method through comparisons."}
{"id": "2602.12261", "categories": ["math.PR", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.12261", "abs": "https://arxiv.org/abs/2602.12261", "authors": ["Frederik Ravn Klausen", "Noah Kravitz"], "title": "Half-plane non-coexistence without FKG", "comment": "17 pages, 5 figures", "summary": "For $μ$ an edge percolation measure on the infinite square lattice, let $μ_{\\textit{hp}}$ (respectively, $μ^*_{hp}$) denote its marginal (respectively, the marginal of its planar dual process) on the upper half-plane. We show that if $μ$ is translation-invariant and ergodic and almost surely has only finitely many infinite clusters, then either almost surely $μ_{hp}$ has no infinite cluster, or almost surely $μ^*_{hp}$ has no infinite cluster. By the classical Burton--Keane argument, these hypotheses are satisfied if $μ$ is translation-invariant and ergodic and has finite-energy. In contrast to previous ``non-coexistence'' theorems, our result does not impose a positive-correlation (FKG) hypothesis on $μ$. Our arguments also apply to the random-cluster model (including the regime $q<1$, which lacks FKG), the uniform spanning tree, and the uniform odd subgraph."}
{"id": "2602.11849", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11849", "abs": "https://arxiv.org/abs/2602.11849", "authors": ["Abraham Reyes-Velazquez", "Stefan Güttel", "Igor Larrosa", "Jonas Latz"], "title": "Data-driven discovery of chemical reaction networks", "comment": null, "summary": "We propose a unified framework that allows for the full mechanistic reconstruction of chemical reaction networks (CRNs) from concentration data. The framework utilizes an integral formulation of the differential equations governing the chemical reactions, followed by an automatic procedure to recover admissible mass-action mechanisms from the equations. We provide theoretical justification for the use of integral formulations using analytical and numerical error bounds. The integral formulation is demonstrated to offer superior robustness to noise and improved accuracy in both rate-law and graph recovery when compared to other commonly used formulations. Together, our developments advance the goal of fully automated, data-driven chemical mechanism discovery."}
{"id": "2602.11566", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11566", "abs": "https://arxiv.org/abs/2602.11566", "authors": ["Shravan Mohan"], "title": "On a group of invariances in a class of functions", "comment": null, "summary": "A class of parametric functions formed by alternating compositions of multivariate polynomials and rectification style monomial maps is studied (the layer-wise exponents are treated as fixed hyperparameters and are not optimized). For this family, nontrivial parametric invariances are identified and characterized, i.e., distinct parameter settings that induce identical input-output maps. A constructive description of the invariance structure is provided, enabling sparse function representations, parameter obfuscation, and potential dimensionality reduction for optimization."}
{"id": "2602.12027", "categories": ["math.ST", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.12027", "abs": "https://arxiv.org/abs/2602.12027", "authors": ["Pierre Monmarché"], "title": "General-purpose post-sampling reweighting method for multimodal target measures", "comment": null, "summary": "When sampling multi-modal probability distributions, correctly estimating the relative probability of each mode, even when the modes have been discovered and locally sampled, remains challenging. We test a simple reweighting scheme designed for this situation, which consists in minimizing (in terms of weights) the Kullback-Leibler divergence of a weighted (regularized) empirical distribution of the samples with respect to the target measure."}
{"id": "2602.11870", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11870", "abs": "https://arxiv.org/abs/2602.11870", "authors": ["Silvia Bertoluzza", "Fabio Credali", "Francesca Gardini"], "title": "Avoiding stabilization terms in virtual elements for eigenvalue problems: The Reduced Basis Virtual Element Method", "comment": "28 pages, 10 figures, 1 table, 1 algorithm", "summary": "We present the novel Reduced Basis Virtual Element Method (rbVEM) for solving the Laplace eigenvalue problem. This approach is based on the virtual element method and exploits the reduced basis technique to obtain an explicit representation of the virtual (non-polynomial) contribution to the discrete space. rbVEM yields a fully conforming discretization of the considered problem, so that stabilization terms are avoided. We prove that rbVEM provides the correct spectral approximation with optimal error estimates. Theoretical results are supplemented by an exhaustive numerical investigation."}
{"id": "2602.11594", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11594", "abs": "https://arxiv.org/abs/2602.11594", "authors": ["Welington de Oliveira", "Johannes O. Royset"], "title": "Composite Optimization using Local Models and Global Approximations", "comment": null, "summary": "This work presents a unified framework that combines global approximations with locally built models to handle challenging nonconvex and nonsmooth composite optimization problems, including cases involving extended real-valued functions. We show that near-stationary points of the approximating problems converge to stationary points of the original problem under suitable conditions. Building on this, we develop practical algorithms that use tractable convex master programs derived from local models of the approximating problems. The resulting double-loop structure improves global approximations while adapting local models, providing a flexible and implementable approach for a wide class of composite optimization problems. It also lays the groundwork for new algorithmic developments in this domain."}
{"id": "2602.11972", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11972", "abs": "https://arxiv.org/abs/2602.11972", "authors": ["Erik Weyl", "Andreas Bartel", "Manuel Schaller"], "title": "Splitting Schemes for ODEs with Goal-Oriented Error Estimation", "comment": "23 pages, 5 figures", "summary": "We present a hybrid a-priori/a-posteriori goal oriented error estimator for a combination of dynamic iteration-based solution of ordinary differential equations discretized by finite elements. Our novel error estimator combines estimates from classical dynamic iteration methods, usually used to enable splitting-based distributed simulation, and from the dual weighted residual method to be able to evaluate and balance both, the dynamic iteration error and the discretization error in desired quantities of interest. The obtained error estimators are used to conduct refinements of the computational mesh and as a stopping criterion for the dynamic iteration. In particular, we allow for an adaptive and flexible discretization of the time domain, where variables can be discretized differently to match both goal and solution requirements, e.g. in view of multiple time scales. We endow the scheme with efficient solvers from numerical linear algebra to ensure its applicability to complex problems. Numerical experiments compare the adaptive approach to a uniform refinement."}
{"id": "2602.11677", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.11677", "abs": "https://arxiv.org/abs/2602.11677", "authors": ["Massimo Fornasier", "Hui Huang", "Jona Klemenc", "Greta Malaspina"], "title": "From Consensus-Based Optimization to Evolution Strategies: Proof of Global Convergence", "comment": null, "summary": "Consensus-based optimization (CBO) is a powerful and versatile zero-order multi-particle method designed to provably solve high-dimensional global optimization problems, including those that are genuinely nonconvex or nonsmooth. The method relies on a balance between stochastic exploration and contraction toward a consensus point, which is defined via the Laplace principle as a proxy for the global minimizer.\n  In this paper, we introduce new CBO variants that address practical and theoretical limitations of the original formulation of this novel optimization methodology. First, we propose a model called $δ$-CBO}, which incorporates nonvanishing diffusion to prevent premature collapse to suboptimal states. We also develop a numerically stable implementation, the Consensus Freezing scheme, that remains robust even for arbitrarily large time steps by freezing the consensus point over time intervals. We connect these models through appropriate asymptotic limits. Furthermore, we derive from the Consensus Freezing scheme by suitable time rescaling and asymptotics a further algorithm, the Consensus Hopping scheme, which can be interpreted as a form of $(1,λ)$-Evolution Strategy. For all these schemes, we characterize for the first time the invariant measures and establish global convergence results, including exponential convergence rates."}
{"id": "2602.11976", "categories": ["math.NA"], "pdf": "https://arxiv.org/pdf/2602.11976", "abs": "https://arxiv.org/abs/2602.11976", "authors": ["Francisco Arrieta Zuccalli", "Pedro Massey"], "title": "Lambda admissible subspaces of self adjoint matrices", "comment": "32 pages, 5 figures", "summary": "Given a self-adjoint matrix $A$ and an index $h$ such that $λ_h(A)$ lies in a cluster of eigenvalues of $A$, we introduce the novel class of $Λ$-admissible subspaces of $A$ of dimension $h$. First, we show that the low-rank approximation of the form $P_{\\mathcal{T}} A P_{\\mathcal{T}}$, for a subspace $\\mathcal{T}$ that is close to any $Λ$-admissible subspace of $A$, has nice properties. Then, we prove that some well-known iterative algorithms (such as the Subspace Iteration Method, or the Krylov subspace method) produce subspaces that become arbitrarily close to $Λ$-admissible subspaces. We obtain upper bounds for the distance between subspaces obtained by the Rayleigh-Ritz method applied to $A$ and the class of $Λ$-admissible subspaces. We also find upper bounds for the condition number of the (set-valued) map computing the class of $Λ$-admissible subspaces of $A$. Finally, we include numerical examples that show the advantage of considering this new class of subspaces in the clustered eigenvalue setting."}
{"id": "2602.11770", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11770", "abs": "https://arxiv.org/abs/2602.11770", "authors": ["S. Bellavia", "S. Gratton", "B. Morini", "Ph. L. Toint"], "title": "An objective-function-free algorithm for general smooth constrained optimization", "comment": "2 figures", "summary": "A new algorithm for smooth constrained optimization is proposed that never computes the value of the problem's objective function and that handles both equality and inequality constraints. The algorithm uses an adaptive switching strategy between a normal step aiming at reducing constraint's infeasibility and a tangential step improving dual optimality, the latter being inspired by the AdaGrad-norm method. Its worst-case iteration complexity is analyzed, showing that the norm of the gradients generated converges to zero like O(1/\\sqrt{k+1}) for problems with full-rank Jacobians. Numerical experiments show that the algorithm's performance is remarkably insensitive to noise in the objective function's gradient."}
{"id": "2602.12008", "categories": ["math.NA", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.12008", "abs": "https://arxiv.org/abs/2602.12008", "authors": ["Dragoş Manea"], "title": "Mesh-free numerical method for Dirichlet eigenpairs of the Laplacian with potential", "comment": null, "summary": "This paper is concerned with the numerical approximation of the $L^2$ Dirichlet eigenpairs of the operator $-Δ+ V$ on a simply connected $C^2$ bounded domain $Ω\\subset \\mathbb{R}^2$ containing the origin, where $V$ is a radial potential.\n  We propose a mesh-free method inspired by the Method of Particular Solutions for the Laplacian (i.e. $V=0$). Extending this approach to general $C^1$ radial potentials is challenging due to the lack of explicit basis functions analogous to Bessel functions. To overcome this difficulty, we consider the equation $-Δu + V u = λu$ on a ball containing $Ω$, without imposing boundary conditions, for a collection of values $λ$ forming a fine discretisation of the interval in which eigenvalues are sought. By rewriting the problem in polar coordinates and applying a Fourier expansion with respect to the angular variable, we obtain a decoupled system of ordinary differential equations. These equations are solved numerically using a one-dimensional Finite Element Method, yielding a family of basis functions that are solutions of the equation $-Δu + V u = λu$ on the ball and are independent of the domain $Ω$.\n  Dirichlet eigenvalues of $-Δ+ V$ are then approximated by minimising the boundary values on $\\partial Ω$ among linear combinations of the basis functions and identifying those values of $λ$ for which the computed minimum is sufficiently small. The proposed method is highly memory-efficient compared to the standard Finite Element approach."}
{"id": "2602.11789", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.11789", "abs": "https://arxiv.org/abs/2602.11789", "authors": ["Hongxu Chen", "Ke Wei", "Luo Luo"], "title": "Decentralized Non-convex Stochastic Optimization with Heterogeneous Variance", "comment": null, "summary": "Decentralized optimization is critical for solving large-scale machine learning problems over distributed networks, where multiple nodes collaborate through local communication. In practice, the variances of stochastic gradient estimators often differ across nodes, yet their impact on algorithm design and complexity remains unclear. To address this issue, we propose D-NSS, a decentralized algorithm with node-specific sampling, and establish its sample complexity depending on the arithmetic mean of local standard deviations, achieving tighter bounds than existing methods that rely on the worst-case or quadratic mean. We further derive a matching sample complexity lower bound under heterogeneous variance, thereby proving the optimality of this dependence. Moreover, we extend the framework with a variance reduction technique and develop D-NSS-VR, which under the mean-squared smoothness assumption attains an improved sample complexity bound while preserving the arithmetic-mean dependence. Finally, numerical experiments validate the theoretical results and demonstrate the effectiveness of the proposed algorithms."}
{"id": "2602.12121", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.12121", "abs": "https://arxiv.org/abs/2602.12121", "authors": ["Taehyeong Kim", "Hayoung Choi", "Yimin Wei"], "title": "Low T-Phase Rank Approximation of Third Order Tensors", "comment": "27 pages, 1 figure", "summary": "We study low T-phase-rank approximation of sectorial third-order tensors $\\mathscr{A}\\in\\mathbb{C}^{n\\times n\\times p}$ under the tensor T-product. We introduce canonical T-phases and T-phase rank, and formulate the approximation task as minimizing a symmetric gauge of the canonical phase vector under a T-phase-rank constraint. Our main tool is a tensor phase-majorization inequality for the geometric mean, obtained by lifting the matrix inequality through the block-circulant representation. In the positive-imaginary regime, this yields an exact optimal-value formula and an explicit optimal half-phase truncation family. We further establish tensor counterparts of classical matrix phase inequalities and derive a tensor small phase theorem for MIMO linear time-invariant systems."}
{"id": "2602.11817", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11817", "abs": "https://arxiv.org/abs/2602.11817", "authors": ["Nam Van Tran"], "title": "Third-Order Dynamical Systems for Generalized Inverse Mixed Variational Inequality Problems", "comment": null, "summary": "In this paper, we propose and analyze a third-order dynamical system for solving a generalized inverse mixed variational inequality problem in a Hilbert space H. We establish the existence and uniqueness of the trajectories generated by the system under suitable continuity assumptions, and prove their exponential convergence to the unique solution under strong monotonicity and Lipschitz continuity conditions. Furthermore, we derive an explicit discretization of the proposed dynamical system, leading to a forward -backward algorithm with double inertial effects. We then establish the linear convergence of the generated iterates to the unique solution."}
{"id": "2602.11484", "categories": ["math.PR", "math.AP", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.11484", "abs": "https://arxiv.org/abs/2602.11484", "authors": ["Jianbo Cui", "Tonghe Dang", "Jialin Hong", "Zhengkai Wang"], "title": "Quantifying the effect of graph structure on strong Feller property of SPDEs", "comment": "34 pages", "summary": "This paper investigates how the structure of the underlying graph influences the behavior of stochastic partial differential equations (SPDEs) on finite tree graphs, where each edge is driven by space-time white noise. We first introduce a novel graph-based null decomposition approach to analyzing the strong Feller property of the Markov semigroup generated by SPDEs on tree graphs. By examining the positions of zero entries in eigenfunctions of the graph Laplacian operator, we establish a sharp upper bound on the number of noise-free edges that ensures both the strong Feller property and irreducibility. Interestingly, we find that the addition of noise to any single edge is sufficient for chain graphs, whereas for star graphs, at most one edge can remain noise-free without compromising the system's properties. Furthermore, under a dissipative condition, we prove the existence and exponential ergodicity of a unique invariant measure."}
{"id": "2602.11821", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11821", "abs": "https://arxiv.org/abs/2602.11821", "authors": ["Valentyn Khokhlov"], "title": "Multi-period Newsvendor Model", "comment": "25 pages", "summary": "The newsvendor model is a well-known stochastic model for inventory management; however, it was originally developed for a single-period context and focuses on trading companies. This paper proposes an extension of the newsvendor model into a mutli-period setting, aiming to develop a decision-making tool for manufacturing firms to determine the optimal production batch size. The objective function is to maximize operating profit in accordance with generally accepted accounting principles. The model can also incorporate overhead costs, such as warehousing, shrinkage, cost of capital, and lead time between the production decision and output. Monte Carlo simulations demonstrate that the proposed model results in higher profitability compared to other newsvendor models used in our analysis, as well as the safety stock buffer approach. The key feature explaining its outperformance is better adaptability of the production batch size, that leads to fewer stock-outs relative to other newsvendor models and lower inventory levels compared to the safety stock buffer approach. The robustness analysis shows that the proposed model is quite tolerant of mismatches between the \"model\" and the \"true\" demand distributions. Finally, we provide some recommendations on selecting the appropriate \"model\" distribution for different SKUs."}
{"id": "2602.11677", "categories": ["math.OC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.11677", "abs": "https://arxiv.org/abs/2602.11677", "authors": ["Massimo Fornasier", "Hui Huang", "Jona Klemenc", "Greta Malaspina"], "title": "From Consensus-Based Optimization to Evolution Strategies: Proof of Global Convergence", "comment": null, "summary": "Consensus-based optimization (CBO) is a powerful and versatile zero-order multi-particle method designed to provably solve high-dimensional global optimization problems, including those that are genuinely nonconvex or nonsmooth. The method relies on a balance between stochastic exploration and contraction toward a consensus point, which is defined via the Laplace principle as a proxy for the global minimizer.\n  In this paper, we introduce new CBO variants that address practical and theoretical limitations of the original formulation of this novel optimization methodology. First, we propose a model called $δ$-CBO}, which incorporates nonvanishing diffusion to prevent premature collapse to suboptimal states. We also develop a numerically stable implementation, the Consensus Freezing scheme, that remains robust even for arbitrarily large time steps by freezing the consensus point over time intervals. We connect these models through appropriate asymptotic limits. Furthermore, we derive from the Consensus Freezing scheme by suitable time rescaling and asymptotics a further algorithm, the Consensus Hopping scheme, which can be interpreted as a form of $(1,λ)$-Evolution Strategy. For all these schemes, we characterize for the first time the invariant measures and establish global convergence results, including exponential convergence rates."}
{"id": "2602.11872", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11872", "abs": "https://arxiv.org/abs/2602.11872", "authors": ["Kathrin Prinz", "Levin Nemesch", "Stefan Ruzika"], "title": "A High-Performance Parallel Algorithm for Multi-Objective Integer Optimization", "comment": null, "summary": "Multi-objective integer optimization problems are hard to solve, mainly because the number of nondominated images is often extremely large. We present the first exact algorithm, called PEA, that fully utilizes the multicore architecture of modern hardware. By exploiting the structure of the parameter set of the underlying scalarization, PEA can use a high number of threads while avoiding the usual pitfalls of parallel computing. It is highly scalable and easy to implement. As a result, PEA can solve much larger instances than previous state-of-the-art algorithms. Besides, PEA has a sound theoretical foundation. Unlike other existing parallel algorithms, it always solves the same number of scalarization problems as comparable sequential algorithms. We demonstrate the potential of PEA in a computational study."}
{"id": "2602.12273", "categories": ["math.OC", "cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.12273", "abs": "https://arxiv.org/abs/2602.12273", "authors": ["Yongcun Song", "Xiaoming Yuan", "Hangrui Yue", "Tianyou Zeng"], "title": "Learning to Control: The iUzawa-Net for Nonsmooth Optimal Control of Linear PDEs", "comment": null, "summary": "We propose an optimization-informed deep neural network approach, named iUzawa-Net, aiming for the first solver that enables real-time solutions for a class of nonsmooth optimal control problems of linear partial differential equations (PDEs). The iUzawa-Net unrolls an inexact Uzawa method for saddle point problems, replacing classical preconditioners and PDE solvers with specifically designed learnable neural networks. We prove universal approximation properties and establish the asymptotic $\\varepsilon$-optimality for the iUzawa-Net, and validate its promising numerical efficiency through nonsmooth elliptic and parabolic optimal control problems. Our techniques offer a versatile framework for designing and analyzing various optimization-informed deep learning approaches to optimal control and other PDE-constrained optimization problems. The proposed learning-to-control approach synergizes model-based optimization algorithms and data-driven deep learning techniques, inheriting the merits of both methodologies."}
{"id": "2602.11921", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.11921", "abs": "https://arxiv.org/abs/2602.11921", "authors": ["Kazuhiro Sato"], "title": "Relationship Between Controllability Scoring and Optimal Experimental Design", "comment": null, "summary": "Controllability scores provide control-theoretic centrality measures that quantify the relative importance of state nodes in networked dynamical systems. We establish a structural connection between finite-time controllability scoring and approximate optimal experimental design (OED): the finite-time controllability Gramian decomposes additively across nodes, yielding an affine matrix model of the same form as the information-matrix model in OED. This yields a direct correspondence between the volumetric controllability score (VCS) and D-optimality, and between the average energy controllability score (AECS) and A-optimality, implying that the classical D/A invariance gap has a direct analogue in controllability scoring. By contrast, we point out that controllability scoring typically admits a unique optimizer, unlike approximate-OED formulations. Finally, we uncover a long-horizon phenomenon with no OED counterpart: source-like state nodes without a negative self-loop can be increasingly downweighted by AECS as the horizon grows. Two numerical examples corroborate this long-horizon downweighting behavior."}
{"id": "2602.11947", "categories": ["math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2602.11947", "abs": "https://arxiv.org/abs/2602.11947", "authors": ["Apoorva Narula", "Santanu S. Dey", "Yao Xie"], "title": "Mixed-Integer Programming for Change-point Detection", "comment": null, "summary": "We present a new mixed-integer programming (MIP) approach for offline multiple change-point detection by casting the problem as a globally optimal piecewise linear (PWL) fitting problem. Our main contribution is a family of strengthened MIP formulations whose linear programming (LP) relaxations admit integral projections onto the segment assignment variables, which encode the segment membership of each data point. This property yields provably tighter relaxations than existing formulations for offline multiple change-point detection. We further extend the framework to two settings of active research interest: (i) multidimensional PWL models with shared change-points, and (ii) sparse change-point detection, where only a subset of dimensions undergo structural change. Extensive computational experiments on benchmark real-world datasets demonstrate that the proposed formulations achieve reductions in solution times under both $\\ell_1$ and $\\ell_2$ loss functions in comparison to the state-of-the-art."}
{"id": "2602.11948", "categories": ["math.OC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.11948", "abs": "https://arxiv.org/abs/2602.11948", "authors": ["Antoine Gonon", "Andreea-Alexandra Muşat", "Nicolas Boumal"], "title": "Insights on Muon from Simple Quadratics", "comment": null, "summary": "Muon updates weight matrices along (approximate) polar factors of the gradients and has shown strong empirical performance in large-scale training. Existing attempts at explaining its performance largely focus on single-step comparisons (on quadratic proxies) and worst-case guarantees that treat the inexactness of the polar-factor as a nuisance ``to be argued away''. We show that already on simple strongly convex functions such as $L(W)=\\frac12\\|W\\|_{\\text{F}}^2$, these perspectives are insufficient, suggesting that understanding Muon requires going beyond local proxies and pessimistic worst-case bounds. Instead, our analysis exposes two observations that already affect behavior on simple quadratics and are not well captured by prevailing abstractions: (i) approximation error in the polar step can qualitatively alter discrete-time dynamics and improve reachability and finite-time performance -- an effect practitioners exploit to tune Muon, but that existing theory largely treats as a pure accuracy compromise; and (ii) structural properties of the objective affect finite-budget constants beyond the prevailing conditioning-based explanations. Thus, any general theory covering these cases must either incorporate these ingredients explicitly or explain why they are irrelevant in the regimes of interest."}
{"id": "2602.11999", "categories": ["math.OC", "math.AP"], "pdf": "https://arxiv.org/pdf/2602.11999", "abs": "https://arxiv.org/abs/2602.11999", "authors": ["Guillaume Wang", "Lénaïc Chizat"], "title": "Local convergence of mean-field Langevin dynamics: from gradient flows to linearly monotone games", "comment": "40 pages", "summary": "We study the local convergence of diffusive mean-field systems, including Wasserstein gradient flows, min-max dynamics, and multi-species games. We establish exponential local convergence in $χ^2$-divergence with sharp rates, under two main assumptions: (i) the stationary measures satisfy a Poincaré inequality, and (ii) the velocity field satisfies a monotonicity condition, which reduces to linear convexity of the objective in the gradient flow case. We do not assume any form of displacement convexity or displacement monotonicity.\n  In the gradient flow case, global exponential convergence is already known under our linear convexity assumption, with an asymptotic rate governed by the log-Sobolev constant of the stationary measure. Our contribution in this setting is to identify the sharp rate near equilibrium governed instead by the Poincaré constant. This rate coincides with the one suggested by Otto calculus (i.e. by a tight positivity estimate of the Wasserstein Hessian), and refines some results of Tamura (1984), extending them beyond quadratic objectives.\n  More importantly, our proof technique extends to certain non-gradient systems, such as linearly monotone two-player and multi-player games. In this case, we obtain explicit local exponential convergence rates in $χ^2$-divergence, thereby partially answering the open question raised by the authors at COLT 2024. While that question concerns global convergence (which remains open), even local convergence results were previously unavailable.\n  At the heart of our analysis is the design of a Lyapunov functional that mixes the $χ^2$-divergence with weighted negative Sobolev norms of the density relative to equilibrium."}
{"id": "2602.12214", "categories": ["math.OC"], "pdf": "https://arxiv.org/pdf/2602.12214", "abs": "https://arxiv.org/abs/2602.12214", "authors": ["Fabio Ciccarelli", "Alexander Helber", "Erik Mühmer"], "title": "The colored knapsack problem: structural properties and exact algorithms", "comment": null, "summary": "We introduce and study a novel generalization of the classical Knapsack Problem (KP), called the Colored Knapsack Problem (CKP). In this problem, the items are partitioned into classes of colors and the packed items need to be ordered such that no consecutive items are of the same color. We establish that the problem is weakly NP-hard and propose two exact dynamic programming algorithms with time complexities of $\\mathcal{O}(bn^4)$ and $\\mathcal{O}(b^2n^3)$, respectively. To enhance practical performance, we derive various dominance and fathoming rules for both approaches. From a theoretical perspective, we analyze the linear programming relaxation of the natural CKP formulation, proving that an optimal solution exists with at most two fractional items. We also show that the relaxation can be solved in $\\mathcal{O}(n)$ time, matching the complexity of the classical KP. Finally, we establish a comprehensive benchmark of CKP instances, derived from the Colored Bin Packing Problem. Extensive computational experiments demonstrate that the proposed dynamic programming algorithms significantly outperform state-of-the-art MIP solvers on most of these instances."}
{"id": "2602.12273", "categories": ["math.OC", "cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.12273", "abs": "https://arxiv.org/abs/2602.12273", "authors": ["Yongcun Song", "Xiaoming Yuan", "Hangrui Yue", "Tianyou Zeng"], "title": "Learning to Control: The iUzawa-Net for Nonsmooth Optimal Control of Linear PDEs", "comment": null, "summary": "We propose an optimization-informed deep neural network approach, named iUzawa-Net, aiming for the first solver that enables real-time solutions for a class of nonsmooth optimal control problems of linear partial differential equations (PDEs). The iUzawa-Net unrolls an inexact Uzawa method for saddle point problems, replacing classical preconditioners and PDE solvers with specifically designed learnable neural networks. We prove universal approximation properties and establish the asymptotic $\\varepsilon$-optimality for the iUzawa-Net, and validate its promising numerical efficiency through nonsmooth elliptic and parabolic optimal control problems. Our techniques offer a versatile framework for designing and analyzing various optimization-informed deep learning approaches to optimal control and other PDE-constrained optimization problems. The proposed learning-to-control approach synergizes model-based optimization algorithms and data-driven deep learning techniques, inheriting the merits of both methodologies."}
{"id": "2602.11290", "categories": ["math.ST", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.11290", "abs": "https://arxiv.org/abs/2602.11290", "authors": ["Kengo Kato", "Boyu Wang"], "title": "Entropic vector quantile regression: Duality and Gaussian case", "comment": "26 pages", "summary": "Vector quantile regression (VQR) is an optimal transport (OT) problem subject to a mean-independence constraint that extends classical linear quantile regression to vector response variables. Motivated by computational considerations, prior work has considered entropic relaxation of VQR, but its fundamental structural and approximation properties are still much less understood than entropic OT. The goal of this paper is to address some of these gaps. First, we study duality theory for entropic VQR and establish strong duality and dual attainment for marginals with possibly unbounded supports. In addition, when all marginals are compactly supported, we show that dual potentials are real analytic. Second, building on our duality theory, when all marginals are Gaussian, we show that entropic VQR has a closed-form optimal solution, which is again Gaussian, and establish the precise approximation rate toward unregularized VQR."}
{"id": "2602.11926", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.11926", "abs": "https://arxiv.org/abs/2602.11926", "authors": ["Silpi Saha", "Sangita Jha", "Mrinal Kanti Roychowdhury"], "title": "Optimal Quantization for Nonuniform Densities on Spherical Curves", "comment": null, "summary": "We present an analysis of optimal quantization of probability measures with nonuniform densities on spherical curves. We begin by deriving the centroid condition, followed by a high-resolution asymptotic analysis to establish the point-density formula. We further quantify the asymptotic error formula for the nonuniform densities. We apply these theorems to the von Mises distributions and characterize the optimal condition. We also provide applications using the high-resolution asymptotic and its corresponding error formula. Our results can be used in geometric probability theory and quantization theory of spherical curves."}
{"id": "2602.12006", "categories": ["math.PR", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.12006", "abs": "https://arxiv.org/abs/2602.12006", "authors": ["Johan Benedikt Spille", "Wilhelm Stannat"], "title": "A Novel Approach to Peng's Maximum Principle for McKean-Vlasov Stochastic Differential Equations", "comment": null, "summary": "We present a novel approach to the proof of Peng's maximum principle for McKean-Vlasov stochastic differential equations (SDE). The main step is the introduction of a third adjoint equation, a conditional McKean-Vlasov backward SDE, to accommodate the dualization of quadratic terms containing two independent copies of the first-order variational process. This is an intrinsic extension of the maximum principle from Peng for standard SDE and gives a conceptually consistent proof. Our approach will be useful in further extensions to the common noise setting and the infinite dimensional setting."}
{"id": "2602.12121", "categories": ["math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2602.12121", "abs": "https://arxiv.org/abs/2602.12121", "authors": ["Taehyeong Kim", "Hayoung Choi", "Yimin Wei"], "title": "Low T-Phase Rank Approximation of Third Order Tensors", "comment": "27 pages, 1 figure", "summary": "We study low T-phase-rank approximation of sectorial third-order tensors $\\mathscr{A}\\in\\mathbb{C}^{n\\times n\\times p}$ under the tensor T-product. We introduce canonical T-phases and T-phase rank, and formulate the approximation task as minimizing a symmetric gauge of the canonical phase vector under a T-phase-rank constraint. Our main tool is a tensor phase-majorization inequality for the geometric mean, obtained by lifting the matrix inequality through the block-circulant representation. In the positive-imaginary regime, this yields an exact optimal-value formula and an explicit optimal half-phase truncation family. We further establish tensor counterparts of classical matrix phase inequalities and derive a tensor small phase theorem for MIMO linear time-invariant systems."}
